import { 五彩石数据类型 } from '@/@types/五彩石'
import { 属性类型 } from '@/@types/属性'
import { 五彩石增益类型枚举 } from '@/@types/枚举'

const 五彩石_六级: 五彩石数据类型[] = [
  {
    五彩石名称: '彩·破招·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·破招·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1463 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1463 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·无双·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·无双·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·激流·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·激流·灭气·破招(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·激流·灭气·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·激流·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·激流·月华·破招(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·激流·月华·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·激流·破招·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2925 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·激流·破招·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·激流·无双·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2925 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·激流·无双·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 442 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·激流·破招(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·灭气·激流·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·灭气·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·月华·破招(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·灭气·月华·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·灭气·破招·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·破招·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·无双·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·无双·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1463 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·星见·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·星见·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·星见·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·星见·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1463 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 5850,
      },
    ],
  },
  {
    五彩石名称: '彩·星见·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·星见·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1463 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2925,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·月华·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·月华·激流·破招(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·月华·激流·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 884 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·月华·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·月华·灭气·破招(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·月华·灭气·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2925 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·月华·破招·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·月华·破招·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2925 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
  {
    五彩石名称: '彩·月华·无双·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2925 },
      {
        增益类型: 属性类型.内功基础攻击,
        增益名称: 五彩石增益类型枚举.内功基础攻击,
        增益数值: 1768,
      },
    ],
  },
  {
    五彩石名称: '彩·月华·无双·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1463,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2925 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 5850 },
    ],
  },
]

export default 五彩石_六级
