import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 孤锋破浪 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '孤')
  static 回复锐意 = 0
  static 本次伤害次数 = 0
  static 释放前破绽层数 = 0

  constructor(模拟循环) {
    super(模拟循环)
  }

  检查GCD() {
    const 单刀GCD = this.模拟循环.GCD组?.单刀 || 0
    const 双刀GCD = this.模拟循环.GCD组?.双刀 || 0
    const 最大GCD = Math.max(单刀GCD, 双刀GCD)
    return 最大GCD
  }

  裂海横天判定() {
    return (
      this.模拟循环.校验奇穴是否存在?.('滔天') &&
      !!this.模拟循环.当前自身buff列表?.['灭影追风']?.当前层数
    )
  }

  裂海横天触发() {
    if (this.裂海横天判定()) {
      this.触发伤害行为('滔天')
    }
  }

  触发孤锋破浪伤害(索引) {
    孤锋破浪.本次伤害次数 += 1
    // 破招
    this.触发伤害行为('破')

    this.触发伤害行为('孤锋破浪')

    this.消耗一层橙武()

    this.裂海横天触发()
  }

  消耗一层橙武() {
    const 原额外锐意刷新时间 = this.模拟循环.当前自身buff列表?.['橙武孤锋']?.刷新时间 || 0
    this.模拟循环.卸除buff?.({
      名称: '橙武孤锋',
      对象: '自身',
      卸除层数: 1,
      buff刷新时间: 原额外锐意刷新时间,
    })
  }

  命中(是否为最后一个技能, 索引) {
    孤锋破浪.释放前破绽层数 = this.当前破绽层数()
    this.弱点击破判定('孤')

    this.判定破浪三式洄涛()
    孤锋破浪.本次伤害次数 = 0

    if (this.模拟循环.校验奇穴是否存在?.('威声') && !是否为最后一个技能) {
      // 2秒后生效
      const 生效时间 = (this.模拟循环?.当前时间 || 0) + 每秒郭氏帧 * 2
      this.触发伤害行为('界破', 1, [], 生效时间)
    }
    if (this.模拟循环.校验奇穴是否存在?.('截辕')) {
      const 截辕内置CD = this.模拟循环.当前目标buff列表?.['截辕内置CD']?.当前层数
      // 24747
      if (!截辕内置CD) {
        // 判定截辕内置CD2秒
        this.触发伤害行为('截辕')
        this.模拟循环.技能类实例集合?.截辕?.获得和刷新截辕?.()
        this.模拟循环.添加buff?.({ 名称: '截辕内置CD', 对象: '目标' })
      }
    }
  }

  造成伤害(索引) {
    this.触发孤锋破浪伤害(索引)

    if (
      this.模拟循环.校验奇穴是否存在?.('承磊') &&
      this.模拟循环.当前目标buff列表?.['破绽']?.当前层数 === 6
    ) {
      this.触发伤害行为('承磊·破')
    }

    // 判断长溯层数
    const 长溯层数 = this.模拟循环.当前目标buff列表?.['长溯']?.当前层数
    if (长溯层数) {
      for (let i = 0; i < 长溯层数; i++) {
        this.触发孤锋破浪伤害(索引)
      }
      this.模拟循环.卸除buff?.({ 名称: '长溯', 对象: '目标', 卸除层数: 长溯层数 })
    }

    this.保存释放记录()

    const 破绽层数 = this.当前破绽层数()
    if (!!this.模拟循环.当前自身buff列表?.['灭影追风']?.当前层数 && 破绽层数 >= 4) {
      this.模拟循环.卸除buff?.({ 名称: '破绽', 对象: '目标', 卸除层数: 破绽层数 })
      if (破绽层数 > 0) {
        for (let i = 0; i < 破绽层数; i++) {
          this.获得洄涛('孤锋结算')
        }
      }
    }
  }

  释放后() {
    // !this.模拟循环.当前自身buff列表?.['橙武']?.当前层数 &&
    if (!this.模拟循环.当前自身buff列表?.['威声']?.当前层数) {
      this.模拟循环.切换角色体态?.('单刀', 孤锋破浪.技能数据?.技能名称)
    }

    // 威声只生效一次
    if (this.模拟循环.当前自身buff列表?.['威声']?.当前层数) {
      this.模拟循环.卸除buff?.({ 名称: '威声', 对象: '自身', 卸除层数: 1 })
    }
  }

  保存释放记录() {
    this.本次释放记录 = {
      伤害段数: 孤锋破浪.本次伤害次数,
      特殊标记: 孤锋破浪.释放前破绽层数,
      重要buff列表: this.获取当前重要buff列表(['戗风', '灭影追风', '流岚', '橙武孤锋']),
    }
  }
}

export default 孤锋破浪

export const 孤锋破浪类型 = typeof 孤锋破浪
