import type { 数据类型 } from '@/@types/数据'
import type { 循环详情 } from '@/@types/循环'
import type { 数据模块类型 } from '@/store/data'
import { 在指定心法数据下执行 } from '@/数据/数据工具/获取当前数据'
import { 秒伤计算 } from '@/计算模块/计算函数'

export type 局部计算状态 = Pick<
  数据模块类型,
  | '装备信息'
  | '增益数据'
  | '增益启用'
  | '当前输出计算目标名称'
  | '当前计算循环名称'
  | '当前奇穴信息'
  | '当前秘籍信息'
  | '自定义循环列表'
  | '网络延迟'
  | '团队增益轴'
  | '特殊配置'
>

export const 计算局部秒伤 = (心法数据: 数据类型, 状态: 局部计算状态, 计算循环详情: 循环详情) =>
  在指定心法数据下执行(心法数据, () =>
    秒伤计算({
      是否更新显示计算结果: false,
      更新计算循环详情: 计算循环详情,
      计算技能详情: false,
    })(undefined, () => ({ data: 状态 })),
  )
