import { 获取倒读条实际帧数分布 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'
import { 每秒郭氏帧 } from '@/数据/常量'

class 兵主逆 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '兵主逆')
  static 作用总间隔 = 45
  static 作用间隔帧 = 15
  static 释放重置 = false

  constructor(模拟循环) {
    super(模拟循环)
    兵主逆.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '兵主逆')
    this.初始化技能运行数据()
  }

  释放前初始化() {
    if (兵主逆?.技能数据?.技能CD) {
      const 原始CD = 每秒郭氏帧 * 5
      const 加速后帧数 = this.模拟循环.获取衍天实际帧数(原始CD)
      兵主逆.技能数据.技能CD = 加速后帧数
    }
  }

  获取读条时间() {
    // 根据加速修改实际读条帧
    const 读条持续时间 = this.模拟循环.获取衍天实际帧数(兵主逆.作用总间隔)
    return 读条持续时间
  }

  读条(读条开始时间) {
    兵主逆.释放重置 = false
    if (this.模拟循环.当前自身buff列表?.['橙武']?.当前层数) {
      兵主逆.释放重置 = true
    }
    // 开始读条
    this.读条兵主逆(读条开始时间)
    this.获取星芒()
    this.保存释放记录('兵主逆')
  }

  读条兵主逆(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    // const 循环加速值 = this.模拟循环.加速值 || 0
    const 循环加速值 = this.模拟循环.获取实际加速值() || 0
    const 作用分布 = 获取倒读条实际帧数分布(兵主逆.作用总间隔, 兵主逆.作用间隔帧, 循环加速值)
    let 已读条时间 = 0
    for (let i = 0; i < 作用分布.length; i++) {
      待生效事件队列.push({
        事件名称: '技能读条',
        事件时间: 读条开始时间 + 已读条时间 + 作用分布[i],
        事件备注: {
          技能名称: '兵主逆',
          是否为最后一跳: 作用分布.length - 1 === i,
        },
      })
      已读条时间 = 已读条时间 + 作用分布[i]
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  // 顺序不可随意更改
  读条命中(事件备注) {
    this.水卦加速判断()
    this.根据卦象触发伤害('兵主逆')
    this.灵器伤害()
    this.橙武伤害('神兵·合灯')
    this.对自身效果()
    this.镇星入舆处理()

    if (事件备注?.是否为最后一跳) {
      this.触发伤害行为('破')
      this.模拟循环.卸除buff({ 名称: '镇星入舆_兵', 对象: '自身' })
    }
  }

  // skill/衍天/套路及子技能/兵_通用对自身执行一次效果.lua
  对自身效果() {
    if (this.模拟循环.校验奇穴是否存在('顺祝')) {
      const 当前卦象 = this.判断当前卦象()
      if (当前卦象) {
        const 当前卦象Buff = this.获取卦象映射(当前卦象)
        this.延长持续时间(当前卦象Buff)
        this.延长持续时间('荧入白')
        this.延长持续时间('祝由释放允许')
      }
    }
    this.获得星运(5, '兵主逆')
  }

  延长持续时间(Buff名称) {
    this.模拟循环.延长Buff({
      名称: Buff名称,
      对象: '自身',
      来源: '兵主逆',
      延长时间: 每秒郭氏帧 * 3,
    })
  }

  镇星入舆处理() {
    if (
      this.模拟循环.校验奇穴是否存在('镇星入舆') &&
      this.模拟循环.当前自身buff列表['镇星入舆_兵']?.当前层数
    ) {
      this.根据卦象触发伤害('兵主逆')
      this.灵器伤害()
      this.获得星运(5, '兵主逆')
      this.橙武伤害('神兵·合灯')
    }
  }

  释放后() {
    if (兵主逆.释放重置) {
      this.重置调息时间()
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['荧入白', '祝祷', '鬼遁', '镇星', '明灯']),
    }
  }
}

export default 兵主逆

export const 兵主逆类型 = typeof 兵主逆
