// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 阵云结晦 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '阵云结晦')
  static 回复怒气 = 0

  constructor(模拟循环) {
    super(模拟循环)

    阵云结晦.回复怒气 = 15
  }
  释放() {
    this.模拟循环.添加buff?.({ 名称: '阵云结晦充能', 对象: '自身', 新增层数: 1 })
    this.模拟循环.添加buff?.({ 名称: '月照连营可释放标记', 对象: '自身', 新增层数: 1 })
  }
  命中() {
    // 阵云结晦伤害延迟0.625秒
    const 阵云结晦伤害延迟 = (this.模拟循环.当前时间 || 0) + 10
    this.模拟循环.添加待生效事件队列?.([
      {
        事件时间: 阵云结晦伤害延迟,
        事件名称: '阵云结晦伤害延迟',
        事件备注: { 技能名称: '阵云结晦' },
      },
    ])
  }
  阵云结晦伤害延迟() {
    this.触发伤害行为('阵云结晦')
  }
  造成伤害(索引) {}

  释放后() {
    this.触发回复怒气(阵云结晦.回复怒气, 阵云结晦.技能数据?.技能名称)
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武']),
    }
  }
  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
      底部标识: this.技能释放时怒气 || 0,
    }
  }
}

export default 阵云结晦
export const 阵云结晦类型 = typeof 阵云结晦
