import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 木落雁归 extends 有CD技能通用类 {
  // lua入口 19818
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '木落雁归')
  static 释放重置 = false

  constructor(模拟循环) {
    super(模拟循环)
  }

  释放前() {
    if (this.模拟循环.当前自身buff列表?.['物化天行']?.当前层数) {
      this.折伞落地()
    }
  }

  命中() {
    木落雁归.释放重置 = false

    this.木落雁归造成伤害()

    // 驾鸾
    if (this.模拟循环.校验奇穴是否存在('驾鸾')) {
      this.模拟循环.技能类实例集合?.振翅图南?.减少调息时间?.(每秒郭氏帧 * 2)
    }

    // 苍梧
    if (this.模拟循环.校验奇穴是否存在('苍梧')) {
      this.模拟循环.技能类实例集合?.跃潮斩波?.减少调息时间?.(每秒郭氏帧 * 1)
    }

    this.清除清源()

    if (this.模拟循环.当前自身buff列表?.['橙武']?.当前层数) {
      木落雁归.释放重置 = true
      this.模拟循环.技能类实例集合?.御波驾澜?.获得和刷新御波驾澜?.()
    }

    this.保存释放记录('木落雁归')
  }

  释放后() {
    if (木落雁归.释放重置) {
      this.更新技能运行数据({ 待充能时间点: [] })
    }
    木落雁归.释放重置 = false
  }

  清除清源() {
    this.模拟循环.卸除buff?.({ 名称: '清源·1', 对象: '自身' })
    this.模拟循环.卸除buff?.({ 名称: '清源·2', 对象: '自身' })
    this.模拟循环.卸除buff?.({ 名称: '清源·3', 对象: '自身' })
  }

  木落雁归造成伤害() {
    this.触发伤害行为('木落雁归')
    this.触发伤害行为('破', 1, [], undefined, 6)
    if (this.模拟循环?.大橙武模拟) {
      // 25%概率造成一次，这里取期望0.25次
      this.触发伤害行为?.('木落雁归·神兵', 0.25)
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['太息', '游仙', '梦悠', '橙武']),
    }
  }
}

export default 木落雁归

export const 木落雁归类型 = typeof 木落雁归
