import { 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 定式黑白实例 } from '../../定式黑白'

class 玉石俱焚 extends 有CD技能通用类 {
  // scripts/skill/万花/万花_百花拂穴手_玉石俱焚.lua
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '玉石俱焚')
  // static 引爆总跳数 = 0
  static 引爆总种类 = 0
  static 获得墨意 = 5
  static 本次释放墨意变化 = 0
  static 释放重置 = false
  static 定式黑白引爆次数 = 0

  constructor(模拟循环) {
    super(模拟循环)
    玉石俱焚.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '玉石俱焚')

    // 点出奇穴后CD受加速影响
    const 循环加速值 = this.模拟循环.加速值
    if (玉石俱焚?.技能数据?.技能CD) {
      const 加速后帧数 = 获取实际帧数(每秒郭氏帧 * 13.5, 循环加速值)
      玉石俱焚.技能数据.技能CD = 加速后帧数
    }
    this.初始化技能运行数据()
  }

  释放后() {
    if (玉石俱焚.释放重置) {
      this.更新技能运行数据({ 待充能时间点: [] })
    }
    玉石俱焚.释放重置 = false
  }

  命中() {
    玉石俱焚.释放重置 = false
    if (this.模拟循环.当前自身buff列表?.['橙武']?.当前层数) {
      玉石俱焚.释放重置 = true
    }

    // this.橙武刷新DOT()
    this.DOT跳数记录()
    this.结算定式黑白()
    this.折花处理()
    this.吞噬DOT()
    this.流离减CD()
    this.钟灵()
    this.丹青()
    this.橙武判定()
    this.流离判定()
    this.春寒判定()
    this.墨意变化(玉石俱焚.获得墨意 + 玉石俱焚.本次释放墨意变化)
    this.触发伤害行为('玉石俱焚')
    this.保存释放记录('玉石俱焚')
    this.涓流函数()
  }

  结算定式黑白() {
    if (this.模拟循环?.校验奇穴是否存在('定式黑白')) {
      const DOT种类 = 玉石俱焚.引爆总种类
      if (DOT种类) {
        const 定式黑白引爆次数 = 定式黑白实例.触发定式黑白(DOT种类 + 1, this.模拟循环.当前时间)
        玉石俱焚.定式黑白引爆次数 += DOT种类 + 1
        this.触发伤害行为('碎玉', 定式黑白引爆次数, [])
      }
    }
  }

  橙武刷新DOT() {
    if (this?.模拟循环?.当前自身buff列表?.['橙武']?.当前层数) {
      // 商
      if (this?.模拟循环?.技能类实例集合?.DOT_商阳指?.DOT运行数据?.当前层数) {
        this.模拟循环.技能类实例集合.DOT_商阳指.获得和刷新商阳指()
      }
      // 兰
      if (this?.模拟循环?.技能类实例集合?.DOT_兰摧玉折?.DOT运行数据?.当前层数) {
        this.模拟循环.技能类实例集合.DOT_兰摧玉折.获得和刷新兰摧玉折()
      }
      // 钟
      if (this?.模拟循环?.技能类实例集合?.DOT_钟林毓秀?.DOT运行数据?.当前层数) {
        this.模拟循环.技能类实例集合.DOT_钟林毓秀.获得和刷新钟林毓秀()
      }
    }
  }

  DOT跳数记录() {
    // let 引爆总跳数 = 0
    let 引爆总种类 = 0
    const 钟林毓秀跳数 =
      this?.模拟循环?.技能类实例集合?.DOT_钟林毓秀?.DOT运行数据?.待生效数据?.length || 0
    const 商阳指跳数 =
      this?.模拟循环?.技能类实例集合?.DOT_商阳指?.DOT运行数据?.待生效数据?.length || 0
    const 兰摧玉折跳数 =
      this?.模拟循环?.技能类实例集合?.DOT_兰摧玉折?.DOT运行数据?.待生效数据?.length || 0
    // 引爆总跳数 += 钟林毓秀跳数
    // 引爆总跳数 += 商阳指跳数
    // 引爆总跳数 += 兰摧玉折跳数
    引爆总种类 = (钟林毓秀跳数 ? 1 : 0) + (商阳指跳数 ? 1 : 0) + (兰摧玉折跳数 ? 1 : 0)
    // 玉石俱焚.引爆总跳数 = 引爆总跳数
    玉石俱焚.引爆总种类 = 引爆总种类
  }

  折花处理() {
    if (this.模拟循环?.校验奇穴是否存在('折花')) {
      // 商
      if (this?.模拟循环?.技能类实例集合?.DOT_商阳指?.DOT运行数据?.当前层数) {
        this.模拟循环?.添加buff({ 名称: `商阳折花`, 对象: '自身' })
      }
      // 兰
      if (this?.模拟循环?.技能类实例集合?.DOT_兰摧玉折?.DOT运行数据?.当前层数) {
        this.模拟循环?.添加buff({ 名称: `兰摧折花`, 对象: '自身' })
      }
      // 钟
      if (this?.模拟循环?.技能类实例集合?.DOT_钟林毓秀?.DOT运行数据?.当前层数) {
        this.模拟循环?.添加buff({ 名称: `钟林折花`, 对象: '自身' })
      }
    }
  }

  吞噬DOT() {
    this?.模拟循环?.技能类实例集合?.[`DOT_钟林毓秀`]?.玉石引爆()
    this?.模拟循环?.技能类实例集合?.[`DOT_商阳指`]?.玉石引爆()
    this?.模拟循环?.技能类实例集合?.[`DOT_兰摧玉折`]?.玉石引爆()
  }

  流离减CD() {
    if (this?.模拟循环?.校验奇穴是否存在('流离')) {
      if (玉石俱焚.引爆总种类) {
        const 减少CD总帧数 = 玉石俱焚.引爆总种类 * 每秒郭氏帧 * 1.25
        this.减少调息时间(减少CD总帧数)
      }
    }
  }

  钟灵() {
    if (玉石俱焚.引爆总种类) {
      this?.模拟循环?.添加buff({ 名称: '钟灵', 对象: '自身' })
      this?.模拟循环?.添加buff({ 名称: '钟灵瞬发', 对象: '自身' })
    }
  }

  丹青() {
    if (this?.模拟循环?.校验奇穴是否存在('丹青')) {
      this?.模拟循环?.技能类实例集合?.['丹青']?.丹青初始化()
    }
  }

  橙武判定() {
    if (this?.模拟循环?.当前自身buff列表?.['橙武']?.当前层数) {
      this.模拟循环.技能类实例集合.DOT_商阳指.获得和刷新商阳指()
      this.青歌()
      this.模拟循环.技能类实例集合.DOT_钟林毓秀.获得和刷新钟林毓秀()
    }
  }

  青歌() {
    if (this?.模拟循环?.校验奇穴是否存在('青歌')) {
      this?.模拟循环?.添加buff({ 名称: '青歌', 对象: '自身' })
    }
  }

  流离判定() {
    if (this?.模拟循环?.当前自身buff列表?.['流离']?.当前层数) {
      this?.模拟循环?.卸除buff({ 名称: '流离', 对象: '自身' })
      this.模拟循环.技能类实例集合.DOT_兰摧玉折.获得和刷新兰摧玉折()
      玉石俱焚.本次释放墨意变化 = 20
    }
    this.墨海临源叠层()
  }

  春寒判定() {
    if (this?.模拟循环?.校验奇穴是否存在('春寒')) {
      this.模拟循环.技能类实例集合?.乱洒青荷?.减少调息时间(每秒郭氏帧 * 5)
    }
  }

  保存释放记录(名称) {
    const 保存显示段数 = this.模拟循环.显示涓流层数
      ? this.模拟循环.当前自身buff列表['涓流']?.当前层数 || 0
      : undefined

    this.本次释放记录 = {
      伤害段数: 保存显示段数,
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['钟灵', '倚天', '涓流', '乱洒青荷', '布散畅和']),
    }
  }
}

export default 玉石俱焚

export const 玉石俱焚类型 = typeof 玉石俱焚
