import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'
import { 每秒郭氏帧 } from '@/数据/常量'

class 聚势摧霆 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '聚势摧霆')
  static 读条时间 = 每秒郭氏帧 * 2.5
  static 本次释放是否读条 = true
  static 本次释放消耗箭数 = 8

  constructor(模拟循环) {
    super(模拟循环)

    // 因为横断技能充能信息受奇穴影响，这里做覆盖
    聚势摧霆.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '聚势摧霆')
    聚势摧霆.本次释放消耗箭数 = 8

    this.初始化技能运行数据()
  }

  获取读条时间(技能索引) {
    if (技能索引 === 0) {
      聚势摧霆.本次释放是否读条 = false
      return 0
    }
    聚势摧霆.本次释放是否读条 = true
    return 聚势摧霆.读条时间
  }

  释放() {
    this.保存释放记录()
  }

  读条(读条开始时间) {
    this.读条聚势摧霆(读条开始时间)
    const 当前箭袋数量 = this.模拟循环?.角色状态信息?.箭袋信息?.length || 0
    聚势摧霆.本次释放消耗箭数 = 当前箭袋数量
  }

  读条聚势摧霆(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    待生效事件队列.push({
      事件名称: '技能读条',
      事件时间: 读条开始时间 + 聚势摧霆.读条时间,
      事件备注: {
        技能名称: '聚势摧霆',
      },
    })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  连珠承契() {
    if (this.模拟循环.校验奇穴是否存在('连珠')) {
      this.模拟循环?.获得承契()
      this.模拟循环.技能类实例集合.金乌见坠.减少调息时间(每秒郭氏帧 * 2, '聚势摧霆')
    }
  }

  连珠Buff判定() {
    if (this.模拟循环.校验奇穴是否存在('连珠')) {
      this.模拟循环.添加buff?.({ 名称: '连珠', 对象: '自身', 新增层数: 1 })
    }
  }

  聚势摧霆造成伤害() {
    this.模拟循环.标鹄判定()
    this.模拟循环.技能类实例集合.贯穿.获得和刷新贯穿('聚势摧霆')
    this.触发伤害行为('聚势摧霆')
  }

  聚势摧霆蓄力消耗箭附加伤害() {
    this.模拟循环.技能类实例集合.贯穿.获得和刷新贯穿('聚势摧霆·蓄力')
    this.触发伤害行为('聚势摧霆·蓄力')
  }

  造成伤害() {
    if (!聚势摧霆.本次释放是否读条) {
      this.读条伤害()
    }
  }

  读条伤害() {
    // 正读条引在读条结束后才进入CD
    if (聚势摧霆.技能数据) {
      this.模拟循环?.技能释放后更新运行数据?.(聚势摧霆.技能数据, this)
    }

    this.连珠承契()
    this.连珠Buff判定()

    for (let i = 0; i < 8; i++) {
      this.聚势摧霆造成伤害()
    }

    if (聚势摧霆.本次释放消耗箭数 > 0) {
      for (let i = 0; i < 8; i++) {
        this.聚势摧霆蓄力消耗箭附加伤害()
      }
    }

    this?.模拟循环?.消耗箭('聚势摧霆', 聚势摧霆.本次释放消耗箭数)
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['佩弦']),
    }
  }
}

export default 聚势摧霆

export const 饮羽簇类型 = typeof 聚势摧霆
