import { Buff枚举, 循环基础技能数据类型, 日志类型 } from '../simulator/type'
import { 基础GCD帧 } from '.'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 通用Buff数据, 通用循环模拟技能基础数据 } from '../../通用/通用技能/通用技能定义'

const 循环模拟技能基础数据: 循环基础技能数据类型[] = [
  ...((通用循环模拟技能基础数据 as any) || []).map((item) => {
    if (item?.技能名称 === '特效腰坠') {
      return {
        ...item,
        图标: 'https://icon.jx3box.com/icon/22901.png',
      }
    }
    return item
  }),
  {
    技能名称: '天斗旋·悟',
    技能释放后添加GCD: 基础GCD帧,
    最小GCD: 0,
    是否为读条技能: true,
    读条时间: 基础GCD帧 * 1,
    造成伤害次数: 1,
    技能GCD组: '公共',
    技能类型: '傍身',
    图标: 'https://icon.jx3box.com/icon/101453.png',
  },
  {
    技能名称: '返闭惊魂',
    技能释放后添加GCD: 基础GCD帧 * 1,
    最小GCD: 0,
    造成伤害次数: 0,
    技能CD: 每秒郭氏帧 * 30,
    技能GCD组: '公共',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/101459.png',
  },
  {
    技能名称: '奇门飞宫',
    技能释放后添加GCD: 基础GCD帧 * 1,
    最小GCD: 0,
    造成伤害次数: 0,
    技能CD: 每秒郭氏帧 * 12,
    技能GCD组: '公共',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/101457.png',
  },
  {
    技能名称: '奇门飞宫·贰',
    技能释放后添加GCD: 基础GCD帧 * 1,
    最小GCD: 0,
    造成伤害次数: 1,
    技能CD: 每秒郭氏帧 * 1,
    技能GCD组: '自身',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/102243.png',
  },
  {
    技能名称: '兵主逆',
    技能释放后添加GCD: 基础GCD帧 * 1,
    最小GCD: 0,
    是否为倒读条技能: true,
    造成伤害次数: 3,
    最大充能层数: 2,
    技能CD: 每秒郭氏帧 * 8,
    技能GCD组: '公共',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/101458.png',
  },
  {
    技能名称: '杀星在尾',
    技能释放后添加GCD: 基础GCD帧 * 1,
    最小GCD: 0,
    是否为读条技能: true,
    造成伤害次数: 1,
    技能CD: 每秒郭氏帧 * 12,
    技能GCD组: '公共',
    技能类型: '对阵',
    图标: 'https://icon.jx3box.com/icon/101461.png',
  },
  {
    技能名称: '列宿游',
    技能释放后添加GCD: 基础GCD帧,
    是否为读条技能: true,
    读条时间: 基础GCD帧 * 1,
    造成伤害次数: 1,
    技能CD: 每秒郭氏帧 * 60,
    技能GCD组: '公共',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/101455.png',
  },
  {
    技能名称: '等待1秒',
    技能释放后添加GCD: 0,
    技能CD: 0,
    造成伤害次数: 0,
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/25300.png',
    说明: '无实际意义，不造成伤害，单纯等待1秒',
  },
  {
    技能名称: '换行',
    技能释放后添加GCD: 0,
    技能CD: 0,
    技能GCD组: '自身',
    造成伤害次数: 0,
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/14516.png',
    说明: '这只是个单纯的换行按钮',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
]

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  // Buff
  明灯: {
    类型: '自身',
    名称: '明灯·悟',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 60,
    图标: 'https://icon.jx3box.com/icon/101455.png',
  },
  灵灯: {
    类型: '自身',
    名称: '灵灯·悟',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 25,
    图标: 'https://icon.jx3box.com/icon/101478.png',
  },
  堙灭: {
    类型: '自身',
    名称: '堙灭·悟',
    最大层数: 3,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/101476.png',
  },
  返闭无双: {
    类型: '自身',
    名称: '返闭无双',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/101459.png',
  },
  兵主逆增伤: {
    类型: '自身',
    名称: '兵主逆增伤',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 12,
    图标: 'https://icon.jx3box.com/icon/101458.png',
  },
  奇门飞宫状态: {
    类型: '自身',
    名称: '奇门飞宫状态',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/101457.png',
  },
  无界_通用增伤_6: {
    类型: '自身',
    名称: '杀星增伤',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/101461.png',
  },
  返闭增伤: {
    类型: '自身',
    名称: '返闭增伤',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/101459.png',
  },
  大橙武增伤: {
    类型: '自身',
    名称: '大橙武增伤',
    最大层数: 999, // 可以叠加
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/2589.png',
  },
  ...(通用Buff数据 as any),
}
