import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'
import { 待生效事件 } from '../../type'
import { 获取倒读条实际帧数分布, 获取实际帧数 } from '@/工具函数/data'
import { ERROR_ACTION } from '../../utils'

class 弛风鸣角 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '弛风鸣角')
  static 作用总间隔 = 15
  static 作用间隔帧 = 5

  constructor(模拟循环) {
    super(模拟循环)
  }

  生命周期() {
    this.模拟循环.添加战斗日志?.({
      日志: '弛风鸣角',
      日志类型: '释放技能',
    })
    // this.读条()
    this.释放后()
  }

  获取读条时间() {
    // 根据加速修改实际读条帧
    const 循环加速值 = this.模拟循环.加速值 || 0
    const 读条持续时间 = 获取实际帧数(弛风鸣角.作用总间隔, 循环加速值)
    return 读条持续时间
  }

  释放() {
    if (
      !this.模拟循环.当前自身buff列表['劲风簇追']?.当前层数 &&
      !(
        this.模拟循环.校验奇穴是否存在('灼心') &&
        this.模拟循环.当前自身buff列表['乘黄之威']?.当前层数
      )
    ) {
      return { 可以释放: false, 异常信息: ERROR_ACTION.BUFF错误 }
    }
    return this.模拟循环.箭数校验(undefined, 1)
  }

  读条(读条开始时间) {
    // 开始读条
    this.读条弛风鸣角(读条开始时间)
    return
  }

  读条弛风鸣角(读条开始时间 = 0) {
    const 待生效事件队列: 待生效事件[] = []
    const 循环加速值 = this.模拟循环.加速值 || 0
    const 作用分布 = 获取倒读条实际帧数分布(弛风鸣角.作用总间隔, 弛风鸣角.作用间隔帧, 循环加速值)
    let 已读条时间 = 0
    for (let i = 0; i < 作用分布.length; i++) {
      待生效事件队列.push({
        事件名称: '技能读条',
        事件时间: 读条开始时间 + 已读条时间 + 作用分布[i],
        事件备注: {
          技能名称: '弛风鸣角',
        },
      })
      已读条时间 = 已读条时间 + 作用分布[i]
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  // 顺序不可随意更改
  读条伤害() {
    if (this.模拟循环.角色状态信息?.箭袋信息?.length > 0) {
      this.模拟循环.棘矢引爆贯穿判定(`弛风鸣角`)
      this.模拟循环.金乌箭判定()
      this.模拟循环.标鹄判定()
      this.触发伤害行为('劲风簇')
      this.模拟循环.消耗箭('弛风鸣角')
    }
  }

  释放后() {
    // this.模拟循环.增加时间(15)
    this.模拟循环.卸除buff({ 名称: '劲风簇追', 对象: '自身' })
  }
}

export default 弛风鸣角

export const 弛风鸣角类型 = typeof 弛风鸣角
