import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '亘天',
        奇穴图片: 'https://icon.jx3box.com/icon/14161.png',
        id: '25368',
        奇穴描述:
          '“天斗旋”变为3层8秒充能招式，充能时间受加速率影响，运功时间降低0.5秒，回复星运效果提高50%。对敌对目标额外造成一次<SUB 34683 0>“亘天”伤害，该伤害受到天斗旋秘籍加成。',
      },
      {
        奇穴名称: '追叙',
        奇穴图片: 'https://icon.jx3box.com/icon/17189.png',
        id: '37456',
        奇穴描述:
          '施展“鬼星开穴”引爆连局后，6秒内施展“变卦”使“鬼星开穴”引爆的“魂灯”位置及状态返回引爆前，刷新持续时间，并返还80%“鬼星开穴”调息时间。',
      },
      {
        奇穴名称: '踏斗',
        奇穴图片: 'https://icon.jx3box.com/icon/14019.png',
        id: '25026',
        奇穴描述:
          '同时只会存在一个<NounID 92>，“纵横三才”调息时间延长6秒，移动<NounID 92>时会触发<NounID 105>效果。',
      },
      {
        奇穴名称: '三垣',
        奇穴图片: 'https://icon.jx3box.com/icon/14047.png',
        id: '44478',
        奇穴描述:
          '“奇门飞宫”对20尺内目标施展，会召唤3盏<NounID 196>环绕目标；若目标已有<NounID 196>环绕则将其引爆，造成<SUB 45094 0>混元性内功伤害或<SUB 45095 0>治疗效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '灵器',
        奇穴图片: 'https://icon.jx3box.com/icon/14037.png',
        id: '25173',
        奇穴描述:
          '施展“三星临”“兵主逆”“天斗旋”命中敌对目标时，自身或目标处于“连局”中则触发“灵器”效果，造成<SUB 25174 0>混元性内功伤害。',
      },
      {
        奇穴名称: '擎羊',
        奇穴图片: 'https://icon.jx3box.com/icon/14029.png',
        id: '25088',
        奇穴描述:
          '“鬼星开穴”无视目标8%化劲，施展“鬼星开穴”时，自身每存在1个<NounID 92>则“鬼星开穴”伤害额外提高23%。',
      },
      {
        奇穴名称: '知微',
        奇穴图片: 'https://icon.jx3box.com/icon/14058.png',
        id: '25382',
        奇穴描述:
          '“奇门飞宫”改为在身后5尺生成<NounID 92>，<NounID 92>撞击后，使自身10秒内下一个“天斗旋”无需运功，施展后使敌对目标每2秒受到混元性内功伤害，最多叠加2层，被卸除时只消失1层，持续30秒；若目标已拥有该效果，则立刻生效2跳。<TALENT_CORE 25026 1>',
      },
      {
        奇穴名称: '逐光',
        奇穴图片: 'https://icon.jx3box.com/icon/18317.png',
        id: '44479',
        奇穴描述:
          '“兵主逆”调息时间降低2秒，运功速度提高2倍，破招伤害降低70%；“天斗旋”调息时间降低1秒，伤害提高50%。<TALENT_CORE 44478 1>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '神遁',
        奇穴图片: 'https://icon.jx3box.com/icon/14052.png',
        id: '25028',
        奇穴描述:
          '自身在“连局”内免疫控制（击退和被拉除外）；“起卦”调息时间增加3秒，免控时间缩短3秒。<TALENT_CORE 25368 1>',
      },
      {
        奇穴名称: '风遁',
        奇穴图片: 'https://icon.jx3box.com/icon/14034.png',
        id: '25367',
        奇穴描述:
          '施展“鬼星开穴”重置“奇门飞宫”充能时间；“起卦”免控时间提高6秒。<TALENT_CORE 37456 1>',
      },
      {
        奇穴名称: '堪卜',
        奇穴图片: 'https://icon.jx3box.com/icon/16230.png',
        id: '25137',
        奇穴描述: '“起卦”调息时间降低8秒，“起卦”效果期间移动速度提高20%。',
      },
      {
        奇穴名称: '鬼遁',
        奇穴图片: 'https://icon.jx3box.com/icon/14046.png',
        id: '25072',
        奇穴描述:
          '施展“奇门飞宫”时获得90秒<NounID 158>，若存在“连局”，使“连局”环绕20尺内当前非侠士目标，成功环绕时返还调息时间。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '顺祝',
        奇穴图片: 'https://icon.jx3box.com/icon/14036.png',
        id: '25034',
        奇穴描述:
          '“兵主逆”“天斗旋”伤害提高10%，可以在移动中施展，运功不会被打退，每跳会延长3秒自身卦象时间，最多延长9秒。',
      },
      {
        奇穴名称: '连蜷',
        奇穴图片: 'https://icon.jx3box.com/icon/14043.png',
        id: '24951',
        奇穴描述: '“踏星行”闪避几率提高至80%，持续时间提高1秒，回复90点星运值。',
      },
      {
        奇穴名称: '燃灯',
        奇穴图片: 'https://icon.jx3box.com/icon/18320.png',
        id: '42489',
        奇穴描述:
          '“踏星行”调息时间延长5秒，改为乘骑魂灯向前飞行，施展时击退6尺内至多3个敌对侠士目标6尺，每秒对6尺内至多3个敌对目标添加“祝由·火离”效果，命中带有自身“祝由·火离”效果的目标时，造成一次“祝由·火离”伤害。',
      },
      {
        奇穴名称: '神占',
        奇穴图片: 'https://icon.jx3box.com/icon/14162.png',
        id: '42492',
        奇穴描述:
          '任何伤害使你的当前气血值低于1%时，解除控制，重置“起卦”调息时间并自动施展，延迟1秒后占得下述卦象中的一个，并获得对应效果，在占得卦象之前自身不会重伤。\\n神占·火离：浴火重生，回复100%气血值。\\n神占·山艮：不动如山，3秒内受到的伤害降低99%。\\n神占·水坎：清源正本，解除自身受到的阴性、阳性、混元性、毒性、点穴、持续伤害不利效果，并在5秒内受到的治疗成效提高100%。\\n该效果每300秒只能触发一次。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '天钺',
        奇穴图片: 'https://icon.jx3box.com/icon/14022.png',
        id: '25087',
        奇穴描述:
          '“鸿蒙天禁”运功时间降低0.75秒，可在跳跃中施展。可对团队成员使用，并卸除掉“阴性不利效果”“阳性不利效果”“混元不利效果”“毒不利效果”“持续伤害不利效果”各2个。',
      },
      {
        奇穴名称: '神皆寂',
        奇穴图片: 'https://icon.jx3box.com/icon/14165.png',
        id: '25011',
        奇穴描述:
          '打断目标运功，对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元性内功伤害，命中后使其封内1.5秒。该封内效果正常结束时，若目标处于“连局”内，使其封内4.5秒。<TALENT_CORE 25368 1>',
      },
      {
        奇穴名称: '列宿游',
        奇穴图片: 'https://icon.jx3box.com/icon/17712.png',
        id: '32791',
        奇穴描述:
          '对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元性内功伤害，并使目标幻化4秒（效果视为击倒）；命中后获得“明灯”：会心效果提高20%，持续12秒。',
      },
      {
        奇穴名称: '龙马出河',
        奇穴图片: 'https://icon.jx3box.com/icon/14028.png',
        id: '25114',
        奇穴描述:
          '在20尺内目标点位置，产生12秒“龙马出河”，延迟1.5秒后将自身传送至“龙马出河”中心位置，使范围内至多5个敌对侠士目标沉默并锁足3秒。自身位于范围内时，伤害提高10%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '鬼宿',
        奇穴图片: 'https://icon.jx3box.com/icon/18322.png',
        id: '42455',
        奇穴描述:
          '“鬼星开穴”变成2层充能招式，充能时间12秒，施展后返还30点星运值，命中连局内目标后为其添加<NounID 143>。',
      },
      {
        奇穴名称: '连极阵',
        奇穴图片: 'https://icon.jx3box.com/icon/14164.png',
        id: '25383',
        奇穴描述:
          '标记目标，每2秒消耗5点星运值，使<NounID 92><NounID 105>标记目标，随后回到自身位置，该<NounID 105>不附带控制效果，伤害降低50%；持续期间所有招式施展距离提高5尺，施展“三星临”返还0.5秒基础调息时间，<NounID 92>不会因为超出距离而消失。星运值不足时或施展二段招式可解除标记。<TALENT_CORE 25026 1>',
      },
      {
        奇穴名称: '杀星在尾',
        奇穴图片: 'https://icon.jx3box.com/icon/14059.png',
        id: '25176',
        奇穴描述:
          '每秒对自身8尺内随机位置召唤流星雨，流星雨会坠落至该位置对4尺范围内最多5个目标造成<SUB 25150 0>混元性内功伤害，若当前目标处于“连局”之中则流星雨集中坠落至目标位置，流星雨持续8秒。命中受控目标伤害提高60%。',
      },
      {
        奇穴名称: '镇星入舆',
        奇穴图片: 'https://icon.jx3box.com/icon/18319.png',
        id: '37505',
        奇穴描述:
          '强化1个<NounID 92>与自身链接，30秒内首次施展“三星临”“兵主逆”“天斗旋”时，伤害提高10%，运功期间自身免疫打退、打断、缴械和无法运功效果，链接在自身的<NounID 92>也会施展同样的招式攻击敌方。\\n效果期间可以施展2次二段招式：使“连局”环绕自身重新生成，对当前非侠士目标造成<SUB 45032 3><NounID 13>混元性内功伤害，命中后使自身在战斗中伤害提高15%。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '休囚',
        奇穴图片: 'https://icon.jx3box.com/icon/14042.png',
        id: '25074',
        奇穴描述: '“祝由·火离”卦象持续期间，目标受治疗成效降低45%，持续15秒。',
      },
      {
        奇穴名称: '延年',
        奇穴图片: 'https://icon.jx3box.com/icon/14038.png',
        id: '25061',
        奇穴描述:
          '“斗转星移”可对团队成员施展。“斗转星移”与目标交换位置后，自身将获得化解气血最大值30%的护盾，持续6秒。',
      },
      {
        奇穴名称: '星合',
        奇穴图片: 'https://icon.jx3box.com/icon/13874.png',
        id: '24986',
        奇穴描述:
          '“往者定”定身时间提高2秒，施展后在3秒内每0.5秒对目标6尺内至多4个敌对目标造成<SUB 42509 1>混元性内功伤害，对自身“连局”中目标施展时，立刻触发定身效果。施展“斗转星移”后可在4秒内额外释放一次“往者定”。',
      },
      {
        奇穴名称: '连断',
        奇穴图片: 'https://icon.jx3box.com/icon/14025.png',
        id: '25378',
        奇穴描述:
          '“变卦”变为2层充能招式，调息时间提高12秒，可重置自身卦象祝由效果，施展“鬼星开穴”后6秒内下一个“变卦”星运消耗降低20点。',
      },
      {
        奇穴名称: '荧入白',
        奇穴图片: 'https://icon.jx3box.com/icon/14031.png',
        id: '25085',
        奇穴描述: '卦象持续期间自身无双等级提高20%，无视目标50%内功防御等级，威胁值降低50%。',
      },
      {
        奇穴名称: '焚如',
        奇穴图片: 'https://icon.jx3box.com/icon/14053.png',
        id: '25030',
        奇穴描述:
          '“祝由·火离”不再溅射伤害其他目标，但对当前目标伤害提高50%，且若其被锁足，定身，眩晕，击倒，则造成的伤害提高50%。',
      },
      {
        奇穴名称: '司命',
        奇穴图片: 'https://icon.jx3box.com/icon/14050.png',
        id: '24965',
        奇穴描述: '“天人合一”状态后释放的第一个治疗招式会使目标受到的伤害降低40%，持续6秒。',
      },
      {
        奇穴名称: '相蚀',
        奇穴图片: 'https://icon.jx3box.com/icon/14160.png',
        id: '24949',
        奇穴描述:
          '“鬼星开穴”命中“连局”内的敌对目标后标记其6秒，标记期间再次命中时卸除其混元、阴性、阳性、毒性有益气劲各一个。',
      },
      {
        奇穴名称: '华盖',
        奇穴图片: 'https://icon.jx3box.com/icon/14015.png',
        id: '25148',
        奇穴描述:
          '“天人合一”转换比例提高100%，期间每秒获得3点星运值，该效果不会在“绝境战场”中生效。',
      },
      {
        奇穴名称: '坍缩',
        奇穴图片: 'https://icon.jx3box.com/icon/18321.png',
        id: '32794',
        奇穴描述: '“鸿蒙天禁”可对目标10尺内2个额外目标生效。',
      },
      {
        奇穴名称: '御前星',
        奇穴图片: 'https://icon.jx3box.com/icon/25398.png',
        id: '42511',
        奇穴描述:
          '施展“九字诀”套路招式时获得1层“星芒”，最多叠加24层，仅在战斗中维持。“鬼星开穴”替换为“御前星”，需持续运功，每拥有1层获得0.25秒运功时间，每0.25秒消耗1层“星芒”，对25尺内敌对目标发射1颗“芒星”造成<SUB 42520 1>混元性内功伤害，可在移动、跳跃中运功，运功不会被打退。',
      },
      {
        奇穴名称: '天医',
        奇穴图片: 'https://icon.jx3box.com/icon/14027.png',
        id: '42926',
        奇穴描述: '“巨门北落”持续时间延长1秒，期间自身受到的治疗成效提高25%。',
      },
    ],
  },
]

export default 奇穴数据
