import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '亘天',
        奇穴图片: 'https://icon.jx3box.com/icon/14161.png',
        id: '25368',
        奇穴描述:
          '“天斗旋”变为3层8秒充能招式，充能时间受加速率影响，运功时间降低0.5秒，造成原本170%的伤害，对侠士目标施展额外获得10点星运。',
      },
      {
        奇穴名称: '追叙',
        奇穴图片: 'https://icon.jx3box.com/icon/17189.png',
        id: '37456',
        奇穴描述:
          '施展“鬼星开穴”引爆连局后，6秒内施展“变卦”使“鬼星开穴”引爆的“魂灯”位置及状态返回引爆前，刷新持续时间，并返还80%“鬼星开穴”调息时间。',
      },
      {
        奇穴名称: '踏斗',
        奇穴图片: 'https://icon.jx3box.com/icon/14019.png',
        id: '25026',
        奇穴描述:
          '“纵横三才”施展需基础调息时间并变为2层充能招式，移动<NounID 92>距离至少为8尺；<NounID 92>移动时会<NounID 105>沿途至多4个目标，并根据移动距离造成混元内功伤害、使自身回复星运。“奇门飞宫”仅可放置1个<NounID 92>，施展后<NounID 92>会立即向当前选中目标方向<NounID 105>，该次<NounID 105>距离固定为15尺并额外附带4秒眩晕效果。',
      },
      {
        奇穴名称: '三垣',
        奇穴图片: 'https://icon.jx3box.com/icon/14047.png',
        id: '44478',
        奇穴描述:
          '“奇门飞宫”改为对20尺内目标施展，施展时立即对目标造成一次<SUB 45094 0>混元性内功伤害或<SUB 45095 0>治疗效果，并使自身所有<NounID 92>附着其环绕，持续24秒，期间若目标超过自身45尺则<NounID 92>会被强制收回，若目标为侠士还会每0.5秒额外对其造成一次伤害或治疗效果。\\n以此方式附着环绕的<NounID 92>不再形成“局”，而是环绕连接形成8尺圆形“连局”。施展“返闭惊魂”不再会产生<NounID 92>，施展“鬼星开穴”引爆<NounID 92>后不再会使其消失。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '灵器',
        奇穴图片: 'https://icon.jx3box.com/icon/14037.png',
        id: '25173',
        奇穴描述:
          '施展“三星临”“兵主逆”“天斗旋”命中敌对目标时，自身或目标处于“连局”中则触发“灵器”效果，造成<SUB 25174 0>混元性内功伤害。',
      },
      {
        奇穴名称: '擎羊',
        奇穴图片: 'https://icon.jx3box.com/icon/14029.png',
        id: '25088',
        奇穴描述:
          '“鬼星开穴”无视目标8%化劲，施展时自身每存在1个<NounID 92>则伤害提高23%，命中受自身“往者定”影响的目标时造成原本175%的伤害。',
      },
      {
        奇穴名称: '知微',
        奇穴图片: 'https://icon.jx3box.com/icon/14058.png',
        id: '25382',
        奇穴描述:
          '<NounID 92>撞击目标后附带“知微”效果，使其每2秒受到混元内功伤害，至多叠加2层，被卸除时只消失1层，持续30秒。《九字诀》套路招式命中“知微”效果的目标使其立即生效1跳。<TALENT_CORE 25026 1>',
      },
      {
        奇穴名称: '逐光',
        奇穴图片: 'https://icon.jx3box.com/icon/18317.png',
        id: '44479',
        奇穴描述:
          '“兵主逆”调息时间降低2秒，运功速度提高2倍；“天斗旋”调息时间降低1秒，伤害提高50%。<TALENT_CORE 44478 1>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '御前星',
        奇穴图片: 'https://icon.jx3box.com/icon/25398.png',
        id: '42511',
        奇穴描述:
          '“鬼星开穴”替换为“御前星”：持续运功，每0.25秒消耗10点星运对目标发射1颗“芒星”造成<SUB 42520 1>混元性内功伤害。该招式可在移动、跳跃及“踏星行”状态下施展，运功不会被打退。该招式视为《九字诀》套路。',
      },
      {
        奇穴名称: '神皆寂',
        奇穴图片: 'https://icon.jx3box.com/icon/14165.png',
        id: '25011',
        奇穴描述:
          '<TALENT_CORE 25368 1>打断目标运功，并在2秒延迟后为其添加4秒<BUFF_NOUN 31801 2 神皆寂>效果。若添加时目标处于自身连局内，则持续时长提高至8秒。<TALENT 25382 1 知微>',
      },
      {
        奇穴名称: '列宿游',
        奇穴图片: 'https://icon.jx3box.com/icon/17712.png',
        id: '32791',
        奇穴描述:
          '立即使目标幻化5秒（效果视为击倒），期间“鬼星开穴”命中该目标附带<SUB 33236 1>额外伤害。',
      },
      {
        奇穴名称: '龙马出河',
        奇穴图片: 'https://icon.jx3box.com/icon/14028.png',
        id: '25114',
        奇穴描述:
          '在20尺内目标点放置“龙马出河”，12秒内持续为8尺内至多4名敌对侠士添加治疗吸收效果，每秒相当于其最大气血值的6%。有该效果的目标离开“龙马出河”区域时，治疗吸收效果会以50%的比例折算为<NounID 101>。\\n“龙马出河”在场期间首次施展“奇门飞宫”会使其移动至“奇门飞宫”的位置。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '顺祝',
        奇穴图片: 'https://icon.jx3box.com/icon/14036.png',
        id: '25034',
        奇穴描述:
          '“兵主逆”“天斗旋”伤害提高10%，可以在移动中施展，运功不会被打退，每跳会延长3秒自身卦象时间，至多延长至30秒。',
      },
      {
        奇穴名称: '连蜷',
        奇穴图片: 'https://icon.jx3box.com/icon/14043.png',
        id: '24951',
        奇穴描述: '“踏星行”闪避几率提高至80%，持续时间提高1秒，期间每秒恢复3%最大气血值。',
      },
      {
        奇穴名称: '燃灯',
        奇穴图片: 'https://icon.jx3box.com/icon/18320.png',
        id: '42489',
        奇穴描述:
          '“踏星行”调息时间延长5秒，改为乘骑魂灯向前飞行，施展时击退6尺内至多3个敌对侠士目标6尺，每秒对6尺内至多3个敌对目标添加“祝由·火离”效果，命中带有自身“祝由·火离”效果的目标时，造成一次“祝由·火离”伤害。',
      },
      {
        奇穴名称: '神占',
        奇穴图片: 'https://icon.jx3box.com/icon/14162.png',
        id: '42492',
        奇穴描述:
          '任何伤害使你的当前气血值低于1%时，解除控制，重置“起卦”调息时间并自动施展，延迟1秒后占得下述卦象中的一个，并获得对应效果，在占得卦象之前自身不会重伤。\\n神占·火离：浴火重生，回复100%气血值。\\n神占·山艮：不动如山，3秒内受到的伤害降低99%。\\n神占·水坎：清源正本，解除自身受到的阴性、阳性、混元性、毒性、点穴、持续伤害不利效果，并在5秒内受到的治疗成效提高100%。\\n该效果每300秒只能触发一次。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '神遁',
        奇穴图片: 'https://icon.jx3box.com/icon/14052.png',
        id: '25028',
        奇穴描述:
          '自身在“连局”内免疫控制（击退和被拉除外）；“起卦”调息时间增加3秒，免控时间缩短3秒。<TALENT_CORE 25368 1>',
      },
      {
        奇穴名称: '风遁',
        奇穴图片: 'https://icon.jx3box.com/icon/14034.png',
        id: '25367',
        奇穴描述:
          '施展“鬼星开穴”重置“奇门飞宫”充能时间；“起卦”免控时间提高6秒，免控期间每秒获得8点星运。<TALENT_CORE 37456 1>',
      },
      {
        奇穴名称: '堪卜',
        奇穴图片: 'https://icon.jx3box.com/icon/16230.png',
        id: '25137',
        奇穴描述: '“起卦”调息时间降低8秒，“起卦”效果期间移动速度提高20%。',
      },
      {
        奇穴名称: '鬼遁',
        奇穴图片: 'https://icon.jx3box.com/icon/14046.png',
        id: '25072',
        奇穴描述:
          '星运值上限提高至300点。施展“奇门飞宫”形成“连局”后使其环绕自身重新生成，处于连局中“起卦”必定占得“水坎”，并使下两次“变卦”处于连局中施展时不消耗星运。以此方式占得的“水坎”加速率提高至10%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '鬼宿',
        奇穴图片: 'https://icon.jx3box.com/icon/18322.png',
        id: '42455',
        奇穴描述:
          '“鬼星开穴”变成2层充能招式，充能时间12秒，施展后返还30点星运值，命中连局内目标后为其添加<NounID 143>。',
      },
      {
        奇穴名称: '连极阵',
        奇穴图片: 'https://icon.jx3box.com/icon/14164.png',
        id: '25383',
        奇穴描述:
          '<TALENT_CORE 25026 1>标记目标并在其左右各放置1个<NounID 92>，以此方式放置的<NounID 92>不再形成“连局”，拥有独立的“纵横三才”调息时间。随后每1.5秒，若标记目标处于自身33尺内，则其中一个<NounID 92>会固定<NounID 105>至另一个<NounID 92>处，另一个<NounID 92>则会<NounID 105>至目标对侧6尺。<NounID 105>5次后两个<NounID 92>消失。<TALENT 25382 1 知微>',
      },
      {
        奇穴名称: '杀星在尾',
        奇穴图片: 'https://icon.jx3box.com/icon/14059.png',
        id: '25176',
        奇穴描述:
          '每秒对自身8尺内随机位置召唤流星雨，流星雨会坠落至该位置对4尺范围内最多5个目标造成<SUB 25150 0>混元性内功伤害，若当前目标处于“连局”之中则流星雨集中坠落至目标位置，流星雨持续8秒。命中受控目标伤害提高60%。',
      },
      {
        奇穴名称: '镇星入舆',
        奇穴图片: 'https://icon.jx3box.com/icon/18319.png',
        id: '37505',
        奇穴描述:
          '“连局”存在时可施展。立即使“连局”环绕自身重新展开并重置<NounID 92>持续时间，使自身获得<BUFF_NOUN 28878 1 镇星环>并在4秒内免疫控制效果。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '休囚',
        奇穴图片: 'https://icon.jx3box.com/icon/14042.png',
        id: '25074',
        奇穴描述: '“祝由·火离”卦象持续期间，目标受治疗成效降低45%，持续15秒。',
      },
      {
        奇穴名称: '延年',
        奇穴图片: 'https://icon.jx3box.com/icon/14038.png',
        id: '25061',
        奇穴描述:
          '“斗转星移”可对团队成员施展。“斗转星移”与目标交换位置后，自身将获得化解气血最大值30%的护盾，持续6秒。',
      },
      {
        奇穴名称: '星合',
        奇穴图片: 'https://icon.jx3box.com/icon/13874.png',
        id: '24986',
        奇穴描述:
          '“往者定”定身时间提高2秒，命中处于自身“连局”内的目标时会直接触发定身。“斗转星移”命中被“往者定”定身的目标后返还20秒调息时间。',
      },
      {
        奇穴名称: '连断',
        奇穴图片: 'https://icon.jx3box.com/icon/14025.png',
        id: '25378',
        奇穴描述:
          '“变卦”变为2层充能招式，调息时间提高12秒，可重置自身卦象祝由效果，施展“鬼星开穴”后6秒内下一个“变卦”星运消耗降低20点。',
      },
      {
        奇穴名称: '荧入白',
        奇穴图片: 'https://icon.jx3box.com/icon/14031.png',
        id: '25085',
        奇穴描述: '卦象持续期间自身无双等级提高20%，无视目标50%内功防御等级，威胁值降低50%。',
      },
      {
        奇穴名称: '焚如',
        奇穴图片: 'https://icon.jx3box.com/icon/14053.png',
        id: '25030',
        奇穴描述:
          '“祝由·火离”不再溅射伤害其他目标，但对当前目标伤害提高50%，且若其被锁足，定身，眩晕，击倒，则造成的伤害提高50%。',
      },
      {
        奇穴名称: '司命',
        奇穴图片: 'https://icon.jx3box.com/icon/14050.png',
        id: '24965',
        奇穴描述: '“天人合一”状态后释放的第一个治疗招式会使目标受到的伤害降低40%，持续6秒。',
      },
      {
        奇穴名称: '相蚀',
        奇穴图片: 'https://icon.jx3box.com/icon/14160.png',
        id: '24949',
        奇穴描述:
          '“鬼星开穴”命中“连局”内的敌对目标后标记其6秒，标记期间再次命中时卸除其混元、阴性、阳性、毒性有益气劲各一个。',
      },
      {
        奇穴名称: '华盖',
        奇穴图片: 'https://icon.jx3box.com/icon/14015.png',
        id: '25148',
        奇穴描述:
          '“天人合一”转换比例提高100%，期间每秒获得3点星运值，该效果不会在“绝境战场”中生效。',
      },
      {
        奇穴名称: '坍缩',
        奇穴图片: 'https://icon.jx3box.com/icon/18321.png',
        id: '32794',
        奇穴描述: '“鸿蒙天禁”可对目标10尺内2个额外目标生效。',
      },
      {
        奇穴名称: '世降',
        奇穴图片: 'https://icon.jx3box.com/icon/28375.png',
        id: '46240',
        奇穴描述:
          '对目标施展“祝由·火离”后6秒内消耗星运，祝由将回以共鸣，每次共鸣使其持续时间延长2秒并对附着目标额外造成<SUB 46241 1>混元内功伤害，若目标非侠士则造成原本220%的伤害。',
      },
      {
        奇穴名称: '天医',
        奇穴图片: 'https://icon.jx3box.com/icon/14027.png',
        id: '42926',
        奇穴描述: '“巨门北落”持续时间延长1秒，期间自身受到的治疗成效提高25%。',
      },
    ],
  },
]

export default 奇穴数据
