import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '踏莲',
        奇穴图片: 'https://icon.jx3box.com/icon/7252.png',
        id: '14635',
        奇穴描述:
          '“芙蓉并蒂”调息时间降低10秒，定身效果持续时间延长1秒，控制效果持续期间目标受到伤害提高10%。',
      },
      {
        奇穴名称: '飞白',
        奇穴图片: 'https://icon.jx3box.com/icon/17211.png',
        id: '30596',
        奇穴描述:
          '“玉石俱焚”不再吞噬持续伤害，而是使其剩余伤害提升120%。目标12秒内被自身附带持续伤害的招式命中时，其附带的持续伤害也会提高120%。',
      },
      {
        奇穴名称: '丹鼎',
        奇穴图片: 'https://icon.jx3box.com/icon/2999.png',
        id: '24912',
        奇穴描述:
          '“快雪时晴”不会被打退打断，期间免疫控制和封内效果(击退和被拉除外)，调息时间变为20秒充能2层且受加速影响，伤害提高80%且额外附带2跳伤害，若主目标为非侠士则对其造成伤害提高60%。',
      },
      {
        奇穴名称: '水佩',
        奇穴图片: 'https://icon.jx3box.com/icon/24995.png',
        id: '42155',
        奇穴描述:
          '“青荷”效果期间自身招式伤害提高15%，且会强化下一个点穴截脉套路下所有招式，使其都可附带“兰摧玉折”“钟林毓秀”持续伤害效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '晴昼',
        奇穴图片: 'https://icon.jx3box.com/icon/16222.png',
        id: '42168',
        奇穴描述: '“乱洒青荷”变为2层充能技能，施展后获得最大气血值15%的伤害吸收盾，持续6秒。',
      },
      {
        奇穴名称: '折花',
        奇穴图片: 'https://icon.jx3box.com/icon/11823.png',
        id: '21744',
        奇穴描述:
          '“阳明指”命中后吞噬目标身上剩余时间最长的持续伤害效果。自身持续伤害被吞噬后，使下一个对应持续伤害招式附带混元伤害。',
      },
      {
        奇穴名称: '针砭',
        奇穴图片: 'https://icon.jx3box.com/icon/24421.png',
        id: '40077',
        奇穴描述: '“乱洒青荷”强化的招式命中时，使目标1.5秒后无法运功，持续3秒。',
      },
      {
        奇穴名称: '青冠',
        奇穴图片: 'https://icon.jx3box.com/icon/4492.png',
        id: '44339',
        奇穴描述: '无双等级提高20%，招式无视敌方65%内功防御等级。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '游斤',
        奇穴图片: 'https://icon.jx3box.com/icon/20082.png',
        id: '36017',
        奇穴描述:
          '“芙蓉并蒂”命中敌对侠士后，在其身上放置一个天工铁颅，持续5秒。期间目标无法施展轻功，被自身“玉石俱焚”命中触发吞噬时，铁颅会产生一次共鸣爆破，对目标及其附近6尺最多5名敌对目标造成<SUB 36018 1>混元伤害。',
      },
      {
        奇穴名称: '随墨',
        奇穴图片: 'https://icon.jx3box.com/icon/18309.png',
        id: '32638',
        奇穴描述:
          '战斗中累计受到20%最大气血值的伤害时获得“随墨”效果，使下一个“阳明指”命中目标时，短暂延迟后附带“兰摧玉折”“钟林毓秀”“商阳指”中缺少的一个，随后重新记录伤害。',
      },
      {
        奇穴名称: '雪弃',
        奇穴图片: 'https://icon.jx3box.com/icon/2999.png',
        id: '38850',
        奇穴描述:
          '“快雪时晴”会心会效提高20%，可在移动中施展，且每额外命中一个目标，伤害提高50%，最多提高150%。<TALENT_CORE 24912 1>',
      },
      {
        奇穴名称: '风烟翠',
        奇穴图片: 'https://icon.jx3box.com/icon/3016.png',
        id: '5774',
        奇穴描述:
          '“商阳指”“钟林毓秀”命中时可将该效果添加给目标半径8尺内的最多5个目标。“玉石俱焚”可以作用于目标15尺内额外3个目标，命中侠士时根据每个目标被吞噬的持续伤害数量对其造成<SUB 42156 0>额外伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '守拙',
        奇穴图片: 'https://icon.jx3box.com/icon/11826.png',
        id: '28464',
        奇穴描述:
          '受到控制时可以对8尺内敌对目标施展，唤出“阿甘贰型”，将敌方目标关入“阿甘贰型”体内。期间“阿甘贰型”不可移动，持续4秒。',
      },
      {
        奇穴名称: '流离',
        奇穴图片: 'https://icon.jx3box.com/icon/3002.png',
        id: '6682',
        奇穴描述:
          '每次消耗墨意，使下一次“玉石俱焚”命中后恢复20墨意并附带“兰摧玉折”持续伤害效果。每吞噬一个持续伤害效果，调息时间降低1.25秒，最多降低3.75秒。',
      },
      {
        奇穴名称: '沁逸',
        奇穴图片: 'https://icon.jx3box.com/icon/24418.png',
        id: '40075',
        奇穴描述: '“乱洒青荷”施展后使下一次“快雪时晴”最终伤害提高40%。',
      },
      {
        奇穴名称: '兰舟',
        奇穴图片: 'https://icon.jx3box.com/icon/3016.png',
        id: '6686',
        奇穴描述:
          '混元性持续伤害提高5%，持续伤害效果被卸除后，每个持续伤害使目标1.5秒内无法受到治疗效果，最多叠加4.5秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '韫墨',
        奇穴图片: 'https://icon.jx3box.com/icon/27137.png',
        id: '44358',
        奇穴描述:
          '受到定身、眩晕、击倒、被击僵直效果时，每1秒获得1层<NounID 167>，最多20层。施展“水月无间”后清除所有<NounID 167>效果，根据层数返还“水月无间”“乱洒青荷”调息时间。',
      },
      {
        奇穴名称: '生风',
        奇穴图片: 'https://icon.jx3box.com/icon/11824.png',
        id: '23945',
        奇穴描述:
          '“钟林毓秀”“兰摧玉折”会心提高10%，可以在移动中施展，运功时间降低0.5秒，命中后减少0.5秒基础调息时间。',
      },
      {
        奇穴名称: '春脉',
        奇穴图片: 'https://icon.jx3box.com/icon/1516.png',
        id: '18259',
        奇穴描述:
          '“玉石俱焚”每吞噬目标身上一个自身的持续伤害效果，则卸除目标混元、阳性、阴性、毒性有益气劲各一个。',
      },
      {
        奇穴名称: '风裳',
        奇穴图片: 'https://icon.jx3box.com/icon/24996.png',
        id: '42164',
        奇穴描述: '“青荷”的强化招式命中时重置“芙蓉并蒂”调息时间。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '钟灵',
        奇穴图片: 'https://icon.jx3box.com/icon/4555.png',
        id: '26692',
        奇穴描述:
          '施展“玉石俱焚”触发吞噬时下一“兰摧玉折”或“钟林毓秀”无需运功且消耗20墨意，自身18秒内基础攻击提高15%。',
      },
      {
        奇穴名称: '天工甲士',
        奇穴图片: 'https://icon.jx3box.com/icon/16223.png',
        id: '28465',
        奇穴描述:
          '持续运功5秒组装天工甲士，随后激活二段招式“天工”操纵天工甲士，每次操纵时间最多持续30秒。天工甲士无法受到治疗，其气血值耗尽时会损坏并使操纵者脱离。当场上存在自身损坏的天工甲士时，“天工甲士”无需运功并使其自我修复5秒。若主动离开天工甲士则记录离开时天工甲士的气血值，25秒后可以再次使用“天工”并继承离开时天工甲士的气血值。',
      },
      {
        奇穴名称: '洛川神韵',
        奇穴图片: 'https://icon.jx3box.com/icon/14146.png',
        id: '24919',
        奇穴描述:
          '挥洒墨笔，对目标侠士造成<SUB 24920 0>混元内功伤害，并溅射其周围10尺内的一位敌方侠士造成<SUB 24920 0>混元内功伤害，使其被墨迹相连，持续10秒。墨迹相连期间，两者也会同样受到对方受到的伤害的20%。若两者相距超过12尺则墨迹炸裂，造成<SUB 24923 0>混元内功伤害并且无法施展招式，持续4秒。',
      },
      {
        奇穴名称: '南风吐月',
        奇穴图片: 'https://icon.jx3box.com/icon/7510.png',
        id: '14965',
        奇穴描述:
          '可对团队友方目标施展，清除其所有阴性、混元性、阳性、毒性、持续和点穴的不利效果且不会受到攻击但效果期间无法移动、无法施展招式，持续8秒。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '清风垂露',
        奇穴图片: 'https://icon.jx3box.com/icon/1523.png',
        id: '133',
        奇穴描述:
          '为友方目标卸除阳性不利效果、阴性不利效果、混元不利效果、毒性不利效果、点穴不利效果、持续伤害不利效果各一个。“离经易道”心法下返还5秒调息时间。<TALENT 3789 1 施展后,为目标额外卸除一个持续伤害的不利效果>',
      },
      {
        奇穴名称: '厥阴指',
        奇穴图片: 'https://icon.jx3box.com/icon/1513.png',
        id: '183',
        奇穴描述:
          '若目标正在运功则进行打断并造成<SUB 144 0>混元性内功伤害，并使其<BUFF 585 1 desc>，持续<BUFF 585 1 time>，使自身招式伤害提高15%，持续8秒。“离经易道”心法下返还10秒调息时间。',
      },
      {
        奇穴名称: '如馥',
        奇穴图片: 'https://icon.jx3box.com/icon/19178.png',
        id: '34573',
        奇穴描述:
          '战斗中受击使自身获得一层“春泥护花”，该效果每3秒可触发一次。自身拥有的“春泥护花”最后一层被敌对侠士击破时，自身混元内功伤害提高7%，持续10秒。',
      },
      {
        奇穴名称: '墨海临源',
        奇穴图片: 'https://icon.jx3box.com/icon/21978.png',
        id: '37267',
        奇穴描述:
          '战斗中每施展5次“阳明指”“玉石俱焚”“快雪时晴”可激活1层施展次数，最多可累计3层。施展后恢复20墨意，对目标造成<NounID 13>混元伤害，该伤害对非侠士目标提高165%，并附带一段破招伤害。',
      },
      {
        奇穴名称: '空山',
        奇穴图片: 'https://icon.jx3box.com/icon/2998.png',
        id: '24914',
        奇穴描述:
          '“听风吹雪”可以对敌方侠士施展，运功1秒，将自身与敌方侠士当前气血值百分比互换，互换后目标气血值不会低于50%，调息时间1分钟。',
      },
      {
        奇穴名称: '连劫',
        奇穴图片: 'https://icon.jx3box.com/icon/23481.png',
        id: '38595',
        奇穴描述:
          '甩出4颗棋子将目标围困，造成6秒“提子”效果，期间目标造成的伤害及治疗效果降低80%。“玉石俱焚”命中时可以降低“连劫”5秒调息时间。',
      },
      {
        奇穴名称: '青歌',
        奇穴图片: 'https://icon.jx3box.com/icon/11828.png',
        id: '5762',
        奇穴描述:
          '“商阳指”命中非侠士目标后，18秒内自身基础攻击力提高15%，“阳明指”额外恢复5点墨意。',
      },
      {
        奇穴名称: '轻鸿',
        奇穴图片: 'https://icon.jx3box.com/icon/1515.png',
        id: '18268',
        奇穴描述:
          '“太阴指”变为2层充能技能，充能时间17秒，但无法被“春泥护花”重置调息时间。减伤效果提高至40%，持续时间提高至8秒。',
      },
      {
        奇穴名称: '活络',
        奇穴图片: 'https://icon.jx3box.com/icon/399.png',
        id: '37065',
        奇穴描述:
          '“水月无间”变为两层充能招式，充能时间50秒。“水月无间”免控效果期间，使自身免疫缴械和无法运功效果的影响，且运功不会被打断。',
      },
      {
        奇穴名称: '秋毫',
        奇穴图片: 'https://icon.jx3box.com/icon/3007.png',
        id: '17565',
        奇穴描述:
          '“清心静气”对自身效果提升至10%最大气血值。调息时间增加至30秒，施展后为友方目标添加7层“毫针”效果。',
      },
      {
        奇穴名称: '春寒',
        奇穴图片: 'https://icon.jx3box.com/icon/405.png',
        id: '42167',
        奇穴描述: '“乱洒青荷”调息时间降低20秒。',
      },
      {
        奇穴名称: '渲青',
        奇穴图片: 'https://icon.jx3box.com/icon/24419.png',
        id: '40800',
        奇穴描述:
          '“青荷”效果将强化下两个招式，强化招式命中时重置“玉石俱焚”调息时间，但附带的“兰摧玉折”“钟林毓秀”伤害加成降低至10%。若强化招式命中非侠士目标则额外造成<SUB 45191 1>伤害。',
      },
    ],
  },
]

export default 奇穴数据
