export default {
  装备基础属性: {
    "基础攻击": 63075,
    "破防等级": 82587,
    "无双等级": 84944,
    "会心等级": 105289,
    "会心效果等级": 15993,
    "全能等级": 0,
    "武器伤害_最小值": 6397,
    "武器伤害_最大值": 10662,
    "破招值": 2244,
    "力道": 44,
    "元气": 8551,
    "身法": 44,
    "根骨": 44,
    "体质": 175682,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 9743,
    "装分": 662724
  },
  装备镶嵌附魔属性: {
    "基础攻击": 10845,
    "破防等级": 15414,
    "无双等级": 3916,
    "会心等级": 10408,
    "会心效果等级": 2244,
    "全能等级": 0,
    "武器伤害_最小值": 0,
    "武器伤害_最大值": 0,
    "破招值": 2244,
    "力道": 44,
    "元气": 726,
    "身法": 44,
    "根骨": 44,
    "体质": 45,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 2801
  },
  装备列表: [
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSurplusValueBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 105058,
      "装备部位": "帽子",
      "附魔": "攻击+849"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atPhysicsCriticalDamagePowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 106809,
      "装备部位": "衣服",
      "附魔": "无双+836"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 106908,
      "装备部位": "腰带",
      "附魔": "无双+836"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104921,
      "装备部位": "护腕",
      "附魔": "破防+2801"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSurplusValueBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atAllTypeCriticalStrike",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 106884,
      "装备部位": "下装",
      "附魔": "破防+2801"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104725,
      "装备部位": "鞋子",
      "附魔": "加速+2801"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalDamagePowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 43111,
      "装备部位": "项链",
      "附魔": "元气+539"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 42988,
      "装备部位": "腰坠",
      "附魔": "会心+4202"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 44353,
      "装备部位": "戒指",
      "附魔": "攻击+849"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 43004,
      "装备部位": "戒指",
      "附魔": "攻击+1273"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 41347,
      "装备部位": "暗器",
      "附魔": "破防+4202"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSpunkBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 8,
      "id": 43579,
      "装备部位": "武器"
    }
  ],
  五彩石: "彩·真元·鹤顶·痛击(陆)",
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    试炼适应之力: 4,
    常驻套装会心会效: 1,
    套装技能: 0,
    特效_40788: 1,
    试炼项链会心: 4,
    风特效腰坠: 1,
    特效_40802: 1,
    特效_40803: 1,
    试炼暗器特效: 4,
    大橙武特效: 9
  },
}
