import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 破势 extends 有CD技能通用类 {
  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
  }

  释放() {
    return this.模拟循环.校验奇穴是否存在('破势') &&
      this.模拟循环.当前自身buff列表.飞剑?.当前层数 === 5 &&
      !this.模拟循环.当前自身buff列表.破势二段
      ? { 可以释放: true }
      : { 可以释放: false, 异常信息: '破势需要破势奇穴及完整五剑，且没有已有二段资格' }
  }

  命中() {
    this.本次释放记录.卸除飞剑序号 = this.模拟循环.技能类实例集合.万世不竭.技能运行数据.最后飞剑序号
    this.模拟循环.卸除buff({ 名称: '飞剑', 对象: '自身', 卸除层数: 5 })
    this.模拟循环.添加buff({ 名称: '破势二段', 对象: '自身', 覆盖层数: 3 })
  }
}

export default 破势
