import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 纵横三才 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '纵横三才')
  static 自动三才间隔 = 每秒郭氏帧 * 2

  constructor(模拟循环) {
    super(模拟循环)
    纵横三才.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '纵横三才')
    this.初始化技能运行数据()
  }

  添加自动三才事件(开始时间 = this.模拟循环.当前时间) {
    const 待生效事件: 待生效事件[] = []
    for (let i = 1; i <= 5; i++) {
      const 事件时间 = 开始时间 + 纵横三才.自动三才间隔 * i
      待生效事件.push({
        事件名称: `自动三才`,
        事件时间: 事件时间,
        事件备注: {},
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  创建自动三才() {
    if (this.模拟循环?.技能类实例集合?.['奇门飞宫']?.灯存在判定()) {
      // 按下就触发一次，不考虑飞行动画
      this.自动三才触发()
      this.添加自动三才事件()
    }
  }

  命中() {
    this.纵横三才造成伤害(true)
    this.保存释放记录('纵横三才')
  }

  判断踏斗增益层数() {
    let 增益列表: string[] = []
    if (this.模拟循环?.当前自身buff列表?.['踏斗']?.当前层数) {
      增益列表.push(`踏斗·${this.模拟循环?.当前自身buff列表?.['踏斗']?.当前层数}`)
    }
    return 增益列表
  }
  纵横三才造成伤害(主动释放?) {
    const 伤害名称 = 主动释放 ? '纵横三才·主动' : '纵横三才'
    this.触发伤害行为(伤害名称, 1, this.判断踏斗增益层数())

    // 不确定先触发伤害还是先添加Buff
    // this.模拟循环.添加buff({ 名称: '踏斗', 对象: '自身' })

    if (this.模拟循环.校验奇穴是否存在('知微')) {
      this.模拟循环.添加buff?.({ 名称: '知微', 对象: '自身' })
    }
  }

  自动三才触发() {
    const 星运 = this.模拟循环.角色状态信息.星运
    if (星运 >= 5 && this.模拟循环.技能类实例集合?.['奇门飞宫']?.灯存在判定()) {
      this.模拟循环.添加buff({ 名称: '连极阵', 对象: '目标' })
      this.消耗星运(5, '连极阵')
      this.纵横三才造成伤害()
      this.自动三才数量校验()
    } else {
      this.模拟循环.删除待生效事件队列('自动三才')
      this.模拟循环.卸除buff({ 名称: '连极阵', 对象: '目标' })
    }
  }

  自动三才数量校验() {
    const 待生效三才事件 = this.模拟循环.待生效事件队列.filter(
      (item) => item.事件名称 === '自动三才',
    )
    if (待生效三才事件.length <= 2) {
      const 最后三才事件 = 待生效三才事件[待生效三才事件.length - 1]
      this.添加自动三才事件(最后三才事件?.事件时间) // 添加自动三才事件
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['荧入白', '祝祷', '鬼遁', '镇星', '明灯']),
    }
  }
}

export default 纵横三才

export const 纵横三才类型 = typeof 纵横三才
