import { 技能增益列表类型 } from '@/@types/技能'
import { 属性类型 } from '@/@types/属性'
import 通用增益 from './通用增益/通用增益'
import 小橙武技能增益 from './通用增益/小橙武技能增益'
import 大橙武技能增益 from './通用增益/大橙武技能增益'

const 斩刀增益: 技能增益列表类型[] = [
  ...通用增益,
  ...小橙武技能增益,
  ...大橙武技能增益,
  {
    // 苍生铸世技改：血怒·惊涌期间斩刀对非侠士目标伤害提高100%
    增益名称: '血怒_惊涌_斩刀',
    依赖奇穴: '惊涌',
    增益所在位置: '奇穴',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.非侠增伤, 值: 1024 / 1024 }], // 秘笈非侠配方：斩刀+1024（+100%）
  },
  {
    增益名称: '9%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 92 / 1024 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
  {
    增益名称: '7%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.外功会心百分比, 值: 0.07 }],
  },
  {
    增益名称: '2%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.外功会心百分比, 值: 0.02 }],
  },
  {
    // 人偶图残页：不再对6尺内的目标冲刺
    增益名称: '6尺内不突进',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [],
  },
]

export default 斩刀增益
