import { 技能增益列表类型 } from '@/@types/技能'
import { 属性类型 } from '@/@types/属性'
import { 按数字生成数组 } from '@/心法模块/模块工具/按数字生成数组'
import 通用增益 from './通用增益/通用增益'

const 盾猛增益: 技能增益列表类型[] = [
  ...通用增益,
  // 威压：消耗层数强化盾猛，每层伤害提高30%（伤害加成）
  ...按数字生成数组(6).map(
    (层数) =>
      ({
        增益名称: `威压·${层数}`,
        依赖奇穴: '威压',
        增益所在位置: '奇穴',
        增益类型: '部分启用',
        增益集合: [{ 属性: 属性类型.通用增伤, 值: (307 * 层数) / 1024 }],
      }) as 技能增益列表类型,
  ),
  {
    // 威压：盾猛无视目标100%外功防御
    增益名称: '技能无视',
    依赖奇穴: '威压',
    增益所在位置: '奇穴',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
  },
  {
    增益名称: '2%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.外功会心百分比, 值: 0.02 }],
  },
  {
    增益名称: '3%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.外功会心百分比, 值: 0.03 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
  {
    增益名称: '4%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 41 / 1024 }],
  },
  {
    // 人偶图残页(6582)：不再对6尺内的目标冲刺
    增益名称: '6尺内不突进',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [],
  },
]

export default 盾猛增益
