import { 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'
import { 待生效事件 } from '../../type'
import { 每秒郭氏帧 } from '@/数据/常量'

class 商陆缀寒 extends 技能统一类 {
  // scripts/skill/北天药宗/北天药宗_商陆其根.lua
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '商陆缀寒')
  static 作用总间隔 = 24
  static 读条时间 = 24
  static 本次释放是否读条 = true

  constructor(模拟循环) {
    super(模拟循环)
  }

  获取读条时间(技能索引) {
    this.保存释放记录('商陆缀寒')

    if (this.六微校验() || this.凌然天风校验() || 技能索引 === 0) {
      商陆缀寒.本次释放是否读条 = false
      return 0
    }

    const 读条时间 = this.获取商陆缀寒读条时间()
    商陆缀寒.本次释放是否读条 = true
    return 读条时间
  }

  获取商陆缀寒读条时间() {
    let 基础读条时间 = 商陆缀寒.作用总间隔
    if (this.模拟循环?.当前自身buff列表?.['相使']?.当前层数) {
      // 相使 期间减少0.25秒读条，先计算减少后计算加速
      基础读条时间 = 基础读条时间 - 4
    }
    if (this.模拟循环.校验奇穴是否存在('熟地')) {
      基础读条时间 = 基础读条时间 - 8
    }
    const 读条持续时间 = 获取实际帧数(基础读条时间, this.模拟循环.加速值)
    商陆缀寒.读条时间 = 读条持续时间
    return 读条持续时间
  }

  读条(读条开始时间) {
    // 开始读条
    this.读条商陆缀寒(读条开始时间)
  }

  读条商陆缀寒(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    待生效事件队列.push({
      事件名称: '技能读条',
      事件时间: 读条开始时间 + 商陆缀寒.读条时间,
      事件备注: {
        技能名称: '商陆缀寒',
      },
    })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  读条命中() {
    this.商陆缀寒命中()
  }

  命中(释放索引) {
    if (!商陆缀寒.本次释放是否读条 || 释放索引 === 0) {
      this.商陆缀寒命中()
    }

    if (this.模拟循环.校验奇穴是否存在('熟地')) {
      this.模拟循环.GCD组.公共 = Math.max((this.模拟循环.GCD组.公共 || 0) - 8, 0)
    }
  }

  商陆缀寒命中() {
    if (this.模拟循环.校验奇穴是否存在('甘遂')) {
      this?.模拟循环?.技能类实例集合?.['紫叶沉疴']?.减少调息时间(每秒郭氏帧 * 1)
      this?.模拟循环?.技能类实例集合?.['苍棘缚地']?.减少调息时间(每秒郭氏帧 * 1)
    }

    if (this.六微校验()) {
      this.改变温寒(-2, '商陆缀寒_六微')
      this.触发伤害行为('六微')
    }

    this.触发伤害行为('商陆缀寒')
    this.改变温寒(-1, '商陆缀寒')
  }

  六微校验() {
    return this.模拟循环.校验奇穴是否存在('六微') && this?.模拟循环?.角色状态信息?.温寒 >= 5
  }

  凌然天风校验() {
    const 商秘籍 = this.模拟循环?.秘籍?.['商陆缀寒']
    const 秘籍包含凌然天风瞬发 = 商秘籍?.includes('凌然天风')
    return 秘籍包含凌然天风瞬发 && this.模拟循环.当前自身buff列表?.['凌然天风']?.当前层数
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['相使']),
    }
  }
}

export default 商陆缀寒

export const 商陆缀寒类型 = typeof 商陆缀寒
