import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '鬼门·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101419.png',
        id: '101419',
        奇穴描述: '{中毒}的目标气血低于50%时受到自身造成的伤害提高30%。',
      },
      {
        奇穴名称: '罔医·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101420.png',
        id: '101420',
        奇穴描述:
          '飞叶满襟·悟命中目标使自身基础攻击力提高15%，持续10秒，{凌然天风}状态下，飞叶满襟·悟的范围增加10尺。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '祛疾·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101421.png',
        id: '101421',
        奇穴描述: '每次触发{无方中和}后，附带25%攻击力的额外伤害，驱散目标身上的1个增益气劲。',
      },
      {
        奇穴名称: '神莹·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101422.png',
        id: '101422',
        奇穴描述: '每次触发{无方中和}后，降低1秒{滞空技}的调息时间且使自身伤害提高5%持续6秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '济世·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101423.png',
        id: '101423',
        奇穴描述: '植物每秒流失血量降低为12%，自身无双等级提高25%。',
      },
      {
        奇穴名称: '寿延·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101424.png',
        id: '101424',
        奇穴描述: '腾空跃起时自身回复10%最大气血值，{凌然天风}状态下自身免疫控制。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '苍棘缚地·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101370.png',
        id: '101370',
        奇穴描述:
          '在目标区域生长植物【苍棘】对范围内的敌方目标造成毒性内功伤害，【苍棘】自身每秒流失15%血量，最多存在12秒。',
      },
      {
        奇穴名称: '逐云寒蕊·悟',
        奇穴图片: 'https://icon.jx3box.com/icon/101371.png',
        id: '101371',
        奇穴描述:
          '在自身10尺范围内生长植物【寒蕊】范围内友方进入{隐匿}状态并每秒恢复2%气血值，【寒蕊】自身每秒流失15%血量，最多存在10秒；隐身期间自身每秒获得2层{寒蕊·悟}，造成伤害时消耗1层，额外80%攻击力的伤害。',
      },
    ],
  },
  //{
  //奇穴列表: [],
  //},
  //{
  //奇穴列表: [],
  //},
  //{
  //是否为混池: true,
  //奇穴列表: [],
  //},
]

export default 奇穴数据
