import 循环模拟技能基础数据 from '../../../../constant/skill'
import { 每秒郭氏帧 } from '@/数据/常量'
import 特效统一类 from '../特效统一类'

class 召唤凤凰 extends 特效统一类 {
  static 技能数据 = 循环模拟技能基础数据.find((item) => item.技能名称 === '召唤凤凰')
  static 读条时间 = 每秒郭氏帧 * 5.5

  constructor(模拟循环) {
    super(模拟循环)
    召唤凤凰.技能数据 = 模拟循环.技能基础数据.find((item) => item.技能名称 === '召唤凤凰')
  }

  获取读条时间() {
    this.本次释放记录 = { 实际伤害技能: '召唤凤凰' }
    return 召唤凤凰.读条时间
  }

  读条(读条开始时间: number) {
    this.模拟循环.添加待生效事件队列([
      {
        事件名称: '技能读条',
        事件时间: 读条开始时间 + 召唤凤凰.读条时间,
        事件备注: { 技能名称: '召唤凤凰' },
      },
    ])
  }

  读条命中() {
    if (召唤凤凰.技能数据) {
      this.模拟循环.技能释放后更新运行数据(召唤凤凰.技能数据, this)
    }
    this.模拟循环.卸除buff({ 名称: '凤凰起符', 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: '附灵·煌符', 对象: '自身' })
    this.模拟循环.角色状态信息.凤凰已施符 = false
    this.模拟循环.添加buff({ 名称: '凤凰', 对象: '自身' })
  }
}

export default 召唤凤凰
