import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 断脉 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '断脉')

  constructor(模拟循环) {
    super(模拟循环)
  }

  释放() {
    return
  }

  命中() {
    this.一阳指胧雾观花云散校验()

    this?.模拟循环?.回复能量(15, '任脉')
    this.触发伤害行为?.('断脉')

    if (this.模拟循环.校验奇穴是否存在?.('反朴')) {
      this.模拟循环.技能类实例集合?.引窍?.减少调息时间?.(每秒郭氏帧 * 1)
      this.模拟循环.技能类实例集合?.截阳?.减少调息时间?.(每秒郭氏帧 * 1)
    }

    if (this.模拟循环.校验奇穴是否存在?.('卫分')) {
      if (!this?.模拟循环?.当前目标buff列表?.['绝脉']?.当前层数) {
        this?.模拟循环?.回复能量(15, '任脉')
      }
    }

    if (this.模拟循环?.大橙武模拟) {
      // 25%概率造成一次，这里取期望0.25次
      this.触发伤害行为?.('断脉·神兵', 0.25)
    }

    this.模拟循环.判断逆脉()
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['出岫']),
    }
  }
}

export default 断脉

export const 断脉类型 = typeof 断脉
