// import 循环主类 from '../main'
import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 偃守孤旌 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '偃守孤旌')
  回复怒气 = 100

  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
  }
  释放() {
    this.模拟循环?.切换角色体态?.('擎刀', '偃守孤旌')
    this.模拟循环.添加buff?.({ 名称: '战绝', 对象: '自身', 新增层数: 1 })
    // 偃守孤旌释放后重置斩刀、闪刀调息时间
    this.重置苍雪刀调息时间()
    // 偃守孤旌释放后回复100怒
    this.触发回复怒气(this.回复怒气, '偃守孤旌')
    // 偃守孤旌释放后每3秒回复100怒
    const 偃守孤旌持续回怒 = (this.模拟循环.当前时间 || 0) + 每秒郭氏帧 * 3
    this.模拟循环.添加待生效事件队列?.([
      {
        事件时间: 偃守孤旌持续回怒,
        事件名称: '偃守孤旌持续回怒',
        事件备注: { 技能名称: '偃守孤旌' },
      },
    ])
    // 偃守孤旌结束后强制切换擎盾
    const 偃守孤旌切换擎盾 = (this.模拟循环.当前时间 || 0) + 每秒郭氏帧 * 9
    this.模拟循环.添加待生效事件队列?.([
      {
        事件时间: 偃守孤旌切换擎盾,
        事件名称: '偃守孤旌切换擎盾',
        事件备注: { 技能名称: '偃守孤旌' },
      },
    ])
    this.保存释放记录()
  }
  偃守孤旌持续回怒() {
    const 有战绝 = this.模拟循环?.当前自身buff列表?.['战绝']?.当前层数
    if (!有战绝) {
      return
    }
    this.触发回复怒气(this.回复怒气, '偃守孤旌持续回怒')
    const 偃守孤旌持续回怒 = (this.模拟循环?.当前时间 || 0) + 每秒郭氏帧 * 3
    this.模拟循环?.添加待生效事件队列?.([
      {
        事件时间: 偃守孤旌持续回怒,
        事件名称: '偃守孤旌持续回怒',
        事件备注: { 技能名称: '偃守孤旌' },
      },
    ])
  }
  偃守孤旌切换擎盾() {
    this.模拟循环?.切换角色体态?.('擎盾', '偃守孤旌结束')
    this.模拟循环.卸除buff?.({ 名称: '战绝', 对象: '自身', 卸除层数: 1 })
  }
  释放后() {
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武',]),
    }
  }
}

export default 偃守孤旌
export const 偃守孤旌类型 = typeof 偃守孤旌
