import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 灭 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '灭')
  static 释放重置 = false

  constructor(模拟循环) {
    super(模拟循环)
    灭.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '灭')
    this.初始化技能运行数据()
  }

  命中() {
    灭.释放重置 = false

    if (!this.模拟循环.校验奇穴是否存在('驰骋')) {
      this.下马处理()
    }

    this.灭造成伤害()
    this.破楼兰判定()
    this.触发伤害行为('灭·自伤')
    this.战心判定()
    this.保存释放记录('灭')
  }

  释放后() {
    if (灭.释放重置) {
      this.更新技能运行数据({ 待充能时间点: [] })
    }
    灭.释放重置 = false
  }

  灭造成伤害() {
    // if (this.模拟循环.角色状态信息.体态 === '骑乘') {
    //   this.触发伤害行为('灭·骑驭')
    // }
    const 技能实际伤害名称 = this.模拟循环?.五十血以下 ? '灭·斩杀' : '灭'
    this.触发伤害行为(技能实际伤害名称)
  }

  战心判定() {
    if (this.模拟循环.校验奇穴是否存在('战心')) {
      this?.模拟循环?.技能类实例集合?.['流血']?.获得和刷新流血()
      this.回复战意('灭', 3)
    }
  }

  破楼兰判定() {
    if (this.模拟循环.校验奇穴是否存在('破楼兰')) {
      if (this.模拟循环.五十血以下) {
        this.触发伤害行为('灭·破楼兰·一')
      } else {
        this.触发伤害行为('灭·破楼兰·二')
      }
      this.触发伤害行为('破')
      // 两个技能里面都写了触发破招但是破招有内置CD所以只生效一次

      if (this.模拟循环.当前自身buff列表?.['破楼兰标记']?.当前层数) {
        this.模拟循环.卸除buff?.({ 名称: '破楼兰标记', 对象: '自身', 卸除层数: 1 })
      } else {
        this.模拟循环.添加buff?.({ 名称: '破楼兰标记', 对象: '自身', 新增层数: 1 })
        灭.释放重置 = true
      }
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表([
        '龙驭',
        '牧云',
        '驰骋·1',
        '驰骋·2',
        '激雷',
        '夜征',
        '渊',
      ]),
    }
  }
}

export default 灭

export const 灭类型 = typeof 灭
