import 技能统一类 from '../../通用类/技能统一类'
import 技能基础数据 from '../../../constant/skill'

class 祭湘君 extends 技能统一类 {
  static 技能数据 = 技能基础数据.find((技能) => 技能.技能名称 === '祭湘君')!
  技能名称 = '祭湘君'

  constructor(模拟循环) {
    super(模拟循环)
  }

  释放() {
    return { 可以释放: this.模拟循环.角色状态信息.醉意 >= 1, 异常信息: '祭湘君需要至少一层醉意' }
  }

  命中() {
    this.保存释放记录()
    const 醉意 = this.模拟循环.角色状态信息.醉意
    this.模拟循环.卸除buff({ 名称: '祭湘君', 对象: '自身', 卸除层数: 3 })
    this.模拟循环.添加buff({ 名称: '祭湘君', 对象: '自身', 新增层数: 醉意 })
    this.模拟循环.添加buff({ 名称: '酩酊大醉', 对象: '自身' })
    this.模拟循环.角色状态信息.醉意 = 0
    this.模拟循环.添加战斗日志({
      日志: `祭湘君消耗${醉意}点醉意，醉意变为0，召出${醉意}个影子`,
      日志类型: '技能释放结果',
    })
  }

  获得连击() {
    const 影子数量 = this.模拟循环.当前自身buff列表.祭湘君?.当前层数 || 0
    if (影子数量) {
      this.模拟循环.添加buff({ 名称: '祭湘君连击', 对象: '自身' })
      if ((this.模拟循环.当前自身buff列表.祭湘君连击?.当前层数 || 0) >= 5) {
        this.模拟循环.添加战斗日志({
          日志: `祭湘君累计5次连击，触发${影子数量}次影子伤害`,
          日志类型: '技能释放结果',
        })
        this.触发伤害行为('祭湘君', 影子数量)
        this.模拟循环.卸除buff({ 名称: '祭湘君连击', 对象: '自身', 卸除层数: 100 })
      }
    }
  }
}

export default 祭湘君
