import type { ComponentType } from 'react'

export type 无方答疑ID =
  | '赛季强度'
  | '玩法与宏'
  | '僵直'
  | '手动与宏强度'
  | '无方手打'
  | '助手只读商'
  | '药性与四寒'
  | '助手伤害低'
  | 'cw与宏'
  | '加速'
  | '破招与配装'
  | '四件套'
  | '装备比较'
  | '切糕'
  | '小药'
  | '小cw与水特效'
  | '阵'
  | '五彩石'
  | '附魔'

const 答疑内容: Record<无方答疑ID, ComponentType> = {
  赛季强度: () => (
    <>
      <p>{'能玩，中等往上，本内第一页中间偏后的位置'}</p>
    </>
  ),
  玩法与宏: () => (
    <>
      <p>{'武学助手直接启动'}</p>
      <p>也可以使用2段宏，参考计算器两段宏攻略</p>
    </>
  ),
  僵直: () => (
    <>
      <p>{'无方的刀法有僵直，不打刀就没事。'}</p>
      <p>{'川乌没有僵直，但是川乌可以滞空，导致平地用川乌跳不起来。'}</p>
    </>
  ),
  手动与宏强度: () => (
    <>
      <p>{'以计算器 两段宏（潮生）为100%，相同延迟下，手动约为105%，武学助手约为92%。'}</p>
      <p>
        {
          '流派只有灵荆和逆势的区别，武学助手是灵荆，木桩92%，实战会更低，逆势提供更多的实战灵活性。'
        }
      </p>
    </>
  ),
  无方手打: () => (
    <p>
      可以参考
      <a
        href='https://docs.qq.com/aio/DT3NraHdFRGFVYVZM?opennew=1&client=qqclient_online&p=1UJbg1xfIgM6vaDEQ2m8wP&client_hint=0'
        target='_blank'
      >
        绿皮书手动循环
      </a>
    </p>
  ),
  助手只读商: () => (
    <>
      <p>{'把苍棘、沾衣都设置为目标位置释放（游戏设置和剑心插件都要看一下）'}</p>
      <p>{'把紫伏洗成别的奇穴再洗回来'}</p>
    </>
  ),
  药性与四寒: () => (
    <>
      <p>{'武学助手强制4寒启动'}</p>
    </>
  ),
  助手伤害低: () => (
    <>
      <p>{'先按计算器，看看能不能打到计算器；'}</p>
      <p>{'差距很大再排查别的问题。'}</p>
      <p>{'同样装分的号，一身散件比一身黄字能低20%'}</p>
    </>
  ),
  cw与宏: () => (
    <>
      <p>{'武学助手：在香繁轮第2个川读完开特效，5温最好，2温（打出了商）也不要紧。'}</p>
      <p>{'两段宏：在香繁轮第1个川读完开特效，5温最好，2温（打出了商）也不要紧。'}</p>
    </>
  ),
  加速: () => (
    <>
      <p>{'推荐至少3段加速。60以上延迟4段加速，100以上延迟5段加速。'}</p>
    </>
  ),
  破招与配装: () => (
    <>
      <p>{'在没有精简的情况下，优先选择加速，其次破防，最后会心。'}</p>
      <p>{'有了精简特别是黄字以后，属性收益不再具有意义，收益只看精简的ID(这配装看ID的)'}</p>
      <p>{'具体请参考配装指导'}</p>
    </>
  ),
  四件套: () => (
    <>
      <p>{'需要，只有使用无修头或者无修鞋的两黄字配装不要4件套。'}</p>
    </>
  ),
  装备比较: () => (
    <>
      <p>{'对于散件而言，优先高品，同品加速达标的情况下，破防优于会心。'}</p>
      <p>
        {'对于精简而言，这玩意儿看ID的，请参考计算器。链接：'}
        <a href='https://dps.btcsg.top/dps?xf=wf' target='_blank'>
          https://dps.btcsg.top/dps?xf=wf
        </a>
      </p>
      <p>
        {'计算器可以导入自己的装备，两种方法，茗伊导出装备代码或者世界说句话直接角色导入（beta）。'}
      </p>
    </>
  ),
  切糕: () => (
    <>
      <p>{'常规配装不可以，速成可以考虑。'}</p>
    </>
  ),
  小药: () => (
    <>
      <p>{'两根骨两攻击。'}</p>
    </>
  ),
  小cw与水特效: () => (
    <>
      <p>{'不太行，强度相当于10人武器。'}</p>
    </>
  ),
  阵: () => (
    <>
      <p>{'T1 和尚、段氏、莫问'}</p>
      <p>{'T2 花间、万灵、田螺'}</p>
      <p>{'（上面都没有就申请自己开阵）'}</p>
    </>
  ),
  五彩石: () => (
    <>
      <p>{'常规：破防·无双·攻击，或者 加速·无双·攻击'}</p>
      <p>{'进阶：回蓝（潮生）·破防·攻击'}</p>
    </>
  ),
  附魔: () => (
    <>
      <p>{'头、脚、戒指：攻击 （不推荐加速附魔）'}</p>
      <p>{'衣服、腰带：无双（活动兑换）'}</p>
      <p>{'手、裤：根骨（综合最优）'}</p>
      <p>{'暗器：根骨/加速'}</p>
      <p>{'武器：攻击/龙血'}</p>
    </>
  ),
}

export const 获取无方答疑内容 = (答疑ID: 无方答疑ID): ComponentType => {
  const 内容 = 答疑内容[答疑ID]
  return () => (
    <div style={{ lineHeight: 1.8, fontSize: 14 }}>
      <内容 />
    </div>
  )
}
