import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 触发橙武 extends 有CD技能通用类 {
  constructor(模拟循环) {
    super(模拟循环)
    this.技能数据 = 模拟循环.技能基础数据.find((技能) => 技能.技能名称 === '触发橙武')
  }

  释放() {
    return this.模拟循环.大橙武模拟
      ? { 可以释放: true }
      : { 可以释放: false, 异常信息: { 信息: '未装备大橙武，不能触发橙武' } }
  }

  命中() {
    const 模拟 = this.模拟循环
    ;(['上将军印', '醉斩白蛇', '破釜沉舟'] as const).forEach((技能) =>
      模拟.技能类实例集合[技能].重置调息时间(),
    )
    模拟.技能类实例集合.橙武四面楚歌.授予橙武额外施展()
    ;(['狂意', '刀魂', '气劲'] as const).forEach((资源) => 模拟.变更资源(资源, 100, '触发橙武'))
    模拟.添加buff({ 名称: '橙武', 对象: '自身' })
    模拟.添加buff({ 名称: '橙武破釜沉舟', 对象: '自身', 新增层数: 3 })
    this.本次释放记录 = { 造成buff数据: this.获取施加重要buff信息('橙武')! }
  }
}

export default 触发橙武
