import { 获取实际技能数据 } from '../../../通用/通用函数'
import 循环主类类型 from '../main'
import { 循环基础技能数据类型, 技能释放记录结果 } from '../type'

class 技能统一类 {
  模拟循环: 循环主类类型 = {} as any
  本次释放记录: 技能释放记录结果 = {}
  本次释放延迟: number | 'GCD' = 0

  constructor(模拟循环) {
    this.模拟循环 = 模拟循环
    return
  }

  检查GCD(索引, 当前技能?: 循环基础技能数据类型) {
    const 后一个技能 = this.模拟循环?.测试循环?.[索引 + 1]
    const GCD组 = 当前技能?.技能GCD组 === '自身' ? 当前技能?.技能名称 : 当前技能?.技能GCD组 || ''
    let GCD = this.模拟循环?.GCD组?.[GCD组] || 0
    let 等待GCD = 0
    let 释放延迟判定 = this.本次释放延迟
    if (当前技能?.技能名称 && ['触发橙武', '水月无间']?.includes(当前技能?.技能名称)) {
      释放延迟判定 = 'GCD'
    }

    if (释放延迟判定) {
      if (GCD组 === '公共') {
        GCD = GCD + 释放延迟判定
      }
      // 如果存在后面的技能，判断后面的技能当前的GCD为多少，推进到后一个技能。这样可以让灭卡在后面的技能释放前释放
      else if (释放延迟判定 === 'GCD' && 后一个技能) {
        const 后一个技能实际名称 = 获取实际技能数据(后一个技能)?.实际技能名称
        const 当前技能 = this?.模拟循环?.技能基础数据?.find(
          (item) => item?.技能名称 === 后一个技能实际名称,
        )
        if (当前技能 && 当前技能?.技能GCD组) {
          const 延迟等待 = this.模拟循环?.当前时间 ? this.模拟循环?.网络延迟 : 0

          if (当前技能?.技能GCD组 !== ('自身' as any)) {
            const 技能实例 = this?.模拟循环?.技能类实例集合?.[当前技能?.技能名称]
            const 后一个技能GCD = this.模拟循环?.检查GCD?.(当前技能, 技能实例, 索引 + 1) || 0
            等待GCD = Math.max(后一个技能GCD - 延迟等待, 0)
          } else {
            const 再下一个技能实际名称 = 获取实际技能数据(
              this.模拟循环?.测试循环?.[索引 + 2],
            )?.实际技能名称
            const 再下一个技能 = this?.模拟循环?.技能基础数据?.find(
              (item) => item?.技能名称 === 再下一个技能实际名称,
            )
            if (再下一个技能 && 再下一个技能?.技能GCD组 !== ('自身' as any)) {
              const 技能实例 = this?.模拟循环?.技能类实例集合?.[再下一个技能?.技能名称]
              const 后一个技能GCD = this.模拟循环?.检查GCD?.(再下一个技能, 技能实例, 索引 + 2) || 0
              等待GCD = Math.max(后一个技能GCD - 延迟等待, 0)
            }
          }
        }
      } else {
        等待GCD = Number(释放延迟判定)
      }
      if (等待GCD) {
        GCD = Math.max(等待GCD, GCD)
      }
    }
    this.本次释放延迟 = 0
    return GCD
  }

  释放前初始化(额外信息, i) {
    if (额外信息?.延迟) {
      this.本次释放延迟 = 额外信息?.延迟
    }
    // 重置释放记录
    this.本次释放记录 = {}
  }

  触发伤害行为(
    伤害名称,
    伤害次数 = 1,
    额外增益列表: string[] = [],
    触发伤害时间: number | undefined = undefined,
    技能等级 = 1,
  ) {
    const 增益列表 = [...额外增益列表]
    const 快照检测Buff列表 = this.获取DOT快照检测Buff列表(伤害名称)
    if (
      this.模拟循环.校验奇穴是否存在('清流') &&
      !增益列表?.some((item) => item?.includes('清流')) &&
      !!this?.模拟循环?.技能类实例集合?.DOT_兰摧玉折?.DOT运行数据?.当前层数
    ) {
      增益列表.push('清流')
    }

    if (
      this.模拟循环?.当前自身buff列表?.['涓流']?.当前层数 &&
      !增益列表?.some((item) => item?.includes('涓流'))
    ) {
      增益列表.push(`涓流·${this.模拟循环?.当前自身buff列表?.['涓流']?.当前层数}`)
    }

    this.模拟循环.技能造成伤害?.(
      伤害名称,
      伤害次数,
      增益列表,
      触发伤害时间,
      false,
      技能等级,
      快照检测Buff列表,
    )
  }

  涓流函数() {
    if (this?.模拟循环?.校验奇穴是否存在('涓流')) {
      const 当前涓流层数 = this?.模拟循环?.当前自身buff列表?.['涓流']?.当前层数 || 0
      if (当前涓流层数 >= 10) {
        this.模拟循环?.卸除buff({ 名称: '涓流', 对象: '自身', 卸除层数: 10 })
      } else {
        this.模拟循环?.添加buff({ 名称: '涓流', 对象: '自身' })
      }
    }
  }

  获取DOT快照检测Buff列表(伤害名称) {
    if (伤害名称?.includes('DOT')) {
      return ['倚天', '钟灵', '布散畅和', '涓流', '故幽', '青歌']
      // return this.获取当前快照buff()
    } else {
      return []
    }
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
    }
  }

  获取当前重要buff列表(技能依赖自身buff列表: string[] = [], 技能依赖目标buff列表: string[] = []) {
    const 重要buff列表: string[] = []
    技能依赖自身buff列表.forEach((buff) => {
      if (this.模拟循环.当前自身buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    技能依赖目标buff列表.forEach((buff) => {
      if (this.模拟循环.当前目标buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    return 重要buff列表 || []
  }

  获取施加重要buff信息(buff名称) {
    const 当前时间 = this.模拟循环.当前时间 || 0
    const buff对象 = this.模拟循环.Buff和Dot数据?.[buff名称]

    return buff对象
      ? {
          buff名称: buff名称,
          buff开始时间: 当前时间,
          buff结束时间: 当前时间 + (buff对象?.最大持续时间 || 0),
        }
      : null
  }

  温寒文案 = (值) => {
    return 值 > 0 ? '温' : '寒'
  }

  /**
   * @name 计算中和变化
   * @description 根据中和变化差值计算触发中和次数
   */
  计算中和变化(当前温寒, 变更值) {
    if (当前温寒 * 变更值 >= 0) return 0
    return Math.min(Math.abs(当前温寒), Math.abs(变更值))
  }

  墨意变化(墨意变化值, 是否为纯消耗 = false) {
    let 最终墨意变化值 = 墨意变化值 || 0
    if (!是否为纯消耗) {
      if (!墨意变化值) {
        return
      }
      if (this.模拟循环?.校验奇穴是否存在('放歌')) {
        最终墨意变化值 = 最终墨意变化值 + 2
      }
    }
    if (最终墨意变化值 < 0) {
      this.模拟循环?.添加buff({ 名称: '流离', 对象: '自身' })
    }
    let 最终墨意 = (this?.模拟循环?.角色状态信息?.墨意 || 0) + 最终墨意变化值
    最终墨意 = Math.max(0, 最终墨意)
    最终墨意 = Math.min(60, 最终墨意)
    this.模拟循环.角色状态信息.墨意 = 最终墨意
    if (最终墨意 < 20) {
      this.模拟循环?.卸除buff({ 名称: '水月瞬发', 对象: '自身' })
    }
    const 水月瞬发判断 = 最终墨意 >= 20 && this.模拟循环?.当前自身buff列表?.['水月无间']?.当前层数
    // 水月瞬发判断
    if (水月瞬发判断) {
      this.模拟循环?.添加buff({ 名称: '水月瞬发', 对象: '自身' })
    }
  }

  墨海临源叠层() {
    this?.模拟循环?.技能类实例集合?.['墨海临源']?.获得层数()
  }

  折花伤害触发判定(判定技能) {
    if (this.模拟循环?.校验奇穴是否存在('折花')) {
      const buff名称 = `${判定技能}折花`
      if (this?.模拟循环?.当前自身buff列表?.[buff名称]?.当前层数) {
        this?.触发伤害行为('折花')
        this.模拟循环?.卸除buff({ 名称: buff名称, 对象: '自身' })
      }
    }
  }

  焚玉伤害触发判定() {
    if (this.模拟循环?.校验奇穴是否存在('焚玉')) {
      if (this?.模拟循环?.当前自身buff列表?.['焚玉']?.当前层数) {
        this?.触发伤害行为('焚玉')
        this.模拟循环?.卸除buff({ 名称: '焚玉', 对象: '自身' })
      }
    }
  }

  墨意校验() {
    return this.模拟循环?.角色状态信息?.墨意 >= 20
  }

  水月校验() {
    return !!this.模拟循环?.当前自身buff列表?.['水月瞬发']?.当前层数
  }

  钟灵校验() {
    return !!this.模拟循环?.当前自身buff列表?.['钟灵瞬发']?.当前层数
  }

  获取当前快照buff() {
    const buff列表: string[] = []
    if (this?.模拟循环?.当前自身buff列表?.['倚天']?.当前层数) {
      buff列表.push('倚天_快照')
    }
    if (this?.模拟循环?.当前自身buff列表?.['钟灵']?.当前层数) {
      buff列表.push('钟灵')
    }
    if (this?.模拟循环?.当前自身buff列表?.['涓流']?.当前层数) {
      buff列表.push(`涓流·${this?.模拟循环?.当前自身buff列表?.['涓流']?.当前层数}`)
    }
    if (this?.模拟循环?.当前自身buff列表?.['布散畅和']?.当前层数) {
      buff列表.push(`布散畅和`)
    }
    if (this?.模拟循环?.当前自身buff列表?.['故幽']?.当前层数) {
      buff列表.push(`故幽`)
    }
    if (this?.模拟循环?.当前自身buff列表?.['青歌']?.当前层数) {
      buff列表.push(`青歌`)
    }
    return buff列表
  }
}

export default 技能统一类
