import { 获取倒读条实际帧数分布, 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'

class 川乌射罔 extends 有CD技能通用类 {
  // scripts/skill/北天药宗/北天药宗_奚毒射罔.lua
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '川乌射罔')
  static 作用总间隔 = 36
  static 作用间隔帧 = 9
  static 香繁饮露触发 = false
  static 释放重置 = false

  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
    川乌射罔.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '川乌射罔')
  }

  获取读条时间() {
    if (this.模拟循环.当前自身buff列表?.['香繁饮露']?.当前层数) {
      川乌射罔.香繁饮露触发 = true
      川乌射罔.作用总间隔 = 27
    } else {
      川乌射罔.香繁饮露触发 = false
      川乌射罔.作用总间隔 = 36
    }
    // 根据加速修改实际读条帧
    const 读条持续时间 = 获取实际帧数(川乌射罔.作用总间隔, this.模拟循环.加速值)
    return 读条持续时间
  }

  读条(读条开始时间) {
    川乌射罔.释放重置 = false
    this.模拟循环.卸除buff({ 名称: '香繁饮露', 对象: '自身', 事件时间: 读条开始时间 })
    if (this.模拟循环.当前自身buff列表?.['橙武']?.当前层数) {
      川乌射罔.释放重置 = true
    }
    // 开始读条
    this.读条川乌射罔(读条开始时间)
    this.保存释放记录('川乌射罔')
  }

  命中() {
    if (川乌射罔.香繁饮露触发 && 川乌射罔?.技能数据?.技能CD) {
      this.减少调息时间(Math.floor((川乌射罔?.技能数据?.技能CD || 0) * 0.7))
    }
  }

  读条川乌射罔(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    const 循环加速值 = this.模拟循环.加速值 || 0
    const 作用分布 = 获取倒读条实际帧数分布(川乌射罔.作用总间隔, 川乌射罔.作用间隔帧, 循环加速值)
    let 已读条时间 = 0
    for (let i = 0; i < 作用分布.length; i++) {
      待生效事件队列.push({
        事件名称: '技能读条',
        事件时间: 读条开始时间 + 已读条时间 + 作用分布[i],
        事件备注: {
          技能名称: '川乌射罔',
          是否为最后一跳: 作用分布.length - 1 === i,
        },
      })
      已读条时间 = 已读条时间 + 作用分布[i]
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  // 顺序不可随意更改
  读条命中(事件备注) {
    this.改变温寒(1, '川乌射罔')
    this.模拟循环.回复内力(1)
    this.触发伤害行为('川乌射罔')
    if (this.模拟循环.当前自身buff列表?.['橙武']) {
      this.改变温寒(-2, '川乌射罔_橙武')
    }
    if (川乌射罔.香繁饮露触发) {
      this.改变温寒(1, '川乌射罔_香繁饮露')
    }
    //if (this.模拟循环.校验奇穴是否存在('往馥')) {
    //if (
    // this.模拟循环.当前自身buff列表['苍棘缚地蛰伏']?.当前层数 ||
    // this.模拟循环.当前自身buff列表['苍棘缚地']?.当前层数
    // ) {
    //   this.触发伤害行为('往馥')
    // }
    //}
    if (事件备注?.是否为最后一跳) {
      this.触发伤害行为('破', 1, [], undefined, 1)
      this.模拟循环.添加buff({ 名称: '凄骨', 对象: '自身' })
      this.模拟循环.技能类实例集合?.逆乱?.获得和刷新逆乱?.()
      if (this.模拟循环.当前自身buff列表?.['橙武']) {
        this.触发伤害行为('鹿王本生')
      }
      this.模拟循环.卸除buff({ 名称: '橙武', 对象: '自身' })
      // 奇穴-养荣
      //if (this.模拟循环.校验奇穴是否存在('养荣')) {
      // this.触发伤害行为('养荣')
      //}
    }
  }

  释放后() {
    if (川乌射罔.释放重置) {
      this.重置调息时间()
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['相使']),
    }
  }
}

export default 川乌射罔

export const 川乌射罔类型 = typeof 川乌射罔
