export const 快捷添加数据: 快捷添加数据类型[] = [
  {
    名称: 'ACBC',
    技能序列: ['寒更晓箭', '金乌见坠', '劲风簇', '白羽流星', '饮羽簇', '白羽流星'],
    color: 'blue',
  },
  // {
  //   名称: 'AAABCA',
  //   技能序列: [
  //     '寒更晓箭',
  //     '金乌见坠',
  //     '劲风簇',
  //     '劲风簇',
  //     '劲风簇',
  //     '饮羽簇',
  //     '白羽流星',
  //     '劲风簇',
  //   ],
  //   color: 'magenta',
  // },
  {
    名称: 'CBC引A',
    技能序列: ['寒更晓箭', '金乌见坠', '白羽流星', '饮羽簇', '白羽流星', '引风唤灵', '劲风簇'],
    color: 'green',
  },
  // {
  //   名称: 'AAABC引A',
  //   技能序列: [
  //     '寒更晓箭',
  //     '金乌见坠',
  //     '劲风簇',
  //     '劲风簇',
  //     '劲风簇',
  //     '饮羽簇',
  //     '白羽流星',
  //     '引风唤灵',
  //     '劲风簇',
  //   ],
  //   color: 'purple',
  // },
  // {
  //   名称: '行留断',
  //   技能序列: ['行', '留', '断'],
  //   color: 'green',
  // },
  // {
  //   名称: '横三沧孤',
  //   技能序列: ['横', '沧', '沧', '沧', '孤'],
  //   color: 'purple',
  // },
  // {
  //   名称: '行留行',
  //   技能序列: ['行', '留', '行'],
  //   color: 'volcano',
  // },
  // {
  //   名称: '停留断',
  //   技能序列: ['停', '留', '断'],
  //   color: 'red',
  // },
]

export interface 快捷添加数据类型 {
  名称: string
  技能序列: string[]
  color?: string
}
