import { 技能增益列表类型 } from '@/@types/技能'
import 通用增益 from './通用增益/通用增益'
import 大橙武技能增益 from './通用增益/大橙武技能增益'
import 小橙武技能增益 from './通用增益/小橙武技能增益'

// 斩刀秘籍·命中眩晕并返还刀系调息(16996)：命中眩晕3秒，下个刀系招式返还调息（清绝刀CD），行为在模拟器实现
// 斩刀秘籍·命中附加流血(16997)：命中时为目标添加1层[流血]，行为在模拟器实现
const 斩刀悟增益: 技能增益列表类型[] = [
  ...通用增益,
  ...大橙武技能增益,
  ...小橙武技能增益,
  {
    增益名称: '【秘章】返还调息',
    增益所在位置: '秘籍',
    增益类型: '部分启用',
    增益集合: [],
  },
  {
    增益名称: '【绝篇】添加流血',
    增益所在位置: '秘籍',
    增益类型: '部分启用',
    增益集合: [],
  },
]

export default 斩刀悟增益
