import 技能统一类 from '../../通用类/技能统一类'
import type 循环主类 from '../../main'
import 技能基础数据 from '../../../constant/skill'

class 亢龙有悔 extends 技能统一类 {
  static 技能数据 = 技能基础数据.find((技能) => 技能.技能名称 === '亢龙有悔')!
  技能名称 = '亢龙有悔'

  constructor(模拟循环: 循环主类) {
    super(模拟循环)
  }

  命中() {
    this.保存释放记录()
    this.本次释放记录.特殊标记 = this.模拟循环.角色状态信息.内力
    if (!this.模拟循环.当前自身buff列表.暴龙震江) {
      this.模拟循环.更新内力(-this.模拟循环.角色状态信息.内力, this.技能名称)
    } else {
      this.触发伤害行为('醉影·一', 1, [], undefined, false, 4)
    }
    if (this.模拟循环.当前自身buff列表.触类) {
      const 酩酊 = this.模拟循环.校验奇穴是否存在('酩酊')
      this.触发伤害行为('醉影·一', 1, [], undefined, false, 酩酊 ? 2 : 1)
      if (酩酊 || this.模拟循环.校验奇穴是否存在('驯致')) this.模拟循环.更新内力(5, '触类')
      this.模拟循环.卸除buff({ 名称: '触类', 对象: '自身' })
    }
  }

  造成伤害() {
    this.本次释放记录.伤害段数 = this.模拟循环.校验奇穴是否存在('驯致') ? 3 : 6
    if (this.模拟循环.校验奇穴是否存在('驯致')) {
      this.触发伤害行为('亢龙有悔·三分之一不翻倍', 2)
      this.触发伤害行为('亢龙有悔合一掌1')
      if (this.模拟循环.当前自身buff列表.逍遥 && !this.模拟循环.当前自身buff列表.贞固)
        this.模拟循环.僵直结束时间 = this.模拟循环.当前时间 + 38
    } else {
      ;['一', '二', '三', '四', '五', '六'].forEach((段, 索引) =>
        this.登记伤害('亢龙有悔·' + 段, [1, 2, 3, 4, 6, 19][索引]),
      )
    }
  }

  释放后() {
    this.触发苍龙()
    if (this.模拟循环.秘籍.亢龙有悔?.includes('含弘'))
      this.模拟循环.添加buff({ 名称: '含弘·3', 对象: '自身' })
  }
}

export default 亢龙有悔
