import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'

class 擒龙决 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '擒龙决')

  constructor(模拟循环) {
    super(模拟循环)
    擒龙决.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '擒龙决')
    this.初始化技能运行数据()
  }

  是否点不再恢复禅那秘籍() {
    return this.模拟循环?.秘籍?.擒龙决?.find((item) => item === '不再恢复禅那')
  }

  命中() {
    this.模拟循环.角色状态信息.禅那 = 3
    this.模拟循环.添加buff?.({ 名称: '擒龙', 对象: '自身', 新增层数: 1 })

    if (this.模拟循环.校验奇穴是否存在('正念')) {
      this.模拟循环.添加buff?.({ 名称: '正念', 对象: '自身', 新增层数: 1 })
      this.模拟循环.技能类实例集合?.捉影式?.恢复正念次数()
    }

    if (this.模拟循环.校验奇穴是否存在('众嗔')) {
      this.模拟循环.添加buff?.({ 名称: '果报', 对象: '自身', 新增层数: 4 })
    }

    if (!this.是否点不再恢复禅那秘籍()) {
      const 待生效事件队列: 待生效事件[] = []
      for (let i = 0; i < 10; i++) {
        待生效事件队列.push({
          事件名称: '擒龙回豆',
          事件时间: this.模拟循环.当前时间 + 每秒郭氏帧 * 1.5 * (i + 1),
        })
      }
      this.模拟循环.添加待生效事件队列(待生效事件队列)
      // TODO: 自动回复禅那逻辑
    }
    this.保存释放记录('擒龙决')
  }

  擒龙回豆() {
    this.回复禅那('擒龙决后续', 1)
  }

  保存释放记录(名称) {
    const 造成buff数据 = this.获取施加重要buff信息('擒龙')
    this.本次释放记录 = {
      实际伤害技能: 名称,
      造成buff数据: 造成buff数据 || undefined,
      重要buff列表: this.获取当前重要buff列表(['擒龙', '风特效_快照', '金刚日轮']),
    }
  }
}

export default 擒龙决

export const 擒龙决类型 = typeof 擒龙决
