import { 每秒郭氏帧 } from '@/数据/常量'
import 技能统一类 from '../../通用类/技能统一类'

class 万世不竭二段 extends 技能统一类 {
  释放() {
    return !this.模拟循环.当前自身buff列表.破势二段 &&
      this.模拟循环.技能类实例集合.万世不竭.获取飞剑余时() >= 每秒郭氏帧 * 15
      ? { 可以释放: true }
      : { 可以释放: false, 异常信息: '万世二段需要飞剑剩余至少15秒且没有破势资格' }
  }

  命中() {
    const 万世 = this.模拟循环.技能类实例集合.万世不竭
    const 余时 = 万世.获取飞剑余时()
    const 橙武 = this.模拟循环.当前自身buff列表.橙武
    this.本次释放记录 = { 实际伤害技能: '万世不竭·一' }
    this.触发伤害行为('万世不竭·一')
    if (this.模拟循环.校验奇穴是否存在('无外')) {
      this.触发伤害行为('无外', 1, [], undefined, Math.ceil(余时 / 每秒郭氏帧))
    }
    万世.修改飞剑余时(橙武 ? 每秒郭氏帧 * 25 : -每秒郭氏帧 * 15)
    if (橙武) {
      this.模拟循环.卸除buff({
        名称: '橙武',
        对象: '自身',
        卸除层数: 1,
        buff刷新时间: 橙武.刷新时间,
      })
    }
  }
}

export default 万世不竭二段
