import { 每秒郭氏帧 } from '@/数据/常量'
import 技能统一类 from '../../通用类/技能统一类'

class 唤灵印 extends 技能统一类 {
  constructor(模拟循环) {
    super(模拟循环)
  }

  获得唤灵印(本次召唤宠物: string, 召唤来源) {
    if (this?.模拟循环?.角色状态信息?.换灵印) {
      this.模拟循环.角色状态信息.换灵印 = {
        ...this.模拟循环.角色状态信息.换灵印,
        [本次召唤宠物]: true,
      }
    }
    this.模拟循环.删除待生效事件队列(`卸除换灵印_${本次召唤宠物}`)
    // 弛律召野获得的换灵印10秒后会自动消失
    if (召唤来源 === '弛律召野') {
      this.模拟循环.添加待生效事件队列([
        {
          事件名称: `卸除换灵印_${本次召唤宠物}`,
          事件时间: this.模拟循环.当前时间 + 每秒郭氏帧 * 10,
          事件备注: {
            本次召唤宠物: 本次召唤宠物,
          },
        },
      ])
    }
  }

  卸除换灵印(本次召唤宠物: string) {
    if (this?.模拟循环?.角色状态信息?.换灵印) {
      this.模拟循环.角色状态信息.换灵印 = {
        ...this.模拟循环.角色状态信息.换灵印,
        [本次召唤宠物]: false,
      }
    }
  }
}

export default 唤灵印

export const 唤灵印类型 = typeof 唤灵印
