export const 快捷添加数据: 快捷添加数据类型[] = [
  {
    名称: '双断截引',
    技能序列: ['断脉', '截阳', '断脉', '截阳', '引窍'],
    color: 'cyan',
  },
  {
    名称: '断截断引',
    技能序列: ['断脉', '截阳', '断脉', '引窍'],
    color: 'green',
  },
  {
    名称: '断截引',
    技能序列: ['断脉', '截阳', '引窍'],
    color: 'blue',
  },
  {
    名称: '破阳截引',
    依赖奇穴: ['蛰微', '一阳来复'],
    技能序列: ['破穴', '一阳来复', '截阳', '引窍'],
    color: 'magenta',
  },
  {
    名称: '风劈双断',
    依赖奇穴: ['茫缈'],
    技能序列: ['骤风令', '骤风劈风', '断脉', '截阳', '断脉', '引窍'],
    color: 'volcano',
  },
  {
    名称: '风劈',
    依赖奇穴: ['茫缈'],
    技能序列: ['骤风令', '骤风劈风'],
    color: 'gold',
  },
  // {
  //   名称: 'CBC引A',
  //   技能序列: ['寒更晓箭', '金乌见坠', '白羽流星', '饮羽簇', '白羽流星', '引风唤灵', '劲风簇'],
  //   color: 'green',
  // },
]

export interface 快捷添加数据类型 {
  名称: string
  技能序列: string[]
  color?: string
  依赖奇穴?: string[]
}
