export default {
  装备基础属性: {
    基础攻击: 82645,
    破防等级: 100607,
    无双等级: 88797,
    会心等级: 151923,
    会心效果等级: 39654,
    全能等级: 0,
    武器伤害_最小值: 3425,
    武器伤害_最大值: 5708,
    破招值: 7497,
    力道: 44,
    元气: 44,
    身法: 44,
    根骨: 7004,
    体质: 219217,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 10712,
    装分: 826718,
  },
  装备镶嵌附魔属性: {
    基础攻击: 14698,
    破防等级: 14958,
    无双等级: 11148,
    会心等级: 8373,
    会心效果等级: 1317,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 0,
    力道: 44,
    元气: 44,
    身法: 44,
    根骨: 948,
    体质: 45,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 3279,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109565,
      装备部位: '帽子',
      附魔: '攻击+994',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109268,
      装备部位: '衣服',
      附魔: '无双+978',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109172,
      装备部位: '腰带',
      附魔: '无双+978',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109405,
      装备部位: '护腕',
      附魔: '无双+3279',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109434,
      装备部位: '下装',
      附魔: '无双+3279',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109571,
      装备部位: '鞋子',
      附魔: '加速+3279',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 48046,
      装备部位: '项链',
      附魔: '根骨+736',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 8,
      id: 49086,
      装备部位: '腰坠',
      附魔: '会心+5739',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 47928,
      装备部位: '戒指',
      附魔: '攻击+1739',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 47928,
      装备部位: '戒指',
      附魔: '攻击+1739',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 44535,
      装备部位: '暗器',
      附魔: '破防+5739',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atSpiritBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 8,
      id: 44277,
      装备部位: '武器',
      附魔: '攻击+994',
    },
  ],
  五彩石: '彩·灭气·无双·月华(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    试炼适应之力: 8,
    常驻套装会心会效: 1,
    套装技能: 0,
    特效_40788: 3,
    特效_40793: 3,
    试炼鞋子会心: 8,
    试炼项链会心: 8,
    试炼腰坠破防: 8,
    特效_40803: 2,
    试炼暗器特效: 8,
    小橙武特效_会心: 1,
    小橙武特效: 6,
  },
}
