export default {
  装备基础属性: {
    基础攻击: 66767,
    破防等级: 82975,
    无双等级: 99395,
    会心等级: 62740,
    会心效果等级: 9216,
    全能等级: 0,
    武器伤害_最小值: 2737,
    武器伤害_最大值: 4562,
    破招值: 0,
    力道: 44,
    元气: 44,
    身法: 44,
    根骨: 10753,
    体质: 184036,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 9904,
    装分: 693028,
  },
  装备镶嵌附魔属性: {
    基础攻击: 11994,
    破防等级: 10090,
    无双等级: 6717,
    会心等级: 3366,
    会心效果等级: 3366,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 0,
    力道: 44,
    元气: 44,
    身法: 44,
    根骨: 330,
    体质: 45,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 2801,
  },
  装备列表: [
    {
      当前精炼等级: 6,
      装备部位: '帽子',
      附魔: '加速+2801',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSpiritBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      id: 106775,
    },
    {
      当前精炼等级: 6,
      装备部位: '衣服',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 106807,
      附魔: '无双+836',
    },
    {
      当前精炼等级: 6,
      装备部位: '腰带',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 106711,
      附魔: '无双+836',
    },
    {
      当前精炼等级: 6,
      装备部位: '护腕',
      附魔: '无双+2801',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAllTypeCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 106939,
    },
    {
      当前精炼等级: 6,
      装备部位: '下装',
      附魔: '破防+2801',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAllTypeCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 106975,
    },
    {
      当前精炼等级: 6,
      装备部位: '鞋子',
      附魔: '攻击+849',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      id: 106743,
    },
    {
      当前精炼等级: 6,
      装备部位: '项链',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 44323,
    },
    {
      当前精炼等级: 8,
      装备部位: '腰坠',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      id: 47803,
    },
    {
      当前精炼等级: 6,
      装备部位: '戒指',
      附魔: '攻击+849',
      镶嵌孔数组: [],
      id: 44345,
    },
    {
      当前精炼等级: 6,
      装备部位: '戒指',
      附魔: '攻击+849',
      镶嵌孔数组: [],
      id: 44343,
    },
    {
      当前精炼等级: 6,
      装备部位: '暗器',
      附魔: '破防+2801',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      id: 42667,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atSpiritBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42718,
      装备部位: '武器',
      附魔: '攻击+849',
    },
  ],
  五彩石: '彩·灭气·无双·月华(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    常驻套装会心会效: 1,
    套装技能: 1,
    特效_40794: 4,
    风特效腰坠: 2,
    水特效武器: 2,
  },
}
