import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '龙驭',
        奇穴图片: 'https://icon.jx3box.com/icon/13434.png',
        id: '24896',
        奇穴描述:
          '“任驰骋”调息时间降低6秒，不再获得<NounID 221>效果，施展时获得6层“龙驭”效果，非“骑御”期间每次施展“龙牙”获得一层“龙驭”效果最多25层，“骑御”期间每次施展“龙牙”会消耗一层“龙驭”使本次“龙牙”对非侠士目标造成的伤害提高45%。',
      },
      {
        奇穴名称: '车悬阵',
        奇穴图片: 'https://icon.jx3box.com/icon/17186.png',
        id: '30654',
        奇穴描述:
          '该招式“骑御”状态会替换“龙牙”招式，不受“龙牙”秘籍影响，消耗3点战意。施展后自身向右侧划出枪刃，对右侧6尺范围内最多5个敌方目标持续造成100%武器伤害外加<SUB 30800 0>外功伤害，持续4秒，期间可以施展冲刺招式。再次释放或者结束时会对前方8尺范围造成100%武器伤害外加<SUB 30808 0>外功伤害。<TALENT 42670 1 >',
      },
      {
        奇穴名称: '破重围',
        奇穴图片: 'https://icon.jx3box.com/icon/7506.png',
        id: '15158',
        奇穴描述:
          '纵马疾驰，自身免疫控制、沉默、缴械，自身招式施展距离提高2尺，控制目标并连续造成13次共计<SUB 15163 0>外功伤害效果并使目标无法施展轻功，命中击倒中的目标伤害提高50%，骑马时方可施展此招式。',
      },
      {
        奇穴名称: '击水',
        奇穴图片: 'https://icon.jx3box.com/icon/4504.png',
        id: '18226',
        奇穴描述:
          '“流血”效果可叠3层，持续效果增加5跳。对有自身三层流血的目标再次添加流血效果，会额外造成<SUB 36568 1>外功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '破楼兰',
        奇穴图片: 'https://icon.jx3box.com/icon/4558.png',
        id: '6524',
        奇穴描述: '“灭”造成一次100%的额外伤害，施展“灭”8秒内获得一次额外施展的机会。',
      },
      {
        奇穴名称: '长征',
        奇穴图片: 'https://icon.jx3box.com/icon/638.png',
        id: '6514',
        奇穴描述: '“突”变为2层充能，调息时间提高1秒，命中目标时回复自身1点“战意”。',
      },
      {
        奇穴名称: '铁骑',
        奇穴图片: 'https://icon.jx3box.com/icon/14129.png',
        id: '28442',
        奇穴描述:
          '“任驰骋”不再充能调息时间降低5秒，<NounID 221>效果持续时间增加5秒，期间成功击倒目标降低“破坚阵”5秒调息。施展时若周围50尺内人数不少于6人，则获得50%护盾，持续15秒。',
      },
      {
        奇穴名称: '武贲',
        奇穴图片: 'https://icon.jx3box.com/icon/27134.png',
        id: '44374',
        奇穴描述: '“啸如虎”调息时间提高30秒，不受血量限制，受控可以施展。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '啸西风',
        奇穴图片: 'https://icon.jx3box.com/icon/23480.png',
        id: '38671',
        奇穴描述:
          '施展后对50尺距离内随机身上存在“流血”效果的最多3名侠士目标周围召唤战狼对其进行攻击造成<SUB 38673 1>点外功伤害，持续9秒，持续期间内目标获得15%<NounID 215>，战狼伤害频率受召唤时的“流血”效果层数影响，层数越高频率越快。<TALENT_CORE 18226 1>',
      },
      {
        奇穴名称: '飞将',
        奇穴图片: 'https://icon.jx3box.com/icon/639.png',
        id: '5673',
        奇穴描述: '对击倒状态的目标伤害提高50%。',
      },
      {
        奇穴名称: '镇远',
        奇穴图片: 'https://icon.jx3box.com/icon/1457.png',
        id: '44373',
        奇穴描述: '“羽林枪法”施展距离提高2尺，“破罡”“破军”伤害提高60%。',
      },
      {
        奇穴名称: '背水一战',
        奇穴图片: 'https://icon.jx3box.com/icon/13432.png',
        id: '37338',
        奇穴描述: '施展“撼如雷”获得12秒<NounID 131>效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '卷千旗',
        奇穴图片: 'https://icon.jx3box.com/icon/28357.png',
        id: '46179',
        奇穴描述:
          '被动效果：“任驰骋”调息时间提高15秒。“驰骋”效果期间解锁招式“卷千旗”。\\n主动效果：“驰骋”效果期间骑乘时可施展；将长枪举过头顶快速旋转，持续运功3秒并免疫打断和沉默，每0.5秒对周围8尺最多5个目标造成外功伤害，使其无法施展轻功持续3秒；每次造成伤害时获得1秒<NounID 221>效果（最多获得3秒）。运功期间可施展“断魂刺”“破坚阵”。施展后可释放二段招式<NounID 230>。',
      },
      {
        奇穴名称: '青阳',
        奇穴图片: 'https://icon.jx3box.com/icon/4576.png',
        id: '6530',
        奇穴描述:
          '“流血”伤害提高10%，“灭”命中后使目标眩晕2秒。命中有自身“流血”效果的目标，每层“流血”额外造成1段<SUB 32909 1>外功伤害。',
      },
      {
        奇穴名称: '连营',
        奇穴图片: 'https://icon.jx3box.com/icon/24993.png',
        id: '44372',
        奇穴描述: '“撼如雷”变为2层充能招式，期间“龙牙”消耗战意降低2点。',
      },
      {
        奇穴名称: '牧云',
        奇穴图片: 'https://icon.jx3box.com/icon/642.png',
        id: '6511',
        奇穴描述: '“龙吟”命中非侠士目标后自身获得<NounID 130>效果，持续15秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '出云',
        奇穴图片: 'https://icon.jx3box.com/icon/643.png',
        id: '5669',
        奇穴描述:
          '“战八方”调息时间增加4秒，作用目标数提高5个，每次施展时第一段命中目标附带“流血”“破风”效果，可以在马下施展。',
      },
      {
        奇穴名称: '力破万钧',
        奇穴图片: 'https://icon.jx3box.com/icon/14130.png',
        id: '24841',
        奇穴描述:
          '只能在马下施展，蓄力刺出长枪，蓄力期间自身免疫控制，移动速度降低50%，最多蓄力1.5秒，对面前12尺最多4个目标击退并最多造成<SUB 24843 3>点外功伤害。若将目标击退至障碍上，使得目标击倒，最多3秒。蓄力时间越长，伤害越高，击倒时间越长。对气血值低于80%的目标该招式会心率提高100%。',
      },
      {
        奇穴名称: '驰骋',
        奇穴图片: 'https://icon.jx3box.com/icon/640.png',
        id: '14824',
        奇穴描述: '施展“任驰骋”获得的外功基础攻击力效果提高至30%，可以在“骑御”状态施展“灭”。',
      },
      {
        奇穴名称: '渊',
        奇穴图片: 'https://icon.jx3box.com/icon/2985.png',
        id: '2628',
        奇穴描述: '冲刺至友方目标身边，使其3秒内受到的伤害降低20%且由自身承担。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '激雷',
        奇穴图片: 'https://icon.jx3box.com/icon/635.png',
        id: '6806',
        奇穴描述: '施展“撼如雷”后小队成员的外功破防值提高20%，外功基础攻击力提高20%，持续6秒。',
      },
      {
        奇穴名称: '夜征',
        奇穴图片: 'https://icon.jx3box.com/icon/7462.png',
        id: '5678',
        奇穴描述:
          '“激雷”效果持续期间自身无视目标70%外功防御，效果持续时间提高100%，期间“骑御”状态施展“龙牙”可额外消耗1层“龙驭”，造成一次<SUB 46586 0>额外伤害。<TALENT_CORE 24896 1>',
      },
      {
        奇穴名称: '徐如林',
        奇穴图片: 'https://icon.jx3box.com/icon/653.png',
        id: '42671',
        奇穴描述: '“啸如虎”结束后若自身气血值低于10%，回复40%气血值。',
      },
      {
        奇穴名称: '破国',
        奇穴图片: 'https://icon.jx3box.com/icon/13433.png',
        id: '24899',
        奇穴描述:
          '“任驰骋”上马后移动速度提高50%且无需运功，<NounID 221>效果持续时间提高1秒，期间自身加速值突破上限，提高50%。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '风骁',
        奇穴图片: 'https://icon.jx3box.com/icon/28359.png',
        id: '46160',
        奇穴描述:
          '“疾如风”效果持续期间，自身额外免疫缴械、沉默、重创、治疗吸收盾效果，且不会被重伤。',
      },
      {
        奇穴名称: '戎行',
        奇穴图片: 'https://icon.jx3box.com/icon/20081.png',
        id: '42670',
        奇穴描述:
          '“车悬阵”持续期间内命中目标时为目标添加“戎行”效果最多2层持续10秒，命中当前目标时，若其处于击倒且有2层“戎行”时额外造成100%武器伤害附加最高<SUB 36258 4>点外功伤害再向前拖行一段距离并结束该技能（每次击倒仅会触发一次），并附带30%治疗吸收盾。<TALENT_CORE 30654 1>',
      },
      {
        奇穴名称: '战心',
        奇穴图片: 'https://icon.jx3box.com/icon/4531.png',
        id: '6781',
        奇穴描述: '“灭”附带流血和破风效果，使自身立刻获得3点战意，并每秒回复3%气血，持续3秒。',
      },
      {
        奇穴名称: '戎戈',
        奇穴图片: 'https://icon.jx3box.com/icon/28356.png',
        id: '46156',
        奇穴描述: '“纵轻骑”效果结束后，获得50%减伤，持续8秒。',
      },
      {
        奇穴名称: '龙血',
        奇穴图片: 'https://icon.jx3box.com/icon/7495.png',
        id: '15001',
        奇穴描述: '“龙牙”施展距离提高2尺，“龙牙”命中有自身“流血”效果的目标额外造成30%伤害。',
      },
      {
        奇穴名称: '牙璋',
        奇穴图片: 'https://icon.jx3box.com/icon/7424.png',
        id: '14821',
        奇穴描述: '“流血”作用间隔缩短0.25秒，“突”附带“流血”“破风”效果。',
      },
      {
        奇穴名称: '易险',
        奇穴图片: 'https://icon.jx3box.com/icon/11901.png',
        id: '28564',
        奇穴描述:
          '“乘龙箭”命中时，重置自身“断魂刺”和“破坚阵”的招式调息时间，每次骑御状态下只可触发一次。',
      },
      {
        奇穴名称: '贯颐',
        奇穴图片: 'https://icon.jx3box.com/icon/13435.png',
        id: '42273',
        奇穴描述:
          '“破坚阵”可基础调息时间中施展，若命中被击倒目标则延长该击倒4秒并造成<SUB 42274 1>伤害。',
      },
      {
        奇穴名称: '守孤城',
        奇穴图片: 'https://icon.jx3box.com/icon/4549.png',
        id: '18487',
        奇穴描述: '“御”抵御伤害的持续时间延长4秒，施展后每秒回复3%的气血，持续5秒。',
      },
      {
        奇穴名称: '风虎',
        奇穴图片: 'https://icon.jx3box.com/icon/2993.png',
        id: '5666',
        奇穴描述: '每点“战意”增加“穿云”“龙吟”“龙牙”“灭”5%伤害。',
      },
      {
        奇穴名称: '振弦',
        奇穴图片: 'https://icon.jx3box.com/icon/17185.png',
        id: '30653',
        奇穴描述:
          '施展“突”、“沧月”、“破坚阵”成功击倒目标或命中倒地目标后，立即对目标位置发射一波半径6尺的箭雨，对最多5个目标造成<SUB 30759 0>外功伤害，并在目标位置生成一个半径6尺持续4秒的“飞鸣镝”区域，区域内最多5个敌对目标每秒会受到<SUB 32979 1>外功伤害。',
      },
      {
        奇穴名称: '霹雳',
        奇穴图片: 'https://icon.jx3box.com/icon/2986.png',
        id: '44401',
        奇穴描述: '“龙吟”变为2层充能招式，附带<NounID 134>持续10秒。',
      },
    ],
  },
]

export default 奇穴数据
