import { 获取倒读条实际帧数分布, 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 数组求和 } from '@/工具函数/help'

class 快雪时晴 extends 有CD技能通用类 {
  // scripts/skill/万花/万花_百花拂穴手_雪舞轻尘.lua
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '快雪时晴')
  static 作用总间隔 = 80 // 断读条不能影响原加速计算
  static 实际作用总间隔 = 80
  static 作用间隔帧 = 16
  static 作用次数 = 5
  static 技能开始时连续快雪次数 = 0
  static 人为断读条损耗 = 0

  constructor(模拟循环) {
    super(模拟循环)
    快雪时晴.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '快雪时晴')

    // 点出奇穴后CD受加速影响
    const 循环加速值 = this.模拟循环.加速值
    if (快雪时晴.技能数据 && this?.模拟循环?.校验奇穴是否存在('丹鼎')) {
      const 加速后帧数 = 获取实际帧数(每秒郭氏帧 * 20, 循环加速值)
      快雪时晴.技能数据.技能CD = 加速后帧数
    }

    // 暗影千机雪中行出奇穴
    快雪时晴.作用总间隔 = 45
    快雪时晴.作用间隔帧 = 9
    // if (this.模拟循环.校验奇穴是否存在('雪中行')) {
    // // 点出奇穴后修改基础作用间隔
    // } else {
    //   快雪时晴.作用总间隔 = 80
    //   快雪时晴.作用间隔帧 = 16
    // }
    this.初始化技能运行数据()
  }

  释放前初始化(额外信息, i) {
    快雪时晴.技能开始时连续快雪次数 = 0
    // 断读条
    快雪时晴.作用次数 = 额外信息?.作用次数 || 5
  }

  获取读条时间() {
    // 根据加速修改实际读条帧
    let 读条持续时间 = 获取实际帧数(快雪时晴.作用总间隔, this.模拟循环.加速值)

    // 判定人为损耗
    快雪时晴.人为断读条损耗 = 0
    if (快雪时晴.作用次数 < 5) {
      if (快雪时晴.作用次数 > 2) {
        // 断2卡GCD释放不考虑这个延迟 - by mfc
        快雪时晴.人为断读条损耗 = this.模拟循环.断快雪延迟
      }
      const 实际作用分布 = this.获取快雪作用分布() // 实际持续读条时间应用总读条时间计算加速后截断
      读条持续时间 = 数组求和(实际作用分布)
    }

    return 读条持续时间 + 快雪时晴.人为断读条损耗
  }

  读条(读条开始时间) {
    this.墨海临源叠层()
    this.墨意变化(5)
    // 开始读条
    this.读条快雪时晴(读条开始时间)
    this.保存释放记录('快雪时晴')
  }

  获取快雪作用分布() {
    const 循环加速值 = this.模拟循环.加速值 || 0
    // 丹鼎的实现方式为直接修改作用次数，总时间/7，见scripts/skill/万花/镇派/快雪加cd加跳数.lua
    const 实际作用次数 = this.模拟循环.校验奇穴是否存在('丹鼎') ? 7 : undefined
    const 截断作用次数 = this.模拟循环.校验奇穴是否存在('丹鼎')
      ? 快雪时晴.作用次数 === 5
        ? 7
        : 快雪时晴.作用次数
      : 快雪时晴.作用次数
    const 作用分布 = 获取倒读条实际帧数分布(
      快雪时晴.作用总间隔,
      快雪时晴.作用间隔帧,
      循环加速值,
      0,
      0,
      实际作用次数,
    )?.filter((_, index) => index < 截断作用次数)
    return 作用分布
  }

  读条快雪时晴(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    const 作用分布 = this.获取快雪作用分布()
    let 已读条时间 = 0
    for (let i = 0; i < 作用分布.length; i++) {
      待生效事件队列.push({
        事件名称: '技能读条',
        事件时间: 读条开始时间 + 已读条时间 + 作用分布[i],
        事件备注: {
          技能名称: '快雪时晴',
          是否为最后一跳: 作用分布.length - 1 === i,
          连续快雪次数: 快雪时晴.技能开始时连续快雪次数 + i + 1,
        },
      })
      已读条时间 = 已读条时间 + 作用分布[i]
    }
    快雪时晴.技能开始时连续快雪次数 += 作用分布.length
    if (快雪时晴.人为断读条损耗) {
      待生效事件队列.push({
        事件名称: '快雪时晴人为损耗',
        事件时间: 读条开始时间 + 已读条时间 + 快雪时晴.人为断读条损耗,
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  // 顺序不可随意更改
  读条命中(事件备注) {
    if (事件备注?.连续快雪次数 % 5 === 0) {
      this.触发伤害行为('破', 1, [], this?.模拟循环?.当前时间, 9)
    }
    this.触发伤害行为('快雪时晴')
    this?.涓流函数()
  }

  保存释放记录(名称) {
    const 保存显示段数 = this.模拟循环.显示涓流层数
      ? this.模拟循环.当前自身buff列表['涓流']?.当前层数 || 0
      : undefined

    this.本次释放记录 = {
      伤害段数: 保存显示段数,
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['钟灵', '倚天', '涓流', '乱洒青荷', '布散畅和']),
      特殊标记: 快雪时晴.作用次数,
    }
  }
}

export default 快雪时晴

export const 快雪时晴类型 = typeof 快雪时晴
