import { 技能增益列表类型 } from '@/@types/技能'
import 通用增益 from './通用增益/通用增益'
import { 属性类型 } from '@/@types/属性'
import 对阵招式增益 from './通用增益/对阵招式增益'

const 决云势悟增益: 技能增益列表类型[] = [
  ...通用增益,
  ...对阵招式增益,
  {
    // 70188
    增益名称: '流血增伤·1',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.易伤增伤, 值: 102 / 1024 }],
  },
  {
    // 70188
    增益名称: '流血增伤·2',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.易伤增伤, 值: (102 * 2) / 1024 }],
  },
  {
    // 70188
    增益名称: '流血增伤·3',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.易伤增伤, 值: (102 * 3) / 1024 }],
  },
]

export default 决云势悟增益
