import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '业因',
        奇穴图片: 'https://icon.jx3box.com/icon/17176.png',
        id: '44370',
        奇穴描述: '消除贪破时获得对应层数的<NounID 247>，持续60秒，最多叠加8层。',
      },
      {
        奇穴名称: '无诤',
        奇穴图片: 'https://icon.jx3box.com/icon/18297.png',
        id: '32649',
        奇穴描述:
          '“横扫六合”调息时间增加至17秒。施展“横扫六合”后重置“守缺式”调息时间，下次“守缺式”释放距离提高至15尺并附带冲刺效果，期间使棍子围绕自身旋转，持续9秒。期间对周围四尺最多5个目标每秒造成<SUB 28542 0>阳性内功伤害，并附带阳性内功持续伤害，无法使用武器，施展“守缺式”后激活“拿云式”。可施展二段招式结束无法使用武器状态。',
      },
      {
        奇穴名称: '六度',
        奇穴图片: 'https://icon.jx3box.com/icon/28342.png',
        id: '44405',
        奇穴描述:
          '禅那值上限提升到6个。“韦陀献杵”“拿云式”会消耗所有禅那，并根据禅那值数量造成伤害。',
      },
      {
        奇穴名称: '千万佛',
        奇穴图片: 'https://icon.jx3box.com/icon/28340.png',
        id: '45935',
        奇穴描述:
          '“横扫六合”变为2层充能招式，生效范围提高4尺，效果持续时间增加14秒，施展后使自身下一个“捕风式”和“守缺式”附带“横扫六合”效果，持续时间增加效果无法与同类效果叠加。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '众嗔',
        奇穴图片: 'https://icon.jx3box.com/icon/2972.png',
        id: '44994',
        奇穴描述:
          '“擒龙诀”持续时间降低5秒，施展后获得4层<NounID 247>。期间“韦陀献杵”“拿云式”伤害提高30%，施展“韦陀献杵”获得<BUFF_NOUN 9801 1 拿云>效果，施展“拿云式”可以消除<NounID 204>。<TALENT_CORE 44370 1>',
      },
      {
        奇穴名称: '轮回诀',
        奇穴图片: 'https://icon.jx3box.com/icon/444.png',
        id: '259',
        奇穴描述:
          '重伤倒地后方可施展，救治自身并使自身恢复30%(<SKILLEx {D0} {MaxLife 0.3}>点)气血值最大值，重伤起身后4秒内受到的伤害降低80%。<TALENT 5907 1 重置“达摩武诀”套路下其他招式的调息时间><TALENT 5908 1 重伤起身后小队成员的基础气血上限提高10%，持续10秒，并回复10%的气血>',
      },
      {
        奇穴名称: '挂碍',
        奇穴图片: 'https://icon.jx3box.com/icon/16210.png',
        id: '37369',
        奇穴描述: '“拿云式”命中侠士目标后，在目标周围6尺造成范围伤害，并返还“守缺式”调息时间3秒。',
      },
      {
        奇穴名称: '抢珠式',
        奇穴图片: 'https://icon.jx3box.com/icon/1509.png',
        id: '240',
        奇穴描述: '打断目标运功，使其<BUFF 445 4 desc>，持续<BUFF 445 4 time>。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '净果',
        奇穴图片: 'https://icon.jx3box.com/icon/4544.png',
        id: '6590',
        奇穴描述:
          '“拿云式”命中血量低于30%的目标伤害提高15%。施展内功伤害招式有30%几率获得“拿云”效果：使自身无视目标气血百分比可立刻施展“拿云式”，最多可叠加3层。',
      },
      {
        奇穴名称: '承缘',
        奇穴图片: 'https://icon.jx3box.com/icon/25384.png',
        id: '42406',
        奇穴描述:
          '切换“伏魔”状态后，下三次消耗3点及以上禅那施展“拿云式”或“韦陀献杵”伤害提高20%，并返还2点禅那。',
      },
      {
        奇穴名称: '静色',
        奇穴图片: 'https://icon.jx3box.com/icon/7482.png',
        id: '14758',
        奇穴描述:
          '“捉影式”变为2层充能技能，23秒充能时间。战斗状态下“捉影式”处于调息状态，4秒内未施展任何伤害招式，则使“捉影式”调息时间降低5秒。',
      },
      {
        奇穴名称: '妙法',
        奇穴图片: 'https://icon.jx3box.com/icon/2968.png',
        id: '6595',
        奇穴描述: '“千斤坠”变为2层充能，施展回复自身10%最大气血值且解除自身锁足、减速效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '金刚怒目',
        奇穴图片: 'https://icon.jx3box.com/icon/440.png',
        id: '17730',
        奇穴描述:
          '“罗汉金身”提供的内功基础攻击效果提高至20%，效果期间造成伤害无视目标60%内功防御。',
      },
      {
        奇穴名称: '系珠',
        奇穴图片: 'https://icon.jx3box.com/icon/7426.png',
        id: '14750',
        奇穴描述: '“擒龙诀”充能时间25秒，其增益效果持续12秒，效果期间提高自身阳性会心几率10%。',
      },
      {
        奇穴名称: '威服',
        奇穴图片: 'https://icon.jx3box.com/icon/23474.png',
        id: '38621',
        奇穴描述:
          '“大狮子吼”改为蓄力招式，长按<NounID 183>，期间免疫控制，移动速度降低60%，最多蓄力1秒。蓄力时召唤一只金刚狮子在原地释放吼叫，在6秒内每2秒对15尺内最多5个目标造成<SUB 38622 0>阳性内功伤害，完整蓄力后拉拽15尺内至多5个目标并眩晕5秒。34秒调息时间。',
      },
      {
        奇穴名称: '狮啸',
        奇穴图片: 'https://icon.jx3box.com/icon/430.png',
        id: '18623',
        奇穴描述:
          '“大狮子吼”不再附带控制效果，生成一个半径10尺的阵法，使自身当前气血及气血最大值提高150%，阵法内的队友受到的伤害的99%传递给自身，期间可施展二段招式结束阵法。少林自身不可移动并免疫控制，调息时间50秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '三生',
        奇穴图片: 'https://icon.jx3box.com/icon/4571.png',
        id: '45103',
        奇穴描述: '3点禅那及以上施展“罗汉金身”时，会返还消耗的禅那值，期间自身无双等级提高30%。',
      },
      {
        奇穴名称: '醍醐灌顶',
        奇穴图片: 'https://icon.jx3box.com/icon/13423.png',
        id: '44441',
        奇穴描述:
          '5点及以上禅那施展“韦陀献杵”“拿云式”，距离提升至12尺，召唤一个禅灵向前挥棍对自身前方15尺范围最多5个目标造成<SUB 44449 1>阳性内功伤害，返还“千斤坠”1.5秒调息时间，禅灵每命中1个目标，则恢复1点禅那值。<TALENT_CORE 44405 1>',
      },
      {
        奇穴名称: '无执',
        奇穴图片: 'https://icon.jx3box.com/icon/1508.png',
        id: '32647',
        奇穴描述:
          '战斗中无法使用武器、无法运功效果期间自身移动速度提高20%且免疫减速，“龙爪功”套路招式公共调息时间降低至1秒，命中后使目标身上<NounID 141>效果提升至30%。',
      },
      {
        奇穴名称: '正念',
        奇穴图片: 'https://icon.jx3box.com/icon/23475.png',
        id: '38623',
        奇穴描述:
          '“擒龙诀”期间获得“正念”效果：不受减速效果影响。“罗汉棍法”距离增加2尺且伤害提高40%，“捉影式”首次施展无调息。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '金刚日轮',
        奇穴图片: 'https://icon.jx3box.com/icon/7459.png',
        id: '32648',
        奇穴描述:
          '在“金刚日轮阵”中，施展“龙爪功”套路伤害招式附带一次伤害。“千斤坠”落地时可以将自身“金刚日轮阵”移动到自身位置。',
      },
      {
        奇穴名称: '缘觉',
        奇穴图片: 'https://icon.jx3box.com/icon/11884.png',
        id: '21703',
        奇穴描述:
          '消耗3点及以上禅那施展“拿云式”，施展距离提高至15尺并附带冲刺效果，造成伤害提高60%。',
      },
      {
        奇穴名称: '明澈',
        奇穴图片: 'https://icon.jx3box.com/icon/11889.png',
        id: '21697',
        奇穴描述:
          '施展“擒龙诀”，自身“禅意”将守护自身，“禅意”会每1秒对10尺范围的一个目标造成<SUB 21700 0>阳性内功伤害，并会优先以攻击自身的目标作为对象。且当“禅意”和自身攻击同一个对象时，“禅意”的该次攻击会变成4尺范围的伤害和减速效果。“禅意”持续10秒。',
      },
      {
        奇穴名称: '振磬',
        奇穴图片: 'https://icon.jx3box.com/icon/28344.png',
        id: '45936',
        奇穴描述:
          '“韦陀献杵”会额外命中目标5尺内2个目标，命中带有自身“横扫六合”效果的目标时，获得1点禅那，为目标添加<NounID 251>，持续3秒。<TALENT_CORE 45935 1>',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '慧焰',
        奇穴图片: 'https://icon.jx3box.com/icon/21970.png',
        id: '44399',
        奇穴描述:
          '施展“捉影式”会使金刚日轮附着在敌对侠士身上10秒，期间自身移速增加20%。日轮每秒对范围内5个目标造成阳性内功伤害，附着结束后日轮消失。自身伤害招式命中日轮附着目标时，会使日轮收缩，且造成伤害增加，最多增加3次。同一目标同时只能被1个日轮附着。',
      },
      {
        奇穴名称: '意相',
        奇穴图片: 'https://icon.jx3box.com/icon/422.png',
        id: '14793',
        奇穴描述:
          '“无相诀”可在“眩晕”、“定身”状态下释放，自身气血值每低于10%，减伤效果增加5%，减伤效果最多增加至90%。',
      },
      {
        奇穴名称: '独觉',
        奇穴图片: 'https://icon.jx3box.com/icon/421.png',
        id: '14795',
        奇穴描述: '“锻骨诀”施展后使自身不受外功伤害影响，持续4秒。',
      },
      {
        奇穴名称: '菩提身',
        奇穴图片: 'https://icon.jx3box.com/icon/11886.png',
        id: '6580',
        奇穴描述: '“无相诀”效果无法被卸除，效果期间每有一个禅那点，每秒恢复0.5%气血最大值。',
      },
      {
        奇穴名称: '身意',
        奇穴图片: 'https://icon.jx3box.com/icon/2967.png',
        id: '5915',
        奇穴描述: '施展“守缺式”“拿云式”“韦陀献杵”后使自身8秒内会心几率提高10%，会心效果提高10%。',
      },
      {
        奇穴名称: '尘息',
        奇穴图片: 'https://icon.jx3box.com/icon/437.png',
        id: '16886',
        奇穴描述: '“守缺式”附带的<NounID 141>效果可叠加2层。',
      },
      {
        奇穴名称: '五识',
        奇穴图片: 'https://icon.jx3box.com/icon/7432.png',
        id: '14752',
        奇穴描述: '“罗汉金身”反弹效果提高50%，效果期间受到伤害有20%几率使自身回复5%气血最大值。',
      },
      {
        奇穴名称: '我闻',
        奇穴图片: 'https://icon.jx3box.com/icon/12728.png',
        id: '24884',
        奇穴描述:
          '“横扫六合”调息时间降低1秒，会心几率提高10%，会心效果提高20%，持续伤害可以叠加2层。',
      },
      {
        奇穴名称: '布泽',
        奇穴图片: 'https://icon.jx3box.com/icon/13420.png',
        id: '44365',
        奇穴描述:
          '清除<NounID 204>效果时对非侠士目标附带一次<SUB 38615 1>阳性内功伤害，清除的层数越多，该次伤害越高。目标气血少于30%时，该伤害提高50%。',
      },
      {
        奇穴名称: '无量波罗',
        奇穴图片: 'https://icon.jx3box.com/icon/2974.png',
        id: '6587',
        奇穴描述:
          '“摩诃无量”招式有效距离提高4尺，若成功控制目标使目标无法施展轻功且受到罗汉棍法套路下招式伤害提高30%持续3秒，命中带有自身“横扫六合”效果的目标，使击倒和封轻功效果及易伤提高2秒。',
      },
      {
        奇穴名称: '无可证',
        奇穴图片: 'https://icon.jx3box.com/icon/16212.png',
        id: '37370',
        奇穴描述:
          '“守缺式”“拿云式”命中敌方玩家时，获得<NounID 127>效果，并依据和目标侠士的体质差值造成伤害并回复自身气血值。',
      },
      {
        奇穴名称: '法王身',
        奇穴图片: 'https://icon.jx3box.com/icon/2973.png',
        id: '42920',
        奇穴描述: '基础气血上限提高10%，元气提高10%。',
      },
    ],
  },
]

export default 奇穴数据
