import { 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { ERROR_ACTION } from '../../utils'

class 龙牙 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '龙牙')

  constructor(模拟循环) {
    super(模拟循环)
    龙牙.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '龙牙')
    const 循环加速值 = this.模拟循环.加速值
    if (龙牙?.技能数据?.技能CD) {
      const 加速后帧数 = 获取实际帧数(龙牙?.技能数据?.技能CD, 循环加速值)
      龙牙.技能数据.技能CD = 加速后帧数
    }
    this.初始化技能运行数据()
  }
  /**
   * 看lua龙血后触发，但是事实上
   * 消耗战意不刷新Buff,风虎是SkillEvent给的Buff
   * 所以这次技能的SkillEvent触发就是5层
   * 所以龙血和龙牙的风虎结算一致
   */

  命中() {
    this.本次是否高亮 = this.高亮判定()

    const 当前自身战意 = this.模拟循环?.角色状态信息?.战意

    this.保存释放记录('龙牙', 当前自身战意)
    this.破罡判定()
    this.龙牙造成伤害()
    this.龙血判定()
    this.判断龙牙锐意消耗()
    //this.牧云判定()
    this.触发伤害行为('破')
    this.橙武判定()
    this.龙牙获得龙驭判定()
  }

  龙牙获得龙驭判定() {
    if (this.模拟循环?.角色状态信息?.体态 === '站立') {
      this.获得龙驭判定()
    }
  }

  高亮判定() {
    return (
      !this.模拟循环.当前自身buff列表['龙驭']?.当前层数 &&
      this.模拟循环?.角色状态信息?.体态 === '骑乘'
    )
  }

  龙牙造成伤害() {
    const 是否为龙驭龙牙 = this.判定是否为龙驭龙牙()
    this.触发伤害行为('龙牙', 1, 是否为龙驭龙牙 ? ['龙驭'] : [])
    if (是否为龙驭龙牙) {
      this.模拟循环.卸除buff?.({ 名称: '龙驭', 对象: '自身', 卸除层数: 1 })
      if (
        this.模拟循环.当前自身buff列表['夜征']?.当前层数 &&
        this.模拟循环.当前自身buff列表['龙驭']?.当前层数
      ) {
        this.触发伤害行为('夜征')
        this.模拟循环.卸除buff?.({ 名称: '龙驭', 对象: '自身', 卸除层数: 1 })
      }
    }
  }

  判定是否为龙驭龙牙() {
    if (this.模拟循环.校验奇穴是否存在('龙驭') && this.模拟循环?.角色状态信息?.体态 === '骑乘') {
      return !!this.模拟循环.当前自身buff列表['龙驭']?.当前层数
    } else {
      return false
    }
  }

  龙血判定() {
    if (this.模拟循环.校验奇穴是否存在('龙血')) {
      if (this.模拟循环?.技能类实例集合?.['流血']?.流血存在判定()) {
        this.触发伤害行为('龙牙·龙血')
      }
    }
  }

  //牧云判定() {
  //if (this.模拟循环.校验奇穴是否存在('牧云')) {
  //const 牧云层数 = this.模拟循环.当前自身buff列表?.['牧云']?.当前层数 || 0
  //      if (牧云层数 && 牧云层数 < 4) {
  //  this.模拟循环.当前自身buff列表['牧云'].当前层数 = 牧云层数 + 1
  // }
  // }
  //}

  判断龙牙锐意消耗() {
    if (this.模拟循环.校验奇穴是否存在('虎贲')) {
      const 龙印层数 = this.模拟循环.当前自身buff列表?.['龙印']?.当前层数 || 0
      if (龙印层数 < 3) {
        this.消耗战意('龙牙', 3)
      } else {
        this.模拟循环.卸除buff?.({ 名称: '龙印', 对象: '自身', 卸除层数: 3 })
      }
      this.模拟循环.添加buff?.({ 名称: '龙印', 对象: '自身', 新增层数: 1 })
    } else if (this.模拟循环.连营判定()) {
      this.消耗战意('龙牙', 1)
    } else {
      this.消耗战意('龙牙', 3)
    }
  }

  橙武判定() {
    if (this.模拟循环.当前自身buff列表?.['橙武']?.当前层数) {
      this.回复战意('龙牙', 5)
      this.触发伤害行为('画角闻龙')
    }
    if (this.模拟循环?.大橙武模拟) {
      // 25%概率造成一次，这里取期望0.25次
      this.触发伤害行为?.('龙牙·神兵', 0.25)
    }
  }

  保存释放记录(名称, 伤害段数) {
    let 保存显示段数 = 伤害段数
    if (this.模拟循环.显示龙牙龙驭层数) {
      const 是否为龙驭龙牙 = this.判定是否为龙驭龙牙()
      if (是否为龙驭龙牙) {
        保存显示段数 = this.模拟循环.当前自身buff列表['龙驭']?.当前层数
      } else {
        保存显示段数 = undefined
      }
    }

    this.本次释放记录 = {
      伤害段数: 保存显示段数,
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表([
        '龙驭',
        '牧云',
        '驰骋·1',
        '驰骋·2',
        '激雷',
        '夜征',
        '渊',
      ]),
    }
  }
}

export default 龙牙

export const 龙牙类型 = typeof 龙牙
