import 循环主类类型 from '../main'
import { 循环基础技能数据类型, 技能释放记录结果 } from '../type'

class 技能统一类 {
  模拟循环: 循环主类类型 = {} as any
  本次释放记录: 技能释放记录结果 = {}
  本次释放延迟: number | 'GCD' = 0
  本次是否高亮: boolean = false
  本次是否在雷内: boolean = false

  constructor(模拟循环) {
    this.模拟循环 = 模拟循环
    return
  }

  检查GCD(索引, 当前技能?: 循环基础技能数据类型) {
    const 后一个技能 = this.模拟循环?.测试循环?.[索引 + 1]
    const GCD组 = 当前技能?.技能GCD组 === '自身' ? 当前技能?.技能名称 : 当前技能?.技能GCD组 || ''
    let GCD = this.模拟循环?.GCD组?.[GCD组] || 0
    let 等待GCD = 0

    if (this.本次释放延迟) {
      if (GCD组 === '公共') {
        GCD = GCD + this.本次释放延迟
      }
      // 如果存在后面的技能，判断后面的技能当前的GCD为多少，推进到后一个技能。这样可以让灭卡在后面的技能释放前释放
      else if (this.本次释放延迟 === 'GCD' && 后一个技能) {
        const 当前技能 = this?.模拟循环?.技能基础数据?.find((item) => item?.技能名称 === 后一个技能)
        if (当前技能 && 当前技能?.技能GCD组) {
          const 技能实例 = this?.模拟循环?.技能类实例集合?.[当前技能?.技能名称]
          const 后一个技能GCD = this.模拟循环?.检查GCD?.(当前技能, 技能实例, 索引 + 1) || 0
          等待GCD = 后一个技能GCD
        }
      } else {
        等待GCD = Number(this.本次释放延迟)
      }
      if (等待GCD) {
        GCD = Math.max(等待GCD, GCD)
      }
    }
    this.本次释放延迟 = 0
    return GCD
  }

  释放前初始化(额外信息) {
    if (额外信息?.延迟) {
      this.本次释放延迟 = 额外信息?.延迟
    }
    // 重置释放记录
    this.本次释放记录 = {}
  }

  成功释放初始化() {
    this.本次是否在雷内 =
      !!this.模拟循环.当前自身buff列表?.['激雷']?.当前层数 ||
      !!this.模拟循环.当前自身buff列表?.['夜征']?.当前层数
  }

  回复战意(来源: string, 回复数量) {
    const 变化后战意 = Math.min(5, this.模拟循环.角色状态信息.战意 + 回复数量)
    this.模拟循环.角色状态信息.战意 = 变化后战意
    this.模拟循环?.添加战斗日志({
      日志: `${来源}回复战意【${回复数量}】战意变为${变化后战意}`,
      日志类型: '自身buff变动',
      日志时间: this.模拟循环?.当前时间,
    })
  }

  消耗战意(来源: string, 消耗数量) {
    const 变化后战意 = Math.max(0, this.模拟循环.角色状态信息.战意 - 消耗数量)
    this.模拟循环.角色状态信息.战意 = 变化后战意

    this.模拟循环?.添加战斗日志({
      日志: `${来源}消耗战意【${消耗数量}】战意变为${变化后战意}`,
      日志类型: '自身buff变动',
      日志时间: this.模拟循环?.当前时间,
    })
  }

  破罡判定() {
    this.模拟循环.添加buff({ 名称: '破军', 对象: '目标' })
    this.触发伤害行为('破罡')
  }

  风虎判定(伤害名称) {
    if (this.模拟循环.校验奇穴是否存在('风虎')) {
      const 风虎伤害名称列表 = [
        '穿云·一',
        '穿云·二',
        '龙吟',
        '灭·斩杀',
        '灭',
        '灭·破楼兰·一',
        '灭·破楼兰·二',
        '灭·骑驭',
        '龙牙·龙血',
        '龙牙',
      ]
      return 风虎伤害名称列表?.includes(伤害名称)
    } else {
      return false
    }
  }

  获取DOT快照检测Buff列表(伤害名称) {
    if (伤害名称?.includes('DOT')) {
      return ['牧云', '渊', '驰骋·2', '驰骋·1', '夜征']
    } else {
      return []
    }
  }

  触发伤害行为(
    伤害名称,
    伤害次数 = 1,
    额外增益列表: string[] = [],
    触发伤害时间: number | undefined = undefined,
    技能等级 = 1,
  ) {
    const 破军标记 = this.模拟循环.当前目标buff列表?.['破军']
    const 伤害时间 = 触发伤害时间 ?? this.模拟循环.当前时间
    const 破军标记有效 =
      破军标记?.当前层数 && 伤害时间 < (破军标记.刷新时间 || 0) + (破军标记.最大持续时间 || 0)

    const 破军触发伤害列表 = [
      '穿云·一',
      '穿云·二',
      '龙吟',
      '龙牙',
      '灭',
      '灭·斩杀',
      '战八方·一',
      '战八方·二三',
      '突',
      '断魂刺',
      '破罡',
    ]
    // 判断玉枕
    const 增益列表 = [...额外增益列表]
    const 快照检测Buff列表 = this.获取DOT快照检测Buff列表(伤害名称)
    if (this.风虎判定(伤害名称)) {
      const 当前战意数量 = this.模拟循环.角色状态信息.战意 || 0
      if (当前战意数量) {
        增益列表.push(`风虎·${当前战意数量}`)
      }
    }
    // if (
    //   this.模拟循环?.当前自身buff列表?.['牧云']?.当前层数 &&
    //   !增益列表?.some((item) => item?.includes('牧云'))
    // ) {
    //   增益列表.push(`牧云·${this.模拟循环?.当前自身buff列表?.['牧云']?.当前层数}`)
    // }

    if (
      this.模拟循环?.当前自身buff列表?.['夜征']?.当前层数 &&
      伤害名称?.includes('DOT') &&
      !增益列表?.some((item) => item?.includes('夜征_常驻'))
    ) {
      增益列表.push('夜征_常驻')
    }
    // 当前技能数据?.宠物伤害
    this.模拟循环.技能造成伤害?.(伤害名称, 伤害次数, 增益列表, 触发伤害时间, false, 技能等级, [
      ...快照检测Buff列表,
      '龙驭',
    ])
    if (破军标记有效 && 破军触发伤害列表.includes(伤害名称)) {
      this.触发伤害行为('破军', 1, [], 伤害时间)
    }
  }

  下马处理() {
    this.模拟循环.角色状态信息.体态 = '站立'
  }

  获得龙驭判定(层数 = 1) {
    if (this.模拟循环.校验奇穴是否存在('龙驭')) {
      this.模拟循环.添加buff?.({ 名称: '龙驭', 对象: '自身', 新增层数: 层数 })
    }
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
      本次是否高亮: !!this.本次是否高亮,
      背景容器: !!this.本次是否在雷内, // background
    }
  }

  获取当前重要buff列表(技能依赖自身buff列表: string[] = [], 技能依赖目标buff列表: string[] = []) {
    const 重要buff列表: string[] = []
    技能依赖自身buff列表.forEach((buff) => {
      if (this.模拟循环.当前自身buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    技能依赖目标buff列表.forEach((buff) => {
      if (this.模拟循环.当前目标buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    return 重要buff列表 || []
  }

  获取施加重要buff信息(buff名称) {
    const 当前时间 = this.模拟循环.当前时间 || 0
    const buff对象 = this.模拟循环.Buff和Dot数据?.[buff名称]

    return buff对象
      ? {
          buff名称: buff名称,
          buff开始时间: 当前时间,
          buff结束时间: 当前时间 + (buff对象?.最大持续时间 || 0),
        }
      : null
  }
}

export default 技能统一类
