import type { 技能增益列表类型 } from '@/@types/技能'
import { 属性类型 } from '@/@types/属性'
import { 按数字生成数组 } from '@/心法模块/模块工具/按数字生成数组'
import 获取快照增益 from '@/心法模块/统一数据/快照增益'

// 409
// function 剑舞函数() {
//   const 数组 = 按数字生成数组(10)
//   return 数组.map((item) => {
//     return {
//       增益名称: `剑舞·${item}`,
//       增益所在位置: '技能',
//       增益类型: '部分启用',
//       增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 154 }],
//     } as 技能增益列表类型
//   })
// }

function 满堂函数() {
  const 数组 = 按数字生成数组(5)
  return 数组.map((item) => {
    return {
      BuffId: 10240,
      Buff层数: item,
      增益名称: `满堂·${item}`,
      增益所在位置: '技能',
      增益类型: '部分启用',
      增益集合: [
        { 属性: 属性类型.内功会心百分比, 值: 0.08 * item },
        { 属性: 属性类型.郭氏内功会心效果等级, 值: 21 * item },
      ],
    } as 技能增益列表类型
  })
}

// 17010
function 广陵月函数() {
  const 数组 = 按数字生成数组(10)
  return 数组.map((item) => {
    return {
      BuffId: 17010,
      Buff层数: item,
      增益名称: `广陵月·${item}`,
      增益所在位置: '技能',
      增益类型: '部分启用',
      增益集合: [{ 属性: 属性类型.郭氏内功会心效果等级, 值: 20 * item }],
    } as 技能增益列表类型
  })
}

const 通用增益: 技能增益列表类型[] = [
  ...获取快照增益(),
  // ...剑舞函数(),
  {
    BuffId: 5788,
    Buff层数: 1,
    增益名称: '枕上',
    增益所在位置: '奇穴',
    依赖奇穴: '枕上',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏全无视防御, 值: 512 }],
  },
  ...满堂函数(),
  ...广陵月函数(),
  {
    // 10081
    增益名称: '非侠',
    增益所在位置: '职业',
    增益启用: true,
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.非侠增伤, 值: 266 / 1024 }],
  },
  {
    BuffId: 409,
    增益名称: `剑舞`,
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 154 }],
  },
  {
    BuffId: 12571,
    Buff等级: 1,
    增益名称: '朝露',
    增益所在位置: '奇穴',
    依赖奇穴: '朝露',
    是否常驻面板: true,
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 51 }],
  },
  {
    // 12549
    增益名称: '元君',
    增益所在位置: '奇穴',
    依赖奇穴: '元君',
    增益类型: '全局启用',
    增益集合: [
      { 属性: 属性类型.内功会心百分比, 值: 0.1 },
      { 属性: 属性类型.郭氏内功会心效果等级, 值: 102 },
    ],
  },
  {
    BuffId: 25435,
    Buff等级: 2,
    增益名称: '剑舞长空',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [
      { 属性: 属性类型.内功会心百分比, 值: 0.05 },
      { 属性: 属性类型.郭氏内功会心效果等级, 值: 205 },
    ],
  },
  {
    BuffId: 17969,
    增益名称: '化冰',
    增益所在位置: '奇穴',
    依赖奇穴: '化冰',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏无双, 值: 307 }],
  },
  {
    BuffId: 538,
    增益名称: '繁音急节',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 461 }],
  },
  {
    BuffId: 28183,
    增益名称: '仙姿·剑破',
    增益所在位置: '奇穴',
    依赖奇穴: '芳姿畅音',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.最终增伤, 值: 51 / 1024 }],
  },
  {
    BuffId: 28184,
    增益名称: '仙姿·玳弦',
    增益所在位置: '奇穴',
    依赖奇穴: '芳姿畅音',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.最终增伤, 值: 51 / 1024 }],
  },
  {
    BuffId: 28185,
    增益名称: '仙姿·剑气',
    增益所在位置: '奇穴',
    依赖奇穴: '芳姿畅音',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.最终增伤, 值: 51 / 1024 }],
  },
  {
    BuffId: 28186,
    增益名称: '仙姿·剑影',
    增益所在位置: '奇穴',
    依赖奇穴: '芳姿畅音',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.最终增伤, 值: 51 / 1024 }],
  },
]

export default 通用增益
