import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import { 每秒郭氏帧 } from '@/数据/常量'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 天斗旋 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '天斗旋')
  static 作用总间隔 = 24
  static 读条时间 = 24
  static 本次释放是否读条 = true
  static 触发橙武 = false
  static 触发知微 = false

  constructor(模拟循环) {
    super(模拟循环)
    天斗旋.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '天斗旋')
    this.初始化技能运行数据()
  }

  释放前初始化() {
    天斗旋.触发橙武 = false
    天斗旋.本次释放是否读条 = false
    天斗旋.触发知微 = false

    if (天斗旋?.技能数据?.技能CD) {
      let 原始CD = 每秒郭氏帧 * 5
      if (this.模拟循环.校验奇穴是否存在('亘天')) {
        原始CD = 每秒郭氏帧 * 8
      }
      let 加速后帧数 = this.模拟循环.获取衍天实际帧数(原始CD)
      if (this.模拟循环.秘籍?.['天斗旋']?.some((a) => a?.includes('减CD_1'))) {
        加速后帧数 = 加速后帧数 - 每秒郭氏帧 * 1
      }
      天斗旋.技能数据.技能CD = 加速后帧数
    }
  }

  获取读条时间(技能索引) {
    this.保存释放记录('天斗旋')

    if (this.模拟循环.当前自身buff列表?.['橙武']?.当前层数) {
      天斗旋.触发橙武 = true
    }

    if (技能索引 == 0) {
      return 0
    }

    if (
      this.模拟循环.当前自身buff列表?.['橙武']?.当前层数 ||
      this.模拟循环.当前自身buff列表?.['知微']?.当前层数
    ) {
      if (this.模拟循环.当前自身buff列表?.['知微']?.当前层数) {
        天斗旋.触发知微 = true
      }
      return 0
    }

    const 读条时间 = this.获取天斗旋读条时间()
    天斗旋.本次释放是否读条 = true

    return 读条时间
  }

  获取天斗旋读条时间() {
    let 基础读条时间 = 天斗旋.作用总间隔

    if (this.模拟循环.校验奇穴是否存在('亘天')) {
      基础读条时间 = 基础读条时间 - 8
    }
    const 读条持续时间 = this.模拟循环.获取衍天实际帧数(基础读条时间)
    天斗旋.读条时间 = 读条持续时间
    return 读条持续时间
  }

  读条(读条开始时间) {
    // 开始读条
    this.读条天斗旋(读条开始时间)
  }

  读条天斗旋(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    待生效事件队列.push({
      事件名称: '技能读条',
      事件时间: 读条开始时间 + 天斗旋.读条时间,
      事件备注: {
        技能名称: '天斗旋',
      },
    })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  读条命中() {
    // 正读条引在读条结束后才进入CD
    if (天斗旋.技能数据) {
      this.模拟循环?.技能释放后更新运行数据?.(天斗旋.技能数据, this)
    }
    this.天斗旋命中()
  }

  命中(释放索引) {
    if (!天斗旋.本次释放是否读条 || 释放索引 === 0) {
      this.天斗旋命中()
    }
  }

  天斗旋命中() {
    this.获取星芒()
    this.水卦加速判断()
    this.根据卦象触发伤害('天斗旋')
    this.灵器伤害()
    this.触发伤害行为('破', 1, [], this.模拟循环.当前时间, 3)
    this.亘天伤害()
    this.橙武伤害('神兵·循环天转')
    this.对自身效果()
    this.镇星入舆处理()
    this.知微处理()
  }

  知微处理() {
    if (天斗旋.触发知微) {
      this.模拟循环.技能类实例集合?.DOT_知微?.引爆并重新刷新(1, '天斗旋')
      this.模拟循环.技能类实例集合?.DOT_知微?.引爆并重新刷新(1, '天斗旋')
      this.模拟循环.技能类实例集合?.DOT_知微?.获得和刷新DOT_知微()

      if (!天斗旋.触发橙武) {
        this.模拟循环.卸除buff({ 名称: '知微', 对象: '自身' })
      }
    }
  }

  对自身效果() {
    let 回复星运 = 20
    if (this.模拟循环.校验奇穴是否存在('亘天')) {
      回复星运 = 回复星运 + 10
    }
    this.获得星运(回复星运, '天斗旋')
  }

  亘天伤害() {
    if (this.模拟循环.校验奇穴是否存在('亘天')) {
      this.触发伤害行为('亘天')
    }
  }

  镇星入舆处理() {
    if (
      this.模拟循环.校验奇穴是否存在('镇星入舆') &&
      this.模拟循环.当前自身buff列表['镇星入舆_斗']?.当前层数
    ) {
      this.根据卦象触发伤害('天斗旋')
      this.灵器伤害()
      this.亘天伤害()
      this.橙武伤害('神兵·循环天转')
      this.知微处理()
      this.模拟循环.卸除buff({ 名称: '镇星入舆_斗', 对象: '自身' })
    }
  }

  释放后() {
    if (天斗旋.触发橙武) {
      this.重置调息时间()
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['荧入白', '祝祷', '鬼遁', '镇星', '明灯']),
    }
  }
}

export default 天斗旋

export const 天斗旋类型 = typeof 天斗旋
