// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import { ERROR_ACTION } from '../../utils'
import 技能统一类 from '../../通用类/技能统一类'

class 绝刀 extends 技能统一类 {
  // 苍云\套路及子技能\苍云_苍雪刀_绝刀.lua
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '绝刀')
  static 本次释放消耗怒气 = 0
  static 本次释放绝破等级 = 0
  static 本次释放绝返等级 = 0
  static 最低消耗怒气 = 25
  static 最高消耗怒气 = 65

  constructor(模拟循环) {
    super(模拟循环)
    const 存在减少消耗怒气秘籍 = this.模拟循环.秘籍?.['绝刀']?.includes('怒气消耗-15')
    if (存在减少消耗怒气秘籍) {
      绝刀.最低消耗怒气 = 10
      绝刀.最高消耗怒气 = 50
    } else {
      绝刀.最低消耗怒气 = 25
      绝刀.最高消耗怒气 = 65
    }
  }

  释放() {
    const 当前怒气 = this.模拟循环.角色状态信息?.怒气 || 0
    if (当前怒气 < 绝刀.最低消耗怒气) {
      return {
        可以释放: false,
        异常信息: ERROR_ACTION.怒气不足,
      }
    }

    return { 可以释放: true }
  }

  判定绝刀怒气消耗() {
    // scripts\skill\苍云\90级奇穴\判定怒气提高绝刀伤害.lua
    const 当前怒气 = this.模拟循环.角色状态信息?.怒气 || 0
    const 消耗怒气等级 = Math.min(Math.floor((当前怒气 - 绝刀.最低消耗怒气) / 10), 4)
    // 吓魂只能对玩家目标生效，但是反正其他PVP奇穴都做了，这个也留着吧，可以科研玩玩
    let 吓魂等级判定 = 0
    let 怒气附加等级 = 0
    if (this.模拟循环.校验奇穴是否存在?.('吓魂')) {
      吓魂等级判定 = 4
      if (this.模拟循环.校验奇穴是否存在?.('嗜血')) {
        怒气附加等级 = 1
      }
    }
    if (this.模拟循环.校验奇穴是否存在?.('嗜血') && 消耗怒气等级 === 4) {
      怒气附加等级 = 5
    }
    const 最终绝反等级 = 消耗怒气等级 + 吓魂等级判定 + 怒气附加等级
    const 消耗怒气 = Math.min(绝刀.最低消耗怒气 + 消耗怒气等级 * 10)
    const 绝破等级 = 消耗怒气等级 + 1
    return {
      绝返等级: 最终绝反等级,
      绝破等级: 绝破等级,
      消耗怒气: 消耗怒气,
    }
  }

  命中() {
    // 用来在模拟器内显示援戈层数标记。
    // 这个要写到前面不然会被橙武跳过。
    this.记录释放时援戈层数()

    绝刀.本次释放消耗怒气 = 0
    绝刀.本次释放绝破等级 = 0
    绝刀.本次释放绝返等级 = 0

    const { 绝返等级, 绝破等级, 消耗怒气 } = this.判定绝刀怒气消耗()
    绝刀.本次释放绝破等级 = 绝破等级
    绝刀.本次释放绝返等级 = 绝返等级

    // 橙武特效期间不消耗怒气和狂绝
    const 有橙武BUFF = this.模拟循环.当前自身buff列表?.['橙武']?.当前层数
    if (有橙武BUFF) {
      return
    }

    // 有狂绝时不消耗怒气
    const 有狂绝 = this.模拟循环.当前自身buff列表?.['狂绝']?.当前层数
    if (有狂绝) {
      this.模拟循环.卸除buff?.({ 名称: '狂绝', 对象: '自身', 卸除层数: 1 })
    } else {
      // 没有橙武和狂绝时正常消耗怒气
      绝刀.本次释放消耗怒气 = 消耗怒气
    }
  }

  造成伤害() {
    const 有血怒_惊涌 = this.模拟循环.当前自身buff列表?.['血怒_惊涌']?.当前层数
    // 使用统一的绝刀技能，但通过倍率调整伤害，并添加绝返增益
    this.触发伤害行为(
      '绝刀',
      1,
      绝刀.本次释放绝返等级 ? [`绝返·${绝刀.本次释放绝返等级}`] : [],
      undefined,
      false,
      1,
    )
    if (有血怒_惊涌) {
      // 有血怒时满怒绝刀触发惊涌
      if (绝刀.本次释放绝破等级 === 5) {
        this.触发伤害行为('惊涌')
      }
      //绝破和惊涌绝破是另外的一个技能，不是苍云破招32745
      this.触发伤害行为(
        '破·绝刀惊涌',
        1,
        绝刀.本次释放绝返等级 ? [`绝返·${绝刀.本次释放绝返等级}`] : [],
        undefined,
        false,
        绝刀.本次释放绝破等级,
      )
    } else {
      this.触发伤害行为(
        '破·绝刀',
        1,
        绝刀.本次释放绝返等级 ? [`绝返·${绝刀.本次释放绝返等级}`] : [],
        undefined,
        false,
        绝刀.本次释放绝破等级,
      )
    }
    this.触发血誓效果(绝刀.本次释放绝返等级)
    this.模拟循环.技能类实例集合?.盾击?.触发援戈伤害?.()
    // 结算怒气消耗
    if (绝刀.本次释放消耗怒气) {
      this.模拟循环.消耗怒气?.(绝刀.本次释放消耗怒气, '绝刀')
    }
    // 绝刀怒气结算要在触发麟光之前，否则会先回怒再消耗
    this.模拟循环.技能类实例集合?.业火麟光?.触发麟光玄甲伤害?.()
    // 嗜血晚于绝刀伤害生效，没有嗜血时释放绝刀，绝刀及相关伤害均无法获得嗜血加成
    this.模拟循环.添加buff?.({ 名称: '嗜血', 对象: '自身', 新增层数: 1 })
  }

  释放后() {
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武']),
    }
  }

  获取技能释放记录结果() {
    const 援戈层数 = this.获取释放时援戈层数() || 0
    const 格式化标记 = this.格式化援戈标记(援戈层数)
    return {
      ...this.本次释放记录,
      特殊标记: 援戈层数 > 0 ? 格式化标记 : undefined,
      伤害段数: 绝刀.本次释放绝破等级,
      底部标识: this.技能释放时怒气 || 0,
    }
  }
}

export default 绝刀
export const 绝刀类型 = typeof 绝刀
