import { 属性类型 } from '@/@types/属性'
import { 装备部位枚举 } from '@/@types/枚举'
import { 附魔原始数据, 附魔数据类型 } from '@/@types/附魔'

const 原始数据: 附魔原始数据[] = [
  { 数值: 1344, 分数: 3368, 颜色: '紫' },
  { 数值: 1148, 分数: 2877, 颜色: '紫', 赛季: '上赛季' },
  { 数值: 672, 分数: 1681, 颜色: '蓝' },
  { 数值: 574, 分数: 1436, 颜色: '蓝', 赛季: '上赛季' },
]

export const 获取武伤附魔数据 = (主属性): 附魔数据类型[] => {
  if (主属性 === '力道' || 主属性 === '身法') {
    return 原始数据.map((item) => {
      return {
        附魔名称: `武伤+${item?.数值}`,
        附魔支持部位: [装备部位枚举.武器],
        增益集合: [{ 属性: 属性类型?.武器伤害, 值: item?.数值 }],
        附魔装分: item?.分数,
        附魔颜色: item?.颜色,
      }
    })
  } else {
    return []
  }
}
