// import 压缩_灭6开 from './快速导入默认循环/启用循环/压缩_灭6开'
// import 压缩_沧3开 from './快速导入默认循环/启用循环/压缩_沧3开'
import 全灭倾怒平轴 from './快速导入默认循环/启用循环/全灭倾怒平轴'
import 紫武_太奶_轮椅_8行 from './快速导入默认循环/启用循环/紫武_太奶_轮椅_8行'
import 紫武_太奶_轮椅_9行 from './快速导入默认循环/启用循环/紫武_太奶_轮椅_9行'
import 紫武_太奶_轮椅_10行 from './快速导入默认循环/启用循环/紫武_太奶_轮椅_10行'
import 紫武_太奶_长短轴_8行 from './快速导入默认循环/启用循环/紫武_太奶_长短轴_8行'
import 紫武_太奶_长短轴_9行 from './快速导入默认循环/启用循环/紫武_太奶_长短轴_9行'
import 橙武_太奶_长短轴 from './快速导入默认循环/启用循环/橙武_太奶_长短轴'
import 雷姐橙武_三段 from './快速导入默认循环/启用循环/雷姐橙武_三段'
import 夯顶拉橙武_四段 from './快速导入默认循环/启用循环/夯顶拉橙武_四段'
import 当请太奶露一手 from './快速导入默认循环/启用循环/当请太奶露一手'
// import 夯顶拉橙武_四段_plus from './快速导入默认循环/启用循环/夯顶拉橙武_四段_plus'

export default [
  全灭倾怒平轴,
  紫武_太奶_轮椅_8行,
  紫武_太奶_轮椅_9行,
  紫武_太奶_轮椅_10行,
  紫武_太奶_长短轴_8行,
  紫武_太奶_长短轴_9行,
  雷姐橙武_三段,
  夯顶拉橙武_四段,
  当请太奶露一手,
  橙武_太奶_长短轴,
  // 夯顶拉橙武_四段_plus,
]
