import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 三星临 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '三星临')

  constructor(模拟循环) {
    super(模拟循环)
    三星临.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '三星临')
  }

  // 顺序不可随意更改
  命中() {
    this.获取星芒()
    this.水卦加速判断()
    this.根据卦象触发伤害('三星临')
    this.灵器伤害()
    this.对自身效果()
    this.镇星入舆处理()

    if (this.模拟循环?.大橙武模拟) {
      // 25%概率造成一次，这里取期望0.25次
      this.触发伤害行为?.('三星临·神兵', 0.25)
    }

    if (this.模拟循环.当前目标buff列表?.['连极阵']?.当前层数) {
      this.模拟循环.GCD组.公共 = Math.max((this.模拟循环.GCD组.公共 || 0) - 8, 0)
    }

    this.保存释放记录('三星临')
  }

  // skill/衍天/套路及子技能/兵_通用对自身执行一次效果.lua
  对自身效果() {
    this.获得星运(5, '三星临')
  }

  镇星入舆处理() {
    if (
      this.模拟循环.校验奇穴是否存在('镇星入舆') &&
      this.模拟循环.当前自身buff列表['镇星入舆_临']?.当前层数
    ) {
      this.根据卦象触发伤害('三星临')
      this.灵器伤害()
      this.获得星运(5, '三星临')
      this.模拟循环.卸除buff({ 名称: '镇星入舆_临', 对象: '自身' })
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['荧入白', '祝祷', '鬼遁', '镇星', '明灯']),
    }
  }
}

export default 三星临

export const 三星临类型 = typeof 三星临
