export default {
  "装备基础属性": {
    "基础攻击": 58428,
    "破防等级": 78663,
    "无双等级": 75358,
    "会心等级": 80159,
    "会心效果等级": 18424,
    "全能等级": 0,
    "武器伤害_最小值": 5450,
    "武器伤害_最大值": 9083,
    "破招值": 1122,
    "力道": 44,
    "元气": 8851,
    "身法": 44,
    "根骨": 44,
    "体质": 163303,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 10115,
    "装分": 606074
  },
  "装备镶嵌附魔属性": {
    "基础攻击": 11514,
    "破防等级": 4488,
    "无双等级": 8480,
    "会心等级": 8893,
    "会心效果等级": 2244,
    "全能等级": 0,
    "武器伤害_最小值": 0,
    "武器伤害_最大值": 0,
    "破招值": 1122,
    "力道": 44,
    "元气": 330,
    "身法": 44,
    "根骨": 44,
    "体质": 1823,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 4202
  },
  "装备列表": [
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSpunkBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104774,
      "装备部位": "帽子",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicCriticalDamagePowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104805,
      "装备部位": "衣服",
      "附魔": "无双+717"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104712,
      "装备部位": "腰带",
      "附魔": "无双+717"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104921,
      "装备部位": "护腕",
      "附魔": "无双+2401"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSurplusValueBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104950,
      "装备部位": "下装",
      "附魔": "无双+2401"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104743,
      "装备部位": "鞋子",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 42940,
      "装备部位": "项链",
      "附魔": "体质+889"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalDamagePowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 43095,
      "装备部位": "腰坠",
      "附魔": "体质+889"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 43002,
      "装备部位": "戒指",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 43002,
      "装备部位": "戒指",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalStrike",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 41218,
      "装备部位": "暗器",
      "附魔": "加速+4202"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSpunkBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 8,
      "id": 42172,
      "装备部位": "武器",
      "附魔": "攻击+728"
    }
  ],
  "五彩石": "彩·星见·激流·月华(陆)",
  "装备增益": {
    "大附魔_伤帽": 2,
    "大附魔_伤衣": 2,
    "大附魔_伤腰": 2,
    "大附魔_伤腕": 2,
    "大附魔_伤鞋": 2,
    "常驻套装会心会效": 1,
    "套装技能": 1,
    "特效_2869": 1,
    "特效_2872": 1,
    "试炼腰坠破防": 4,
    "特效_2875": 2,
    "大橙武特效": 7
  }
}