import { 装备属性信息模型, 装备特效枚举, 装备类型枚举 } from '@/@types/装备'
import { 装备速查数据 } from './interface'
import 获取当前数据 from '@/数据/数据工具/获取当前数据'
import { 属性类型 } from '@/@types/属性'
import { 获取装备增益表现 } from '@/功能模块/基础设置/属性录入/配装器/工具函数/根据装备信息获取基础属性/装备特效判断'
import 装备特效数据 from '@/数据/装备/装备增益数据/装备特效数据'
import {
  获取装备精炼装分,
  装备位置部位枚举,
  装备原始装分,
} from '@/功能模块/基础设置/属性录入/配装器/工具函数/装分计算/工具函数/装备分数'
import { 分数放大系数, 装备和附魔属性转换 } from './容量转换'

export { 分数放大系数 } from './容量转换'

/**
 * @NAME 容量分数计算规则
 * 以附魔为基础分数
 * 使用属性和附魔数值的比例计算出一个分数
 */

const 计算装备容量 = (
  原始数据: 装备属性信息模型[],
  装备部位,
  容量计算属性,
  自定义容量系数,
): 装备速查数据[] => {
  const 实际容量系数 = 过滤容量系数(自定义容量系数, 容量计算属性)

  return 原始数据.map((item) => {
    const 属性容量 = 计算装备属性容量(item, 实际容量系数) || 0
    const 特效容量 = 计算装备特效容量(item, 实际容量系数) || 0
    const 总容量 = 属性容量 + 特效容量
    const 装备质量 = item.装备类型 === 装备类型枚举.橙武 ? '5' : '4'
    const 装备部位映射 = 装备位置部位枚举?.[装备部位]
    const 装备原始分数 = 装备原始装分(item.装备品级, 装备质量, 装备部位映射)
    const 精炼分数 = 获取装备精炼装分(装备原始分数, 装备质量 === '5' ? 8 : 6)
    const 装备总分 = 装备原始分数 + 精炼分数
    if (!装备总分) {
      console.error('装备分数计算错误', item)
    }
    return {
      ...item,
      属性容量,
      特效容量: 特效容量,
      容量装分比: 总容量 / 装备总分,
    }
  })
}

const 计算装备属性容量 = (data: 装备属性信息模型, 实际容量系数) => {
  let 容量分数 = 0
  data?.装备增益?.forEach((item) => {
    const 附魔属性 = 装备和附魔属性转换(item.属性)
    const 附魔数值 = item?.值 || 0
    const 附魔最大数值 = 实际容量系数?.[附魔属性] || 0
    if (附魔最大数值) {
      容量分数 += (附魔数值 / 附魔最大数值) * 分数放大系数
    } else {
      console.error('容量计算错误', item, data)
    }
  })
  if (data?.武器伤害_最大值) {
    const 平均武器伤害 = ((data?.武器伤害_最小值 || 0) + (data?.武器伤害_最大值 || 0)) / 2
    if (平均武器伤害) {
      const 附魔最大数值 = 实际容量系数?.[属性类型.武器伤害] || 0
      // 内功心法没有武伤附魔基准，按不参与容量处理
      if (附魔最大数值) {
        容量分数 += (平均武器伤害 / 附魔最大数值) * 分数放大系数
      }
    }
  }
  return 容量分数
}

const 计算装备特效容量 = (data: 装备属性信息模型, 实际容量系数) => {
  const { 装备增益数据 } = 获取当前数据()
  let 容量分数 = 0
  if (data?.装备特效) {
    const 特效表现 = 获取装备增益表现(data) || 1
    const 增益数据 = 装备增益数据?.[data?.装备特效]
    switch (data?.装备特效) {
      case 装备特效枚举.水特效武器:
      case 装备特效枚举.特效_40790:
      case 装备特效枚举.特效_40802:
      case 装备特效枚举.特效_40803:
      case 装备特效枚举.特效_41065:
      case 装备特效枚举.特效_38944:
      case 装备特效枚举.特效_38939:
      case 装备特效枚举.大橙武特效:
      case 装备特效枚举.小橙武特效:
        if (增益数据?.length) {
          增益数据?.forEach((增益) => {
            const 对应实际值 = 增益?.值?.[特效表现]
            const 附魔最大数值 = 实际容量系数?.[增益?.属性] || 0
            if (对应实际值 !== undefined) {
              if (附魔最大数值) {
                容量分数 += (对应实际值 / 附魔最大数值) * 分数放大系数
              } else {
                console.error('找不到对应附魔值', data, 增益数据)
              }
            } else {
              console.error('找不到对应增益值', data, 增益数据)
            }
          })
        }
        break
      case 装备特效枚举.风特效腰坠:
        if (特效表现) {
          const 附魔最大数值 = 实际容量系数?.[属性类型.全破防等级] || 0
          const 等级加成数值 = 装备增益数据?.[装备特效枚举.风特效腰坠]?.[0]?.值 || {}
          const 加成数值 = 等级加成数值?.[特效表现] || 0
          容量分数 += ((加成数值 * 15) / 180 / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.特效_38934:
        if (特效表现) {
          const 附魔最大数值 = 实际容量系数?.[属性类型.全破防等级] || 0
          const 等级加成数值 = 装备特效数据.特效_38934?.算法参数?.加成数值 || {}
          const 加成数值 = 等级加成数值?.[特效表现] || 0
          容量分数 += (加成数值 / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.特效_38945:
        if (特效表现) {
          const 附魔最大数值 = 实际容量系数?.[属性类型.全会心等级] || 0
          const 算法参数 = 装备特效数据.特效_38945?.算法参数
          const 每层数值 = 算法参数?.加成数值?.[特效表现] || 0
          const 最大层数 = 算法参数?.最大层数?.[特效表现] || 0
          容量分数 += ((每层数值 * 最大层数) / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.特效_38946:
        if (特效表现) {
          const 附魔最大数值 = 实际容量系数?.[属性类型.全基础攻击] || 0
          const 算法参数 = 装备特效数据.特效_38946?.算法参数
          const 每层数值 = 算法参数?.加成数值?.[特效表现] || 0
          const 最大层数 = 算法参数?.最大层数?.[特效表现] || 0
          容量分数 += ((每层数值 * 最大层数) / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      case 装备特效枚举.特效_40791:
        if (特效表现) {
          const 等级加成数值 = 装备特效数据.特效_40791?.算法参数?.加成数值 || {}
          const 加成数值 = 等级加成数值?.[特效表现] || 0
          const 附魔最大数值 = 实际容量系数?.[属性类型.全会心等级] || 0
          容量分数 += (加成数值 / 附魔最大数值) * 分数放大系数
        } else {
          console.error('找不到对应增益值', data, 增益数据)
        }
        break
      default:
        console.info('未计算特效', data?.装备特效)
        break
    }
    return 容量分数
  } else {
    return 0
  }
}

/**
 * 过滤自定义容量系数对象，只保留存在于容量计算属性数组中的key
 * @param {Object} 自定义容量系数 - 包含各种属性系数的对象
 * @param {Array} 容量计算属性 - 用于过滤的有效属性数组
 * @returns {Object} 过滤后的新对象
 */
const 过滤容量系数 = (自定义容量系数, 容量计算属性) => {
  // 创建新对象存储过滤结果
  const 过滤后的系数 = {}

  // 遍历自定义容量系数对象的键
  Object.keys(自定义容量系数).forEach((key) => {
    // 如果该key存在于容量计算属性数组中，则保留
    if (容量计算属性.includes(key)) {
      过滤后的系数[key] = 自定义容量系数[key]
    }
  })

  return 过滤后的系数
}

export default 计算装备容量
