import { 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import { 判断秘籍减读条 } from '../../../../通用/通用函数'
import 技能统一类 from '../../通用类/技能统一类'
import { 每秒郭氏帧 } from '@/数据/常量'

class 钟林毓秀 extends 技能统一类 {
  // scripts/skill/万花/万花_百花拂穴手_钟林毓秀.lua
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '钟林毓秀')
  static 总作用间隔 = 32
  static 读条时间 = 32
  static 本次释放是否读条 = true
  static 本次释放墨意变化 = 0
  static 获得墨意 = 10

  constructor(模拟循环) {
    super(模拟循环)
  }

  获取读条时间(技能索引) {
    if (this.钟灵校验() || this.水月校验() || 技能索引 === 0) {
      钟林毓秀.本次释放是否读条 = false
      return 0
    }

    const 读条时间 = this.获取钟林毓秀读条时间()
    钟林毓秀.本次释放是否读条 = true
    return 读条时间
  }

  获取钟林毓秀读条时间() {
    const 秘籍减读条时间 = 判断秘籍减读条('钟林毓秀', this.模拟循环.秘籍)
    const 生风减读条时间 = this.模拟循环.校验奇穴是否存在('生风') ? 每秒郭氏帧 * 0.5 : 0
    const 读条持续时间 = 获取实际帧数(
      钟林毓秀.总作用间隔 - 秘籍减读条时间 - 生风减读条时间,
      this.模拟循环.加速值,
    )
    钟林毓秀.读条时间 = 读条持续时间
    return 读条持续时间
  }

  读条(读条开始时间) {
    this.保存释放记录('钟林毓秀')
    // 开始读条
    this.读条钟林毓秀(读条开始时间)
  }

  读条钟林毓秀(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    待生效事件队列.push({
      事件名称: '技能读条',
      事件时间: 读条开始时间 + 钟林毓秀.读条时间,
      事件备注: {
        技能名称: '钟林毓秀',
      },
    })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  读条命中() {
    this.钟林毓秀命中()
  }

  命中(释放索引) {
    if (!钟林毓秀.本次释放是否读条 || 释放索引 === 0) {
      this.钟林毓秀命中()
    }
    if (this.模拟循环.校验奇穴是否存在('生风')) {
      this.模拟循环.GCD组.公共 = Math.max((this.模拟循环.GCD组.公共 || 0) - 8, 0)
    }
  }

  钟林毓秀命中() {
    this?.模拟循环?.技能类实例集合?.DOT_钟林毓秀?.获得和刷新钟林毓秀()

    this.折花伤害触发判定('钟林')
    this.焚玉伤害触发判定()

    钟林毓秀.本次释放墨意变化 = 0
    if (this.钟灵校验()) {
      钟林毓秀.本次释放墨意变化 = -20
    } else if (this.水月校验()) {
      钟林毓秀.本次释放墨意变化 = -20
    }
    this.模拟循环?.卸除buff({ 名称: '水月瞬发', 对象: '自身' })
    this.模拟循环?.卸除buff({ 名称: '钟灵瞬发', 对象: '自身' })
    this.墨意变化(钟林毓秀.获得墨意 + 钟林毓秀.本次释放墨意变化)
    this?.涓流函数()
  }

  保存释放记录(名称) {
    const 保存显示段数 = this.模拟循环.显示涓流层数
      ? this.模拟循环.当前自身buff列表['涓流']?.当前层数 || 0
      : undefined

    this.本次释放记录 = {
      伤害段数: 保存显示段数,
      实际伤害技能: 名称,
      特殊标记: 钟林毓秀.本次释放是否读条 ? '读' : undefined,
      重要buff列表: this.获取当前重要buff列表(['钟灵', '倚天', '涓流', '乱洒青荷', '布散畅和']),
    }
  }
}

export default 钟林毓秀

export const 钟林毓秀类型 = typeof 钟林毓秀
