import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import 获取快照增益 from '@/心法模块/统一数据/快照增益'
import { 日月齐光日增益, 日月齐光月增益 } from './日月齐光'

const 通用增益: 技能增益列表类型[] = [
  ...获取快照增益(),
  {
    增益名称: '日月耀临',
    增益所在位置: '奇穴',
    依赖奇穴: '日月耀临',
    增益类型: '全局启用',
    是否常驻面板: true,
    增益集合: [
      { 属性: 属性类型.郭氏无双, 值: 205 },
      { 属性: 属性类型.郭氏全无视防御, 值: 307 },
    ],
  },
  {
    BuffId: 34407,
    Buff等级: 1,
    增益名称: '日月齐光',
    增益所在位置: '奇穴',
    依赖奇穴: '日月齐光',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 256 }],
  },
  {
    增益名称: '非侠',
    增益所在位置: '职业',
    增益启用: true,
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.非侠增伤, 值: 317 / 1024 }],
  },
  {
    // 6277
    BuffId: 6277,
    增益名称: '无明业火',
    增益所在位置: '奇穴',
    增益类型: '部分启用',
    增益集合: [
      { 属性: 属性类型.内功会心百分比, 值: 0.12 },
      { 属性: 属性类型.郭氏内功会心效果等级, 值: 123 },
    ],
  },
]

export const 通用日增益: 技能增益列表类型[] = [...通用增益, ...日月齐光日增益]
export const 通用月增益: 技能增益列表类型[] = [...通用增益, ...日月齐光月增益]

export default 通用增益
