import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '鸣震九霄',
        奇穴图片: 'https://icon.jx3box.com/icon/16188.png',
        id: '28680',
        奇穴描述:
          '被动效果：自身拥有9层<NounID 14>后，每获得1层<NounID 14>，降低“鸣震九霄”调息时间1秒。\\n主动效果：“项王击鼎”三段持续效果期间方可施展，可透支两次，触发不同效果：\\n 一段：将周围10尺内5个敌对目标向自身短暂吸引，若在自身“坚壁清野”区域中施展，本次“项王击鼎”三段持续攻击造成额外伤害。\\n二段：向前冲刺并吸引目标。\\n三段：冲向15尺内选中目标，对自身8尺范围内敌方造成100%武器伤害外加<SUB 40188 0>外功伤害并眩晕2秒。\\n每次施展可获得25%减伤持续8秒，可叠加3层。',
      },
      {
        奇穴名称: '斩狂枭',
        奇穴图片: 'https://icon.jx3box.com/icon/8555.png',
        id: '21858',
        奇穴描述:
          '施展“上将军印”将额外消耗狂意，且使自身获得<NounID 199>效果，每额外消耗10点狂意，<NounID 199>持续时间增加1秒。',
      },
      {
        奇穴名称: '渊冰',
        奇穴图片: 'https://icon.jx3box.com/icon/8637.png',
        id: '25639',
        奇穴描述:
          '“楚河汉界”调息时间增加5秒，施展后3秒内“刀啸风吟”变为最多蓄力1.5秒的招式，命中目标使目标定身且无法使用轻功3秒。蓄力1至1.25秒时施放，刀气会吸收自身“楚河汉界”并造成最高<SUB 36311 4>外功伤害，自身冲向目标并在目标周围形成半径5尺的圆形刀气障碍，敌方玩家目标无法穿越，持续3秒。',
      },
      {
        奇穴名称: '横断山河',
        奇穴图片: 'https://icon.jx3box.com/icon/11907.png',
        id: '25095',
        奇穴描述:
          '金屏体态下可以施展，消耗15点气劲，自身免疫控制（击退和被拉除外），持续4秒，冲向目标，造成<SUB 25262 1>外功伤害并击飞目标，使目标无法施展轻功，持续3秒，若目标被击飞则降低自身0.5秒基础调息时间，可以施展二段招式冲刺至目标身边造成<SUB 25262 2>外功伤害，若目标高于8尺还将被击落，自身随即跳跃落地，再对目标造成<SUB 25262 4>外功伤害并在自身前方6尺生成"封渊震煞"刀气障碍，持续4秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '辟易',
        奇穴图片: 'https://icon.jx3box.com/icon/27077.png',
        id: '44396',
        奇穴描述:
          '“破釜沉舟”调息时间降低4秒，命中不多于三个侠士目标时无视目标30%化劲等级。<TALENT_CORE 25095 1>',
      },
      {
        奇穴名称: '化蛟',
        奇穴图片: 'https://icon.jx3box.com/icon/8642.png',
        id: '16779',
        奇穴描述:
          '“醉斩白蛇”增加3跳且每跳附带一段破招伤害，调息时间提高14秒，可透支一次，触发破招后下一跳伤害递增90%，施展后立刻对目标造成伤害。',
      },
      {
        奇穴名称: '百战',
        奇穴图片: 'https://icon.jx3box.com/icon/8453.png',
        id: '18625',
        奇穴描述:
          '“项王击鼎”伤害提高50%，三段触发的持续范围伤害每跳伤害递增15%，最多提高120%。且攻击频率提升25%。',
      },
      {
        奇穴名称: '霜云',
        奇穴图片: 'https://icon.jx3box.com/icon/25373.png',
        id: '42410',
        奇穴描述: '“擒龙六斩”的伤害递增效果额外提高5%，“四面楚歌”第三段伤害命中时使目标沉默2秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '分疆',
        奇穴图片: 'https://icon.jx3box.com/icon/8516.png',
        id: '17047',
        奇穴描述: '“上将军印”能额外劈出2刀伤害且攻击频率提高33%，招式无视目标15%化劲等级。',
      },
      {
        奇穴名称: '吞楚',
        奇穴图片: 'https://icon.jx3box.com/icon/8512.png',
        id: '16726',
        奇穴描述: '“碎江天”使目标受到的疗伤成效降低50%，持续12秒。',
      },
      {
        奇穴名称: '冷川',
        奇穴图片: 'https://icon.jx3box.com/icon/8526.png',
        id: '16977',
        奇穴描述: '体态能量上限提高20点，战斗状态下非当前体态能量回复速度提高300%。',
      },
      {
        奇穴名称: '烽河',
        奇穴图片: 'https://icon.jx3box.com/icon/25371.png',
        id: '42461',
        奇穴描述:
          '“楚河汉界”调息时间降低10秒，不再生成刀气障碍，转而在身前生成一道刀河，持续5秒，每秒对范围内的最多10个敌方目标造成<SUB 42463 1>外功伤害并减速60%。刀河内的目标持续受到<NounID 75>效果，该效果每2秒最多触发一次。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '冥鼓',
        奇穴图片: 'https://icon.jx3box.com/icon/8507.png',
        id: '26904',
        奇穴描述: '“破釜沉舟”伤害提高50%，招式范围变成360°，且施展后30秒内无视目标50%的外功防御。',
      },
      {
        奇穴名称: '裁骨',
        奇穴图片: 'https://icon.jx3box.com/icon/8635.png',
        id: '16911',
        奇穴描述:
          '“楚河汉界”“封渊震煞”刀气障碍会将触碰到的敌方目标击退并眩晕2秒，20秒内不会再次被影响，最多对10个目标生效。',
      },
      {
        奇穴名称: '削霜',
        奇穴图片: 'https://icon.jx3box.com/icon/8539.png',
        id: '16748',
        奇穴描述:
          '“项王击鼎”第三段招式命中有自身“闹须弥”的侠士目标时，使其获得气血最大值3%的治疗吸收盾，最多叠加8层，持续10秒。',
      },
      {
        奇穴名称: '霜轮',
        奇穴图片: 'https://icon.jx3box.com/icon/8640.png',
        id: '25254',
        奇穴描述:
          '“松烟竹雾”体态下移速效果额外增加10%，受到的锁足、定身、眩晕控制效果持续时间降低10%且每秒恢复自身0.4%自身气血最大值。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '颓阙',
        奇穴图片: 'https://icon.jx3box.com/icon/27076.png',
        id: '44400',
        奇穴描述: '“割据秦宫”调息时间降低5秒，若命中倒地目标则延长倒地时间1.5秒。',
      },
      {
        奇穴名称: '掠关',
        奇穴图片: 'https://icon.jx3box.com/icon/13367.png',
        id: '38541',
        奇穴描述:
          '“项王击鼎”无视目标15%化劲且前三段范围提升至360°。第一、二、三段公共调息时间提升至2.5秒且期间自身不受缴械、沉默影响，造成伤害时使目标僵直，并标记目标使其无法使用“蹑云逐月”。',
      },
      {
        奇穴名称: '砺锋',
        奇穴图片: 'https://icon.jx3box.com/icon/8575.png',
        id: '26735',
        奇穴描述: '切换至“雪絮金屏”体态，使得自身下两个“醉斩白蛇”最终伤害提高56%。',
      },
      {
        奇穴名称: '照野',
        奇穴图片: 'https://icon.jx3box.com/icon/13366.png',
        id: '21264',
        奇穴描述:
          '“西楚悲歌”刀气障碍范围内附带“坚壁清野”残留伤害效果，并使目标无法跳跃，“破釜沉舟”命中“西楚悲歌”内目标时，使目标在“西楚悲歌”结束后3秒内依旧无法跳跃。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '碎影',
        奇穴图片: 'https://icon.jx3box.com/icon/8519.png',
        id: '16816',
        奇穴描述:
          '“闹须弥”释放后获得一次“碎江天”施展机会。“碎江天”命中“闹须弥”目标时额外造成<SUB 38533 0>外功伤害。',
      },
      {
        奇穴名称: '见尘',
        奇穴图片: 'https://icon.jx3box.com/icon/18266.png',
        id: '32857',
        奇穴描述:
          '“上将军印”命中有自身“闹须弥”效果的目标后，会生成灵体在目标身后施展“上将军印·见尘”攻击该目标，对目标造成<SUB 32859 1>伤害。“上将军印·见尘”若累计命中目标3次，则使目标定身2秒。',
      },
      {
        奇穴名称: '微尘',
        奇穴图片: 'https://icon.jx3box.com/icon/25369.png',
        id: '42563',
        奇穴描述: '“闹须弥”变成2层充能招式，且不占用基础调息时间。',
      },
      {
        奇穴名称: '踏风',
        奇穴图片: 'https://icon.jx3box.com/icon/25370.png',
        id: '42564',
        奇穴描述:
          '“龙骧虎步”免控持续时间增5秒，调息时间增加15秒，施展后回复的狂意、刀魂、气劲提升至60点。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '易水',
        奇穴图片: 'https://icon.jx3box.com/icon/8531.png',
        id: '16958',
        奇穴描述: '“西楚悲歌”施展后解除自身锁足和被击僵直状态，使范围内小队成员受到的伤害降低30%。',
      },
      {
        奇穴名称: '秋瑟',
        奇穴图片: 'https://icon.jx3box.com/icon/8533.png',
        id: '16739',
        奇穴描述:
          '“散流霞”调息时间增加10秒，施展后立刻卸除自身阳性、阴性、混元、毒性、点穴、持续伤害不利效果各两个，效果期间施展招式不会解除无法选中状态。',
      },
      {
        奇穴名称: '临江',
        奇穴图片: 'https://icon.jx3box.com/icon/11906.png',
        id: '37982',
        奇穴描述:
          '“上将军印”变为瞬发招式，召唤灵体对目标造成伤害，施展后提高自身的15%外功基础攻击力，10%无双等级，持续30秒。',
      },
      {
        奇穴名称: '绝河',
        奇穴图片: 'https://icon.jx3box.com/icon/19152.png',
        id: '34677',
        奇穴描述:
          '“破釜沉舟”招式有效距离提高2尺。自身血量高于50%时命中侠士目标，则额外消耗自身5%气血值对目标造成双倍的<NounID 101>。',
      },
      {
        奇穴名称: '龙息',
        奇穴图片: 'https://icon.jx3box.com/icon/8545.png',
        id: '16691',
        奇穴描述:
          '“擒龙六斩”变为六层透支招式，施展距离变为6尺，施展后返还8秒调息时间且自身不再进入僵直状态，招式不再附带冲刺和僵直控制效果且占用除“碎江天”外招式1.5秒公共调息时间。',
      },
      {
        奇穴名称: '击瑕',
        奇穴图片: 'https://icon.jx3box.com/icon/8509.png',
        id: '16724',
        奇穴描述:
          '“秀明尘身”套路下招式消耗狂意降低20%，命中锁足、定身、眩晕、倒地目标伤害提高25%。',
      },
      {
        奇穴名称: '重烟',
        奇穴图片: 'https://icon.jx3box.com/icon/8636.png',
        id: '16893',
        奇穴描述: '“秀明尘身”体态下自身所有招式调息速度提高15%。',
      },
      {
        奇穴名称: '疏狂',
        奇穴图片: 'https://icon.jx3box.com/icon/8638.png',
        id: '17054',
        奇穴描述:
          '主动施展“西楚悲歌”时，不再生成刀气障碍，伤害范围扩大至12尺，自身回复20%最大气血值，范围内自身基础攻击力提高30%，持续12秒。',
      },
      {
        奇穴名称: '绝期',
        奇穴图片: 'https://icon.jx3box.com/icon/8518.png',
        id: '17056',
        奇穴描述:
          '“闹须弥”流血效果伤害提高70%且自身伤害招式命中目标后有30%的几率刷新流血效果持续时间并造成<SUB 34585 1>外功伤害，同时降低“闹须弥”1秒调息时间。',
      },
      {
        奇穴名称: '曳鼎',
        奇穴图片: 'https://icon.jx3box.com/icon/8544.png',
        id: '16957',
        奇穴描述: '“楚河汉界”变为2层充能招式，调息时间增加10秒。',
      },
      {
        奇穴名称: '行泽',
        奇穴图片: 'https://icon.jx3box.com/icon/8537.png',
        id: '16781',
        奇穴描述:
          '“醉斩白蛇”消耗的气劲增加15点，命中目标并使目标无法施展轻功、移动速度降低20%，持续2秒。',
      },
      {
        奇穴名称: '扬刀激尘',
        奇穴图片: 'https://icon.jx3box.com/icon/18264.png',
        id: '33123',
        奇穴描述:
          '被动效果：“秀明尘身”体态下招式施展范围增加1尺，控制时间增加1秒，处于自身“坚壁清野”区域时，移动速度提高30%。\\n主动效果：该招式视作“秀明尘身”套路下招式，消耗10点狂意，对前方20尺范围最多5个目标造成<SUB 33129 1>外功伤害附带200%武器伤害，使目标无法施展轻功，持续3秒，路径上附带5秒“坚壁清野”伤害残留效果。',
      },
    ],
  },
]

export default 奇穴数据
