import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 行云势 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '行')
  static 回复锐意 = 0
  static 本次回复锐意 = 0
  static 潋风额外锐意 = 5
  static 本次额外回锐 = false
  static 本次额外伤害 = false

  constructor(模拟循环) {
    super(模拟循环)
    行云势.回复锐意 =
      (行云势.技能数据?.回复锐意 || 0) + (this.模拟循环.校验奇穴是否存在?.('驭耀') ? 6 : 0)
  }

  卸除潋风行云势额外锐意() {
    const 原额外锐意刷新时间 = this.模拟循环.当前自身buff列表?.['潋风行云势额外锐意']?.刷新时间 || 0
    this.模拟循环.卸除buff?.({
      名称: '潋风行云势额外锐意',
      对象: '自身',
      卸除层数: 1,
      buff刷新时间: 原额外锐意刷新时间,
    })
  }

  命中() {
    this.弱点击破判定()
  }

  造成伤害() {
    const 潋风行云势额外锐意 = this.模拟循环.当前自身buff列表?.['潋风行云势额外锐意']?.当前层数
    const 潋风行云势额外伤害 = this.模拟循环.当前自身buff列表?.['潋风行云势额外伤害']?.当前层数

    let 基础锐意 = 0
    if (潋风行云势额外锐意) {
      基础锐意 = 行云势.回复锐意 + 行云势.潋风额外锐意
    } else {
      基础锐意 = 行云势.回复锐意
    }
    行云势.本次额外回锐 = !!潋风行云势额外锐意
    行云势.本次额外伤害 = !!潋风行云势额外伤害

    if (this.模拟循环.校验奇穴是否存在?.('择行')) {
      行云势.本次回复锐意 = 基础锐意 * 3
    } else {
      行云势.本次回复锐意 = 基础锐意
    }

    // 通过判断是否消耗完潋风行云势额外锐意了来决定是否增加伤害，偷懒行为
    let 额外伤害Buff: string[] = []
    if (潋风行云势额外伤害 && !潋风行云势额外锐意) {
      额外伤害Buff.push('潋风_行云')
      this.触发伤害行为('潋风')
    }

    // 判断奇穴存在电逝时，在灭影随风buff下，只会造成行3伤害
    if (
      this.模拟循环.校验奇穴是否存在?.('电逝') &&
      this.模拟循环.当前自身buff列表?.['灭影追风']?.当前层数
    ) {
      this.行云势造成伤害('行云势·三', 3, 额外伤害Buff)
      this.模拟循环.卸除buff?.({ 名称: '行链', 对象: '自身', 卸除层数: 2 })
    } else {
      const 行链层数 = this.模拟循环.当前自身buff列表?.['行链']?.当前层数
      if (!行链层数) {
        this.行云势造成伤害?.('行云势·一', 1, 额外伤害Buff)
        // 添加两层行链buff
        this.模拟循环.添加buff?.({ 名称: '行链', 对象: '自身', 新增层数: 2 })
      } else if (行链层数 > 1) {
        this.行云势造成伤害?.('行云势·二', 2, 额外伤害Buff)
        // 消耗一层行链buff
        this.模拟循环.卸除buff?.({ 名称: '行链', 对象: '自身', 卸除层数: 1 })
      } else if (行链层数 === 1) {
        this.行云势造成伤害?.('行云势·三', 3, 额外伤害Buff)
        this.模拟循环.卸除buff?.({ 名称: '行链', 对象: '自身', 卸除层数: 2 })
      }
    }
    this.卸除潋风行云势额外锐意()

    this.触发回复锐意(行云势.本次回复锐意, 行云势.技能数据?.技能名称)
  }

  行云势造成伤害(名称, 段数, 额外伤害Buff) {
    this.触发伤害行为(名称, 1, 额外伤害Buff)

    if (this.模拟循环?.大橙武模拟) {
      // 25%概率造成一次，这里取期望0.25次
      this.触发伤害行为?.('行云势·神兵', 0.25)
    }

    this.保存释放记录(名称, 段数)
  }

  保存释放记录(名称, 段数) {
    this.本次释放记录 = {
      伤害段数: 段数,
      特殊标记: 行云势.本次额外回锐 ? '5' : 行云势.本次额外伤害 ? 30 : undefined,
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['潋风行云势额外伤害', '灭影追风', '流岚']),
    }
  }
}

export default 行云势

export const 行云势类型 = typeof 行云势
