import { 属性类型 } from '@/@types/属性'

export const 循环名称映射 = {
  外功攻击提高: 属性类型.外功基础攻击,
  内功攻击提高: 属性类型.内功基础攻击,
  外功破防等级提高: 属性类型.外功破防等级,
  内功破防等级提高: 属性类型.内功破防等级,
  外功会心等级提高: 属性类型.外功会心等级,
  内功会心等级提高: 属性类型.内功会心等级,
  外功会心效果等级提高: 属性类型.外功会心效果等级,
  内功会心效果等级提高: 属性类型.内功会心效果等级,
  无双等级提高: 属性类型.无双等级,
  加速等级提高: 属性类型.加速等级,
  近身伤害提高: 属性类型.武器伤害,
  身法提高: 属性类型.身法,
  力道提高: 属性类型.力道,
  元气提高: 属性类型.元气,
  根骨提高: 属性类型.根骨,
}

export const 镶嵌名称映射 = {
  外功攻击提高: 属性类型.外功基础攻击,
  内功攻击提高: 属性类型.内功基础攻击,
  外功破防等级提高: 属性类型.外功破防等级,
  内功破防等级提高: 属性类型.内功破防等级,
  外功会心等级提高: 属性类型.外功会心等级,
  内功会心等级提高: 属性类型.内功会心等级,
  外功会心效果等级提高: 属性类型.外功会心效果等级,
  内功会心效果等级提高: 属性类型.内功会心效果等级,
  无双等级提高: 属性类型.无双等级,
  加速等级提高: 属性类型.加速等级,
  近身伤害提高: 属性类型.武器伤害,
  身法提高: 属性类型.身法,
  力道提高: 属性类型.力道,
  元气提高: 属性类型.元气,
  根骨提高: 属性类型.根骨,
}
