import type { 技能基础数据模型 } from '@/@types/技能'

import 通用增益 from './技能增益/通用增益/通用增益'
import 裁叶饮刃增益 from './技能增益/裁叶饮刃'
import 银光照雪增益 from './技能增益/银光照雪'
import 且待时休增益 from './技能增益/且待时休'
import 川乌射罔增益 from './技能增益/川乌射罔'
import 沾衣未妨增益 from './技能增益/沾衣未妨'
import 钩吻断肠增益 from './技能增益/钩吻断肠'
import 商陆缀寒增益 from './技能增益/商陆缀寒'
import 无方中和增益 from './技能增益/无方中和'
import 苍棘缚地增益 from './技能增益/苍棘缚地'
import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'

// 27560
const 逆乱数据: Partial<技能基础数据模型> = {
  统计名称: '逆乱(DOT)',
  DOT生效间隔: 32,
  DOT跳数: 8,
  基础伤害_基础值: 1,
  技能伤害系数: 181.12248000000005,
  技能增益列表: 通用增益,
}

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '27451',
    技能名称: '裁叶饮刃',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 裁叶饮刃增益,
  },
  {
    技能ID: '28081',
    技能名称: '无方中和',
    技能伤害系数: 457,
    基础伤害_基础值: 80,
    基础伤害_浮动值: 8,
    技能增益列表: 无方中和增益,
  },
  {
    技能ID: '20052_27560', // 20052_27560
    技能名称: '逆乱(DOT)',
    ...逆乱数据,
  },
  {
    技能ID: '27552',
    技能名称: '商陆缀寒',
    技能伤害系数: 253.0,
    基础伤害_基础值: 111,
    基础伤害_浮动值: 6,
    技能增益列表: 商陆缀寒增益,
  },
  {
    技能ID: '27555',
    技能名称: '钩吻断肠',
    技能伤害系数: 120,
    基础伤害_基础值: 11,
    基础伤害_浮动值: 1,
    技能增益列表: 钩吻断肠增益,
  },
  {
    技能ID: '27557',
    技能名称: '川乌射罔',
    技能伤害系数: 343,
    基础伤害_基础值: 21,
    基础伤害_浮动值: 1,
    技能增益列表: 川乌射罔增益,
  },
  {
    技能ID: '27579',
    技能名称: '沾衣未妨',
    统计名称: '沾衣未妨',
    技能伤害系数: 120,
    基础伤害_基础值: 12,
    基础伤害_浮动值: 1,
    技能增益列表: 沾衣未妨增益,
  },
  {
    技能ID: '27584',
    技能名称: '且待时休',
    统计名称: '且待时休',
    技能伤害系数: 282,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 1,
    技能增益列表: 且待时休增益,
  },
  {
    技能ID: '28409',
    技能名称: '且待时休·苍棘缚地',
    秘籍依赖技能: '且待时休',
    统计名称: '且待时休',
    技能伤害系数: 141,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 1,
    技能增益列表: 且待时休增益,
  },
  {
    技能ID: '28346',
    技能名称: '银光照雪',
    秘籍依赖技能: '银光照雪',
    技能伤害系数: 132,
    基础伤害_基础值: 41,
    基础伤害_浮动值: 2,
    技能增益列表: 银光照雪增益,
  },
  {
    技能ID: '27539',
    技能名称: '惊鸿掠水',
    技能伤害系数: 100,
    基础伤害_基础值: 15,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '29505',
    技能名称: '含锋破月',
    技能伤害系数: 801,
    基础伤害_基础值: 57,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '29506',
    技能名称: '飞叶满襟',
    技能伤害系数: 1094,
    基础伤害_基础值: 62,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '30735',
    技能名称: '折枝拂露',
    技能伤害系数: 337,
    基础伤害_基础值: 73,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32922',
    技能名称: '折枝留春',
    技能伤害系数: 1950,
    基础伤害_基础值: 73,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '27657',
    技能名称: '苍棘缚地',
    技能伤害系数: 297,
    基础伤害_基础值: 13,
    基础伤害_浮动值: 1,
    技能增益列表: 苍棘缚地增益,
  },
  {
    技能ID: '28385',
    技能名称: '紫叶沉疴',
    技能伤害系数: 190,
    基础伤害_基础值: 417,
    基础伤害_浮动值: 15,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '28434',
    技能名称: '紫伏',
    技能伤害系数: 238,
    基础伤害_基础值: 3,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '29698',
    技能名称: '商陆缀寒·神兵',
    技能伤害系数: 65,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '29695',
    技能名称: '鹿王本生',
    统计名称: '烬灭',
    技能伤害系数: 440,
    基础伤害_基础值: 12,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '凄骨',
    技能伤害系数: 600,
    基础伤害_基础值: 10,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '40208',
    技能名称: '六微',
    技能伤害系数: 804,
    基础伤害_基础值: 2,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },

  // --------------
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
  裁叶饮刃增益,
  银光照雪增益,
  且待时休增益,
  川乌射罔增益,
  钩吻断肠增益,
  商陆缀寒增益,
  无方中和增益,
}

export { 技能增益 }
