import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 浮游天地 extends 有CD技能通用类 {
  // lua入口 19828
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '浮游天地')

  constructor(模拟循环) {
    super(模拟循环)
    浮游天地.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '浮游天地')
    this.初始化技能运行数据()
  }

  命中() {
    this.浮游天地造成伤害()
    this.模拟循环.角色状态信息.体态 = '撑伞浮空'
    this.模拟循环.添加buff?.({ 名称: '浮游天地', 对象: '自身' })

    this.浮游实际生效判定()

    this?.模拟循环?.技能类实例集合?.['海运南冥']?.重置调息时间()
    this?.模拟循环?.技能类实例集合?.['溟海御波']?.重置调息时间()
    this?.模拟循环?.技能类实例集合?.['逐波灵游']?.重置调息时间()

    this.获得怒翼判定()

    this.获得抟空判定()

    // 暂时不考虑
    // this.添加自动落地事件()
    this.保存释放记录()
  }

  获得抟空判定() {
    // 驾鸾
    if (this.模拟循环.校验奇穴是否存在('抟空')) {
      this.模拟循环.添加buff?.({ 名称: '抟空', 对象: '自身' })
    }
  }

  浮游实际生效判定() {
    const 待生效事件: 待生效事件[] = []
    // 上天20帧，上天后释放的技能内 timer 2 获得buff
    const 事件时间 = this.模拟循环.当前时间 + 20
    待生效事件.push({
      事件名称: `浮游生效`,
      事件时间: 事件时间,
      事件备注: {},
    })
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  浮游生效() {
    if (this.模拟循环.校验奇穴是否存在('游仙')) {
      this.模拟循环.添加buff?.({ 名称: '游仙', 对象: '自身' })
    } else {
      this.模拟循环.添加buff?.({ 名称: '太息', 对象: '自身' })
    }
    this?.模拟循环?.技能类实例集合?.['翼绝云天']?.自动鸟啄校验?.()
  }

  浮游天地造成伤害() {
    this.触发伤害行为('浮游天地')
  }

  获得怒翼判定() {
    if (this.模拟循环.校验奇穴是否存在('怒翼')) {
      const 待生效事件: 待生效事件[] = []
      const 事件时间 = this.模拟循环.当前时间 + 20
      待生效事件.push({
        事件名称: `浮游怒翼`,
        事件时间: 事件时间,
        事件备注: {},
      })
      this.模拟循环.添加待生效事件队列(待生效事件)
    }
  }

  释放完成获得怒翼() {
    if (this.模拟循环?.技能类实例集合?.振翅图南?.存在振翅图南校验()) {
      this.模拟循环.添加buff?.({ 名称: '怒翼', 对象: '自身' })
    }
  }

  保存释放记录() {
    if (this.模拟循环.校验奇穴是否存在('游仙')) {
      const 造成buff数据 = this.获取施加重要buff信息('游仙')
      this.本次释放记录 = 造成buff数据 ? { 造成buff数据 } : {}
    }
  }
}

export default 浮游天地

export const 浮游天地类型 = typeof 浮游天地
