import { Buff枚举, 循环基础技能数据类型, 日志类型 } from '../simulator/type'
import { 基础GCD帧 } from '.'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 通用Buff数据, 通用循环模拟技能基础数据 } from '../../通用/通用技能/通用技能定义'
import 千枝绽蕊 from '../simulator/技能类/千枝绽蕊'
import 千枝伏藏 from '../simulator/技能类/千枝伏藏'

// 技能图标引入

const 循环模拟技能基础数据: 循环基础技能数据类型[] = [
  ...(通用循环模拟技能基础数据 as any),
  {
    // scripts/skill/北天药宗/北天药宗_商陆其根.lua
    技能名称: '商陆缀寒',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '行忌制方',
    图标: 'https://icon.jx3box.com/icon/15409.png',
  },
  {
    // scripts/skill/北天药宗/北天药宗_钩吻断肠.lua
    技能名称: '钩吻断肠',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '行忌制方',
    图标: 'https://icon.jx3box.com/icon/15406.png',
  },
  {
    // scripts/skill/北天药宗/北天药宗_奚毒射罔.lua
    技能名称: '川乌射罔',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 10,
    是否为倒读条技能: true,
    技能GCD组: '公共',
    技能类型: '行忌制方',
    图标: 'https://icon.jx3box.com/icon/15407.png',
  },
  {
    // scripts/skill/北天药宗/北天药宗_沾衣未妨.lua
    技能名称: '沾衣未妨',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 16,
    技能GCD组: '自身',
    技能类型: '行忌制方',
    图标: 'https://icon.jx3box.com/icon/15408.png',
  },
  //{
  // scripts/skill/北天药宗/北天药宗_沾衣未妨.lua
  //技能名称: '不打苍沾',
  //技能释放后添加GCD: 基础GCD帧 - 8,
  //技能CD: 每秒郭氏帧 * 16,
  //技能GCD组: '自身',
  // 技能类型: '行忌制方',
  // 图标: 'https://icon.jx3box.com/icon/15408.png',
  //},
  //{
  // scripts/skill/北天药宗/北天药宗_凌然天风.lua
  //技能名称: '凌然天风',
  //技能释放后添加GCD: 基础GCD帧,
  //技能CD: 每秒郭氏帧 * 45,
  //技能GCD组: '自身',
  // 技能类型: '凌波飞叶',
  //图标: 'https://icon.jx3box.com/icon/15405.png',
  //},
  {
    // scripts/skill/北天药宗/北天药宗_银光照雪.lua
    技能名称: '银光照雪',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 10,
    技能GCD组: '自身',
    技能类型: '凌波飞叶',
    图标: 'https://icon.jx3box.com/icon/15400.png',
  },
  //{
  // scripts/skill/北天药宗/北天药宗_含锋破月.lua
  //技能名称: '含锋破月',
  //技能释放后添加GCD: 基础GCD帧,
  //技能CD: 每秒郭氏帧 * 20,
  //技能GCD组: '公共',
  //技能类型: '凌波飞叶',
  //图标: 'https://icon.jx3box.com/icon/15403.png',
  //},
  //{
  // scripts/skill/北天药宗/北天药宗_飞叶满襟.lua
  // 技能名称: '飞叶满襟',
  // 技能释放后添加GCD: 基础GCD帧,
  //技能GCD组: '自身',
  //技能类型: '凌波飞叶',
  //图标: 'https://icon.jx3box.com/icon/15404.png',
  //},
  {
    // scripts/skill/北天药宗/北天药宗_棘丛于地.lua
    技能名称: '千枝绽蕊',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 32,
    技能GCD组: '自身',
    技能类型: '神农百草',
    图标: 'https://icon.jx3box.com/icon/16027.png',
  },
  {
    // scripts/skill/北天药宗/北天药宗_棘丛于地.lua
    技能名称: '千枝伏藏',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 3,
    技能GCD组: '自身',
    技能类型: '神农百草',
    图标: 'https://icon.jx3box.com/icon/15417.png',
  },
  {
    // scripts/skill/北天药宗/北天药宗_棘丛于地.lua
    技能名称: '苍棘缚地',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '公共',
    技能类型: '神农百草',
    图标: 'https://icon.jx3box.com/icon/15418.png',
  },
  {
    // scripts/skill/北天药宗/北天药宗_紫叶沉疴.lua
    技能名称: '紫叶沉疴',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 30,
    技能GCD组: '公共',
    技能类型: '神农百草',
    图标: 'https://icon.jx3box.com/icon/15419.png',
  },
  {
    // scripts/skill/北天药宗/北天药宗_停辛伫苦.lua
    技能名称: '香繁饮露',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 32,
    技能GCD组: '自身',
    最大充能层数: 2,
    显示类型: '奇穴技能',
    依赖奇穴名: '香繁饮露',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/19201.png',
  },
  {
    技能名称: '触发橙武',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 50,
    技能GCD组: '自身',
    技能类型: '其他',
    显示类型: '大橙武模拟',
    图标: 'https://icon.jx3box.com/icon/23414.png',
  },
  // {
  //   技能名称: '唤醒',
  //   技能释放后添加GCD: 0,
  //   技能GCD组: '自身',
  //   技能类型: '其他',
  //   图标: 'https://icon.jx3box.com/icon/18440.png',
  // },
  // {
  //   技能名称: '易命',
  //   技能释放后添加GCD: 0,
  //   技能GCD组: '自身',
  //   技能类型: '其他',
  //   图标: 'https://icon.jx3box.com/icon/337.png',
  // },
  // {
  //   技能名称: '损毁',
  //   技能释放后添加GCD: 0,
  //   技能GCD组: '自身',
  //   技能类型: '其他',
  //   图标: 'https://icon.jx3box.com/icon/3452.png',
  // },
  //   {
  //     技能名称: '磁雷外泄',
  //     技能释放后添加GCD: 0,
  //     技能GCD组: '自身',
  //     技能类型: '其他',
  //     图标: 'https://icon.jx3box.com/icon/3448.png',
  //   },
  {
    技能名称: '万灵丹',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 120,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/5344.png',
  },
  {
    技能名称: '换行',
    技能释放后添加GCD: 0,
    技能CD: 0,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/24490.png',
    说明: '插入换行将只以”换行“作为展示换行。 若无"换行"则默认以”苍棘缚地“作为展示换行.',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
  '循环异常',
]

export enum 技能GCD组 {
  公共,
  自身,
  换箭,
}

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  // Buff
  相使: {
    // 28413
    类型: '自身',
    名称: '相使',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 18,
    图标: 'https://icon.jx3box.com/icon/15742.png',
    备注: '内功基础攻击力提高15%，期间自身“商陆缀寒”可以移动施展且运功时间降低0.25秒',
  },
  橙武: {
    类型: '自身',
    名称: '橙武',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/2589.png',
  },
  沾衣未妨: {
    // 28413
    类型: '目标',
    名称: '沾衣未妨',
    最大层数: 1,
    最大持续时间: 65,
    图标: 'https://icon.jx3box.com/icon/15408.png',
    备注: '沾衣未妨造成伤害',
  },
  苍棘缚地: {
    类型: '自身',
    名称: '苍棘缚地',
    最大层数: 1,
    最大持续时间: 172,
    图标: 'https://icon.jx3box.com/icon/15418.png',
    备注: '苍棘缚地存在',
  },
  飞叶满襟: {
    类型: '自身',
    名称: '飞叶满襟',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 8,
    图标: 'https://icon.jx3box.com/icon/15404.png',
    备注: '可施展飞叶满襟',
  },
  苍棘缚地蛰伏: {
    类型: '自身',
    名称: '苍棘缚地蛰伏',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 3 + 1,
    图标: 'https://icon.jx3box.com/icon/15418.png',
    备注: '苍棘缚地蛰伏',
  },
  紫伏: {
    // 20702
    类型: '自身',
    名称: '紫伏',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 16,
    图标: 'https://icon.jx3box.com/icon/15419.png',
    备注: '期间自身每次触发中和效果都会对目标8尺区域的3个目标造成毒性内功伤害。',
  },
  凌然天风: {
    // 22282
    类型: '自身',
    名称: '凌然天风',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 7,
    图标: 'https://icon.jx3box.com/icon/15405.png',
    备注: '凌空而起，期间商瞬发',
  },
  千枝绽蕊: {
    // 22282
    类型: '自身',
    名称: '千枝绽蕊',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/16027.png',
    备注: '每秒消耗5%内力，无方中和对非侠士目标额外触发一次',
  },
  千枝伏藏: {
    // 22282
    类型: '自身',
    名称: '千枝伏藏',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/15417.png',
    备注: '每秒回复1%内力',
  },
  唤醒10: {
    // 32939
    类型: '自身',
    名称: '唤醒10',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/18440.png',
    备注: '唤醒每层增伤2%，10层',
  },
  唤醒20: {
    // 32939
    类型: '自身',
    名称: '唤醒20',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/18440.png',
    备注: '唤醒每层增伤2%，20层',
  },
  唤醒30: {
    // 32939
    类型: '自身',
    名称: '唤醒30',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/18440.png',
    备注: '唤醒每层增伤2%，30层',
  },
  易命: {
    // 32939
    类型: '自身',
    名称: '易命',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/337.png',
    备注: '承此余力，死战不息。自身最大气血、伤害与治疗效能显著提升',
  },
  损毁5: {
    // 32939
    类型: '自身',
    名称: '损毁5',
    最大层数: 5,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/3452.png',
    备注: ' 损毁严重，每层使受到的伤害提高10%，5层',
  },
  损毁20: {
    // 32939
    类型: '自身',
    名称: '损毁20',
    最大层数: 20,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/3452.png',
    备注: ' 损毁严重，每层使受到的伤害提高10%，20层',
  },
  损毁50: {
    // 32939
    类型: '自身',
    名称: '损毁50',
    最大层数: 50,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/3452.png',
    备注: '损毁严重，每层使受到的伤害提高10%，50层',
  },
  //   磁雷外泄20: {
  //     // TODO: 替换为实际 BuffId
  //     类型: '自身',
  //     名称: '磁雷外泄20',
  //     最大层数: 20,
  //     最大持续时间: 99999,
  //     图标: 'https://icon.jx3box.com/icon/3448.png',
  //     备注: '磁雷外泄，20%易伤',
  //   },
  //   磁雷外泄100: {
  //     // TODO: 替换为实际 BuffId
  //     类型: '自身',
  //     名称: '磁雷外泄100',
  //     最大层数: 100,
  //     最大持续时间: 99999,
  //     图标: 'https://icon.jx3box.com/icon/3448.png',
  //     备注: '磁雷外泄，100%易伤',
  //   },
  //   磁雷外泄200: {
  //     // TODO: 替换为实际 BuffId
  //     类型: '自身',
  //     名称: '磁雷外泄200',
  //     最大层数: 200,
  //     最大持续时间: 99999,
  //     图标: 'https://icon.jx3box.com/icon/3448.png',
  //     备注: '磁雷外泄，200%易伤',
  //   },
  //   磁雷外泄1000: {
  //     // TODO: 替换为实际 BuffId
  //     类型: '自身',
  //     名称: '磁雷外泄1000',
  //     最大层数: 1000,
  //     最大持续时间: 99999,
  //     图标: 'https://icon.jx3box.com/icon/3448.png',
  //     备注: '磁雷外泄，1000%易伤',
  //   },
  万灵丹: {
    BuffId: 5344,
    类型: '自身',
    名称: '万灵丹',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/5344.png',
    备注: '立刻回复11%内力，并且在30秒内每秒回复0.5%内力',
  },
  香繁饮露: {
    类型: '自身',
    名称: '香繁饮露',
    最大层数: 2,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/19201.png',
    备注: '移动速度提高25%，并使下次施展“且待时休”运功时间和伤害次数减半，“沾衣未妨”持续2.25秒造成3跳伤害，“川乌射罔”1.69秒内造成3跳伤害。以此法施展的招式，会获得原招式两倍的药性，并且施展后返还70%调息时间，并消耗“香繁饮露”效果。',
  },
  凄骨: {
    类型: '自身',
    名称: '凄骨',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 60,
    图标: 'https://icon.jx3box.com/icon/15745.png',
    备注: '无视目标70%防御等级',
  },
  // DOT
  逆乱: {
    类型: '目标',
    名称: '逆乱',
    最大层数: 8,
    最大作用次数: 8,
    最大持续时间: 每秒郭氏帧 * 16,
    伤害频率: 32,
    图标: 'https://icon.jx3box.com/icon/15406.png',
    备注: '使得每2秒受到95点毒性伤害(+[0.1758*最终混元内功攻击])，持续16秒，可以叠加8层。',
  },
  风特效_切腰坠: {
    类型: '自身',
    名称: '风特效_切腰坠',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/3414.png',
    备注: '起手Buff专用，模拟开风特效腰坠后切其他腰坠进入战斗',
  },
  ...(通用Buff数据 as any),
}
