import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '雨龙',
        奇穴图片: 'https://icon.jx3box.com/icon/4593.png',
        id: '6818',
        奇穴描述: '“灼烧”效果持续时间提高120%，可叠加5层。',
      },
      {
        奇穴名称: '驯致',
        奇穴图片: 'https://icon.jx3box.com/icon/4749.png',
        id: '6824',
        奇穴描述: '“亢龙有悔”伤害提高60%，施展时间缩短，所有伤害分三掌打出。',
      },
      {
        奇穴名称: '亢野',
        奇穴图片: 'https://icon.jx3box.com/icon/7484.png',
        id: '14633',
        奇穴描述:
          '“亢龙有悔”调息时间提高至4秒，向前方一掌打出飞龙气劲，对其经过路径上的5个敌对目标造成伤害，并回复50%内力，施展时内力越高，伤害越高且范围越大。',
      },
      {
        奇穴名称: '复征',
        奇穴图片: 'https://icon.jx3box.com/icon/11305.png',
        id: '40646',
        奇穴描述:
          '施展“醉逍遥”后12秒内下一个“棒打狗头”使目标4秒内无法施展内功和外功招式并附带<SUB 32898 5>外功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '贞固',
        奇穴图片: 'https://icon.jx3box.com/icon/4893.png',
        id: '6822',
        奇穴描述:
          '进入<NounID 6>后7秒内施展“蜀犬吠日”“亢龙有悔”自身不会进入僵直，期间“亢龙有悔”伤害降低30%。',
      },
      {
        奇穴名称: '共醉',
        奇穴图片: 'https://icon.jx3box.com/icon/13388.png',
        id: '43059',
        奇穴描述: '“断江流”调息时间降低17秒，不再附带<NounID 51>效果。',
      },
      {
        奇穴名称: '饮江',
        奇穴图片: 'https://icon.jx3box.com/icon/4591.png',
        id: '42099',
        奇穴描述:
          '“断江流”可在基础调息中施展，<NounID 51>持续期间目标每次受到会心伤害则目标被会心几率额外提高4%，最多叠加20%。',
      },
      {
        奇穴名称: '追远',
        奇穴图片: 'https://icon.jx3box.com/icon/4750.png',
        id: '38878',
        奇穴描述:
          '“拨狗朝天”“横打双獒”命中目标会获得1个破招点数。触发破招伤害时会额外追加<SUB 38891 1>外功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '宽野',
        奇穴图片: 'https://icon.jx3box.com/icon/7259.png',
        id: '15211',
        奇穴描述: '“双龙取水”“龙游天地”“龙腾五岳”额外使目标获得1层<NounID 75>。',
      },
      {
        奇穴名称: '龙醒',
        奇穴图片: 'https://icon.jx3box.com/icon/14091.png',
        id: '44204',
        奇穴描述: '“蛟龙翻江”施展后获得30%伤害吸收盾，持续12秒。',
      },
      {
        奇穴名称: '反截',
        奇穴图片: 'https://icon.jx3box.com/icon/4588.png',
        id: '44205',
        奇穴描述:
          '“恶狗拦路”调息时间降低5秒，封轻功时间提高1秒，“犬牙交错”伤害提高100%，也会使目标侠士获得12秒<NounID 51>。',
      },
      {
        奇穴名称: '越渊',
        奇穴图片: 'https://icon.jx3box.com/icon/4752.png',
        id: '6832',
        奇穴描述:
          '招式对非侠士目标伤害提高13%，自身招式内力消耗降低25%，无视目标50%外功防御，“龙战于野”“龙跃于渊”“蜀犬吠日”只会对4尺外的目标触发冲刺效果，进入<NounID 6>后该效果消失。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '催盏',
        奇穴图片: 'https://icon.jx3box.com/icon/4900.png',
        id: '15212',
        奇穴描述: '<NounID 11>被卸除不会消失，而是转移至被卸除目标30尺内的其他小队成员身上。',
      },
      {
        奇穴名称: '交错',
        奇穴图片: 'https://icon.jx3box.com/icon/13389.png',
        id: '43206',
        奇穴描述: '“拨狗朝天”“横打双獒”会心提高20%，无视目标35%化劲等级。',
      },
      {
        奇穴名称: '知至',
        奇穴图片: 'https://icon.jx3box.com/icon/4895.png',
        id: '6830',
        奇穴描述: '施展“龙啸九天”回复10%气血值，同时击毁攻击范围内最多5个气场和可见机关。',
      },
      {
        奇穴名称: '自强',
        奇穴图片: 'https://icon.jx3box.com/icon/21958.png',
        id: '6845',
        奇穴描述: '“蜀犬吠日”招式伤害提高20%，施展后恢复所有内力。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '敏行',
        奇穴图片: 'https://icon.jx3box.com/icon/24967.png',
        id: '41993',
        奇穴描述:
          '对定身、眩晕、击倒、被击僵直的目标伤害提高15%；<NounID 6>持续时间提高15秒；锁足、眩晕、击倒持续时间增加1秒。<TALENT_CORE 6824 1>',
      },
      {
        奇穴名称: '棒挑',
        奇穴图片: 'https://icon.jx3box.com/icon/19160.png',
        id: '44282',
        奇穴描述:
          '“酩酊大醉”时“酒中仙”调息时间降低3秒；“逍遥状态”持续时间降低10秒。<TALENT_CORE 40646 1>',
      },
      {
        奇穴名称: '潜龙勿用',
        奇穴图片: 'https://icon.jx3box.com/icon/18285.png',
        id: '40331',
        奇穴描述:
          '需要30%以上内力才能施展。终结技，结束时消耗所有内力，对8尺范围5个目标持续造成<SUB 40335 1>外功伤害，该伤害对非侠士目标提高120%，消耗内力越多，持续时间越久。',
      },
      {
        奇穴名称: '苍龙戾天',
        奇穴图片: 'https://icon.jx3box.com/icon/11845.png',
        id: '37385',
        奇穴描述:
          '解除自身僵直状态，腾空跃起，延迟后向目标位置打出一掌，对半径10尺范围3个敌对目标造成<SUB 37397 2>外功伤害，若当前目标被命中则获得15秒<NounID 53>效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '酣饮',
        奇穴图片: 'https://icon.jx3box.com/icon/14094.png',
        id: '44317',
        奇穴描述:
          '“笑醉狂”调息时间提高至75秒，持续时间和免控时间提高至10秒，期间移动将结束运功，每秒对自身半径12尺范围内最多8个友方目标添加6秒<NounID 117>效果。',
      },
      {
        奇穴名称: '祭湘君',
        奇穴图片: 'https://icon.jx3box.com/icon/14095.png',
        id: '25197',
        奇穴描述:
          '在自身位置形成<NounID 73>，每2秒对<NounID 73>内最多5个目标造成<SUB 25201 0>外功伤害，<NounID 73>持续12秒，自身位于<NounID 73>内时将获得<NounID 72>效果。',
      },
      {
        奇穴名称: '御鸿于天',
        奇穴图片: 'https://icon.jx3box.com/icon/7501.png',
        id: '14927',
        奇穴描述:
          '对目标及其周围13尺内5个敌对目标造成<SUB 43085 0>外功伤害，刷新并强化该属于自身的<NounID 11>效果，当前目标每存在1层<NounID 11>使自身获得10秒<NounID 82>效果。<TALENT_CORE 6818 1>',
      },
      {
        奇穴名称: '城复于隍',
        奇穴图片: 'https://icon.jx3box.com/icon/16196.png',
        id: '28989',
        奇穴描述:
          '施展后解除自身施展招式的僵直效果并原地蓄力，片刻后冲向目标对其造成<SKILL_[28952_12;28952_13;28952_14;28952_15] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[28952_12;28952_13;28952_14;28952_15] }>)外功伤害并击退16尺。侠士目标被命中将获得<NounID 74>效果；招式施展期间自身免疫控制。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '饮莫停',
        奇穴图片: 'https://icon.jx3box.com/icon/19161.png',
        id: '6337',
        奇穴描述: '冲向目标，以烈酒攻击对方，攻击结束后目标倒地5秒，起身后获得8秒<NounID 54>效果。',
      },
      {
        奇穴名称: '洪荒',
        奇穴图片: 'https://icon.jx3box.com/icon/4898.png',
        id: '21284',
        奇穴描述: '“亢龙有悔”无视目标30%化劲等级，对4尺外目标施展会附带冲刺效果。',
      },
      {
        奇穴名称: '流形',
        奇穴图片: 'https://icon.jx3box.com/icon/4609.png',
        id: '6833',
        奇穴描述: '每5次连击数使得自身受到伤害降低5%，最多可叠加4层，持续35秒。',
      },
      {
        奇穴名称: '落水打狗',
        奇穴图片: 'https://icon.jx3box.com/icon/4888.png',
        id: '6810',
        奇穴描述:
          '“天下无狗”调息时间提高37秒，不再恢复内力，满醉意下完整蓄力后将清除自身所有“醉意”，但每段“天下无狗”命中目标后会叠加一层<NounID 56>效果。',
      },
      {
        奇穴名称: '御龙',
        奇穴图片: 'https://icon.jx3box.com/icon/4744.png',
        id: '6813',
        奇穴描述: '“断江流”的距离提高至10尺。',
      },
      {
        奇穴名称: '息元',
        奇穴图片: 'https://icon.jx3box.com/icon/11306.png',
        id: '6842',
        奇穴描述:
          '“蛟龙翻江”“双龙取水”“龙游天地”“龙腾五岳”内力消耗降低为10%，<NounID 6>下施展自身僵直时间减少30%。',
      },
      {
        奇穴名称: '烟霞',
        奇穴图片: 'https://icon.jx3box.com/icon/4595.png',
        id: '6834',
        奇穴描述:
          '“烟雨行”施展后使自身移动速度提高30%，持续10秒，期间下两次“打狗棒法”套路下招式命中目标后额外造成<SUB 30300 0>外功伤害。',
      },
      {
        奇穴名称: '酩酊',
        奇穴图片: 'https://icon.jx3box.com/icon/18286.png',
        id: '32725',
        奇穴描述: '施展“酒中仙”额外获得10%内力，并使下一个“亢龙有悔”触发的<NounID 71>伤害提高20%。',
      },
      {
        奇穴名称: '仁德',
        奇穴图片: 'https://icon.jx3box.com/icon/14092.png',
        id: '26701',
        奇穴描述:
          '“蜀犬吠日”不再需要施展目标，抵挡3秒内受到的伤害，若招式没有命中过目标则返还6秒“蜀犬吠日”调息时间。',
      },
      {
        奇穴名称: '留魄',
        奇穴图片: 'https://icon.jx3box.com/icon/17699.png',
        id: '32731',
        奇穴描述:
          '“亢龙有悔”命中拥有“恶狗拦路”不利效果且未被自身击出“心窍”的目标时，会将其“心窍”击出至身后最远12尺位置，“心窍”存在期间目标的所有减伤效果降低20%并每秒受到外功伤害，目标可以靠近并消除“心窍”并受到<SUB 32770 1>伤害，“心窍”存在时间越长，造成的伤害越高，在产生6秒后消除并对目标造成<SUB 32770 6>伤害。',
      },
      {
        奇穴名称: '无咎',
        奇穴图片: 'https://icon.jx3box.com/icon/4600.png',
        id: '14626',
        奇穴描述:
          '“笑醉狂”期间移动速度提高100%，完整运功则额外恢复40%气血值和内力值并卸除所有阴性、阳性、混元性、毒性、点穴、持续伤害不利效果。',
      },
      {
        奇穴名称: '坚冰',
        奇穴图片: 'https://icon.jx3box.com/icon/13393.png',
        id: '26702',
        奇穴描述:
          '每5次连击数将会有“灵隼”对自身前方6尺360度范围最多5个目标造成<SUB 26703 1>外功伤害。',
      },
    ],
  },
]

export default 奇穴数据
