/**
 * @name 心法模块-笑尘诀
 * 模块写入者：唐宋
 */
import type { 心法配置类型 } from '@/心法模块/interface'

import 背景图 from './资源/背景图'
import 默认数据 from './默认数据'
import 加速阈值 from './默认数据/加速阈值'
import 计算循环 from './计算循环'
import 奇穴数据 from './奇穴'
import 技能系数, { 技能增益 } from './技能系数'

const 心法配置: 心法配置类型 = {
  加速阈值,
  名称: '笑尘诀',
  踏天境: () => import('./推荐配装'),
  简写: 'xcj',
  模块负责人: '考拉 唐宋',
  数据提供: '数据：考拉 唐宋；测试：君山PVE教育局',
  所属门派: '丐帮',
  主属性: '力道',
  功法: '外功',
  基础属性: { 基础攻击: 2662 },
  主属性额外加成: { 面板攻击: 573 / 1024, 破防等级: 195 / 1024 },
  基础气血加成: 0,
  奇穴数据: 奇穴数据,
  技能系数: 技能系数,
  技能增益: 技能增益,
  计算循环: 计算循环,
  默认数据: 默认数据,
  覆盖率: { 套装会心会效: 0.7 },
  系统配置: {
    主题色: 'rgb(214, 161, 111)',
    心法图标: 'https://icon.jx3box.com/icon/4610.png',
    背景图: 背景图,
    背景色渐变: `linear-gradient(to right, rgba(0,0,0,0.4) 5%, rgba(214, 161, 111, 0.25) 70%)`,
  },
}

export default 心法配置
