import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import { 按数字生成数组 } from '@/工具函数/help'
import 获取快照增益 from '@/心法模块/统一数据/快照增益'

function 缠绞函数() {
  const 数组 = 按数字生成数组(5)
  const 缠绞增益 = [51, 102, 154, 205, 256]
  return 数组.map((item) => {
    return {
      BuffId: 31520,
      Buff层数: item,
      增益名称: `缠绞·${item}`,
      增益所在位置: '技能',
      增益类型: '部分启用',
      增益集合: [{ 属性: 属性类型.易伤增伤, 值: 缠绞增益[item - 1] / 1024 }],
    } as 技能增益列表类型
  })
}

const 通用增益: 技能增益列表类型[] = [
  ...获取快照增益(),
  ...缠绞函数(),
  {
    // 10698
    增益名称: '非侠',
    增益所在位置: '职业',
    增益启用: true,
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.非侠增伤, 值: 420 / 1024 }],
  },
  {
    BuffId: 31699,
    增益名称: '钤束',
    增益所在位置: '奇穴',
    依赖奇穴: '钤束',
    增益类型: '部分启用',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 154 },
      { 属性: 属性类型.郭氏无双, 值: 307 },
    ],
  },
  {
    BuffId: 31765,
    增益名称: '寡合',
    增益所在位置: '奇穴',
    依赖奇穴: '寡合',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏全无视防御, 值: 614 }],
  },
  {
    BuffId: 31673,
    增益名称: '虚影',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.易伤增伤, 值: 205 / 1024 }],
  },
]

export default 通用增益
