export default {
  装备基础属性: {
    基础攻击: 6205,
    破防等级: 1132,
    无双等级: 4015,
    会心等级: 1231,
    会心效果等级: 208,
    全能等级: 0,
    武器伤害_最小值: 55,
    武器伤害_最大值: 92,
    力道: 17,
    元气: 17,
    身法: 18,
    根骨: 2286,
    体质: 4724,
    基础气血上限: 3956,
    额外气血上限: 0,
    加速等级: 1092,
    装分: 17188,
  },
  装备镶嵌附魔属性: {
    基础攻击: 2622,
    破防等级: 48,
    无双等级: 36,
    会心等级: 60,
    会心效果等级: 0,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    力道: 17,
    元气: 17,
    身法: 18,
    根骨: 54,
    体质: 18,
    基础气血上限: 3956,
    额外气血上限: 0,
    加速等级: 0,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSpiritBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111788,
      装备部位: '帽子',
      装备部位索引: '_1',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111794,
      装备部位: '衣服',
      装备部位索引: '_2',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111770,
      装备部位: '腰带',
      装备部位索引: '_3',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111764,
      装备部位: '护腕',
      装备部位索引: '_4',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111782,
      装备部位: '下装',
      装备部位索引: '_5',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111776,
      装备部位: '鞋子',
      装备部位索引: '_6',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 49748,
      装备部位: '项链',
      装备部位索引: '_7',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atMagicOvercome',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 49754,
      装备部位: '腰坠',
      装备部位索引: '_8',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 49760,
      装备部位: '戒指',
      装备部位索引: '_9',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 49760,
      装备部位: '戒指',
      装备部位索引: '_10',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSpiritBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 46323,
      装备部位: '暗器',
      装备部位索引: '_11',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSpiritBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atMagicAttackPowerBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atMagicCriticalStrike',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 46337,
      装备部位: '武器',
      装备部位索引: '_12',
    },
  ],
  五彩石: '彩·星见·灭气·月华(陆)',
  装备增益: {
    大附魔_伤帽: 0,
    大附魔_伤衣: 0,
    大附魔_伤腰: 0,
    大附魔_伤腕: 0,
    大附魔_伤鞋: 0,
  },
}
