import type { 技能基础数据模型 } from '@/@types/技能'
// import { 计算公式计算类型 } from '@/@types/伤害计算'

const 真实伤害系数: 技能基础数据模型[] = [
  // scripts\Include\NewSkill.luad
  // ====================
  {
    技能ID: '29541',
    技能名称: '逐云寒蕊',
    伤害计算次数: 1,
    真实伤害: 1,
    // 伤害计算类型标记: [计算公式计算类型.真实伤害, 计算公式计算类型.等级减伤, 计算公式计算类型.易伤],
  },
  {
    // 伤腕
    技能ID: '37562',
    技能名称: '昆吾·弦刃',
    真实伤害: 1276500,
  },
  {
    // 伤腕
    技能ID: '37562',
    技能名称: '昆吾·弦刃·英雄',
    真实伤害: 2415000,
  },
  {
    // 伤鞋
    技能ID: '37561',
    技能名称: '刃凌',
    真实伤害: 851000, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
  },
  {
    // 伤鞋
    技能ID: '37561',
    技能名称: '刃凌·英雄',
    真实伤害: 1610000,
  },
  {
    // 试炼之地暗器DOT
    技能ID: '38966',
    技能名称: '无修·玄·1',
    真实伤害: 86500, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
  },
  {
    // 试炼之地暗器DOT
    技能ID: '38966',
    技能名称: '无修·玄·2',
    真实伤害: 90000, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
  },
  {
    // 试炼之地暗器DOT
    技能ID: '38966',
    技能名称: '无修·玄·3',
    真实伤害: 320423, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
  },
  {
    // 试炼之地暗器DOT
    技能ID: '38966',
    技能名称: '无修·玄·4',
    真实伤害: 345600, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
  },
  {
    // 试炼之地暗器DOT
    技能ID: '38966',
    技能名称: '无修·玄·5',
    统计名称: '无修·地·1',
    真实伤害: 475043, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
  },
  {
    // 试炼之地暗器DOT
    技能ID: '38966',
    技能名称: '无修·玄·6',
    统计名称: '无修·地·2',
    真实伤害: 515970, // 雾海寻龙版本改为固定伤害，只吃秋肃和等级减伤
  },
  {
    // 试炼之地暗器DOT
    技能ID: '38966',
    技能名称: '无修·玄·7',
    统计名称: '无修·天·1',
    真实伤害: 898344,
  },
  {
    // 试炼之地暗器DOT
    技能ID: '38966',
    技能名称: '无修·玄·8',
    统计名称: '无修·天·2',
    真实伤害: 976154,
  },
  {
    // 试炼之地暗器DOT
    技能ID: '40789',
    技能名称: '巽·1',
    统计名称: '巽',
    真实伤害: 403200,
  },
  {
    // 试炼之地暗器DOT
    技能ID: '40789',
    技能名称: '巽·2',
    统计名称: '巽',
    真实伤害: 601965,
  },
  {
    // 试炼之地暗器DOT
    技能ID: '40789',
    技能名称: '巽·3',
    统计名称: '巽',
    真实伤害: 1138846,
  },
  {
    // 新副本特效护手DOT
    // 特效_42767
    // 12跳(9232)15跳(19285)17跳(30158)22跳(42057)
    技能ID: '42768',
    技能名称: '速·震',
    真实伤害: 141600,
  },
  {
    // 新副本特效护手DOT
    // 特效_42767
    // 12跳(9232)15跳(19285)17跳(30158)22跳(42057)
    技能ID: '42768',
    技能名称: '速·震·2',
    真实伤害: 268000,
  },
]

export default 真实伤害系数
