import { 配装 } from '../../../components'
import 十人配装 from './数据/10人.json'
import 普通配装 from './数据/25人普通.json'

export default function 推荐配装() {
  return (
    <>
      <h3>五彩石</h3>
      <p>常规：破防·无双·攻击 或 加速·无双·攻击</p>
      <p>进阶：回蓝·破防·攻击</p>
      <h3>附魔</h3>
      <p>头、脚、戒指：攻击 （不推荐加速附魔）</p>
      <p>衣服、腰带：无双（活动兑换）</p>
      <p>手、裤：根骨（综合最优）</p>
      <p>暗器：根骨/加速</p>
      <p>武器：攻击/龙血</p>
      <h3>单体</h3>
      <p>2根骨2攻击，根骨/加速大酒，创意食物-奇穴+攻击，香水破防</p>
      <h3>阵眼</h3>
      <p>T1 和尚、段氏、莫问</p>
      <p>T2 花间、万灵、田螺</p>
      <p>（上面都没有就申请自己开阵）</p>
      <h3>属性收益及配装思路</h3>
      <h4>加速</h4>
      <p>推荐至少3段加速，可根据延迟和计算器推荐上4段或5段加速。</p>
      <h4>属性收益（精简不适用）</h4>
      <p>攻击 ＞ 根骨 ＞ 破防 ＞ 无双（综合）＞ 会心 ＞ 会效</p>
      <h4>推荐10人，25人PT过渡配装</h4>
      <h5>10人</h5>
      <配装 名称='无方10人推荐配装' 视图='配装页面' 缩放={1} 配装数据={十人配装} />
      <h5>25PT</h5>
      <配装 名称='无方25PT推荐配装' 视图='配装页面' 缩放={1} 配装数据={普通配装} />
      <h4>精简分析</h4>
      <p>待更新</p>
    </>
  )
}
