// import 循环主类 from '../main'
import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 业火麟光 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '业火麟光')
  static 回复怒气 = 0

  constructor(模拟循环) {
    super(模拟循环)
    业火麟光.回复怒气 = 65
  }

  释放() {
    this.模拟循环?.技能类实例集合?.盾飞?.减少调息时间?.(25 * 每秒郭氏帧)
    this.模拟循环?.添加buff?.({ 名称: '麟光玄甲', 对象: '自身', 新增层数: 9 })
  }

  触发麟光玄甲伤害() {
    // 检查是否有麟光玄甲BUFF
    const 有麟光玄甲 = this.模拟循环?.当前自身buff列表?.['麟光玄甲']?.当前层数
    const 麟光计数 = this.模拟循环?.当前自身buff列表?.['麟光计数']?.当前层数 || 0

    if (!有麟光玄甲) {
      return
    }

    // 触发麟光玄甲伤害
    this.触发伤害行为('麟光甲寒')
    // this.触发伤害行为('破·麟光')
    // 检查是否有麟黯BUFF，有麟黯时不触发计数
    // const 有麟黯 = this.模拟循环?.当前自身buff列表?.['麟黯']?.当前层数
    // if (有麟黯) {
    //   return
    // }
    this.模拟循环?.卸除buff?.({ 名称: '麟光玄甲', 对象: '自身', 卸除层数: 1 })

    if (麟光计数 < 2) {
      this.模拟循环?.添加buff?.({ 名称: '麟光计数', 对象: '自身', 新增层数: 1 })
    } else {
      this.模拟循环?.卸除buff?.({ 名称: '麟光计数', 对象: '自身', 卸除层数: 2 })
      this.麟光重置苍雪刀()
    }
  }

  麟光重置苍雪刀() {
    // 触发三次后重置苍雪刀技能CD并回复65点怒气
    this.重置苍雪刀调息时间()
    this.模拟循环?.回复怒气?.(65, '业火麟光')
    this.触发伤害行为('业火焚城', 1, [], undefined, false, 2) //分山等级为2，铁骨等级为1
    // 添加麟黯效果，防止再次触发
    // this.模拟循环?.添加buff?.({ 名称: '麟黯', 对象: '自身', 新增层数: 1 })
    // this.模拟循环?.添加buff?.({ 名称: '虚弱', 对象: '目标', 新增层数: 1 })
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武']),
    }
  }
}

export default 业火麟光

export const 业火麟光类型 = typeof 业火麟光
