/**
 * 定义模拟循环类
 */

import {
  ERROR_ACTION,
  根据奇穴修改buff数据,
  根据奇穴秘籍修改技能数据,
  DOT快照Buff列表,
} from './utils'
import {
  技能GCD组,
  技能类实例集合,
  检查运行数据实例类型,
  Buff枚举,
  循环日志数据类型,
  循环基础技能数据类型,
  角色状态信息类型,
  技能释放记录数据,
  待生效事件,
  技能运行数据类型,
} from './type'

import 秀明尘身 from './技能类/秀明尘身'
import 松烟竹雾 from './技能类/松烟竹雾'
import 雪絮金屏 from './技能类/雪絮金屏'
import 上将军印 from './技能类/上将军印'
import 破釜沉舟 from './技能类/破釜沉舟'
import 龙骧虎步 from './技能类/龙骧虎步'
import 雷走风切 from './技能类/雷走风切'
import 西楚悲歌 from './技能类/西楚悲歌'
import 坚壁清野 from './技能类/坚壁清野'
import 刀啸风吟 from './技能类/刀啸风吟'
import 醉斩白蛇 from './技能类/醉斩白蛇'
import 闹须弥 from './技能类/闹须弥'
import 碎江天 from './技能类/碎江天'
import 擒龙六斩 from './技能类/擒龙六斩'
import 四面楚歌 from './技能类/四面楚歌'
import 橙武四面楚歌 from './技能类/橙武四面楚歌'
import 楚河汉界 from './技能类/楚河汉界'
import 烽河 from './技能类/烽河'
import 换行 from './技能类/换行'
import 闹须弥DOT from './DOT类/闹须弥'
import 沉舟DOT from './DOT类/沉舟'
import 触发橙武 from './技能类/触发橙武'
import 点掉叠霜 from './技能类/点掉叠霜'
import { 擒龙连段标记 } from '../constant/skill'
import type { 资源类型, 体态类型 } from './type'
import 获取当前数据 from '@/数据/数据工具/获取当前数据'
import { 获取加速等级, 获取实际帧数 } from '@/工具函数/data'
import 获取技能信息 from '@/数据/数据工具/获取技能等级信息'
import { 团队增益轴类型 } from '@/@types/团队增益'
import { 副本事件实例类型 } from '@/@types/副本事件'
import 判断团队增益快照Buff, { 判断副本事件快照Buff } from '@/数据/团队增益/tools'
import { 起手Buff配置 } from '../../通用/通用框架/类型定义/Buff'
import { 技能额外信息分隔符, 获取起手Buff配置 } from '../../通用/通用函数'
import { 选中秘籍信息 } from '@/@types/秘籍'
import 特效腰坠 from '../../通用/通用技能/特效腰坠'

const { 技能系数 } = 获取当前数据()
const 限制资源值 = (数值: number) => Math.max(0, Math.min(100, Math.round(数值 * 10) / 10))

export interface SimulatorCycleProps {
  测试循环: string[]
  加速值: number
  网络延迟: number
  奇穴: string[]
  秘籍: 选中秘籍信息
  大橙武模拟: boolean
  启用团队增益快照?: boolean
  团队增益轴?: 团队增益轴类型
  副本事件实例列表?: 副本事件实例类型[]
  起手Buff配置?: 起手Buff配置
  起手资源?: Partial<Record<资源类型, number>>
  起手体态?: 体态类型
}

class 循环主类 {
  循环执行结果: '成功' | '异常' = '成功'
  循环异常信息 = { 异常索引: 0, 异常信息: '' }
  测试循环: string[] = []
  奇穴: string[] = []
  秘籍: 选中秘籍信息 = {}
  加速等级 = 0
  加速值 = 0
  网络延迟 = 0
  角色状态信息: 角色状态信息类型 = {
    狂意: 100,
    刀魂: 100,
    气劲: 100,
    体态: '秀明尘身',
  }
  当前自身buff列表: Buff枚举 = {}
  当前目标buff列表: Buff枚举 = {}
  当前时间 = 0
  开始释放上一个技能的时间 = 0
  战斗日志: 循环日志数据类型[] = []
  技能释放记录: 技能释放记录数据[] = []
  Buff和Dot数据: Buff枚举 = {}
  技能基础数据: 循环基础技能数据类型[] = []
  GCD组: 技能GCD组 = { 公共: 0 }
  待生效事件队列: 待生效事件[] = []
  技能类实例集合: 技能类实例集合 = {} as 技能类实例集合
  霜风刀法上次造成伤害时间: number | undefined = undefined
  大橙武模拟 = false
  启用团队增益快照 = false
  团队增益轴: 团队增益轴类型 = {}
  副本事件实例列表: 副本事件实例类型[] = []
  已进入战斗 = false

  // 初始化创建
  constructor(props: SimulatorCycleProps) {
    // 模拟开始后不会变动的数据
    this.测试循环 = props.测试循环
    this.大橙武模拟 = props.大橙武模拟
    this.奇穴 = props.奇穴
    this.秘籍 = props.秘籍
    this.加速等级 = 获取加速等级(props.加速值)
    this.加速值 = props.加速值
    this.网络延迟 = props.网络延迟
    this.Buff和Dot数据 = 根据奇穴修改buff数据(this.奇穴, props.加速值)
    this.技能基础数据 = 根据奇穴秘籍修改技能数据(this.奇穴, this.秘籍)

    this.启用团队增益快照 = !!props.启用团队增益快照
    this.团队增益轴 = props.团队增益轴 ? props.团队增益轴 : {}
    this.副本事件实例列表 = props.副本事件实例列表 ? props.副本事件实例列表 : []
    this.待生效事件队列 = []

    // 模拟初始化
    this.初始化技能实例类()
    this.当前自身buff列表 = { ...获取起手Buff配置(props?.起手Buff配置, this.Buff和Dot数据, '自身') }
    this.当前目标buff列表 = { ...获取起手Buff配置(props?.起手Buff配置, this.Buff和Dot数据, '目标') }
    this.更新碎江天GCD()
    this.角色状态信息 = {
      狂意: 限制资源值(props.起手资源?.狂意 ?? 100),
      刀魂: 限制资源值(props.起手资源?.刀魂 ?? 100),
      气劲: 限制资源值(props.起手资源?.气劲 ?? 100),
      体态: props.起手体态 || '秀明尘身',
    }
    this.重置循环执行结果()
  }

  重置循环执行结果() {
    this.循环执行结果 = '成功'
    this.循环异常信息 = { 异常索引: 0, 异常信息: '' }
  }

  初始化技能实例类() {
    this.技能类实例集合 = {
      秀明尘身: new 秀明尘身(this),
      松烟竹雾: new 松烟竹雾(this),
      雪絮金屏: new 雪絮金屏(this),
      上将军印: new 上将军印(this),
      破釜沉舟: new 破釜沉舟(this),
      龙骧虎步: new 龙骧虎步(this),
      雷走风切: new 雷走风切(this),
      西楚悲歌: new 西楚悲歌(this),
      坚壁清野: new 坚壁清野(this),
      刀啸风吟: new 刀啸风吟(this),
      醉斩白蛇: new 醉斩白蛇(this),
      闹须弥: new 闹须弥(this),
      碎江天: new 碎江天(this),
      擒龙六斩: new 擒龙六斩(this),
      四面楚歌: new 四面楚歌(this),
      橙武四面楚歌: new 橙武四面楚歌(this),
      楚河汉界: new 楚河汉界(this),
      烽河: new 烽河(this),
      换行: new 换行(this),
      '闹须弥(DOT)': new 闹须弥DOT(this),
      '沉舟(DOT)': new 沉舟DOT(this),
      触发橙武: new 触发橙武(this),
      点掉叠霜: new 点掉叠霜(this),
      特效腰坠: new 特效腰坠(this),
    }
  }

  添加buff({ 名称, 对象 = '目标', 事件时间 = this.当前时间, 新增层数 = 1, 来源 = '' }) {
    const 当前层数 =
      对象 === '自身'
        ? this.当前自身buff列表[名称]?.当前层数
        : this.当前目标buff列表[名称]?.当前层数

    const 新buff对象 = {
      ...this.Buff和Dot数据[名称],
      当前层数: Math.min((当前层数 || 0) + 新增层数, this.Buff和Dot数据[名称].最大层数 || 1),
      刷新时间: 事件时间,
    }
    if (新buff对象.当前层数 !== 当前层数 && 新buff对象.当前层数 !== 1) {
      this.添加战斗日志({
        日志: `${名称}层数变为【${新buff对象.当前层数}】 ${来源 ? `—— 来源：【${来源}】` : ''}`,
        日志类型: 对象 === '自身' ? '自身buff变动' : '目标buff变动',
        日志时间: 事件时间,
      })
    } else {
      this.添加战斗日志({
        日志: `${对象}获得${名称} ${来源 ? `—— 来源：【${来源}】` : ''}`,
        日志类型: 对象 === '自身' ? '自身buff变动' : '目标buff变动',
        日志时间: 事件时间,
      })
    }

    if (对象 === '自身') {
      this.当前自身buff列表[名称] = { ...新buff对象 }
      if (名称 === '龙息') this.更新碎江天GCD()
    } else {
      this.当前目标buff列表[名称] = { ...新buff对象 }
    }
  }

  卸除buff({
    名称,
    buff刷新时间,
    对象 = '目标',
    事件时间 = this.当前时间,
    卸除层数 = 1,
    来源 = '',
  }: {
    名称: string
    buff刷新时间?: number
    对象?: '自身' | '目标'
    事件时间?: number
    卸除层数?: number
    来源?: string
  }) {
    const 当前层数 =
      对象 === '自身'
        ? this.当前自身buff列表[名称]?.当前层数
        : this.当前目标buff列表[名称]?.当前层数

    if (当前层数 && 当前层数 >= 0) {
      if (当前层数 - 卸除层数 > 0) {
        this.添加战斗日志({
          日志: `${名称}层数变为【${当前层数 - 卸除层数}】 ${来源 ? `—— 来源：【${来源}】` : ''}`,
          日志类型: 对象 === '自身' ? '自身buff变动' : '目标buff变动',
          日志时间: 事件时间,
        })
        const 新buff对象 = {
          ...this.Buff和Dot数据[名称],
          当前层数: 当前层数 - 卸除层数,
          刷新时间: buff刷新时间 ?? 事件时间,
        }
        if (对象 === '自身') {
          this.当前自身buff列表[名称] = { ...新buff对象 }
        } else {
          this.当前目标buff列表[名称] = { ...新buff对象 }
        }
      } else {
        this.添加战斗日志({
          日志: `${对象}失去${名称} ${来源 ? `—— 来源：【${来源}】` : ''}`,
          日志类型: 对象 === '自身' ? '自身buff变动' : '目标buff变动',
          日志时间: 事件时间,
        })
        if (对象 === '自身') {
          delete this.当前自身buff列表[名称]
          if (名称 === '龙息') this.更新碎江天GCD()
        } else {
          delete this.当前目标buff列表[名称]
        }
      }
    }
  }

  // 校验奇穴是否存在
  校验奇穴是否存在(待判断奇穴) {
    return this?.奇穴?.includes(待判断奇穴)
  }

  待生效事件结算(结算判断时间 = this.当前时间) {
    while (this.待生效事件队列[0]?.事件时间 <= 结算判断时间) {
      const 当前事件 = this.待生效事件队列.shift()!
      this.增加时间(当前事件.事件时间 - this.当前时间)
      this.清空已经消失的buff()
      this.对所有有CD技能检查和充能()
      this.添加战斗日志({
        日志: `事件【${当前事件.事件名称}】触发`,
        日志类型: '技能释放结果',
      })
      if (当前事件.事件名称.includes('技能读条')) {
        this.技能类实例集合[当前事件.事件备注.技能名称].读条伤害()
      } else if (当前事件.事件名称.includes('卸除buff')) {
        this.卸除buff({
          名称: 当前事件.事件备注.buff名称,
          对象: 当前事件.事件备注.buff对象,
          卸除层数: 当前事件.事件备注.卸除层数,
        })
      } else if (当前事件.事件名称 === '临江召唤伤害') {
        this.技能类实例集合.上将军印.召唤伤害(当前事件.事件备注.段数, 当前事件.事件备注.触发见尘)
      } else if (当前事件.事件名称 === '坚壁清野直伤' || 当前事件.事件名称 === '坚壁清野残留') {
        this.技能类实例集合.坚壁清野.延迟伤害(!!当前事件.事件备注.直伤)
      } else if (当前事件.事件名称 === '疏狂刀气' || 当前事件.事件名称 === '疏狂领域刷新') {
        this.技能类实例集合.西楚悲歌.领域生效(!!当前事件.事件备注.刷新增益)
      } else if (当前事件.事件名称 === '擒龙一式转二式') {
        this.技能类实例集合.擒龙六斩.一式转二式()
      } else if (当前事件.事件名称 === '烽河持续伤害') {
        this.技能类实例集合.烽河.造成伤害()
      } else if (当前事件.事件名称 === '资源恢复') {
        const 当前资源 = { 秀明尘身: '狂意', 松烟竹雾: '刀魂', 雪絮金屏: '气劲' }[
          this.角色状态信息.体态
        ]
        ;(['狂意', '刀魂', '气劲'] as const).forEach((资源) => {
          if (资源 !== 当前资源) this.变更资源(资源, 1, '体态恢复')
        })
        this.添加待生效事件队列([{ ...当前事件, 事件时间: this.当前时间 + 16 }])
      }
    }
  }

  开始战斗() {
    if (this.已进入战斗) return
    this.已进入战斗 = true
    this.添加待生效事件队列([{ 事件名称: '资源恢复', 事件时间: this.当前时间 + 16 }])
  }

  添加待生效事件队列(传入数据: 待生效事件[], 事件覆盖 = false) {
    let 新待生效事件队列: 待生效事件[] = []
    // 把原来事件中的同名事件修改时间
    if (事件覆盖) {
      if (this.待生效事件队列?.some((item) => item.事件名称 === 传入数据?.[0]?.事件名称)) {
        新待生效事件队列 = this.待生效事件队列.map((item) => {
          if (item.事件名称 === 传入数据?.[0]?.事件名称) {
            return 传入数据?.[0]
          } else {
            return item
          }
        })
      } else {
        新待生效事件队列 = (this.待生效事件队列 || []).concat(传入数据 || [])
      }
    } else {
      新待生效事件队列 = (this.待生效事件队列 || []).concat(传入数据 || [])
    }
    // 由于不确定待生效事件时间分布，重新排序
    新待生效事件队列.sort((a, b) => {
      return (a?.事件时间 || 0) - (b?.事件时间 || 0)
    })
    this.待生效事件队列 = [...新待生效事件队列]
  }

  删除待生效事件队列(事件名称) {
    const 新待生效事件队列: 待生效事件[] = [...(this.待生效事件队列 || [])].filter(
      (item) => item.事件名称 !== 事件名称,
    )
    // 由于不确定待生效事件时间分布，重新排序
    新待生效事件队列.sort((a, b) => {
      return (a?.事件时间 || 0) - (b?.事件时间 || 0)
    })
    this.待生效事件队列 = [...新待生效事件队列]
  }

  // 按实际套路体态校验
  体态校验(当前技能: 循环基础技能数据类型) {
    if (当前技能?.技能类型 && ['秀明尘身', '松烟竹雾', '雪絮金屏']?.includes(当前技能?.技能类型)) {
      if (this.角色状态信息?.体态 !== 当前技能?.技能类型) {
        return {
          可以释放: false,
          异常信息: ERROR_ACTION.体态错误,
        }
      } else {
        return { 可以释放: true }
      }
    } else {
      return { 可以释放: true }
    }
  }

  // ----------------- 时间、GCD、CD相关算法 start----------------- //
  /**
   *
   * @param 增加时间方法
   * @description 每次增加时间方法都要同步推进GCD
   */
  增加时间(time) {
    if (time > 0) {
      this.跳过全部GCD时间(time)
      this.当前时间 += time
      this.DOT结算与更新()
      this.清空已经消失的buff()
    }
  }

  跳过全部GCD时间(time) {
    // 减少GCD剩余时间
    const 新GCD组: 技能GCD组 = {}
    Object.keys(this.GCD组).map((key) => {
      新GCD组[key] = Math.max((this.GCD组[key] || 0) - time, 0)
    })
    this.GCD组 = { ...新GCD组 }
  }

  更新碎江天GCD() {
    const 碎江天 = this.技能基础数据.find((技能) => 技能.技能名称 === '碎江天')!
    碎江天.技能GCD组 = this.当前自身buff列表.龙息 ? '碎江天' : '公共'
  }

  获取技能GCD组(当前技能: 循环基础技能数据类型) {
    return 当前技能.技能GCD组 === '自身' ? 当前技能.技能名称 : 当前技能.技能GCD组
  }

  技能释放前检查GCD统一方法(当前技能: 循环基础技能数据类型) {
    const 校验GCD组 = this.获取技能GCD组(当前技能)
    if (校验GCD组) {
      // 大部分技能只检查自己的GCD
      const GCD = this.GCD组[校验GCD组]
      // 增加GCD
      return GCD || 0
    }
    return 0
  }

  // 对所有有CD技能检查和充能
  对所有有CD技能检查和充能() {
    Object.keys(this.技能类实例集合).forEach((key) => {
      const 实例 = this.技能类实例集合[key]
      if (实例?.技能运行数据) {
        const 运行数据: 技能运行数据类型 = 实例?.技能运行数据
        const 待充能时间点 = 运行数据?.待充能时间点
        if (待充能时间点?.length) {
          const 新待充能时间点 = 待充能时间点?.filter((item) => item > this.当前时间)
          实例?.更新技能运行数据({ 待充能时间点: 新待充能时间点 })
        }
      }
    })
  }

  技能释放前检查运行数据(当前技能: 循环基础技能数据类型, 技能实例: 检查运行数据实例类型, GCD) {
    let 等待CD时间 = 0
    const 可以释放时间 = this.当前时间 + GCD || 0
    if (技能实例?.技能运行数据) {
      const 待充能时间点 = 技能实例?.技能运行数据?.待充能时间点
      if (待充能时间点?.length >= (当前技能?.最大充能层数 || 1)) {
        const 可释放时间 = 待充能时间点?.[0]
        // 当前没有层数可用，需要等待充能
        if (可释放时间 > 可以释放时间) {
          等待CD时间 = 可释放时间 - 可以释放时间
        }
      }
    }
    return 等待CD时间
  }

  技能释放后更新运行数据(当前技能: 循环基础技能数据类型, 技能实例: 检查运行数据实例类型) {
    if (技能实例?.技能运行数据) {
      const 待充能时间点 = 技能实例?.技能运行数据?.待充能时间点 || []

      const 本次释放充能 =
        (待充能时间点?.[待充能时间点.length - 1] || this.当前时间) + (当前技能?.技能CD || 0)
      const 新待充能时间点 = [...待充能时间点, 本次释放充能]
      技能实例?.更新技能运行数据({
        待充能时间点: 新待充能时间点,
      })
    }
  }

  // ----------------- 时间、GCD、CD相关算法 end----------------- //

  // 添加战斗日志
  添加战斗日志(log: 循环日志数据类型) {
    const { 日志时间 = this.当前时间, ...rest } = log
    this.战斗日志.push({
      日志时间: 日志时间,
      ...rest,
    })
  }

  获取伤害增益列表(来源, 造成时间 = this.当前时间, 技能等级 = 1) {
    const 对应技能 = 技能系数?.find((item) => item.技能名称 === 来源)
    const 技能增益列表 = 获取技能信息(对应技能, 技能等级)?.技能增益列表 || []

    const 有关的buff列表 =
      技能增益列表
        ?.filter((item) => {
          const 当前增益数据 =
            this.当前自身buff列表[item.增益名称] || this.当前目标buff列表[item.增益名称]
          const 增益消失时间 = (当前增益数据?.刷新时间 || 0) + (当前增益数据?.最大持续时间 || 0)
          const 增益获得时间 = 当前增益数据?.刷新时间 || 0
          const 增益仍生效 =
            item.增益名称 === '斩狂枭' ? 造成时间 <= 增益消失时间 : 造成时间 < 增益消失时间
          return !!当前增益数据?.当前层数 && 造成时间 >= 增益获得时间 && 增益仍生效
        })
        ?.map((item) => item.增益名称) || []

    let 总增益列表 = 有关的buff列表

    if (this.启用团队增益快照) {
      const 团队增益buff列表 = this.副本事件实例列表?.length
        ? 判断副本事件快照Buff(this.副本事件实例列表, 造成时间)
        : 判断团队增益快照Buff({
            团队增益轴: this.团队增益轴,
            判定帧: 造成时间,
          })
      if (团队增益buff列表?.length) {
        总增益列表 = 总增益列表?.concat(团队增益buff列表)
      }
    }

    return 总增益列表
  }

  // 造成伤害
  技能造成伤害(
    来源,
    伤害次数 = 1,
    额外增益列表: string[] = [],
    造成时间 = this.当前时间,
    DOT伤害 = false,
    技能等级 = 1,
    伤害层数 = 1,
  ) {
    const 实时增益列表 = this.获取伤害增益列表(来源, 造成时间, 技能等级)
    const 总增益列表 = 实时增益列表
      .filter((增益) => !DOT伤害 || !DOT快照Buff列表.includes(增益))
      .concat(额外增益列表)

    this.添加战斗日志({
      日志: 来源,
      日志类型: '造成伤害',
      日志时间: 造成时间,
      buff列表: 总增益列表 || [],
      其他数据: {
        伤害次数: 伤害次数,
        技能等级: 技能等级,
        伤害层数: 伤害层数,
      },
    })
  }

  变更资源(资源: 资源类型, 数量: number, 来源: string) {
    const 旧值 = this.角色状态信息[资源]
    this.角色状态信息[资源] = 限制资源值(旧值 + 数量)
    if (旧值 !== this.角色状态信息[资源])
      this.添加战斗日志({
        日志: 来源 + '：' + 资源 + ' ' + 旧值 + ' → ' + this.角色状态信息[资源],
        日志类型: '自身buff变动',
      })
  }

  结束斩狂枭() {
    const 增益 = this.当前自身buff列表.斩狂枭
    if (!增益) return
    const 剩余帧 = Math.max(0, (增益.刷新时间 || 0) + (增益.最大持续时间 || 0) - this.当前时间)
    this.变更资源('狂意', Math.floor(剩余帧 * 0.625), '提前结束斩狂枭')
    this.卸除buff({ 名称: '斩狂枭', 对象: '自身' })
  }

  切换角色体态(体态: 体态类型) {
    if (this.角色状态信息.体态 === 体态) return
    this.结束斩狂枭()
    this.卸除buff({ 名称: '龙骧·二段', 对象: '自身' })
    ;[...擒龙连段标记, '龙息'].forEach((名称) => this.卸除buff({ 名称, 对象: '自身', 卸除层数: 6 }))
    this.删除待生效事件队列('擒龙一式转二式')
    this.角色状态信息.体态 = 体态
    this.添加战斗日志({ 日志: '切换体态为【' + 体态 + '】', 日志类型: '自身buff变动' })
  }

  检查GCD(当前技能: 循环基础技能数据类型, 技能实例, i) {
    let GCD = 0
    if (技能实例?.检查GCD) {
      GCD = 技能实例.检查GCD(i, { ...当前技能, 技能GCD组: this.获取技能GCD组(当前技能) })
    } else {
      GCD = this.技能释放前检查GCD统一方法(当前技能)
    }
    return GCD
  }

  // 判断GCD，技能CD等
  技能释放前(当前技能: 循环基础技能数据类型, 技能实例, i) {
    let GCD = 0
    let 等待CD = 0

    // 判断是否为当前箭袋第一个技能
    if (i >= 0) {
      // 判断上一个技能对于本技能是否有GCD限制
      if (当前技能?.技能GCD组) {
        GCD = this.检查GCD(当前技能, 技能实例, i)
      }
      // 判断技能CD，如果存在CD。增加等待时间
      if (当前技能?.技能CD) {
        等待CD = this.技能释放前检查运行数据(当前技能, 技能实例, GCD)
      }
    }
    // 原算法对于读条长度为1个gcd的读条技能未做延迟补偿，实际需要，这里做特判实现
    const 上一个技能释放记录 = this.技能释放记录[this.技能释放记录.length - 1]
    const 上一个技能为刀啸风吟 = 上一个技能释放记录?.技能名称 === '刀啸风吟'
    const 延迟等待 = i > 0 && (GCD || 上一个技能为刀啸风吟) ? this.网络延迟 : 0
    const 技能计划释放时间 = this.当前时间 + GCD + 延迟等待
    return {
      技能计划释放时间: 技能计划释放时间,
      技能预估释放时间: 技能计划释放时间 + 等待CD,
      等待CD,
    }
  }

  技能GCD和CD处理(
    等待CD,
    技能预估释放时间,
    当前技能: 循环基础技能数据类型,
    技能实例: 检查运行数据实例类型,
  ) {
    // 判断在处理完特殊事件以后，剩余的待定时间还有多少
    const 时间差 = 技能预估释放时间 - this.当前时间
    if (时间差 && 时间差 > 0) {
      this.增加时间(时间差)
    }
    if (等待CD) {
      this.添加战斗日志({
        日志: `【${当前技能?.技能名称}】等技能CD【${等待CD}】帧`,
        日志类型: '等CD',
        日志时间: 技能预估释放时间,
      })
    }
    const 待充能时间点 = 技能实例?.技能运行数据?.待充能时间点
    const 新待充能时间点 = 待充能时间点?.filter((item) => item > 技能预估释放时间)
    技能实例?.更新技能运行数据?.({ 待充能时间点: 新待充能时间点 })
  }

  // 增加技能GCD
  增加技能GCD(当前技能: 循环基础技能数据类型) {
    // GCD处理
    if (当前技能?.技能GCD组) {
      const 待更新GCD组 = this.获取技能GCD组(当前技能)
      let 实际添加GCD = 获取实际帧数(当前技能?.技能释放后添加GCD, this.加速值)
      if (
        ['西楚悲歌', '雷走风切'].includes(当前技能.技能名称) ||
        (当前技能.技能名称 === '碎江天' && 待更新GCD组 === '碎江天')
      )
        实际添加GCD = 当前技能.技能释放后添加GCD
      if (当前技能?.最小GCD) {
        实际添加GCD = Math.max(实际添加GCD, 当前技能?.最小GCD)
      }
      if (待更新GCD组) {
        const 新GCD = Math.max((this.GCD组[待更新GCD组] || 0) + 实际添加GCD, 0)
        this.GCD组[待更新GCD组] = 新GCD
      }
    }
  }

  技能成功开始释放(当前技能: 循环基础技能数据类型, 技能实例) {
    this.增加技能GCD(当前技能)
    this.增加技能CD(当前技能, 技能实例)
  }

  // 增加技能CD
  增加技能CD(当前技能: 循环基础技能数据类型, 技能实例) {
    // 技能CD处理
    if (当前技能?.技能CD) {
      if (技能实例?.技能释放后更新运行数据) {
        技能实例.技能释放后更新运行数据?.()
      } else {
        this.技能释放后更新运行数据(当前技能, 技能实例)
      }
    }
  }

  // 判断添加GCD等
  技能释放后(
    当前技能: 循环基础技能数据类型,
    计划释放时间: number,
    开始释放时间: number,
    技能实例,
    是否为读条技能: boolean,
  ) {
    const 技能释放记录结果 = 技能实例?.获取技能释放记录结果?.() || {}
    // 技能释放记录
    this.技能释放记录.push({
      技能名称: 当前技能?.技能名称,
      计划释放时间,
      实际释放时间: 开始释放时间,
      是否为读条技能,
      技能释放记录结果: {
        ...技能释放记录结果,
      },
    })
    if (!['擒龙六斩', '换行', '触发橙武'].includes(当前技能.技能名称)) {
      this.卸除buff({ 名称: '龙息', 对象: '自身' })
    }
  }

  清空buff调用函数(对象: '自身' | '目标') {
    const buff列表 = 对象 === '自身' ? this.当前自身buff列表 : this.当前目标buff列表

    // 更新目标buff
    Object.keys(buff列表).forEach((key) => {
      const buff对象 = buff列表[key]
      const buff应该消失时间 = (buff对象?.刷新时间 || 0) + (buff对象?.最大持续时间 || 0)
      const 消失层数 = buff对象?.自然消失失去层数 || buff对象?.最大层数
      const buff已经到期 =
        key === '斩狂枭' && 对象 === '自身'
          ? buff应该消失时间 < this.当前时间
          : buff应该消失时间 <= this.当前时间
      if (buff已经到期) {
        this.卸除buff({ 名称: key, 对象, 事件时间: buff应该消失时间, 卸除层数: 消失层数 })
      }
    })
  }

  清空已经消失的buff() {
    // 更新目标buff
    this.清空buff调用函数('目标')
    // 更新自身buff
    this.清空buff调用函数('自身')
  }

  // 对当前的DOT进行已过期的结算和剩余时间更新
  DOT结算与更新() {
    this.技能类实例集合['闹须弥(DOT)'].结算闹须弥伤害()
    this.技能类实例集合['沉舟(DOT)'].结算沉舟伤害()
  }

  普通攻击结算() {
    // 霜风刀法从0秒开始，每1.5秒（24帧造成一次伤害）
    const 霜风刀法间隔 = 获取实际帧数(24, this.加速值)
    if (this.霜风刀法上次造成伤害时间 !== undefined) {
      if (this.霜风刀法上次造成伤害时间 + 霜风刀法间隔 <= this.当前时间) {
        const 本次应该造成霜风刀法伤害序列: number[] = [
          this.霜风刀法上次造成伤害时间 + 霜风刀法间隔,
        ]
        while (
          本次应该造成霜风刀法伤害序列?.[本次应该造成霜风刀法伤害序列.length - 1] + 霜风刀法间隔 <=
          this.当前时间
        ) {
          本次应该造成霜风刀法伤害序列.push(
            本次应该造成霜风刀法伤害序列?.[本次应该造成霜风刀法伤害序列.length - 1] + 霜风刀法间隔,
          )
        }
        for (let i = 0; i < 本次应该造成霜风刀法伤害序列.length; i++) {
          // 三种体态的霜风刀法系数一致，这里直接用大刀的
          this.技能造成伤害('霜风刀法·大刀', undefined, undefined, 本次应该造成霜风刀法伤害序列[i])
          if (i === 本次应该造成霜风刀法伤害序列.length - 1) {
            this.霜风刀法上次造成伤害时间 = 本次应该造成霜风刀法伤害序列[i]
          }
        }
      }
    } else {
      this.技能造成伤害('霜风刀法·大刀')
      this.霜风刀法上次造成伤害时间 = 0
    }
  }

  // 模拟轮次开始
  本轮模拟开始前() {
    this.重置循环执行结果()
    this.事件结算()
    this.普通攻击结算()
  }

  事件结算() {
    this.待生效事件结算()
    this.DOT结算与更新()
  }

  // 模拟轮次释放结束
  本轮模拟结束后() {
    // 判断buff列表，清空已经消失的buff
    this.清空已经消失的buff()
    this.对所有有CD技能检查和充能()
  }

  // 技能释放校验
  技能释放校验(技能实例, 当前技能) {
    const 体态校验结果 = this.体态校验(当前技能)
    const 释放判断结果 = 技能实例.释放
      ? 技能实例.释放?.() || { 可以释放: true }
      : { 可以释放: true }
    const 校验结果 = {
      可以释放: 体态校验结果.可以释放 && 释放判断结果.可以释放,
      异常信息: 体态校验结果.异常信息 || 释放判断结果.异常信息,
    }
    if (校验结果.可以释放) {
      this.添加战斗日志?.({
        日志: 当前技能?.技能名称,
        日志类型: '释放技能',
      })
    }
    return 校验结果
  }

  // 技能释放异常
  技能释放异常(校验结果, 当前技能, i) {
    this.添加战斗日志({
      日志: `循环在第${i + 1}个技能${当前技能?.技能名称}异常终止`,
      日志类型: '循环异常',
    })
    this.循环执行结果 = '异常'
    if (校验结果?.异常信息) {
      this.循环异常信息 = {
        异常索引: i + 1,
        异常信息: 校验结果?.异常信息,
      }
    }
  }

  // 模拟函数，一个技能的释放生命周期
  模拟(起始索引 = 0) {
    for (let i = 起始索引; i < this.测试循环.length; i++) {
      this.本轮模拟开始前()
      const [实际技能名称, 附加文本] = this.测试循环[i].split(技能额外信息分隔符)
      if (!实际技能名称) {
        this.本轮模拟结束后()
        continue
      }
      const 当前技能 = this.技能基础数据.find((item) => item.技能名称 === 实际技能名称)
      const 技能实例 = this.技能类实例集合[实际技能名称]
      if (当前技能 && 技能实例) {
        let 额外信息 = null
        if (附加文本) {
          try {
            额外信息 = JSON.parse(附加文本)
          } catch {
            this.技能释放异常({ 异常信息: { 信息: '技能附加参数格式错误' } }, 当前技能, i)
            break
          }
        }
        技能实例.释放前初始化?.(额外信息)
        // 获取预估技能释放时间，处理预估时间前的所有待生效事件，推进时间轴
        const 计划GCD组 = this.获取技能GCD组(当前技能)
        const { 技能计划释放时间, 等待CD, 技能预估释放时间 } = this.技能释放前(
          当前技能,
          技能实例,
          i,
        )
        this.待生效事件结算(技能预估释放时间)
        this.技能GCD和CD处理(等待CD, 技能预估释放时间, 当前技能, 技能实例)
        if (计划GCD组 !== this.获取技能GCD组(当前技能)) {
          // 等待或手动延迟期间龙息可能到期，碎江天重新遵守公共调息。
          const 新释放时间 = this.当前时间 + this.技能释放前检查GCD统一方法(当前技能)
          this.待生效事件结算(新释放时间)
          this.增加时间(新释放时间 - this.当前时间)
        }
        this.清空已经消失的buff()
        const 释放校验结果 = this.技能释放校验(技能实例, 当前技能)
        const 开始释放时间 = this.当前时间
        const 读条时间 = 技能实例.读条时间?.() || 0
        if (释放校验结果.可以释放) {
          this.技能成功开始释放(当前技能, 技能实例)
          技能实例.命中?.()
          技能实例.造成伤害?.(i, this.测试循环)
          // 释放成功后才排入读条，末尾的主动读条也完整结算。
          if (读条时间) {
            技能实例.读条?.(开始释放时间)
            this.待生效事件结算(开始释放时间 + 读条时间)
            this.增加时间(开始释放时间 + 读条时间 - this.当前时间)
          }
          技能实例.释放后?.()
        } else {
          this.技能释放异常(释放校验结果, 当前技能, i)
          break
        }
        this.技能释放后(当前技能, 技能计划释放时间, 开始释放时间, 技能实例, !!读条时间)
      } else {
        this.技能释放异常(
          { 异常信息: { 信息: '尚未实现的技能：' + 实际技能名称 } },
          { 技能名称: 实际技能名称 },
          i,
        )
        break
      }
      this.本轮模拟结束后()
    }
  }

  // 将日志按时间排序
  日志排序() {
    const 新日志 = [...(this.战斗日志 || [])]

    新日志.sort((a, b) => {
      return (a?.日志时间 || 0) - (b?.日志时间 || 0)
    })

    this.战斗日志 = [...(新日志 || [])]
  }

  获取当前各技能的运行状态() {
    const 各技能当前运行状态 = {}

    ;(Object.keys(this.技能类实例集合) || []).forEach((key) => {
      各技能当前运行状态[key] = this.技能类实例集合[key]?.技能运行数据 || {}
    })

    return 各技能当前运行状态
  }

  获取各DOT的运行状态() {
    const DOT运行数据 = {}
    Object.keys(this.技能类实例集合).forEach((key) => {
      if (this.技能类实例集合[key].DOT运行数据) {
        DOT运行数据[key] = this.技能类实例集合[key].DOT运行数据
      }
    })
    return DOT运行数据
  }
}

export default 循环主类

export type 循环主类类型 = typeof 循环主类
