import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 破穴 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '破穴')
  static 本次释放减少冷却 = 0
  static 释放时涣风层数 = 0

  constructor(模拟循环) {
    super(模拟循环)

    //
    破穴.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '破穴')
    破穴.本次释放减少冷却 = 0

    this.初始化技能运行数据()
  }

  命中(_, 分身施展?) {
    破穴.释放时涣风层数 = this.模拟循环.当前目标buff列表?.['涣风']?.当前层数 || 0
    const 是否在经脉循行 = this.模拟循环.技能类实例集合?.经脉循行?.经脉循行状态校验()
    let 神封校验结果 = false

    if (!分身施展) {
      if (是否在经脉循行) {
        const 消耗总额 = this.模拟循环.判断消耗总额()
        神封校验结果 = this.模拟循环.神封校验()

        const 破招倍率 = Math.floor(消耗总额 / 2)
        this.触发伤害行为('破', 1, [], undefined, 破招倍率 + 1)

        this.模拟循环.消耗当前一半能量()
      } else {
        this?.模拟循环?.回复能量(15, '任脉')
        this?.模拟循环?.回复能量(15, '督脉')
      }
    }

    if (!分身施展) {
      if (this.模拟循环.校验奇穴是否存在('一阳来复')) {
        this.模拟循环.添加buff({ 名称: '来复', 对象: '自身' })
      }
    }
    // 8、删除无视防御 30487 BUFF

    this.触发伤害行为?.('破穴', 1)

    // 触发获得蛰微
    if (this.模拟循环.校验奇穴是否存在('蛰微')) {
      this.模拟循环.技能类实例集合?.蛰微?.获得和刷新蛰微?.()
    }
    // 8、删除无视防御 30487 BUFF

    if (神封校验结果) {
      this.模拟循环.神封触发()
    }

    this.模拟循环.技能类实例集合?.经脉循行.经脉循行卸除校验()
    const 释放后有无经脉循行 = this.模拟循环.技能类实例集合?.经脉循行.经脉循行状态校验() ? 1 : 2
    this.模拟循环.卸除buff({ 名称: '涣风', 对象: '目标', 卸除层数: 3 })

    this.保存释放记录(释放后有无经脉循行)
  }

  保存释放记录(段数) {
    this.本次释放记录 = {
      伤害段数: 段数,
      重要buff列表: this.获取当前重要buff列表(['']),
    }

    if (破穴.释放时涣风层数) {
      this.本次释放记录.特殊标记 = 破穴.释放时涣风层数
    }
  }
}

export default 破穴

export const 破穴类型 = typeof 破穴
