import 有CD技能通用类 from '../../../通用类/有CD技能通用类'

class 特效统一类 extends 有CD技能通用类 {
  // 应卦震符触发
  static 奔雷怒啸_作用次数 = 8
  static 崩山重踏_作用次数 = 2
  static 疾风连爪_作用次数 = 4
  // 化卦坠符触发
  static 雷亟_作用次数 = 10
  static 天麟踏星坠_作用次数 = 1

  特效NPC存活判定() {
    return !!this.模拟循环.当前自身buff列表['起符']?.当前层数
  }

  触发快照伤害(伤害名称) {
    this.触发伤害行为(
      伤害名称,
      1,
      this.模拟循环.召唤麒麟快照buff列表,
      this.模拟循环.当前时间,
      1,
      this.模拟循环.召唤麒麟快照buff列表,
    )
  }

  化卦坠符伤害() {
    this.触发快照伤害('化卦坠符')

    // 触发附加伤害
    this.触发子技能伤害('雷亟', 特效统一类.雷亟_作用次数)
    this.触发子技能伤害('天麟踏星坠', 特效统一类.天麟踏星坠_作用次数)
  }

  应卦震符伤害() {
    this.触发快照伤害('应卦震符')

    // 触发附加伤害
    this.触发子技能伤害('奔雷怒啸', 特效统一类.奔雷怒啸_作用次数)
    this.触发子技能伤害('崩山重踏', 特效统一类.崩山重踏_作用次数)
    this.触发子技能伤害('疾风连爪', 特效统一类.疾风连爪_作用次数)
  }

  触发子技能伤害(伤害名称, 伤害次数) {
    for (let i = 1; i <= 伤害次数; i++) {
      this.触发快照伤害(伤害名称)
    }
  }

  释放结束() {
    this.清理快照()
    this.模拟循环.卸除buff({ 名称: '麒麟', 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: '起符', 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: '化卦坠符', 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: '应卦震符', 对象: '自身' })
  }

  清理快照() {
    this.模拟循环.召唤麒麟快照buff列表 = []
  }
}

export default 特效统一类

export const 特效统一类类型 = typeof 特效统一类
