import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '寂灭蛊',
        奇穴图片: 'https://icon.jx3box.com/icon/17710.png',
        id: '32753',
        奇穴描述:
          '施展蛊术链接自身与蛊虫，3秒内每0.5秒对自身与蛊虫6尺范围最多3个敌方玩家造成<SUB 32759 1>伤害，每跳延长目标身上属于自己的持续不利伤害效果1跳，效果结束后会将范围内的敌方目标拉至中心位置。期间自身免疫控制、免疫打断、打退、无法运功、缴械效果，可以施展<NounID 133>。该招式视为“引魂蛊术”套路招式。<TALENT 42902 1 >',
      },
      {
        奇穴名称: '怀泽蛊',
        奇穴图片: 'https://icon.jx3box.com/icon/19189.png',
        id: '34654',
        奇穴描述:
          '为一名敌方玩家施种持续6秒的“怀泽蛊”并附带6秒<NounID 21>效果，若施种目标为治疗心法，则在6秒后激活二段招式“大荒泽域”：持续25秒，每秒使目标叠加一层<NounID 20>效果并对6尺内最多5个敌方玩家目标造成一次毒性内功伤害。该招式视为“引魂蛊术”套路招式。',
      },
      {
        奇穴名称: '连缘蛊',
        奇穴图片: 'https://icon.jx3box.com/icon/14140.png',
        id: '25043',
        奇穴描述:
          '运功每0.312秒对目标造成<SUB 25044 0>毒性内功伤害，持续期间不被打退、打断、不受无法施展内功招式和缴械效果的影响，自身免疫控制，持续1.56秒。目标每存在一个自身持续伤害，则伤害额外提高80%，最多提高320%。每跳降低自身“玄水蛊”1.5秒的调息时间。若完整运功则将额外对目标造成一次基于自身持续伤害数量的伤害。该招式视为“引魂蛊术”套路招式。',
      },
      {
        奇穴名称: '降厄',
        奇穴图片: 'https://icon.jx3box.com/icon/19186.png',
        id: '42174',
        奇穴描述:
          '施展后进入6.5秒<NounID 57>状态，每次触发“虫魄”降低5秒“降厄”调息时间。<TALENT 42211 1 “蝎心”运功时间减少0.75秒，施展距离提高5尺，“毒体”期间施展“蝎心”可延长一秒“毒体”的持续时间，最多延长3次><TALENT 42183 1 “厄难毒体”期间每1.5秒会以自身为中心释放一次8尺范围的毒波，对最多五个目标造成范围伤害，并使其身上所有来源自身的“千劫万毒手”持续效果立即生效一跳><TALENT 44412 1 >',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '残香',
        奇穴图片: 'https://icon.jx3box.com/icon/11894.png',
        id: '38455',
        奇穴描述:
          '“蝎心”伤害提高20%，运功“蝎心”招式命中非侠士目标后使目标身上已有的属于自身“千劫万毒手”套路的持续不利效果立即额外造成一跳伤害，且获得<NounID 76>效果。',
      },
      {
        奇穴名称: '生发',
        奇穴图片: 'https://icon.jx3box.com/icon/3027.png',
        id: '6877',
        奇穴描述: '所有宠物的技能的调息时间降低20%，攻击附带50%减速效果，持续4秒。',
      },
      {
        奇穴名称: '蝎毒',
        奇穴图片: 'https://icon.jx3box.com/icon/2783.png',
        id: '6620',
        奇穴描述:
          '“蝎心”不再运功，不再立刻对目标造成伤害，但使目标每2秒受到一次毒性内功伤害，持续12秒。',
      },
      {
        奇穴名称: '节尾',
        奇穴图片: 'https://icon.jx3box.com/icon/25006.png',
        id: '42211',
        奇穴描述:
          '“蝎心”运功时间减少0.75秒，施展距离提高5尺，“降厄”期间施展“蝎心”可延长一秒“降厄”的持续时间，最多延长3次。<TALENT_CORE 42174 1>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '不鸣',
        奇穴图片: 'https://icon.jx3box.com/icon/2801.png',
        id: '37952',
        奇穴描述:
          '施展“灵蛇引”后的下一个“蝎心”会对目标及周围12尺内4个目标造成<SUB 37959 1>毒性伤害并给其添加“蛇影”“蟾啸”“百足”持续伤害效果，同时自身获得对应“虫魄”。',
      },
      {
        奇穴名称: '毒濛',
        奇穴图片: 'https://icon.jx3box.com/icon/13446.png',
        id: '42902',
        奇穴描述:
          '“寂灭蛊”与“寂灭蛊·蛊虫”命中目标时添加1层<NounID 99>效果，并为其添加“蛇影”至层数上限。<TALENT_CORE 32753 1>',
      },
      {
        奇穴名称: '枯脉',
        奇穴图片: 'https://icon.jx3box.com/icon/27149.png',
        id: '44408',
        奇穴描述:
          '对已有“夺命蛊”的目标重复添加“蛊毒”时，每添加1层“蛊毒”会为其添加5%治疗吸收盾，最大5层，持续8秒。',
      },
      {
        奇穴名称: '疑蟾',
        奇穴图片: 'https://icon.jx3box.com/icon/25009.png',
        id: '42180',
        奇穴描述:
          '通过“蟾啸”触发“虫魄”伤害时，立即额外获得一点对应“虫魄”，“蟾啸”调息时间延长16秒，蛊毒效果变为：无法施展内外功招式持续4.5秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '嗜蛊',
        奇穴图片: 'https://icon.jx3box.com/icon/13442.png',
        id: '30088',
        奇穴描述:
          '施展“灵蛊”后自身获得“嗜蛊”效果，持续40秒。“嗜蛊”效果持续期间自身攻击无视目标60%内功防御等级，基础攻击力提高15%，无双等级提高30%，并且成功运功“蝎心”会对目标6尺内额外5个目标造成<SUB 30090 0>伤害。',
      },
      {
        奇穴名称: '怀荼',
        奇穴图片: 'https://icon.jx3box.com/icon/25004.png',
        id: '42292',
        奇穴描述:
          '“虫魄”伤害降低30%，会对目标5尺范围最多3个目标造成伤害，并为目标添加1层<NounID 123>效果。',
      },
      {
        奇穴名称: '腾影',
        奇穴图片: 'https://icon.jx3box.com/icon/25015.png',
        id: '42309',
        奇穴描述:
          '“蛇影”可以叠加两层，每次被卸除只会卸除一层，“灵蛇”的主动技能替换为“腾影”：扑向20尺内目标并击飞目标6尺范围内的5个目标，对其造成毒性伤害，同时使目标身上属于自身的“蛇影”效果立即生效。',
      },
      {
        奇穴名称: '幻蛊',
        奇穴图片: 'https://icon.jx3box.com/icon/2780.png',
        id: '2218',
        奇穴描述:
          '将目标定身5秒并使其获得2层“灵蛊”效果，目标定身期间受到的所有伤害提高10%。<TALENT 14860 1 命中有“迷心蛊”效果的目标，使定身效果持续时间增加1秒><TALENT 6646 1 被驱散后，目标无法使用轻功，持续时间为被驱散时剩余时间的3倍><TALENT 6647 1 调息时间降低30秒，并使目标定身期间受到的所有伤害提高10%>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '驭虫',
        奇穴图片: 'https://icon.jx3box.com/icon/18316.png',
        id: '32741',
        奇穴描述:
          '使自身蛊虫召唤招式彼此拥有1.5秒公用调息时间，不再触发基础调息时间，蛊虫可以召唤到目标位置。施展“蛊虫献祭”后30秒内的第一次召唤蛊虫招式会使自身获得<NounID 135>。',
      },
      {
        奇穴名称: '荒息',
        奇穴图片: 'https://icon.jx3box.com/icon/2782.png',
        id: '25018',
        奇穴描述:
          '在非战斗状态下施展“灵蛇引”不会获得<NounID 128>和其他奇穴效果，返还招式调息时间。“凤凰蛊”不再附带重伤起身效果，调息时间降低为30秒，对自身施展，使得自身获得持续3分钟的<NounID 90>效果。',
      },
      {
        奇穴名称: '蛊影',
        奇穴图片: 'https://icon.jx3box.com/icon/9564.png',
        id: '18689',
        奇穴描述:
          '“灵蛊”释放后自身免疫控制（击退和被拉除外），受到的伤害降低20%，持续6.5秒，该持续时间可以累加。',
      },
      {
        奇穴名称: '蜿行',
        奇穴图片: 'https://icon.jx3box.com/icon/27144.png',
        id: '44412',
        奇穴描述:
          '“降厄”调息时间提高3秒，期间免疫控制效果（推拉除外），移动速度提高30%。<TALENT_CORE 42174 1>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '蛇悉',
        奇穴图片: 'https://icon.jx3box.com/icon/2812.png',
        id: '21302',
        奇穴描述:
          '“蛇影”变为可移动运功技能，运功1.25秒，调息时间6秒，持续不利效果时间增加4秒，立即对目标造成<SUB 21303 0>毒性伤害，同时使6秒内下两次施展“蝎心”无需运功。',
      },
      {
        奇穴名称: '蟾噬',
        奇穴图片: 'https://icon.jx3box.com/icon/14139.png',
        id: '25027',
        奇穴描述:
          '替换“蟾躁”，施展后“玉蟾”可以对团队成员施展，扑向目标，将其吞入口中保护，期间“玉蟾”不可移动，持续4秒。',
      },
      {
        奇穴名称: '蛊虫狂暴',
        奇穴图片: 'https://icon.jx3box.com/icon/2763.png',
        id: '2227',
        奇穴描述:
          '有宠物时方能施展，移除自身所有控制效果，使自身及小队成员获得<NounID 136>，并使当前宠物恢复全部气血值，气血最大值提高50%，移动速度提高50%，防御等级提高100%，伤害提高50%，持续16秒。自身招式伤害提高10%，加速率提高10%，持续16秒。',
      },
      {
        奇穴名称: '忘攸蛊',
        奇穴图片: 'https://icon.jx3box.com/icon/17215.png',
        id: '30540',
        奇穴描述:
          '五毒侠士为自身添加“忘攸蛊”保护自身，最多可持续8秒，“忘攸蛊”持续时间内自身受到的伤害降低50%，并可施展二段招式“忘攸蛊·迭迷”：将“忘攸蛊”对敌方侠士施展，使其移动速度和加速率降低30%，持续4秒，并为目标添加一层“蛊毒”。4秒后“忘攸蛊”毒性会更强，对敌方侠士施展，会使其移动速度和加速率降低60%，持续4秒，且为目标添加两层“蛊毒”。该招式视为“引魂蛊术”套路招式。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '凄切',
        奇穴图片: 'https://icon.jx3box.com/icon/2755.png',
        id: '6627',
        奇穴描述:
          '宠物招式伤害造成的威胁值提高，宠物攻击目标则自身与宠物恢复5%最大气血值。宠物死亡时回复自身20%最大气血值。',
      },
      {
        奇穴名称: '荒骨',
        奇穴图片: 'https://icon.jx3box.com/icon/17711.png',
        id: '37356',
        奇穴描述: '自身不利效果被卸除时会基于被卸除时的剩余跳数造成额外伤害。',
      },
      {
        奇穴名称: '悸心',
        奇穴图片: 'https://icon.jx3box.com/icon/25013.png',
        id: '42306',
        奇穴描述: '召唤蛊虫时获得一次对应的献祭效果，“蛊虫献祭”不再获得附加效果。',
      },
      {
        奇穴名称: '释灵',
        奇穴图片: 'https://icon.jx3box.com/icon/13445.png',
        id: '37351',
        奇穴描述: '“蝎心”命中带有自身“蛇影”效果的目标时，会额外添加一个8秒的持续性伤害效果。',
      },
      {
        奇穴名称: '薄瘴',
        奇穴图片: 'https://icon.jx3box.com/icon/24430.png',
        id: '42183',
        奇穴描述:
          '“降厄”期间每秒会以自身为中心释放一次8尺范围的毒波，对最多五个侠士目标造成<SUB 42217 0>范围伤害，并使其身上所有来源自身的“千劫万毒手”持续效果立即生效一跳。<TALENT_CORE 42174 1>',
      },
      {
        奇穴名称: '蛛魄',
        奇穴图片: 'https://icon.jx3box.com/icon/3035.png',
        id: '21819',
        奇穴描述:
          '“千丝”调息时间提高7秒，可对目标范围释放，释放后从天而降一个巨大的蜘蛛，并吐出一个半径7尺的蛛网，范围内敌对目标移动速度降低60%，敌对侠士目标受到范围类伤害提高10%，并且无法施展轻功，持续4秒，4秒后蜘蛛自爆，对7尺范围内敌对目标造成<SUB 21821 0>毒性伤害并封轻功4秒。',
      },
      {
        奇穴名称: '随风',
        奇穴图片: 'https://icon.jx3box.com/icon/2813.png',
        id: '6628',
        奇穴描述: '“化蝶”后会向前额外冲刺一段距离。',
      },
      {
        奇穴名称: '令怖',
        奇穴图片: 'https://icon.jx3box.com/icon/25007.png',
        id: '42293',
        奇穴描述:
          '“引魂蛊术”招式命中敌方目标后自身会获得1层“令怖”，最多8层。触发“虫魄”时会消耗所有“令怖”，1.25秒内每0.25秒对目标造成基于层数的额外<NounID 13>毒性伤害，该伤害对非侠士目标提高180%。',
      },
      {
        奇穴名称: '二圣',
        奇穴图片: 'https://icon.jx3box.com/icon/14138.png',
        id: '25038',
        奇穴描述:
          '施展“化蝶”，召唤蝴蝶从自身脚底位置扩散，对20尺范围最多5个目标造成<SUB 25039 0>毒性内功伤害，且刷新目标身上属于自身的持续伤害效果时间。并为目标添加“展缓”不利效果，使其6秒后受到和累计移动距离有关的伤害。',
      },
      {
        奇穴名称: '毒手',
        奇穴图片: 'https://icon.jx3box.com/icon/3034.png',
        id: '6644',
        奇穴描述:
          '“玄水蛊”可以对20尺内的敌方玩家施展，造成<SUB 28717 1>伤害，从自身转移一个减益效果给敌方玩家，并且效果持续期间自身受到的60%伤害将由敌方玩家承担，期间目标气血低于1%或距离超过自身50尺则效果消失。（气血和距离限制不在名剑大会，阵营战场，绝境战场场景生效）',
      },
      {
        奇穴名称: '奇术',
        奇穴图片: 'https://icon.jx3box.com/icon/18313.png',
        id: '32788',
        奇穴描述:
          '5秒内对不同的玩家添加“蛊毒”会将他们连接起来，持续6秒，对被连接的任一目标添加持续伤害效果时，会对所有链接目标造成<SUB 40801 0>伤害并添加该持续伤害效果，同时有25%几率重置自身“百足”招式调息时间。',
      },
      {
        奇穴名称: '不僵',
        奇穴图片: 'https://icon.jx3box.com/icon/17214.png',
        id: '30572',
        奇穴描述:
          '“百足”作用目标增加1个，首跳造成的伤害提高90%，且“百足”持续效果每跳造成的效果衰减8%。',
      },
    ],
  },
]

export default 奇穴数据
