import 技能统一类 from '../../通用类/技能统一类'

class 坚冰 extends 技能统一类 {
  constructor(模拟循环) {
    super(模拟循环)
  }

  获得连击() {
    const 原连击层数 = this.模拟循环.当前自身buff列表.连击?.当前层数 || 0
    this.模拟循环.添加buff({ 名称: '连击', 对象: '自身' })
    if (!原连击层数) {
      this.模拟循环.删除待生效事件队列('连击检查')
      this.登记连击检查()
    }
  }

  登记连击检查() {
    this.模拟循环.添加待生效事件队列([
      {
        事件名称: '连击检查',
        事件时间: this.模拟循环.当前时间 + 4,
      },
    ])
  }

  连击检查() {
    const 连击层数 = this.模拟循环.当前自身buff列表.连击?.当前层数 || 0
    const 触发次数 = Math.floor(连击层数 / 5)
    if (触发次数) {
      this.模拟循环.添加战斗日志({
        日志: `坚冰消耗${触发次数 * 5}层连击，触发${触发次数}次灵隼击`,
        日志类型: '技能释放结果',
      })
      this.模拟循环.卸除buff({ 名称: '连击', 对象: '自身', 卸除层数: 触发次数 * 5 })
      this.触发伤害行为('灵隼击', 触发次数)
    }
    if (this.模拟循环.当前自身buff列表.连击) this.登记连击检查()
  }
}

export default 坚冰
