import { 每秒郭氏帧 } from '@/数据/常量'
import { 获取实际帧数 } from '@/工具函数/data'
import 技能统一类 from '../../通用类/技能统一类'
class 四象轮回 extends 技能统一类 {
  获取读条时间() {
    const 秘籍 = this.模拟循环.秘籍['四象轮回'] || []
    const 减读条 =
      (秘籍.includes('减读条_1') ? 每秒郭氏帧 * 0.25 : 0) +
      (秘籍.includes('减读条_2') ? 每秒郭氏帧 * 0.25 : 0)
    return 获取实际帧数(
      每秒郭氏帧 * 2 - 减读条 - (this.模拟循环.校验奇穴是否存在('心固') ? 每秒郭氏帧 * 0.25 : 0),
      this.模拟循环.加速值,
    )
  }
  读条(开始时间: number) {
    this.模拟循环.添加待生效事件队列([
      {
        事件名称: '技能读条',
        事件时间: 开始时间 + this.获取读条时间(),
        事件备注: { 技能名称: '四象轮回' },
      },
    ])
  }
  读条命中() {
    this.本次释放记录 = { 实际伤害技能: '四象轮回' }
    this.触发伤害行为('四象轮回')
    if (this.模拟循环.大橙武模拟) {
      this.触发伤害行为('四象轮回·神兵', 307 / 1024)
    }
    this.模拟循环.改变气点(this.模拟循环.校验奇穴是否存在('心固') ? 5 : 2, '四象轮回')
    this.模拟循环.技能类实例集合.万世不竭.抱阳续剑()
  }
}
export default 四象轮回
