import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'
import { 获取倒读条实际帧数分布, 获取实际帧数 } from '@/工具函数/data'

class 暴雨梨花针 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '暴雨梨花针')

  static 作用总间隔 = 35
  static 作用间隔帧 = 7

  constructor(模拟循环: any) {
    super(模拟循环)

  }

  释放() {
    // 检查神机值是否足够
    const 当前神机值 = this.模拟循环?.角色状态信息?.神机值 || 100
    const 消耗神机值 = 暴雨梨花针.技能数据!.消耗神机值 ?? 0
    if (当前神机值 < 消耗神机值) {
      return {
        可以释放: false,
        异常信息: {信息:`神机值不足，当前神机值：${当前神机值}，所需神机值：${消耗神机值}`}
      }
    }
    this.模拟循环.神机值变化(暴雨梨花针.技能数据!)
    this.模拟循环.暴雨梨花针次数 = 0
    return { 可以释放: true }
  }

  获取读条时间() {
    return 获取实际帧数(暴雨梨花针.技能数据?.读条时间, this.模拟循环.加速值)
  }

  读条(读条开始时间: number) {
    const 待生效事件队列: 待生效事件[] = []
    const 循环加速值 = this.模拟循环.加速值 || 0
    const 作用分布 = 获取倒读条实际帧数分布(
      暴雨梨花针.作用总间隔,
      暴雨梨花针.作用间隔帧,
      循环加速值,
      0,
      0,
      5
    )
    let 已读条时间 = 0
    for (let i = 0; i < 作用分布.length; i++) {
      待生效事件队列.push({
        事件名称: '技能读条',
        事件时间: 读条开始时间 + 已读条时间 + 作用分布[i],
        事件备注: {
          技能名称: '暴雨梨花针',
          是否为最后一跳: 作用分布.length - 1 === i,
        },
      })
      已读条时间 = 已读条时间 + 作用分布[i]
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
    this.保存释放记录('暴雨梨花针')
  }

  读条命中() {
    this.模拟循环.暴雨梨花针次数!++
    const 天绝存在 = this?.模拟循环?.技能类实例集合?.DOT_天绝地灭?.存在()
    if (天绝存在) {
      this.触发伤害行为('天风汲雨', 1)
    }
    if (this.模拟循环.暴雨梨花针次数 === 5 && 天绝存在) {
      this.模拟循环.添加buff?.({ 名称: '天风汲雨', 对象: '自身' })
      this.模拟循环.暴雨梨花针次数 = 0
    }
    this.模拟循环.添加buff?.({ 名称: '气魄', 对象: '自身' })
    const 化血存在 = this?.模拟循环?.技能类实例集合?.DOT_化血?.存在();
    if (化血存在 && this.模拟循环.校验奇穴是否存在('化血迷心')) {
      this.触发伤害行为('化血迷心', 1)
    }
    if (this.模拟循环.当前自身buff列表?.['碧岚幽炎']?.当前层数) {
      this.触发伤害行为('暴雨梨花针·额外', 2)
    }
    this.触发伤害行为('暴雨梨花针', 1)
  }

  重置调息时间() {
    this.更新技能运行数据({ 待充能时间点: [] })
  }

  保存释放记录(名称: string) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['心无旁骛','扬威','神机好穷内攻增伤','秋风散影','催寒','气魄','弩心','天风汲雨']),
    }
  }
}

export default 暴雨梨花针

export const 暴雨梨花针类型 = typeof 暴雨梨花针
