import { Buff枚举, 循环基础技能数据类型, 日志类型 } from '../simulator/type'
import { 基础GCD帧 } from '.'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 通用Buff数据, 通用循环模拟技能基础数据 } from '../../通用/通用技能/通用技能定义'

// 技能图标引入

const 循环模拟技能基础数据: 循环基础技能数据类型[] = [
  ...(通用循环模拟技能基础数据 as any),
  {
    // scripts/skill/万花\万花_养心决_水月无间.lua
    技能名称: '星楼月影',
    技能释放后添加GCD: 基础GCD帧,
    最大充能层数: 2,
    技能CD: 每秒郭氏帧 * 21,
    技能GCD组: '自身',
    技能类型: '养心诀',
    图标: 'https://icon.jx3box.com/icon/1520.png',
  },
  {
    // scripts/skill/万花\万花_养心决_水月无间.lua
    技能名称: '水月无间',
    技能释放后添加GCD: 基础GCD帧 * 0.5,
    技能CD: 每秒郭氏帧 * 60,
    技能GCD组: '自身',
    技能类型: '养心诀',
    图标: 'https://icon.jx3box.com/icon/1522.png',
  },
  {
    // scripts/skill/万花\万花_点穴截脉_阳明指.lua
    技能名称: '阳明指',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '点穴截脉',
    图标: 'https://icon.jx3box.com/icon/1527.png',
  },
  {
    // scripts/skill/万花\万花_点穴截脉_商阳指.lua
    技能名称: '商阳指',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '点穴截脉',
    图标: 'https://icon.jx3box.com/icon/1514.png',
  },
  {
    // scripts/skill/万花/万花_百花拂穴手_钟林毓秀.lua
    技能名称: '钟林毓秀',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '百花拂穴手',
    图标: 'https://icon.jx3box.com/icon/404.png',
  },
  {
    // scripts/skill/万花/万花_百花拂穴手_兰摧玉折.lua
    技能名称: '兰摧玉折',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 6,
    技能GCD组: '公共',
    技能类型: '百花拂穴手',
    图标: 'https://icon.jx3box.com/icon/390.png',
  },
  {
    // scripts/skill/万花/万花_百花拂穴手_雪舞轻尘.lua
    技能名称: '快雪时晴',
    技能释放后添加GCD: 基础GCD帧,
    是否为倒读条技能: true,
    可中断倒读条最大跳数: 5,
    技能CD: 0,
    技能GCD组: '公共',
    技能类型: '百花拂穴手',
    图标: 'https://icon.jx3box.com/icon/2999.png',
  },
  {
    // scripts/skill/万花/万花_百花拂穴手_芙蓉并蒂.lua
    技能名称: '芙蓉并蒂',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '公共',
    技能类型: '百花拂穴手',
    图标: 'https://icon.jx3box.com/icon/398.png',
  },
  {
    // scripts/skill/万花/万花_百花拂穴手_玉石俱焚.lua
    技能名称: '玉石俱焚',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 13.5, // 吃加速
    技能GCD组: '公共',
    技能类型: '百花拂穴手',
    图标: 'https://icon.jx3box.com/icon/411.png',
  },
  {
    // scripts/skill/万花/万花_养心诀_乱洒青荷.lua
    技能名称: '乱洒青荷',
    技能释放后添加GCD: 基础GCD帧 * 0.5,
    技能CD: 每秒郭氏帧 * 60,
    技能GCD组: '自身',
    技能类型: '百花拂穴手',
    图标: 'https://icon.jx3box.com/icon/3001.png',
  },
  {
    // scripts/skill/万花/90级奇穴/万花_韵海镜源.lua
    技能名称: '墨海临源',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    显示类型: '奇穴技能',
    依赖奇穴名: '墨海临源',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/21978.png',
  },
  {
    技能名称: '触发橙武',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 50,
    技能GCD组: '自身',
    技能类型: '其他',
    显示类型: '大橙武模拟',
    图标: 'https://icon.jx3box.com/icon/2589.png',
  },
  {
    技能名称: '删除丹青',
    技能释放后添加GCD: 0,
    技能GCD组: '自身',
    显示类型: '奇穴技能',
    依赖奇穴名: '丹青',
    图标: 'https://icon.jx3box.com/icon/17187.png',
  },
  {
    技能名称: '换行',
    技能释放后添加GCD: 0,
    技能CD: 0,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/8497.png',
    说明: '插入换行将只以”换行“作为展示换行。 若无"换行"则默认以”玉石俱焚“作为展示换行.',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
  '循环异常',
]

export enum 技能GCD组 {
  公共,
  自身,
  换箭,
}

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  // 1913
  橙武: {
    类型: '自身',
    名称: '橙武',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 4,
    图标: 'https://icon.jx3box.com/icon/2589.png',
    备注: 'BuffId: 1913',
  },
  // 412
  水月无间: {
    类型: '自身',
    名称: '水月无间',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/1522.png',
    备注: '水月无间10秒持续期间，若墨意大于等于20，则获得buff412',
  },
  // 412
  水月瞬发: {
    类型: '自身',
    名称: '水月瞬发',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/1522.png',
    备注: 'BuffId：412。下一伤害或疗伤招式无需运功并消耗20墨意，持续10秒。',
  },
  // 32022
  青歌: {
    类型: '自身',
    名称: '青歌',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 18,
    图标: 'https://icon.jx3box.com/icon/2999.png',
    备注: 'BuffId：32022。自身“商阳指”命中后，15秒内自身基础攻击力提高15%，',
  },
  // 1487
  布散畅和: {
    类型: '自身',
    名称: '布散畅和',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/327.png',
    备注: 'BuffId：1487。招式造成的威胁降低80%，混元内功基础攻击力和基础疗伤成效提高30%',
  },
  // 28279
  流离: {
    类型: '自身',
    名称: '流离',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 90,
    图标: 'https://icon.jx3box.com/icon/3002.png',
    备注: 'BuffId：28279。使下一次“玉石俱焚”命中后恢复20墨意并附带“兰摧玉折”持续伤害效果。每吞噬一个持续伤害效果，调息时间降低1秒。',
  },
  // 24597
  商阳折花: {
    类型: '自身',
    名称: '商阳折花',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 99,
    图标: 'https://icon.jx3box.com/icon/11823.png',
    备注: 'BuffId：24597。使下一次“商阳指”释放时附带“折花”伤害。',
  },
  // 24598
  钟林折花: {
    类型: '自身',
    名称: '钟林折花',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 99,
    图标: 'https://icon.jx3box.com/icon/11823.png',
    备注: 'BuffId：24598。使下一次“钟林毓秀”释放时附带“折花”伤害。',
  },
  // 24596
  兰摧折花: {
    类型: '自身',
    名称: '兰摧折花',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 99,
    图标: 'https://icon.jx3box.com/icon/11823.png',
    备注: 'BuffId：24596。使下一次“兰摧玉折”释放时附带“折花”伤害。',
  },
  // 29544
  焚玉: {
    类型: '自身',
    名称: '焚玉',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/411.png',
    备注: 'BuffId：29544。使自身下次施展持续伤害时附带一次点内功伤害。',
  },
  // 11809
  倚天: {
    类型: '自身',
    名称: '倚天',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 99,
    图标: 'https://icon.jx3box.com/icon/7209.png',
    备注: 'BuffId：11809。内功攻击力提高10%，无视目标65%内功防御等级',
  },
  // 2719
  乱洒青荷: {
    类型: '自身',
    名称: '乱洒青荷',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/3001.png',
    备注: 'BuffId：2719。重置“玉石俱焚”调息时间并使自身10秒内移动速度提高10%，下一个“阳明指”同时附带“兰摧玉折”“钟林毓秀”持续伤害效果，并使该“兰摧玉折”“钟林毓秀”伤害提高20%。',
  },
  // 2719
  渲青青荷: {
    类型: '自身',
    名称: '渲青青荷',
    最大层数: 2,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/3001.png',
    备注: 'BuffId：2719。重置“玉石俱焚”调息时间并使自身10秒内移动速度提高10%，下量个“阳明指”同时附带“兰摧玉折”“钟林毓秀”持续伤害效果，并使该“兰摧玉折”“钟林毓秀”伤害提高20%。',
  },
  // 2719
  青荷: {
    类型: '自身',
    名称: '青荷',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/3001.png',
    备注: 'BuffId：2719。重置“玉石俱焚”调息时间并使自身10秒内移动速度提高10%，下一个“阳明指”同时附带“兰摧玉折”“钟林毓秀”持续伤害效果，并使该“兰摧玉折”“钟林毓秀”伤害提高20%。',
  },
  // 9722
  涓流: {
    类型: '自身',
    名称: '涓流',
    最大层数: 10,
    最大持续时间: 每秒郭氏帧 * 20,
    图标: 'https://icon.jx3box.com/icon/410.png',
    备注: 'BuffId：9722。会心几率提高1.6%，会心效果提高1.6%，叠加10层后重置',
  },
  // 28116
  钟灵: {
    类型: '自身',
    名称: '钟灵',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 18,
    图标: 'https://icon.jx3box.com/icon/4555.png',
    备注: 'BuffId：28116。基础攻击提高20%，无双等级提高20%，招式无视敌方65%内功防御等级',
  },
  // 24538
  钟灵瞬发: {
    类型: '自身',
    名称: '钟灵瞬发',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 99,
    图标: 'https://icon.jx3box.com/icon/4555.png',
    备注: 'BuffId：24538。下一运功招式无需运功且消耗20墨意',
  },
  丹青: {
    类型: '自身',
    名称: '丹青',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 1.5,
    图标: 'https://icon.jx3box.com/icon/17187.png',
    备注: '展示用监控，1.5秒后造成丹青伤害。可叠加涓流',
  },
  故幽: {
    类型: '自身',
    名称: '故幽',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 1.5,
    图标: 'https://icon.jx3box.com/icon/398.png',
    备注: '芙蓉刷新DOT自带15%会心',
  },
  雨墨: {
    类型: '自身',
    名称: '雨墨',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/17187.png',
    备注: '展示用监控，每2秒造成一次雨墨伤害，共3次。不可叠加涓流',
  },
  // DOT
  // DOTID: 666
  DOT_商阳指: {
    类型: '目标',
    名称: '商阳指',
    最大层数: 1,
    最大作用次数: 6,
    最大持续时间: 每秒郭氏帧 * 18,
    伤害频率: 48,
    图标: 'https://icon.jx3box.com/icon/1514.png',
    备注: '商阳指，使得每3秒受到1次伤害',
  },
  // DOTID: 714
  DOT_钟林毓秀: {
    类型: '目标',
    名称: '钟林毓秀',
    最大层数: 1,
    最大作用次数: 6,
    最大持续时间: 每秒郭氏帧 * 18,
    伤害频率: 48,
    图标: 'https://icon.jx3box.com/icon/404.png',
    备注: '钟林毓秀，使得每3秒受到1次伤害',
  },
  // DOTID: 711
  DOT_兰摧玉折: {
    类型: '目标',
    名称: '兰摧玉折',
    最大层数: 1,
    最大作用次数: 6,
    最大持续时间: 每秒郭氏帧 * 18,
    伤害频率: 48,
    图标: 'https://icon.jx3box.com/icon/390.png',
    备注: '兰摧玉折，使得每3秒受到1次伤害',
  },
  ...(通用Buff数据 as any),
}
