import _3段_紫武_渲青_0延迟 from './快速导入默认循环/3段_紫武_渲青_0延迟'
import _3段_紫武_渲青_1延迟 from './快速导入默认循环/3段_紫武_渲青_1延迟'
import _3段_橙武_渲青_0延迟 from './快速导入默认循环/3段_橙武_渲青_0延迟'
import _3段_橙武_渲青_1延迟 from './快速导入默认循环/3段_橙武_渲青_1延迟'
import _4段_橙武_渲青_0延迟 from './快速导入默认循环/4段_橙武_渲青_0延迟'
import _4段_橙武_渲青_1延迟 from './快速导入默认循环/4段_橙武_渲青_1延迟'
import _4段_橙武_活络_0延迟 from './快速导入默认循环/4段_橙武_活络_0延迟'
import _4段_橙武_活络_1延迟 from './快速导入默认循环/4段_橙武_活络_1延迟'

export default [
  _3段_紫武_渲青_0延迟,
  _3段_紫武_渲青_1延迟,
  _3段_橙武_渲青_0延迟,
  _3段_橙武_渲青_1延迟,
  _4段_橙武_渲青_0延迟,
  _4段_橙武_渲青_1延迟,
  _4段_橙武_活络_0延迟,
  _4段_橙武_活络_1延迟,
]
