import { Buff枚举, 循环基础技能数据类型, 日志类型 } from '../simulator/type'
import { 基础GCD帧 } from '.'
import { 每秒郭氏帧 } from '@/数据/常量'
import huanhangIcon from '../assets/Skill/huanhangIcon.svg'
import dunfeiIcon from '../assets/Skill/dunfeiIcon.svg'
import dunhuiIcon from '../assets/Skill/dunhuiIcon.svg'
import dunyachongzhiIcon from '../assets/Skill/dunyachongzhiIcon.png'

import { 通用Buff数据, 通用循环模拟技能基础数据 } from '../../通用/通用技能/通用技能定义'

const 循环模拟技能基础数据: 循环基础技能数据类型[] = [
  ...(通用循环模拟技能基础数据 as any),
  {
    // scripts\skill\苍云\套路及子技能\苍云_云城盾_盾击.lua
    // 盾击检测并触发804和836，只检查不触发16
    技能名称: '盾击',
    最大充能层数: 3,
    技能CD: 每秒郭氏帧 * 4,
    技能释放后添加GCD: 16,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['盾击804', '隐刀836'],
    体态: '擎盾',
    技能类型: '云城盾',
    图标: 'https://icon.jx3box.com/icon/6339.png',
    // 援戈盾击在这里修改 → src\功能模块\基础设置\公用设置\循环模拟\心法循环模拟\分山劲\simulator\utils.ts
  },

  {
    // scripts\skill\苍云\套路及子技能\苍云_云城盾_盾猛.lua
    // 盾猛检测并触发16、804和836
    技能名称: '盾猛',
    技能CD: 每秒郭氏帧 * 15,
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    体态: '擎盾',
    技能类型: '云城盾',
    图标: 'https://icon.jx3box.com/icon/6324.png',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_云城盾_盾压.lua
    // 盾压检测并触发16、804和836
    技能名称: '盾压',
    技能CD: 每秒郭氏帧 * 15,
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    体态: '擎盾',
    技能类型: '云城盾',
    图标: 'https://icon.jx3box.com/icon/6332.png',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_云城盾_盾刀.lua
    // 盾刀检测并触发804和836，只检查不触发16
    // 盾刀二段、盾刀三段检测并触发触发804，只检查不触发16，盾挡检测并触发836，在盾击、盾刀之后接盾挡有0.5秒GCD，但在盾刀二段、三段之后接盾挡没有GCD，这个暂时不知道怎么写
    技能名称: '盾刀',
    技能释放后添加GCD: 16,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['盾击804', '隐刀836'],
    体态: '擎盾',
    技能类型: '云城盾',
    图标: 'https://icon.jx3box.com/icon/6327.png',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_云城盾_断马摧城.lua
    // 断马摧城检测并触发804和836，只检查不触发16
    技能名称: '断马摧城',
    技能CD: 每秒郭氏帧 * 30,
    技能释放后添加GCD: 16,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['盾击804', '隐刀836'],
    体态: '擎盾',
    技能类型: '云城盾',
    显示类型: '奇穴技能',
    图标: 'https://icon.jx3box.com/icon/14087.png',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_苍雪刀_斩刀.lua
    // 斩刀检测并触发16、804和836
    技能名称: '斩刀',
    技能CD: 每秒郭氏帧 * 10,
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    体态: '擎刀',
    技能类型: '苍雪刀',
    图标: 'https://icon.jx3box.com/icon/6318.png',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_苍雪刀_绝刀.lua
    // 绝刀检测并触发16、804和836
    技能名称: '绝刀',
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    体态: '擎刀',
    技能类型: '苍雪刀',
    图标: 'https://icon.jx3box.com/icon/6317.png',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_苍雪刀_劫刀.lua
    // 劫刀检测并触发16、804和836
    技能名称: '劫刀',
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    体态: '擎刀',
    技能类型: '苍雪刀',
    图标: 'https://icon.jx3box.com/icon/6312.png',
  },
  {
    // all_unluac\scripts\skill\苍云\套路及子技能\苍云_苍雪刀_闪刀_unluac.lua
    // 闪刀检测并触发16、804和836
    技能名称: '闪刀',
    技能CD: 每秒郭氏帧 * 8,
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    体态: '擎刀',
    技能类型: '苍雪刀',
    图标: 'https://icon.jx3box.com/icon/6354.png',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_苍雪刀_盾飞.lua
    // 盾飞检测并触发822，另外检测并触发818，暂时没什么用
    技能名称: '盾飞',
    最大充能层数: 3,
    技能CD: 每秒郭氏帧 * 18,
    技能释放后添加GCD: 16, // 不占GCD
    最小GCD: 16, // 保护CD不吃加速
    检测GCD组: ['盾飞822'],
    触发GCD组: ['盾飞822'],
    体态: '擎盾',
    技能类型: '云城盾',
    // 释放依赖体态: ['擎盾'],
    // 图标: 'https://icon.jx3box.com/icon/6344.png',
    图标: dunfeiIcon,
  },
  {
    // all_unluac\scripts\skill\苍云\套路及子技能\苍云_苍雪刀_盾回_unluac.lua
    // 盾回检测并触发822
    技能名称: '盾回',
    技能释放后添加GCD: 16, // 不占GCD
    最小GCD: 16, // 保护CD不吃加速
    检测GCD组: ['盾飞822'],
    触发GCD组: ['盾飞822'],
    体态: '擎刀',
    技能类型: '苍雪刀',
    // 释放依赖体态: ['擎刀'],
    // 图标: 'https://icon.jx3box.com/icon/6699.png',
    图标: dunhuiIcon,
  },
  {
    // all_unluac\scripts\skill\苍云\套路及子技能\苍云_寒铁诀_血怒_unluac.lua
    // 血怒检测并触发815（血怒0.5秒）
    技能名称: '血怒',
    最大充能层数: 3,
    技能CD: 每秒郭氏帧 * 25,
    技能释放后添加GCD: 8, // 不占GCD
    最小GCD: 8, // 保护CD不吃加速
    检测GCD组: ['自身'],
    触发GCD组: ['自身'],
    技能类型: '通用',
    图标: 'https://icon.jx3box.com/icon/6351.png',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_云城盾_盾舞.lua
    // 盾舞检测并触发804和836，只检查不触发16
    技能名称: '盾舞',
    是否为倒读条技能: true,
    可中断倒读条最大跳数: 10,
    技能CD: 每秒郭氏帧 * 8,
    技能释放后添加GCD: 16,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['盾击804', '隐刀836'],
    技能类型: '通用',
    图标: 'https://icon.jx3box.com/icon/6343.png',
  },
  {
    // all_unluac\scripts\skill\苍云\套路及子技能\苍云_云城盾_撼地_unluac.lua
    // 撼地检测并触发16、804和836
    技能名称: '撼地',
    技能CD: 每秒郭氏帧 * 20,
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    技能类型: '通用',
    图标: 'https://icon.jx3box.com/icon/6350.png',
  },
  {
    // 阵云结晦检测并触发16、804和836
    技能名称: '阵云结晦',
    最大充能层数: 2,
    技能CD: 每秒郭氏帧 * 45,
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    技能类型: '通用',
    显示类型: '奇穴技能',
    Buff存在不可释放: ['月照连营可释放标记', '雁门迢递可释放标记'],
    图标: 'https://icon.jx3box.com/icon/17157.png',
  },
  {
    // 月照连营检测并触发16、804和836
    技能名称: '月照连营',
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    技能类型: '通用',
    释放依赖Buff: ['月照连营可释放标记'],
    图标: 'https://icon.jx3box.com/icon/17158.png',
  },
  {
    // 雁门迢递检测并触发16、804和836
    技能名称: '雁门迢递',
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '盾击804', '隐刀836'],
    触发GCD组: ['公共', '盾击804', '隐刀836'],
    技能类型: '通用',
    释放依赖Buff: ['雁门迢递可释放标记'],
    图标: 'https://icon.jx3box.com/icon/17159.png',
  },
  {
    // scripts\skill\苍云\90级奇穴\分山_业火麟光一段.lua
    // 业火麟光检测并触发16
    技能名称: '业火麟光',
    技能CD: 每秒郭氏帧 * 50,
    检测GCD组: ['自身'],
    触发GCD组: ['自身'],
    技能类型: '通用',
    显示类型: '奇穴技能',
    图标: 'https://icon.jx3box.com/icon/19153.png',
  },
  {
    // all_unluac\scripts\skill\苍云\90级奇穴\战绝爆发_unluac.lua
    技能名称: '偃守孤旌',
    技能CD: 每秒郭氏帧 * 40,
    技能释放后添加GCD: 0,
    检测GCD组: ['自身'],
    触发GCD组: ['自身'],
    体态: '擎盾',
    技能类型: '其他',
    显示类型: '奇穴技能',
    图标: 'https://icon.jx3box.com/icon/24944.png',
  },
  // 先做隐藏的铁骨技能，方便攻略组的铁骨兄弟用来排轴
  {
    // scripts\skill\苍云\套路及子技能\苍云_云城盾_盾挡.lua
    // 盾挡检测并触发16和836
    技能名称: '盾挡',
    技能释放后添加GCD: 基础GCD帧,
    检测GCD组: ['公共', '隐刀836'],
    触发GCD组: ['公共', '隐刀836'],
    // 技能类型: '云城盾',
    技能类型: '通用',
    图标: 'https://icon.jx3box.com/icon/6301.png',
    说明: '方便铁骨排轴用的临时技能，无实际效果，藏在肃驾奇穴里',
  },
  {
    // scripts\skill\苍云\套路及子技能\苍云_云城盾_寒啸千军.lua
    // 业火麟光检测并触发16
    技能名称: '寒啸千军',
    技能CD: 每秒郭氏帧 * 30,
    技能释放后添加GCD: 基础GCD帧,
    触发GCD组: ['公共'],
    检测GCD组: ['公共'],
    技能类型: '通用',
    // 显示类型: '奇穴技能',
    图标: 'https://icon.jx3box.com/icon/7514.png',
    说明: '方便铁骨排轴用的临时技能，无实际效果，藏在肃驾奇穴里',
  },
  {
    技能名称: '触发橙武',
    技能释放后添加GCD: 0,
    造成伤害次数: 0,
    技能CD: 每秒郭氏帧 * 50,
    技能类型: '其他',
    检测GCD组: ['自身'],
    触发GCD组: ['自身'],
    显示类型: '大橙武模拟',
    图标: 'https://icon.jx3box.com/icon/23384.png',
  },
  {
    技能名称: '重置盾压',
    技能释放后添加GCD: 0,
    技能CD: 0,
    造成伤害次数: 0,
    技能类型: '其他',
    图标: dunyachongzhiIcon,
    说明: '重置盾压',
  },
  {
    技能名称: '换行',
    技能释放后添加GCD: 0,
    技能CD: 0,
    造成伤害次数: 0,
    技能类型: '其他',
    图标: huanhangIcon,
    说明: '插入换行将只以”换行“作为展示换行。 若无"换行"则默认以”盾回“作为展示换行.',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
]

export enum 技能GCD组 {
  公共,
  自身,
}

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  // 目标BUFF
  虚弱: {
    类型: '目标',
    名称: '虚弱',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 24,
    图标: 'https://icon.jx3box.com/icon/6347.png',
  },
  // 自身BUFF
  嗜血: {
    类型: '自身',
    名称: '嗜血',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 12,
    图标: 'https://icon.jx3box.com/icon/6288.png',
  },
  狂绝: {
    类型: '自身',
    名称: '狂绝',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/6317.png',
  },
  援戈: {
    类型: '自身',
    名称: '援戈',
    最大层数: 12,
    最大持续时间: 每秒郭氏帧 * 60,
    图标: 'https://icon.jx3box.com/icon/20064.png',
  },
  麟光玄甲: {
    类型: '自身',
    名称: '麟光玄甲', // 麟光甲
    最大层数: 9,
    最大持续时间: 每秒郭氏帧 * 25,
    图标: 'https://icon.jx3box.com/icon/19154.png',
  },
  // 麟黯: {
  //   类型: '自身',
  //   名称: '麟黯',
  //   最大层数: 1,
  //   最大持续时间: 每秒郭氏帧 * 14,
  //   图标: 'https://icon.jx3box.com/icon/19154.png',
  // },
  血怒: {
    类型: '自身',
    名称: '血怒',
    最大层数: 3,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/6351.png',
  },
  血怒_惊涌: {
    类型: '自身',
    名称: '血怒_惊涌',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/6351.png',
  },
  橙武: {
    类型: '自身',
    名称: '橙武',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 4,
    图标: 'https://icon.jx3box.com/icon/23384.png',
  },
  盾飞: {
    类型: '目标',
    名称: '盾飞',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/6344.png',
  },
  锋鸣: {
    类型: '自身',
    名称: '锋鸣',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/6326.png',
  },
  陷阵: {
    类型: '自身',
    名称: '陷阵',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/6297.png',
  },
  战绝: {
    类型: '自身',
    名称: '战绝',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 9,
    图标: 'https://icon.jx3box.com/icon/17697.png',
  },
  // 先做隐藏的铁骨技能，方便攻略组的铁骨兄弟用来排轴
  盾挡: {
    类型: '自身',
    名称: '盾挡',
    最大层数: 20,
    最大持续时间: 每秒郭氏帧 * 11,
    图标: 'https://icon.jx3box.com/icon/6301.png',
  },
  振奋: {
    类型: '自身',
    名称: '振奋',
    最大层数: 100,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/6436.png',
  },
  寒啸千军: {
    类型: '自身',
    名称: '寒啸千军',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/7514.png',
  },
  // 严阵: {
  //   类型: '自身',
  //   名称: '严阵',
  //   最大层数: 3,
  //   最大持续时间: 每秒郭氏帧 * 20,
  //   图标: 'https://icon.jx3box.com/icon/6332.png',
  // },
  //辅助用的隐藏BUFF
  阵云结晦充能: {
    类型: '自身',
    名称: '阵云结晦充能',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 45,
    图标: 'https://icon.jx3box.com/icon/17157.png',
  },
  月照连营可释放标记: {
    类型: '自身',
    名称: '可释放月照连营',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 45,
    图标: 'https://icon.jx3box.com/icon/17158.png',
  },
  雁门迢递可释放标记: {
    类型: '自身',
    名称: '可释放雁门迢递',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 45,
    图标: 'https://icon.jx3box.com/icon/17159.png',
  },
  以血盟誓: {
    类型: '目标',
    名称: '以血盟誓',
    最大层数: 2,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/18272.png',
  },
  //隐藏BUFF
  盾刀标记: {
    类型: '自身',
    名称: '盾刀标记',
    最大层数: 2,
    最大持续时间: 每秒郭氏帧 * 4,
    图标: 'https://img.jx3box.com/image/common/nullicon.png',
  },
  盾击标记: {
    类型: '自身',
    名称: '盾击标记',
    最大层数: 3,
    最大持续时间: 每秒郭氏帧 * 2,
    图标: 'https://img.jx3box.com/image/common/nullicon.png',
  },
  麟光计数: {
    类型: '自身',
    名称: '麟光计数',
    最大层数: 3,
    最大持续时间: 每秒郭氏帧 * 14,
    图标: 'https://icon.jx3box.com/icon/19154.png',
  },
  血怒连按标记: {
    类型: '自身',
    名称: '血怒连按标记',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 2,
    图标: 'https://img.jx3box.com/image/common/nullicon.png',
  },
  // DOT
  流血: {
    类型: '目标',
    名称: '流血',
    最大层数: 1,
    最大作用次数: 13,
    最大持续时间: 每秒郭氏帧 * 26,
    伤害频率: 每秒郭氏帧 * 2,
    图标: 'https://icon.jx3box.com/icon/6323.png',
  },

  ...(通用Buff数据 as any),
}
