// import 循环模拟技能基础数据 from '../../../constant/skill'
// import 有CD技能通用类 from '../../通用类/有CD技能通用类'
//
// class 磁雷外泄 extends 有CD技能通用类 {
//   static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '磁雷外泄')
//
//   constructor(模拟循环) {
//     super(模拟循环)
//   }
//
//   释放() {
//     const 有磁雷外泄20 = !!this?.模拟循环?.当前自身buff列表?.['磁雷外泄20']
//     const 有磁雷外泄100 = !!this?.模拟循环?.当前自身buff列表?.['磁雷外泄100']
//     const 有磁雷外泄200 = !!this?.模拟循环?.当前自身buff列表?.['磁雷外泄200']
//     const 有磁雷外泄1000 = !!this?.模拟循环?.当前自身buff列表?.['磁雷外泄1000']
//
//     if (!有磁雷外泄20 && !有磁雷外泄100 && !有磁雷外泄200 && !有磁雷外泄1000) {
//       this.模拟循环.添加buff?.({ 名称: '磁雷外泄20', 对象: '自身', 新增层数: 1 })
//     } else if (有磁雷外泄20) {
//       this.模拟循环.卸除buff({ 名称: '磁雷外泄20', 对象: '自身', 卸除层数: 1 })
//       this.模拟循环.添加buff?.({ 名称: '磁雷外泄100', 对象: '自身', 新增层数: 1 })
//     } else if (有磁雷外泄100) {
//       this.模拟循环.卸除buff({ 名称: '磁雷外泄100', 对象: '自身', 卸除层数: 1 })
//       this.模拟循环.添加buff?.({ 名称: '磁雷外泄200', 对象: '自身', 新增层数: 1 })
//     } else if (有磁雷外泄200) {
//       this.模拟循环.卸除buff({ 名称: '磁雷外泄200', 对象: '自身', 卸除层数: 1 })
//       this.模拟循环.添加buff?.({ 名称: '磁雷外泄1000', 对象: '自身', 新增层数: 1 })
//     } else if (有磁雷外泄1000) {
//       this.模拟循环.卸除buff({ 名称: '磁雷外泄1000', 对象: '自身', 卸除层数: 1 })
//     }
//
//     return
//   }
// }
//
// export default 磁雷外泄
//
// export const 磁雷外泄类型 = typeof 磁雷外泄
