import type { 技能基础数据模型 } from '@/@types/技能'
import { 获取破招实际系数 } from '../../统一数据/系数计算'

import 通用增益 from './技能增益/通用增益/通用增益'
import 判官笔法增益 from './技能增益/判官笔法'
import 快雪时晴增益 from './技能增益/快雪时晴'
import 阳明指增益 from './技能增益/阳明指'
import 商阳指增益 from './技能增益/商阳指'
import 兰摧玉折增益 from './技能增益/兰摧玉折'
import 芙蓉并蒂增益 from './技能增益/芙蓉并蒂'
import 钟林毓秀增益 from './技能增益/钟林毓秀'
import 故幽增益 from './技能增益/故幽'
import 玉石俱焚增益 from './技能增益/玉石俱焚'
import 临源增益 from './技能增益/临源'
import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'

const 兰摧玉折基础数据: Partial<技能基础数据模型> = {
  统计名称: '兰摧玉折(DOT)',
  秘籍依赖技能: '兰摧玉折',
  DOT生效间隔: 48,
  DOT跳数: 6, // 基础6跳，秘籍+1跳，系数按6算
  基础伤害_基础值: 30,
  技能伤害系数: 802.1777696150126,
  技能增益列表: 兰摧玉折增益,
}

const 钟林毓秀基础数据: Partial<技能基础数据模型> = {
  统计名称: '钟林毓秀(DOT)',
  秘籍依赖技能: '钟林毓秀',
  DOT生效间隔: 48,
  DOT跳数: 6, // 基础6跳，秘籍+1跳，系数按6算
  基础伤害_基础值: 38,
  技能伤害系数: 696.6126565958272,
  技能增益列表: 钟林毓秀增益,
}

const 商阳指基础数据: Partial<技能基础数据模型> = {
  统计名称: '商阳指(DOT)',
  秘籍依赖技能: '商阳指',
  DOT生效间隔: 48,
  DOT跳数: 6, // 基础6跳，秘籍+1跳，系数按6算
  基础伤害_基础值: 50,
  技能伤害系数: 640.8836440681611,
  技能增益列表: 商阳指增益,
}

// const 旧万花DOT数据下版本删除 = [
//   {
//     技能名称: '兰摧玉折(DOT)·阳明', // 阳明 兰摧玉折 dotID 711 触发ID 13848
//     ...兰摧玉折基础数据,
//   },
//   {
//     技能名称: '兰摧玉折(DOT)·吞海', // 711_18730_601
//     ...兰摧玉折基础数据,
//   },
//   {
//     技能名称: '兰摧玉折(DOT)·阳明吞海', // 711_13848_601
//     ...兰摧玉折基础数据,
//   },
//   {
//     技能名称: '兰摧玉折(DOT)·乱洒吞海', // 711_39906_601
//     ...兰摧玉折基础数据,
//     // 技能伤害系数: 882.395546576514,
//     技能伤害系数: 962.613323538015,
//   },
//   {
//     技能名称: '兰摧玉折(DOT)·玉石',
//     ...兰摧玉折基础数据,
//   },
//   {
//     技能名称: '钟林毓秀(DOT)·阳明', // 阳明 钟林毓秀 dotID 714 触发ID 13847
//     ...钟林毓秀基础数据,
//   },
//   {
//     技能名称: '钟林毓秀(DOT)·吞海', // 714_285_601
//     ...钟林毓秀基础数据,
//   },
//   {
//     技能名称: '钟林毓秀(DOT)·阳明吞海', // 714_3847_601
//     ...钟林毓秀基础数据,
//   },
//   {
//     技能名称: '钟林毓秀(DOT)·乱洒吞海', // 714_39907_601
//     ...钟林毓秀基础数据,
//     技能伤害系数: 835.9351879149925,
//   },
//   {
//     技能名称: '钟林毓秀(DOT)·玉石',
//     ...钟林毓秀基础数据,
//   },
//   {
//     技能名称: '钟林毓秀(DOT)·橙武', // 乱洒阳明 钟林毓秀 dotID 714 触发ID 3086
//     ...钟林毓秀基础数据,
//   },
//   {
//     技能名称: '商阳指(DOT)·阳明', // 乱洒阳明 商阳指 dotID 666 触发ID 13849
//     ...商阳指基础数据,
//   },
//   {
//     技能名称: '商阳指(DOT)·吞海', // 666_180_601
//     ...商阳指基础数据,
//   },
//   {
//     技能名称: '商阳指(DOT)·玉石', // 666_6126
//     ...商阳指基础数据,
//   },
//   /**
//    * 芙蓉相关
//    */
//   {
//     技能名称: '兰摧玉折(DOT)·芙蓉玉石',
//     ...兰摧玉折基础数据,
//     技能增益列表: [...通用增益, ...故幽增益],
//   },
//   {
//     技能名称: '钟林毓秀(DOT)·芙蓉玉石',
//     ...钟林毓秀基础数据,
//     技能增益列表: [...钟林毓秀增益, ...故幽增益],
//   },
//   {
//     技能名称: '商阳指(DOT)·芙蓉玉石',
//     ...商阳指基础数据,
//     技能增益列表: [...通用增益, ...故幽增益],
//   },
//   // 快雪
//   {
//     技能名称: '快雪时晴(DOT)', // 快雪dot dotID 24158 触发ID 32481
//     统计名称: '快雪时晴(DOT)',
//     DOT生效间隔: 64,
//     DOT跳数: 7,
//     技能伤害系数: 50.748882291843756,
//     基础伤害_基础值: 38,
//     技能增益列表: [...通用增益, ...故幽增益],
//   },
//   {
//     技能名称: '快雪时晴(DOT)·芙蓉', // 快雪dot dotID 24158 触发ID 32409
//     统计名称: '快雪时晴(DOT)',
//     DOT生效间隔: 64,
//     DOT跳数: 7,
//     技能伤害系数: 50.748882291843756,
//     基础伤害_基础值: 38,
//     技能增益列表: [...通用增益, ...故幽增益],
//   },
//   {
//     技能名称: '钟林毓秀(DOT)·乱洒', // 714_39907
//     ...钟林毓秀基础数据,
//     技能伤害系数: 835.9351879149925,
//   },
//   // --------------
// ]

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '16',
    技能名称: '判官笔法',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 判官笔法增益,
  },
  {
    技能ID: '32467',
    技能名称: '破',
    统计名称: '破',
    技能伤害系数: 获取破招实际系数(-472674.21618175996),
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 获取破招实际系数(-472674.21618175996) },
      2: { 技能伤害系数: 获取破招实际系数(-472674.21618175996) },
      3: { 技能伤害系数: 获取破招实际系数(-472674.21618175996) },
      4: { 技能伤害系数: 获取破招实际系数(-472674.21618175996) },
      5: { 技能伤害系数: 获取破招实际系数(-472674.21618175996) },
      6: { 技能伤害系数: 获取破招实际系数(-472674.21618175996) },
      7: { 技能伤害系数: 获取破招实际系数(-472674.21618175996) },
      8: { 技能伤害系数: 获取破招实际系数(708412.4930048) },
      9: { 技能伤害系数: 获取破招实际系数(122749.66200320027) },
    },
  },
  {
    技能ID: '182',
    技能名称: '玉石俱焚',
    技能伤害系数: 73.6,
    基础伤害_基础值: 81,
    基础伤害_浮动值: 10,
    技能增益列表: 玉石俱焚增益,
  },
  {
    技能ID: '186',
    技能名称: '芙蓉并蒂',
    技能伤害系数: 261.28,
    基础伤害_基础值: 76,
    基础伤害_浮动值: 5,
    技能增益列表: [...芙蓉并蒂增益, ...故幽增益],
  },
  {
    技能ID: '6693',
    技能名称: '商阳指',
    技能伤害系数: 294,
    基础伤害_基础值: 20,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '14941',
    技能名称: '阳明指',
    技能伤害系数: 509,
    基础伤害_基础值: 155,
    基础伤害_浮动值: 28,
    技能增益列表: 阳明指增益,
  },
  {
    技能ID: '25768',
    技能名称: '兰摧玉折·神兵',
    技能伤害系数: 100,
    基础伤害_基础值: 0,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32501',
    技能名称: '折花',
    统计名称: '折花',
    技能伤害系数: 349.59999999999997,
    基础伤害_基础值: 155,
    基础伤害_浮动值: 28,
    技能增益列表: 通用增益,
    技能等级数据: {
      4: { 技能伤害系数: 334 },
    },
  },
  {
    技能ID: '6233',
    技能名称: '快雪时晴',
    统计名称: '快雪时晴',
    秘籍依赖技能: '快雪时晴',
    技能伤害系数: 222.3203598,
    基础伤害_基础值: 65,
    基础伤害_浮动值: 10,
    技能增益列表: 快雪时晴增益,
  },
  {
    技能ID: '37270',
    技能名称: '墨海·一', // 37270/1
    统计名称: '墨海',
    技能伤害系数: 1851.3000000000004,
    基础伤害_基础值: 34,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '37270',
    技能名称: '墨海·二', // 37270/3
    统计名称: '墨海',
    技能伤害系数: 555.3900000000001,
    基础伤害_基础值: 34,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '37270',
    技能名称: '临源·一', // 37270/2
    统计名称: '临源',
    技能伤害系数: 2855.3579999999993,
    基础伤害_基础值: 34,
    基础伤害_浮动值: 5,
    技能增益列表: 临源增益,
  },
  {
    技能ID: '37270',
    技能名称: '临源·二', // 37270/4
    统计名称: '临源',
    技能伤害系数: 2855.3579999999993,
    基础伤害_基础值: 34,
    基础伤害_浮动值: 5,
    技能增益列表: 临源增益,
  },
  {
    技能ID: '38955',
    技能名称: '焚玉', // 38955
    技能伤害系数: 300,
    基础伤害_基础值: 155,
    基础伤害_浮动值: 28,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '37525',
    技能名称: '钟灵', // 37525
    技能伤害系数: 328,
    基础伤害_基础值: 121,
    基础伤害_浮动值: 10,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '30648',
    技能名称: '丹青', // 30648
    技能伤害系数: 470.4,
    基础伤害_基础值: 155,
    基础伤害_浮动值: 28,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32629',
    技能名称: '雨墨', // 32629
    技能伤害系数: 100.0,
    基础伤害_基础值: 400,
    基础伤害_浮动值: 15,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '26696',
    技能名称: '碎玉', // 26696
    技能伤害系数: 138,
    基础伤害_基础值: 15,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '23402',
    技能名称: '飞指抖霜', // 特效武器
    技能伤害系数: 0,
    基础伤害_基础值: 3848446,
    基础伤害_浮动值: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '22075',
    技能名称: '雪凤舞连天', // 特效武器
    技能伤害系数: 0,
    基础伤害_基础值: 577267,
    基础伤害_浮动值: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '21309',
    技能名称: '孤望飞霜满', // 特效武器
    技能伤害系数: 0,
    基础伤害_基础值: 192422,
    基础伤害_浮动值: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '22047',
    技能名称: '渡池觅狭间', // 特效武器
    技能伤害系数: 0,
    基础伤害_基础值: 486,
    基础伤害_浮动值: 0,
    技能增益列表: 通用增益,
    技能等级数据: {
      '1,6': {
        基础伤害_基础值: [486, 753, 1950, 8298, 7216],
      },
    },
  },
  {
    技能ID: '45191',
    技能名称: '渲青', // 特效武器
    技能伤害系数: 1120,
    基础伤害_基础值: 155,
    基础伤害_浮动值: 28,
    技能增益列表: 通用增益,
  },
  /**
   * 兰摧玉折
   */
  {
    技能名称: '兰摧玉折(DOT)', // 711_18730普通 711_13848流离
    ...兰摧玉折基础数据,
  },
  {
    技能名称: '兰摧玉折(DOT)·芙蓉', // 711_6136
    ...兰摧玉折基础数据,
    技能增益列表: [...通用增益, ...故幽增益],
  },
  {
    技能名称: '兰摧玉折(DOT)·乱洒', // 711_39906
    ...兰摧玉折基础数据,
    技能伤害系数: 962.613323538015,
  },
  {
    技能名称: '兰摧玉折(DOT)·乱洒渲青', // 711_39906
    ...兰摧玉折基础数据,
    技能伤害系数: 882.395546576514,
  },
  /**
   * 钟林毓秀
   */
  {
    技能名称: '钟林毓秀(DOT)', // 714_285普通 714_13847橙武
    ...钟林毓秀基础数据,
  },
  {
    技能名称: '钟林毓秀(DOT)·芙蓉', // 714_6135
    ...钟林毓秀基础数据,
    技能增益列表: [...钟林毓秀增益, ...故幽增益],
  },
  {
    技能名称: '钟林毓秀(DOT)·乱洒', // 714_39907
    ...钟林毓秀基础数据,
    技能伤害系数: 835.9351879149925,
  },
  {
    技能名称: '钟林毓秀(DOT)·乱洒渲青', // 714_39907
    ...钟林毓秀基础数据,
    技能伤害系数: 766.27392225541,
  },
  /**
   * 商阳指
   */
  {
    技能名称: '商阳指(DOT)', // 666_180普通 666_13849橙武
    ...商阳指基础数据,
  },
  {
    技能名称: '商阳指(DOT)·芙蓉', // 666_6134
    ...商阳指基础数据,
    技能增益列表: [...通用增益, ...故幽增益],
  },
  // ...旧万花DOT数据下版本删除,
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
  判官笔法增益,
  快雪时晴增益,
  阳明指增益,
  芙蓉并蒂增益,
  钟林毓秀增益,
  故幽增益,
}

export { 技能增益 }
