import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '穿肌透骨',
        奇穴图片: 'https://icon.jx3box.com/icon/24412.png',
        id: '42482',
        奇穴描述:
          '重弩的弹道速度提高100%，重弩对原地受控状态下的目标填装速度和造成伤害翻倍，攻击间隔减半。',
      },
      {
        奇穴名称: '困孤悬饵',
        奇穴图片: 'https://icon.jx3box.com/icon/23477.png',
        id: '42481',
        奇穴描述:
          '自身“化血”效果的目标受到治疗则下一跳“化血”生效时额外造成<SUB 42483 1>毒性内功伤害。',
      },
      {
        奇穴名称: '九霄风雷',
        奇穴图片: 'https://icon.jx3box.com/icon/11945.png',
        id: '20544',
        奇穴描述:
          '“鬼斧神工”替换为“九霄风雷”，不受原招式秘籍影响，调息时间固定为70秒。施展时<SUB 21847 1>',
      },
      {
        奇穴名称: '回肠荡气',
        奇穴图片: 'https://icon.jx3box.com/icon/3202.png',
        id: '45108',
        奇穴描述: '“扬威”状态下“蚀肌弹”命中目标回复25点神机值并添加“化血”。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '波诡云谲',
        奇穴图片: 'https://icon.jx3box.com/icon/19176.png',
        id: '42473',
        奇穴描述:
          '“鬼斧神工”会额外预留9发“鬼斧备弹”。千机弩锁定的目标被“暗藏杀机”命中后，消耗3发“鬼斧备弹”，将其装填为“鬼斧弹药”并使自身获得5秒“扬威”',
      },
      {
        奇穴名称: '千机之威',
        奇穴图片: 'https://icon.jx3box.com/icon/3205.png',
        id: '6506',
        奇穴描述: '当自身位于千机变25尺范围内时，自身基础攻击提高15%，招式无视目标50%防御等级。',
      },
      {
        奇穴名称: '神机千算',
        奇穴图片: 'https://icon.jx3box.com/icon/3191.png',
        id: '6778',
        奇穴描述: '“毒刹”伤害提高40%且对目标造成伤害后回复自身3%气血最大值，最多每1秒触发一次。',
      },
      {
        奇穴名称: '梅花针',
        奇穴图片: 'https://icon.jx3box.com/icon/3174.png',
        id: '3092',
        奇穴描述:
          '若目标正在运功则进行打断，并使其<BUFF 3227 0 desc>，持续<BUFF 3227 0 time>。“浮空”期间不可施展。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '云奔雨骤',
        奇穴图片: 'https://icon.jx3box.com/icon/12730.png',
        id: '24037',
        奇穴描述:
          '“扬威”期间“蚀肌弹”命中目标，使其6秒内下一次被连弩或重弩攻击命中时额外附带一段<SUB 26900 1>或<SUB 26901 1>毒性内功伤害，至多叠加3层。该伤害视为千机弩造成。',
      },
      {
        奇穴名称: '化血迷心',
        奇穴图片: 'https://icon.jx3box.com/icon/3188.png',
        id: '18249',
        奇穴描述:
          '“蚀肌弹”“暴雨梨花针”命中有自身“化血”效果的目标附带一次<SUB 3304 1>毒性内功伤害。',
      },
      {
        奇穴名称: '黑云翻墨',
        奇穴图片: 'https://icon.jx3box.com/icon/16214.png',
        id: '42474',
        奇穴描述: '“天绝地灭”伤害提高100%，触发和生效范围提高4尺。',
      },
      {
        奇穴名称: '狂雨穿心',
        奇穴图片: 'https://icon.jx3box.com/icon/27133.png',
        id: '44513',
        奇穴描述:
          '施展“鬼斧神工”后，获得10层“狂雨”气劲、“暴雨梨花针”每跳消耗一层“狂雨”和15点神机值对目标造成<SUB 44512 11>毒性内功伤害，该伤害对非侠士目标额外生效1次。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '藏形待时',
        奇穴图片: 'https://icon.jx3box.com/icon/21975.png',
        id: '42476',
        奇穴描述: '“暗藏杀机”调息时间提高7秒，命中锁足、定身、眩晕的目标将其击倒4秒。',
      },
      {
        奇穴名称: '尽刑彻毒',
        奇穴图片: 'https://icon.jx3box.com/icon/16218.png',
        id: '42475',
        奇穴描述: '“暗藏杀机”命中目标使其剩余“化血”效果作用间隔降低至1秒，持续时间不变。',
      },
      {
        奇穴名称: '千机不殆',
        奇穴图片: 'https://icon.jx3box.com/icon/3230.png',
        id: '6508',
        奇穴描述: '“鬼斧弹药”期间重弩的爆炸范围提高4尺，连弩的攻击间隔降低0.5秒。',
      },
      {
        奇穴名称: '绝伦逸群',
        奇穴图片: 'https://icon.jx3box.com/icon/3225.png',
        id: '5719',
        奇穴描述:
          '“浮光掠影”调息时间降低30秒，施展“浮光掠影”获得的“浮光掠影”效果消失后移除移动限制，并使自身免疫移动限制、受到的伤害降低40%，持续4秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '图穷匕见',
        奇穴图片: 'https://icon.jx3box.com/icon/3292.png',
        id: '42478',
        奇穴描述:
          '被动效果：“暗藏杀机”变为遥控陷阱，投掷时立即激活并隐匿，不再自动触发，战斗中施展返还全额调息时间。\\n主动效果：遥控全部“暗藏杀机”立即触发，并额外附带10尺击退效果。调息时间20秒。',
      },
      {
        奇穴名称: '林寒涧肃',
        奇穴图片: 'https://icon.jx3box.com/icon/11840.png',
        id: '42477',
        奇穴描述:
          '“天绝地灭”放置后直接激活触发，触发时不再附带拉扯和锁足。持续期间范围每秒增大4尺（至多增大至15尺），并可施展二段招式，将范围内至多4个敌方目标和自身其他陷阱拉至中心位置。',
      },
      {
        奇穴名称: '荆天棘地',
        奇穴图片: 'https://icon.jx3box.com/icon/3198.png',
        id: '3115',
        奇穴描述:
          '消耗15点神机值，对目标发射一个荆棘机关，使其受到<SUB 3220 0>外功伤害或<SUB 3221 0>毒性内功伤害，并使周围最多5个目标获得“荆天棘地”效果：外功命中降低100%，内功造成伤害降低100%，持续<BUFF 3215 0 time>。外功命中降低，内功造成伤害降低效果每秒递减10%。',
      },
      {
        奇穴名称: '擘两分星',
        奇穴图片: 'https://icon.jx3box.com/icon/11838.png',
        id: '30921',
        奇穴描述:
          '“神机值”低于80点时，造成内功伤害增加20%。“神机值”高于20点时，“陷阱技”造成伤害增加10%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '诡面埋伏',
        奇穴图片: 'https://icon.jx3box.com/icon/14135.png',
        id: '25151',
        奇穴描述:
          '陷阱技。消耗30点神机值和一个机关，在目标点投掷一个“诡面埋伏”陷阱，持续10秒。\\n“诡面埋伏”陷阱：1.5秒后激活，并在6尺范围内首次出现敌方侠士目标时触发。\\n“诡面埋伏”触发：对6尺范围最多3个目标造成毒性内功伤害，并使之无法运功，无法受到治疗效果，持续3秒。',
      },
      {
        奇穴名称: '千秋万劫',
        奇穴图片: 'https://icon.jx3box.com/icon/17180.png',
        id: '18675',
        奇穴描述:
          '使自身进入20秒开火状态，期间可施展4次“千秋万劫”：对目标点范围10尺内至多5个目标造成<SUB 18677 0>毒性内功伤害，并使其剩余“化血”效果伤害提高100%。',
      },
      {
        奇穴名称: '千机连环',
        奇穴图片: 'https://icon.jx3box.com/icon/17184.png',
        id: '30723',
        奇穴描述:
          '连弩存在时可施展。立即在连弩周围产生2个“千机连环弩”，持续15秒。“千机连环弩”会与连弩攻击同样的目标，造成视为连弩伤害的<SUB 31027 1>毒性内功伤害，“扬威”效果下附带“易损”：6秒内受到连弩伤害提高10%，可叠加10层。',
      },
      {
        奇穴名称: '星离雨散',
        奇穴图片: 'https://icon.jx3box.com/icon/3189.png',
        id: '42479',
        奇穴描述:
          '消耗30点神机值和一个机关，对目标所在位置投掷“星离雨散”机关并立即对其及其4尺内至多3个目标造成<SUB 42664 1>“封喉”毒性内功伤害。\\n“星离雨散”机关：2秒后触发，对6尺内至多3个目标造成<SUB 42664 2>毒性内功伤害，命中被“封喉”命中过的目标时伤害提高100%，若目标非侠士则引爆其全部“化血”。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '秋风散影',
        奇穴图片: 'https://icon.jx3box.com/icon/7438.png',
        id: '6461',
        奇穴描述:
          '当你与当前敌对目标距离超过8尺时，获得10秒“秋风散影”效果：招式会心几率提高10%，会心效果提高10%。',
      },
      {
        奇穴名称: '危峰屹立',
        奇穴图片: 'https://icon.jx3box.com/icon/3197.png',
        id: '6464',
        奇穴描述:
          '“惊鸿游龙”调息时间降低5秒，闪避几率提高至60%，受到伤害降低提高至55%，若躲闪攻击则减少1秒“浮光掠影”调息时间并回复自身3%气血最大值，该效果每1秒最多触发一次。',
      },
      {
        奇穴名称: '袍泽故旧',
        奇穴图片: 'https://icon.jx3box.com/icon/3199.png',
        id: '23642',
        奇穴描述:
          '“子母飞爪”调息时间减少10秒，可对友方目标施展。若目标为队友，则自身与目标队友之间生成一条锁链持续7秒。友方目标获得一个增益技能“子母飞爪·子”：位移至唐门队友身旁；自身可施展二段技能“子母飞爪·子”：位移至队友身旁。施展技能后队友和自身免疫控制（击退和被拉除外），持续2秒，锁链效果作用一次消失。',
      },
      {
        奇穴名称: '卸元归魂',
        奇穴图片: 'https://icon.jx3box.com/icon/3181.png',
        id: '18241',
        奇穴描述: '施展“孔雀翎”卸除当前目标的阴性、阳性、毒性、混元气劲各两个。',
      },
      {
        奇穴名称: '天幕藏锋',
        奇穴图片: 'https://icon.jx3box.com/icon/14134.png',
        id: '33577',
        奇穴描述:
          '“浮空”状态期间可以在空中双击W、S按键中任意一个，快速冲向指定的前方或者后方，获得5秒“扬威”效果。',
      },
      {
        奇穴名称: '分水逐旌',
        奇穴图片: 'https://icon.jx3box.com/icon/7487.png',
        id: '17572',
        奇穴描述:
          '“惊鸿游龙”状态持续时间内，若自身受到的伤害累积超过自身气血最大值的10%，则自动触发“浮光掠影”隐身效果并卸除自身所有不利效果，持续5秒。',
      },
      {
        奇穴名称: '杀机断魂',
        奇穴图片: 'https://icon.jx3box.com/icon/7440.png',
        id: '33134',
        奇穴描述:
          '每存在一个“天绝地灭”提高10%“千机变”造成的伤害。\\n每存在一个“暗藏杀机”提高20%“天绝地灭”造成的伤害。\\n每存在一个“千机变”提高30%“暗藏杀机”造成的伤害。',
      },
      {
        奇穴名称: '平地风雷',
        奇穴图片: 'https://icon.jx3box.com/icon/20078.png',
        id: '36279',
        奇穴描述: '“雷震子”会在15尺内敌方目标间弹跳6次，每次控制时间变为2秒。',
      },
      {
        奇穴名称: '击搏挽裂',
        奇穴图片: 'https://icon.jx3box.com/icon/3208.png',
        id: '6510',
        奇穴描述: '“扬威”状态下“蚀肌弹”伤害提高30%，可无需运功直接施展。',
      },
      {
        奇穴名称: '神威穿彻',
        奇穴图片: 'https://icon.jx3box.com/icon/20079.png',
        id: '27267',
        奇穴描述: '“鬼斧神工”调息降低40秒，运功时间降低至1.5秒，获得的“扬威”持续时间降低至10秒。',
      },
      {
        奇穴名称: '千回百转',
        奇穴图片: 'https://icon.jx3box.com/icon/13428.png',
        id: '18237',
        奇穴描述:
          '“孔雀翎”使目标锁足4秒并标记目标，若目标4秒内若受到的伤害超过最大血量的30%，则触发虚弱效果，减速封轻功，基础内外功攻击力和基础治疗效果降低50%，持续5秒。',
      },
      {
        奇穴名称: '天风汲雨',
        奇穴图片: 'https://icon.jx3box.com/icon/16604.png',
        id: '42472',
        奇穴描述:
          '“暴雨梨花针”命中自身“天绝地灭”内的目标附带<SUB 42484 1>毒性内功伤害，并使自身获得“汲雨”：自身无双等级提高5%，毒性内功破防等级提高5%，可叠加4层，持续25秒。',
      },
    ],
  },
]

export default 奇穴数据
