// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import { ERROR_ACTION } from '../../utils'
import 技能统一类 from '../../通用类/技能统一类'

class 劫刀 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '劫刀')
  static 消耗怒气 = 0

  constructor(模拟循环) {
    super(模拟循环)
    const 存在减少消耗怒气秘籍 = this.模拟循环.秘籍?.['劫刀']?.includes('怒气消耗-5')
    if (存在减少消耗怒气秘籍) {
      劫刀.消耗怒气 = 5
    } else {
      劫刀.消耗怒气 = 10
    }
  }
  释放() {
    const 当前怒气 = this.模拟循环.角色状态信息?.怒气 || 0
    if (当前怒气 < 劫刀.消耗怒气) {
      return {
        可以释放: false,
        异常信息: ERROR_ACTION.怒气不足,
      }
    }

    return { 可以释放: true }
  }
  命中() {
    // 苍雪刀记录绝刀怒气用以判断触发的血誓怒气。
    this.记录绝刀怒气判定()
    // 用来在模拟器内显示援戈层数标记。
    this.记录释放时援戈层数()
  }

  造成伤害() {
    this.触发伤害行为('劫刀')
    this.触发血誓效果(劫刀.绝刀怒气判定?.绝返等级)
    this.模拟循环.技能类实例集合?.盾击?.触发援戈伤害?.()
    // 怒气结算要在触发麟光之前，否则会先回怒再消耗
    this.触发消耗怒气(劫刀.消耗怒气, 劫刀.技能数据?.技能名称)
    this.模拟循环.技能类实例集合?.业火麟光?.触发麟光玄甲伤害?.()

    // 崩血3层流血时，闪刀、劫刀消耗一层流血并触发崩血伤害
    if (this.模拟循环.校验奇穴是否存在?.('崩血')) {
      this.模拟循环.技能类实例集合?.流血?.崩血消耗流血()
    }
  }

  释放后() {
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武']),
    }
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
      特殊标记: this.获取释放时援戈层数(),
    }
  }
}

export default 劫刀
export const 劫刀类型 = typeof 劫刀
