import 目标监控 from '../../无方/目标监控'
import { 攻略容器, 奇穴展示 } from '../../../components'
import 无方攻略排版 from '../../无方/统一样式'
import 推荐配装 from '../推荐配装/展示'

export default function 无方悟手动攻略() {
  return (
    <攻略容器 标题='无界端 / 无方·悟心法 · 手动攻略' 模式='计算结果'>
      <无方攻略排版>
        <blockquote>
          <p>
            来源：<a href='https://docs.qq.com/aio/DT3NraHdFRGFVYVZM'>无方PVE绿皮书</a>
          </p>
          <strong>作者：长倦</strong>
        </blockquote>

        <h2>技能、秘籍与奇穴</h2>
        <p>武学助手一键推荐即可。</p>
        <奇穴展示 奇穴={['鬼门·悟', '神莹·悟', '济世·悟', '苍棘缚地·悟']} />

        <h2>手法</h2>
        <p>
          <strong>起手准备：</strong>选中自己释放并蒂，获取 3 温，以 3 温性起手。
        </p>

        <h3>武学助手起手</h3>
        <pre>苍-钩-并青-开启武学助手</pre>

        <h3>手动循环</h3>
        <pre>苍-钩-并青-沾川-钩商钩商-川-钩商钩商-并青-沾川-钩商钩商-川-钩商钩商-至苍CD好</pre>
        <p>溢出温性的川都可以提前断，比如 2 温断川打钩。</p>

        <h2>循环分析</h2>
        <p>无方·悟的推荐技能为【川乌】【沾衣】【并蒂】【青圃】。</p>
        <p>其中，川乌给温性，沾衣给寒性，并蒂给温性，青圃给寒性，理论上可以获得最佳的中和。</p>
        <p>然而实际上，由于川乌的短 CD，这个技能组合的药性始终是偏温的。</p>
        <p>因此，在充分利用中和的情况下，会有一个单川乌是正常的。</p>

        <h2>组合连招</h2>
        <h3>并蒂青圃</h3>
        <p>
          <strong>一定要在 2 温以上使用。</strong>
          青圃会中和并蒂逐跳产生的温性，并且立即引爆中毒效果。
        </p>
        <p>青圃秘章机制：</p>
        <ol>
          <li>
            若在寒性或中性情况下使用青圃，会首跳直接结算目标身上的【中毒】效果，后续伤害由于未产生中和，不再结算中和效果。
          </li>
          <li>
            若在温性情况下使用青圃，会首跳直接结算目标身上的中毒效果，后续伤害如果产生中和，会继续结算该中和产生的中毒效果，直至不再产生中和。
            如 3 温，则第 1、2、3、4 跳分别结算原本目标身上的、第 1、2、3 跳攻击产生的中毒效果，第
            5、6 跳则不结算中毒效果。
          </li>
        </ol>

        <h3>沾衣川乌</h3>
        <p>任意药性均可使用。</p>

        <h3>钩商</h3>
        <p>钩商至下一个技能 CD 好，不限制一定要一钩一商打完。</p>
        <h2>目标监控</h2>
        <目标监控 />

        <h2>推荐配装</h2>
        <推荐配装 />

        <h2>配装及属性分析</h2>
        <h3>五彩石</h3>
        <p>速无攻，CW用会破攻。</p>
        <h3>附魔</h3>
        <p>头、脚、戒指：攻击 （不推荐加速附魔）</p>
        <p>衣服、腰带：无双（活动兑换）</p>
        <p>手、裤：根骨（综合最优）</p>
        <p>暗器：根骨/加速</p>
        <p>武器：攻击/龙血</p>
        <h3>单体</h3>
        <p>2根骨2攻击，根骨/加速大酒，创意食物-气血+攻击，香水破防</p>
        <h3>阵眼</h3>
        <p>T1 和尚、段氏、莫问</p>
        <p>T2 花间、万灵、田螺</p>
        <p>（上面都没有就申请自己开阵）</p>
        <h3>属性收益及配装思路</h3>
        <h4>加速</h4>
        <p>加速1段10即可。</p>
        <h4>属性收益（精简不适用）</h4>
        <p>攻击 ＞ 根骨 ＞ 破防 ＞ 无双（综合）＞ 会心 ＞ 会效</p>
        <h4>精简分析</h4>
        <p>待更新</p>
      </无方攻略排版>
    </攻略容器>
  )
}
