import { 获取倒读条实际帧数分布, 获取加速等级, 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 待生效事件 } from '../../type'
import { ERROR_ACTION } from '../../utils'

class 勾线 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '穿云')
  当前消耗心络 = 0

  constructor(模拟循环) {
    super(模拟循环)
    勾线.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '勾线')
    this.初始化技能运行数据()
  }

  命中() {
    const 当前心络 = this.模拟循环.角色状态信息.心络
    const 额外消耗心络次数 = 当前心络 >= 30 ? Math.min(Math.floor((当前心络 - 20) / 10), 2) : 0
    this.当前消耗心络 = Math.min(20 + 额外消耗心络次数 * 10, 当前心络)
    this.消耗心络('勾线', this.当前消耗心络)
    const 作用分布 = 获取倒读条实际帧数分布(
      每秒郭氏帧 * (2 + 额外消耗心络次数 * 1.5),
      每秒郭氏帧 * 0.5,
      this.模拟循环.加速值,
    )
    let 已读条时间 = 0
    const 待生效事件队列: 待生效事件[] = []
    for (let i = 0; i < 作用分布.length; i++) {
      待生效事件队列.push({
        事件名称: '技能读条',
        事件时间: this.模拟循环.当前时间 + 已读条时间 + 作用分布[i],
        事件备注: {
          技能名称: '勾线',
          技能次数: i + 1,
          消耗心络: this.当前消耗心络,
        },
      })
      已读条时间 = 已读条时间 + 作用分布[i]
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
    const 是否释放 = this.模拟循环.技能类实例集合?.千里急?.自动释放('勾线', this.模拟循环.当前时间)
    if (是否释放) {
      this.保存释放记录(`勾线`)
    }
  }

  释放() {
    if (this.模拟循环.角色状态信息.心络 < 20) {
      return {
        可以释放: false,
        异常信息: { 信息: ERROR_ACTION.心络错误?.信息 },
      }
    }
  }

  _获取读条时间() {
    const 当前心络 = this.模拟循环.角色状态信息.心络
    const 额外消耗心络次数 = 当前心络 >= 30 ? Math.min(Math.floor((当前心络 - 20) / 10), 2) : 0
    return 获取实际帧数(每秒郭氏帧 * (2 + 额外消耗心络次数 * 1.5), this.模拟循环.加速值)
  }

  读条伤害(事件备注: { 技能次数: number; 消耗心络: number }) {
    this.触发伤害行为('勾线', 1, [], undefined, 事件备注?.技能次数)
    this.模拟循环.添加buff?.({ 名称: '缠绞', 对象: '目标', 新增层数: 1 })
    const 额外次数 = Math.floor((事件备注?.消耗心络 - 20) / 10)
    if (事件备注?.技能次数 === 额外次数 * 3 + 4) {
      this.触发伤害行为('谐调', 1, [], undefined, 额外次数 + 1)
    }
  }

  获取释放后GCD减少时间() {
    const 读条时间 = this._获取读条时间()
    return -1 * 读条时间 + (this.模拟循环.网络延迟 || 0)
  }

  寄意减少CD() {
    if (this.模拟循环.校验奇穴是否存在('寄意')) {
      this.减少调息时间(每秒郭氏帧 * 1)
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      伤害段数: (this.模拟循环.技能类实例集合?.千里急?.当前千里急 + 3) % 4 || 4,
      重要buff列表: this.获取当前重要buff列表(['钤束', '虚影']),
    }
  }
}

export default 勾线

export const 勾线类型 = typeof 勾线
