import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'
import { 获取实际帧数 } from '@/工具函数/data'
import { 判断秘籍减读条 } from '@/功能模块/基础设置/公用设置/循环模拟/心法循环模拟/通用/通用函数'

class 蚀肌弹 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '蚀肌弹')

  static 读条时间: number

  constructor(模拟循环: any) {
    super(模拟循环)
  }

  释放() {
    // 检查神机值是否足够
    const 当前神机值 = this.模拟循环?.角色状态信息?.神机值 || 100
    const 消耗神机值 = 蚀肌弹.技能数据!.消耗神机值 ?? 0
    if (当前神机值 < 消耗神机值) {
      return {
        可以释放: false,
        异常信息: { 信息: `神机值不足，当前神机值：${当前神机值}，所需神机值：${消耗神机值}` },
      }
    }
    return { 可以释放: true }
  }

  获取读条时间() {
    const 秘籍减读条时间 = 判断秘籍减读条('蚀肌弹', this.模拟循环.秘籍)
    const 实际读条时间 = 获取实际帧数(
      蚀肌弹.技能数据!.读条时间! - 秘籍减读条时间,
      this.模拟循环.加速值,
    )
    蚀肌弹.读条时间 = 实际读条时间
    return 实际读条时间
  }

  读条(读条开始时间: number) {
    const 待生效事件队列: 待生效事件[] = []
    待生效事件队列.push({
      事件名称: '技能读条',
      事件时间: 读条开始时间 + 蚀肌弹.读条时间,
      事件备注: {
        技能名称: '蚀肌弹',
      },
    })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  读条命中() {
    const 鸩羽 = this.模拟循环?.当前目标buff列表?.['鸩羽']
    if (鸩羽 && 鸩羽.当前层数! > 0) {
      this?.模拟循环?.技能类实例集合?.DOT_化血?.获得和刷新化血('蚀肌弹')
    }
    if (this.模拟循环.校验奇穴是否存在('雀引彀中') && 鸩羽) {
      this.触发伤害行为('破', 1, [], this?.模拟循环?.当前时间, 1)
    }
    if (鸩羽 && this.模拟循环.校验奇穴是否存在('化血迷心')) {
      this.触发伤害行为('化血迷心', 1)
    }
    this.触发伤害行为('蚀肌弹', 1)
    this.模拟循环.神机值变化?.(蚀肌弹.技能数据!)
    this?.模拟循环?.技能类实例集合?.孔雀翎?.重置调息时间()
    this.保存释放记录('蚀肌弹')
  }

  保存释放记录(名称: string) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表([
        '心无旁骛',
        '扬威',
        '神机好穷内攻增伤',
        '秋风散影',
        '催寒',
        '气魄',
        '弩心',
        '天风汲雨',
      ]),
    }
  }
}

export default 蚀肌弹

export const 蚀肌弹类型 = typeof 蚀肌弹
