import { 创建耦合表 } from '../../通用/耦合默认值'

export const 耦合表 = 创建耦合表({
  隐藏增益: {
    自身: ['同尘·1', '同尘·2', '同尘·3', '同尘·4', '风特效_英雄_快照', '风特效_快照'],
    目标: ['颠越苍穹'],
  },
  名称: '紫霞功',
  资源: { qidian: '气点' },
  资源显示: { qidian: '气点（0–10，2 点为一豆）' },
  排除技能: ['回豆', '卸除飞剑'],
  技能: {
    '359': '破苍穹',
    '367': '四象轮回',
    '301': '两仪化形',
    '44473': '六合独尊',
    '2674': '五方行尽',
    '18640': '万世不竭',
    '18654': '万世不竭二段',
    '24946': '破势',
    '46199': '破势二段',
    '2681': '紫气东来',
  },
  自身增益: {
    紫气东来: '紫气东来·3',
    气剑: '飞剑',
    破苍穹: '375',
    破势: '破势二段',
    仙灵: '橙武',
  },
  目标增益: { 同尘: '八方剑域' },
  连招: {
    万世不竭: [{ 增益: '飞剑', 技能: '万世不竭二段' }],
    破势: [{ 增益: '破势二段', 技能: '破势二段' }],
  },
  增益ID: {
    '1916': { 自身: ['橙武'] },
    '375': { 自身: ['破苍穹一', '破苍穹二', '破苍穹三'] },
    '12504': { 自身: ['飞剑'] },
    '17918': { 自身: ['破势二段'] },
    '2757': { 自身: ['紫气东来·3'] },
    '1908': { 自身: ['会神'] },
    '33119': { 目标: ['八方剑域'] },
    '27158': { 目标: ['颠越苍穹'] },
    '9966': { 自身: ['同尘·1', '同尘·2', '同尘·3', '同尘·4'] },
  },
  示例: '/cast [qidian>7] 两仪化形\n/cast 四象轮回',
})
