import { 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'
import { 待生效事件 } from '../../type'
import { 判断秘籍减读条 } from '../../../../通用/通用函数'

class 阳明指 extends 技能统一类 {
  // scripts/skill/万花\万花_点穴截脉_阳明指.lua
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '阳明指')
  static 总作用间隔 = 28
  static 读条时间 = 28
  static 本次释放是否读条 = true
  static 本次释放墨意变化 = 0
  static 获得墨意 = 5

  constructor(模拟循环) {
    super(模拟循环)
  }

  获取读条时间(技能索引) {
    this.保存释放记录('阳明指')

    if (this.墨意校验() || this.水月校验() || 技能索引 === 0) {
      阳明指.本次释放是否读条 = false
      return 0
    }

    const 读条时间 = this.获取阳明指读条时间()
    阳明指.本次释放是否读条 = true
    return 读条时间
  }

  获取阳明指读条时间() {
    const 秘籍减读条时间 = 判断秘籍减读条('阳明指', this.模拟循环.秘籍)
    const 读条持续时间 = 获取实际帧数(阳明指.总作用间隔 - 秘籍减读条时间, this.模拟循环.加速值)
    阳明指.读条时间 = 读条持续时间

    return 读条持续时间
  }

  读条(读条开始时间) {
    // 开始读条
    this.读条阳明指(读条开始时间)
  }

  读条阳明指(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    待生效事件队列.push({
      事件名称: '技能读条',
      事件时间: 读条开始时间 + 阳明指.读条时间,
      事件备注: {
        技能名称: '阳明指',
      },
    })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  读条命中() {
    this.阳明指命中()
  }

  命中(释放索引) {
    if (!阳明指.本次释放是否读条 || 释放索引 === 0) {
      this.阳明指命中()
    }
  }

  阳明指命中() {
    阳明指.本次释放墨意变化 = 0
    if (this.墨意校验()) {
      阳明指.本次释放墨意变化 = -20
    } else if (this.水月校验()) {
      阳明指.本次释放墨意变化 = -20
    } else if (this.钟灵校验()) {
      阳明指.本次释放墨意变化 = -20
    }
    this.模拟循环?.卸除buff({ 名称: '水月瞬发', 对象: '自身' })
    this.触发伤害行为('阳明指')
    this.折花处理()
    this.乱洒处理()
    this.焚玉()
    this.墨海临源叠层()
    this.墨意变化(阳明指.获得墨意 + 阳明指.本次释放墨意变化)
    this.清歌墨意变化()
    this?.涓流函数()
  }

  清歌墨意变化() {
    if (this.模拟循环.当前自身buff列表?.['青歌']?.当前层数) {
      this.墨意变化(5)
    }
  }

  判断Dot消失时间(Dot名称) {
    const 当前Dot待生效数据 =
      this?.模拟循环?.技能类实例集合?.[`DOT_${Dot名称}`]?.DOT运行数据?.待生效数据 || []
    if (当前Dot待生效数据?.length) {
      const 最后一条数据 = 当前Dot待生效数据?.[当前Dot待生效数据?.length - 1]
      return 最后一条数据?.生效时间 || 0
    }
    return 0
  }

  折花处理() {
    // 同跳数优先级钟林>商阳＞兰摧
    if (this.模拟循环?.校验奇穴是否存在('折花')) {
      const 商阳指生效时间 = this.判断Dot消失时间('商阳指')
      const 钟林毓秀生效时间 = this.判断Dot消失时间('钟林毓秀')
      const 兰摧玉折生效时间 = this.判断Dot消失时间('兰摧玉折')
      const 最大生效时间 = Math.max(商阳指生效时间, 钟林毓秀生效时间, 兰摧玉折生效时间)
      if (!最大生效时间) {
        return
      }
      let 最大生效时间技能 = ''
      if (最大生效时间 === 钟林毓秀生效时间) {
        最大生效时间技能 = '钟林毓秀'
      } else if (最大生效时间 === 商阳指生效时间) {
        最大生效时间技能 = '商阳指'
      } else if (最大生效时间 === 兰摧玉折生效时间) {
        最大生效时间技能 = '兰摧玉折'
      }
      this?.模拟循环?.技能类实例集合?.[`DOT_${最大生效时间技能}`]?.阳明引爆()

      // 添加折花
      const 折花Buff名称 = {
        钟林毓秀: '钟林折花',
        商阳指: '商阳折花',
        兰摧玉折: '兰摧折花',
      }

      if (折花Buff名称?.[最大生效时间技能]) {
        this.模拟循环?.添加buff({ 名称: `${折花Buff名称?.[最大生效时间技能]}`, 对象: '自身' })
      }

      // 代码里写了Math.min导致所有等级为2
      this?.触发伤害行为('破', 1, [], this?.模拟循环?.当前时间, 2)
    }
  }

  乱洒处理() {
    if (this?.模拟循环?.当前自身buff列表?.['乱洒青荷']?.当前层数) {
      this?.模拟循环?.技能类实例集合?.[`DOT_兰摧玉折`]?.乱洒阳明刷新()
      this?.模拟循环?.技能类实例集合?.[`DOT_钟林毓秀`]?.乱洒阳明刷新()
      if (this.模拟循环.校验奇穴是否存在('风裳')) {
        this?.模拟循环?.技能类实例集合?.[`芙蓉并蒂`]?.重置调息时间()
      }
    }
    if (this?.模拟循环?.当前自身buff列表?.['渲青青荷']?.当前层数) {
      this?.模拟循环?.技能类实例集合?.[`玉石俱焚`]?.更新技能运行数据({ 待充能时间点: [] })
      this?.触发伤害行为('渲青')
      this?.模拟循环?.卸除buff?.({ 名称: '渲青青荷', 对象: '自身', 卸除层数: 1 })
    }
  }

  焚玉() {
    if (this.模拟循环?.校验奇穴是否存在('焚玉')) {
      this.模拟循环?.添加buff({ 名称: `焚玉`, 对象: '自身' })
    }
  }

  保存释放记录(名称) {
    const 保存显示段数 = this.模拟循环.显示涓流层数
      ? this.模拟循环.当前自身buff列表['涓流']?.当前层数 || 0
      : undefined

    this.本次释放记录 = {
      伤害段数: 保存显示段数,
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['钟灵', '倚天', '涓流', '乱洒青荷', '布散畅和']),
    }
  }
}

export default 阳明指

export const 阳明指类型 = typeof 阳明指
