import { 五彩石数据类型 } from '@/@types/五彩石'
import { 属性类型 } from '@/@types/属性'
import { 五彩石增益类型枚举 } from '@/@types/枚举'

const 五彩石_六级: 五彩石数据类型[] = [
  {
    五彩石名称: '彩·击破·强击·固筋(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.全会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 104 },
      { 增益类型: 属性类型.郭氏根骨, 增益名称: 五彩石增益类型枚举.根骨百分比, 增益数值: 81 },
    ],
  },
  {
    五彩石名称: '彩·击破·强击·聚魂(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.全会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 104 },
      { 增益类型: 属性类型.郭氏元气, 增益名称: 五彩石增益类型枚举.元气百分比, 增益数值: 81 },
    ],
  },
  {
    五彩石名称: '彩·急速·无双·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 52 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·急速·激流·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·无双·急速·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 52 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·无双·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·无双·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·无双·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·无双·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·星见·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·星见·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·星见·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·星见·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·星见·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·星见·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·月华·无双·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 52,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·月华·无双·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 52,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·月华·激流·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 52,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·月华·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 52,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·月华·灭气·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 52,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·月华·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 52,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·潮生·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.每秒内力恢复, 增益名称: 五彩石增益类型枚举.回蓝, 增益数值: 20 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·潮生·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.每秒内力恢复, 增益名称: 五彩石增益类型枚举.回蓝, 增益数值: 20 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·潮生·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.每秒内力恢复, 增益名称: 五彩石增益类型枚举.回蓝, 增益数值: 20 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·潮生·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.每秒内力恢复, 增益名称: 五彩石增益类型枚举.回蓝, 增益数值: 20 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·潮生·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.每秒内力恢复, 增益名称: 五彩石增益类型枚举.回蓝, 增益数值: 20 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·潮生·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.每秒内力恢复, 增益名称: 五彩石增益类型枚举.回蓝, 增益数值: 20 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·激流·急速·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 52 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 104 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·激流·无双·急速(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 52 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 104 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·激流·无双·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 52 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·激流·无双·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 52 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·激流·月华·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·激流·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·激流·灭气·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·激流·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·无双·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 52 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·灭气·无双·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 52 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·灭气·月华·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·灭气·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·灭气·激流·无双(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·灭气·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·灵根·急速·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.根骨, 增益名称: 五彩石增益类型枚举.根骨, 增益数值: 52 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·灵根·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.根骨, 增益名称: 五彩石增益类型枚举.根骨, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·灵根·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.根骨, 增益名称: 五彩石增益类型枚举.根骨, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·灵根·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.根骨, 增益名称: 五彩石增益类型枚举.根骨, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·灵根·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.根骨, 增益名称: 五彩石增益类型枚举.根骨, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·灵根·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.根骨, 增益名称: 五彩石增益类型枚举.根骨, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·灵根·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.根骨, 增益名称: 五彩石增益类型枚举.根骨, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·真元·急速·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 52 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·真元·月华·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·真元·月华·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 52 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 104,
      },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·真元·激流·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·激流·灭气(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 52 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 104 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 208 },
    ],
  },
  {
    五彩石名称: '彩·真元·灭气·月华(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      {
        增益类型: 属性类型.内功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 208,
      },
    ],
  },
  {
    五彩石名称: '彩·真元·灭气·激流(陆)',
    五彩石等级: 6,
    装备增益: [
      { 增益类型: 属性类型.元气, 增益名称: 五彩石增益类型枚举.元气, 增益数值: 52 },
      { 增益类型: 属性类型.内功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 104 },
      { 增益类型: 属性类型.内功基础攻击, 增益名称: 五彩石增益类型枚举.内功基础攻击, 增益数值: 208 },
    ],
  },
]

export default 五彩石_六级
