import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '朱厌',
        奇穴图片: 'https://icon.jx3box.com/icon/20293.png',
        id: '35761',
        奇穴描述: '“弛律召野”调息时间增加20秒，一次召唤三只“偕行动物”。',
      },
      {
        奇穴名称: '祝灵',
        奇穴图片: 'https://icon.jx3box.com/icon/20290.png',
        id: '35762',
        奇穴描述:
          '“汇山岚”变为15秒两层充能招式。释放“聚长川”、“汇山岚”会使下一次“归平野”伤害提高50%。',
      },
      {
        奇穴名称: '聚势摧霆',
        奇穴图片: 'https://icon.jx3box.com/icon/24423.png',
        id: '40240',
        奇穴描述:
          '持续蓄力，不断消耗箭矢增加释放时的伤害，最多消耗8支箭矢蓄力2.5秒。松开后立刻回复10%内力值并释放全部蓄力箭矢迅速攻击目标，造成伤害并使目标获得标鹄，对非侠士目标造成伤害提高265%。蓄力期间每消耗一支箭，增强一次释放时的额外伤害并使目标获得一层“贯穿”。<TALENT 42467 1 >',
      },
      {
        奇穴名称: '佑主',
        奇穴图片: 'https://icon.jx3box.com/icon/20273.png',
        id: '42468',
        奇穴描述: '自身最大气血值降低30%，施展“游雾乘云”、“澄神醒梦”时，获得 <NounID 98>。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '兴游',
        奇穴图片: 'https://icon.jx3box.com/icon/20275.png',
        id: '35748',
        奇穴描述: '施展“汇灵合契”需求的“唤灵印”减少一个。“引风唤灵”调息时间增加4.5秒。',
      },
      {
        奇穴名称: '贯侯',
        奇穴图片: 'https://icon.jx3box.com/icon/20299.png',
        id: '35757',
        奇穴描述: '“标鹄”引爆时额外使目标获得一层“标鹄”，引爆伤害对非侠士目标提高33%。',
      },
      {
        奇穴名称: '通灵',
        奇穴图片: 'https://icon.jx3box.com/icon/19589.png',
        id: '38866',
        奇穴描述:
          '“汇灵合契”消耗唤灵印超过施展要求数时，每超过一个则“汇灵合契”状态持续时间增加6秒，并延长自身6秒承契。',
      },
      {
        奇穴名称: '行危',
        奇穴图片: 'https://icon.jx3box.com/icon/102008.png',
        id: '42486',
        奇穴描述: '施展“澄神醒梦”3秒内施展“应天授命”返还“应天授命”10秒调息时间。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '襄尺',
        奇穴图片: 'https://icon.jx3box.com/icon/20287.png',
        id: '35721',
        奇穴描述:
          '“承契”层数为5层且剩余时间大于等于8秒时，若再次获得“承契”效果则降低“金乌见坠”3秒调息时间。',
      },
      {
        奇穴名称: '弋矰',
        奇穴图片: 'https://icon.jx3box.com/icon/20286.png',
        id: '35724',
        奇穴描述: '“上弦星流术”套路招式命中背对自身目标时，使目标获得2秒“弋矰”：无法施展轻功效果。',
      },
      {
        奇穴名称: '蓄锐',
        奇穴图片: 'https://icon.jx3box.com/icon/20307.png',
        id: '35727',
        奇穴描述: '战斗中若4秒内未释放伤害招式则获得“承契”效果，回复10%内力值。',
      },
      {
        奇穴名称: '虚彀',
        奇穴图片: 'https://icon.jx3box.com/icon/23483.png',
        id: '38664',
        奇穴描述:
          '获得“空弦惊雁”效果8秒内，附带该效果的箭矢命中未被定身、眩晕、击倒的目标时，直接使目标获得3秒定身效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '孰湖',
        奇穴图片: 'https://icon.jx3box.com/icon/20271.png',
        id: '35719',
        奇穴描述: '“偕行动物”出现时额外获得一层“承契”。',
      },
      {
        奇穴名称: '冉遗',
        奇穴图片: 'https://icon.jx3box.com/icon/20289.png',
        id: '35722',
        奇穴描述: '施展“应天授命”卸除一个持续伤害不利效果，期间受治疗效果提高20%。',
      },
      {
        奇穴名称: '射革',
        奇穴图片: 'https://icon.jx3box.com/icon/20306.png',
        id: '35726',
        奇穴描述: '对锁足、定身、眩晕、击倒目标造成伤害提高25%。',
      },
      {
        奇穴名称: '连珠',
        奇穴图片: 'https://icon.jx3box.com/icon/19597.png',
        id: '42467',
        奇穴描述:
          '“聚势摧霆”不再充能，调息时间降低3秒，成功施展后使自身获得1层“承契”并降低“金乌见坠”2秒调息时间，命中目标后使目标添加“连珠”持续18秒，最多两层，每层“连珠”期间受到自身的“标鹄”提高20%。<TALENT_CORE 40240 1>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '桑柘',
        奇穴图片: 'https://icon.jx3box.com/icon/20280.png',
        id: '35736',
        奇穴描述: '“贯穿”增加一跳，“标鹄”引爆时额外增加一层“贯穿”。',
      },
      {
        奇穴名称: '时祯',
        奇穴图片: 'https://icon.jx3box.com/icon/20265.png',
        id: '35743',
        奇穴描述: '“汇灵合契”状态结束后，自身获得2秒“澄神醒梦”和“应天授命”效果。',
      },
      {
        奇穴名称: '审固',
        奇穴图片: 'https://icon.jx3box.com/icon/20303.png',
        id: '35759',
        奇穴描述:
          '使6层以上目标获得“贯穿”时，不再刷新持续时间，而是延长4秒“贯穿”的持续时间，对目标同一次“贯穿”状态最多可触发2次。',
      },
      {
        奇穴名称: '信诺',
        奇穴图片: 'https://icon.jx3box.com/icon/19595.png',
        id: '42470',
        奇穴描述: '“乘黄之威”护盾值提高50%。<TALENT_CORE 42468 1>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '祓厄',
        奇穴图片: 'https://icon.jx3box.com/icon/20308.png',
        id: '35730',
        奇穴描述:
          '“汇山岚”作用目标数降低2个，不再造成眩晕而是3秒<NounID 113>，施展“汇山岚”后玩家的追击范围会增大2尺。',
      },
      {
        奇穴名称: '诸怀',
        奇穴图片: 'https://icon.jx3box.com/icon/20281.png',
        id: '35733',
        奇穴描述:
          '施展“引风唤灵”时，自身获得一层“承契”。召唤兽和自身在“承契”期间基础攻击力提高10%，无视目标20%外功防御。',
      },
      {
        奇穴名称: '星烨',
        奇穴图片: 'https://icon.jx3box.com/icon/20278.png',
        id: '35763',
        奇穴描述:
          '“游雾乘云”需要2枚“唤灵印”方可施展，施展后清空全部“唤灵印”并重置调息时间，使当前全部箭矢获得“空弦惊雁”效果。期间“劲风簇”造成伤害提高150%。',
      },
      {
        奇穴名称: '片羽',
        奇穴图片: 'https://icon.jx3box.com/icon/20425.png',
        id: '36449',
        奇穴描述: '“风尽浮生”一段冲刺过程中，重置“白羽流星”并激活“没石饮羽”。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '佩弦',
        奇穴图片: 'https://icon.jx3box.com/icon/20298.png',
        id: '35751',
        奇穴描述:
          '“饮羽簇”无视目标65%外功防御，施展“金乌见坠”后下次施展“饮羽簇”无需运功，持续10秒。',
      },
      {
        奇穴名称: '祛邪',
        奇穴图片: 'https://icon.jx3box.com/icon/20301.png',
        id: '35760',
        奇穴描述: '释放“汇灵合契”时，补充箭袋至八枚，使当前全部箭矢获得“金乌见坠”、“空弦惊雁”。',
      },
      {
        奇穴名称: '白虹贯日',
        奇穴图片: 'https://icon.jx3box.com/icon/19598.png',
        id: '35765',
        奇穴描述:
          '蓄力2秒射出40尺的超远一箭，蓄力期间免疫控制效果，使被攻击的目标获得“贯穿”效果，初始为一层，每蓄力0.5秒增加一层“贯穿”效果，最多四层。',
      },
      {
        奇穴名称: '灼心',
        奇穴图片: 'https://icon.jx3box.com/icon/24425.png',
        id: '42469',
        奇穴描述:
          '“乘黄之威”存在期间，上弦星流术全部升级为对应的“白羽流星”强化招式。“没石饮羽”和“流矢雨集”的命中目标数量降低2个。<TALENT_CORE 42468 1>',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '沃焦',
        奇穴图片: 'https://icon.jx3box.com/icon/20304.png',
        id: '35728',
        奇穴描述:
          '“空弦惊雁”后20秒内下一次“劲风簇”若命中运功目标则使目标获得5秒“沃焦”效果：招式施展距离变为0尺，无法看到其他目标。(该招式视为沉默效果)',
      },
      {
        奇穴名称: '鹿蜀',
        奇穴图片: 'https://icon.jx3box.com/icon/20311.png',
        id: '35729',
        奇穴描述: '“偕行动物”离场时，自身获得“偕行动物”的“承契”。',
      },
      {
        奇穴名称: '反曲',
        奇穴图片: 'https://icon.jx3box.com/icon/20309.png',
        id: '35731',
        奇穴描述:
          '“饮羽簇”命中4层以上“贯穿”目标时，使没有<NounID 75>的目标获得一层<NounID 75>效果。',
      },
      {
        奇穴名称: '腾驾',
        奇穴图片: 'https://icon.jx3box.com/icon/20310.png',
        id: '35732',
        奇穴描述: '“游雾乘云”状态下施展“腾云”不再立刻解除骑乘，“腾云”变为两重充能招式。',
      },
      {
        奇穴名称: '于狩',
        奇穴图片: 'https://icon.jx3box.com/icon/20284.png',
        id: '35737',
        奇穴描述:
          '施展“没石饮羽”时获得一层“承契”。施展“没石饮羽”时若箭袋内箭矢数量为3-5，则引爆命中的非侠士造成1次额外伤害。',
      },
      {
        奇穴名称: '同渡',
        奇穴图片: 'https://icon.jx3box.com/icon/20285.png',
        id: '35740',
        奇穴描述:
          '“汇灵合契”期间，受治疗效果增加15%。对你释放治疗招式的治疗心法获得5秒“同渡”效果：招式施展距离增加20%，移动速度提高20%。',
      },
      {
        奇穴名称: '领胡',
        奇穴图片: 'https://icon.jx3box.com/icon/20269.png',
        id: '35742',
        奇穴描述: '“弛律召野”调息时间降低10秒，“偕行动物”造成伤害提高30%。',
      },
      {
        奇穴名称: '卢令',
        奇穴图片: 'https://icon.jx3box.com/icon/20268.png',
        id: '35745',
        奇穴描述: '身法提高10%，无双等级提高10%，内力回复提高20%。',
      },
      {
        奇穴名称: '命俦',
        奇穴图片: 'https://icon.jx3box.com/icon/23482.png',
        id: '35756',
        奇穴描述:
          '“弛律召野”将会额外召唤强击型“偕行动物”助战持续15秒。协同动物会每3秒出现一次并打击“弛律召野”的释放目标，直到释放一次白羽流星，协同动物便会转换打击目标为白羽流星的目标。',
      },
      {
        奇穴名称: '偕极',
        奇穴图片: 'https://icon.jx3box.com/icon/24424.png',
        id: '40238',
        奇穴描述:
          '“归平野”伤害提高20%，“汇灵合契”期间“归平野”冲刺次数无上限，“白羽流星”无调息时间。',
      },
      {
        奇穴名称: '狩印',
        奇穴图片: 'https://icon.jx3box.com/icon/24425.png',
        id: '40239',
        奇穴描述:
          '“霖集簇”、“流矢雨集”命中后会标记目标至多6层持续15秒的“狩印”，“乘黄”和“偕行动物”造成伤害时会引爆一层“狩猎标记”并且造成一次额外伤害。',
      },
      {
        奇穴名称: '随袭',
        奇穴图片: 'https://icon.jx3box.com/icon/20315.png',
        id: '42471',
        奇穴描述:
          '“乘黄之威”期间自身会心会效提高5%，触发“标鹄”后若目标为侠士且气血值低于10%则“乘黄”对其发动一次造成目标10%最大气血值的<NounID 101>。<TALENT_CORE 42468 1>',
      },
    ],
  },
]

export default 奇穴数据
