/**
 * 装备特效等级表现
 * 判断英雄精简、试炼精简、橙武特效
 */

/**
 * 副本特效增益表现
 * 暂无更多等级
 */
export const 获取副本特效增益表现 = (品级: number, 特效等级?: string | undefined) => {
  if (特效等级) {
    return +特效等级
  }
  return 品级 >= 36000 ? 3 : 品级 >= 33000 ? 2 : 1
}

/**
 * 试炼之地增益表现
 */
export const 试炼特效枚举 = [
  [23501, 24500], // 1
  [24501, 25500], // 2
  [25501, 28100], // 3
  [28101, 32000], // 4
  [32001, 35000], // 5 32500品
  [35001, 36000], // 6 35300品
  [36001, 38100], // 7 38100品
  [38101, 42440], // 8 41440品
]
export const 获取试炼之地增益表现 = (品级: number, 特效等级?: string | undefined) => {
  if (特效等级) {
    return +特效等级
  }
  const 表现索引 = 试炼特效枚举?.findIndex((range) => 品级 >= range[0] && 品级 <= range[1])
  return (表现索引 || 0) + 1
}

/**
 * 橙武特效等级表现
 */
const 品级对应特效等级枚举 = {
  12500: 99, // 12500没有神兵无双buff
  17100: 1,
  18300: 2,
  25950: 3,
  20750: 4,
  29575: 5,
  23650: 6,
  31625: 7,
  34375: 8,
  37125: 9,
  40500: 10,
  42500: 11,
}

export const 获取橙武特效等级表现 = (品级: number) => {
  return 品级对应特效等级枚举[品级]
}

/**
 * 小橙武特效等级表现
 */
const 品级对应小橙武特效等级枚举 = {
  24500: 1,
  27000: 2,
  29500: 3,
  32000: 4,
  35000: 5,
  39750: 6,
}

export const 获取小橙武特效等级表现 = (品级: number) => {
  return 品级对应小橙武特效等级枚举[品级]
}
