// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 月照连营 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '月照连营')
  static 回复怒气 = 0

  // 释放前怒气用于在左下角显示当前怒气，因为开启会显得界面比较乱，所以只作为自用。
  释放前怒气 = 0 // 释放前怒气自用标记-2026-04-18

  constructor(模拟循环) {
    super(模拟循环)

    月照连营.回复怒气 = 15
  }
  释放() {
    // 释放前怒气用于在左下角显示当前怒气，显示后界面比较乱，所以只作为自用。
    this.释放前怒气 = this.模拟循环.角色状态信息?.怒气 || 0 // 释放前怒气自用标记-2026-04-18

    const 月照连营可释放 = this.模拟循环.当前自身buff列表?.['月照连营可释放标记']?.当前层数

    if (月照连营可释放) {
      // 释放月照连营，移除月照标记，添加雁门迢递标记
      this.模拟循环.卸除buff?.({ 名称: '月照连营可释放标记', 对象: '自身', 卸除层数: 1 })
      this.模拟循环.添加buff?.({ 名称: '雁门迢递可释放标记', 对象: '自身', 新增层数: 1 })

      // 执行月照连营的释放逻辑
      // ... 月照连营的具体释放代码
    } else {
      return {
        可以释放: false,
      }
    }

    return { 可以释放: true }
  }
  命中() {
    // 月照连营伤害延迟0.5秒
    const 月照连营伤害延迟 = (this.模拟循环.当前时间 || 0) + 8
    this.模拟循环.添加待生效事件队列?.([
      {
        事件时间: 月照连营伤害延迟,
        事件名称: '月照连营伤害延迟',
        事件备注: { 技能名称: '月照连营' },
      },
    ])
  }
  月照连营伤害延迟() {
    this.触发伤害行为('月照连营')
    // 阵云破招是9级
    this.触发伤害行为('破', 1, [], undefined, false, 9)
  }
  造成伤害(索引) {}

  释放后() {
    this.触发回复怒气(月照连营.回复怒气, 月照连营.技能数据?.技能名称)
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武']),
    }
  }
  // 释放前怒气用于在左下角显示当前怒气，因为开启会显得界面比较乱，所以只作为自用。
  // 获取技能释放记录结果() {
  //   return {
  //     ...this.本次释放记录,
  //     伤害段数: this.释放前怒气,  // 释放前怒气自用标记-2026-04-18
  //   }
  // }
}

export default 月照连营
export const 月照连营类型 = typeof 月照连营
