// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 月照连营 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '月照连营')
  本次释放等级 = 1

  constructor(模拟循环) {
    super(模拟循环)
  }
  释放() {
    const 月照连营Buff = this.模拟循环.当前自身buff列表?.['可释放月照连营']
    const 月照连营可释放 = 月照连营Buff?.当前层数

    if (月照连营可释放) {
      this.本次释放等级 = 月照连营可释放
      // 释放月照连营，移除月照标记
      this.模拟循环.卸除buff?.({ 名称: '可释放月照连营', 对象: '自身', 卸除层数: 月照连营可释放 })
      this.模拟循环.添加buff?.({
        名称: '可释放雁门迢递',
        对象: '自身',
        新增层数: this.本次释放等级,
      })
      // }
    } else {
      return {
        可以释放: false,
        异常信息: '月照连营不可释放，缺少可释放月照连营',
      }
    }

    return { 可以释放: true }
  }
  命中() {
    // 月照连营伤害延迟0.5秒
    // 苍生铸世技改：伤害立即生效，注释保留
    // const 月照连营伤害延迟 = (this.模拟循环.当前时间 || 0) + 8
    // this.模拟循环.添加待生效事件队列?.([
    //   {
    //     事件时间: 月照连营伤害延迟,
    //     事件名称: '月照连营伤害延迟',
    //     事件备注: { 技能名称: '月照连营' },
    //   },
    // ])
  }
  // 月照连营伤害延迟() {
  //   // 后续招式等级由可释放Buff层数传递
  //   this.触发伤害行为('月照连营', 1, [], undefined, false, this.本次释放等级)
  // }
  造成伤害(索引) {
    this.触发伤害行为('月照连营', 1, [], undefined, false, this.本次释放等级)
  }

  释放后() {
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '威压', '橙武']),
    }
  }
  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
    }
  }
}

export default 月照连营
export const 月照连营类型 = typeof 月照连营
