import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '芳姿畅音',
        奇穴图片: 'https://icon.jx3box.com/icon/21962.png',
        id: '37316',
        奇穴描述:
          '将根据5秒内施展的下一个“猿公剑法”套路下招式产生不同的“留芳仙姿”，每携带一种“留芳仙姿”使自身最终伤害提高5%，“留芳仙姿”在战斗状态下持续25秒，持续时间内，自身施展对应“猿公剑法”后获得1点剑舞，命中目标造成伤害追加额外阴性内功伤害，触发该次阴性内功伤害视作施展“猿公剑法”套路下招式。',
      },
      {
        奇穴名称: '步生花',
        奇穴图片: 'https://icon.jx3box.com/icon/24407.png',
        id: '46198',
        奇穴描述:
          '对其他目标释放“水榭花盈”时，获得7秒“繁音急节”效果，自身下3次施展“猿公剑法”对目标6尺内最多5个目标造成与“急曲”层数相关的伤害。',
      },
      {
        奇穴名称: '剑心通明',
        奇穴图片: 'https://icon.jx3box.com/icon/901.png',
        id: '547',
        奇穴描述:
          '对目标造成<SKILL LunarDamage>点(+<SKILLEx {D0} {SkillLunarAP}>)阴性内功伤害，使其<BUFF 690 1 desc>，持续<BUFF 690 1 time>，并打断目标运功。',
      },
      {
        奇穴名称: '梦鲤拂波',
        奇穴图片: 'https://icon.jx3box.com/icon/25382.png',
        id: '42516',
        奇穴描述:
          '在目标点放置一个半径12尺的“鲤池”，持续5秒，使区域内最多5个敌方目标眩晕4秒，而后锦鲤游动，每0.5秒对区域内最多5个目标造成<SUB 42519 1>阴性内功伤害。<TALENT 42549 1 需要核心奇穴【梦鲤】“玳弦急曲”命中锦鲤池区域内的目标时，每跳使锦鲤额外攻击一次，该攻击只作用于施展“玳弦急曲”时选择的目标>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '枕上',
        奇穴图片: 'https://icon.jx3box.com/icon/4527.png',
        id: '5864',
        奇穴描述: '“猿公剑法”套路下招式会心后，自身加速率提高5%，无视目标50%内功防御，持续15秒。',
      },
      {
        奇穴名称: '疾光',
        奇穴图片: 'https://icon.jx3box.com/icon/23469.png',
        id: '25000',
        奇穴描述: '“急曲”持续伤害效果提高100%，“江海凝光”不再使其立刻生效。',
      },
      {
        奇穴名称: '成玉',
        奇穴图片: 'https://icon.jx3box.com/icon/886.png',
        id: '6558',
        奇穴描述:
          '“剑影留痕”命中目标附带一次“成玉”阴性伤害。成功击退目标后，使目标获得“成玉”效果：受到伤害提高10%，持续3秒。',
      },
      {
        奇穴名称: '繁姿',
        奇穴图片: 'https://icon.jx3box.com/icon/7460.png',
        id: '14727',
        奇穴描述: '阴性招式会心后，自身回复2%气血值。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '明空',
        奇穴图片: 'https://icon.jx3box.com/icon/23471.png',
        id: '38617',
        奇穴描述:
          '“剑破虚空”调息时间降低6秒，不再打断目标运功、不会使目标无法施展内功招式和施展轻功招式，获得的“剑舞长空”效果持续时间变为6秒，不再附带护盾，提高自身5%会心和20%会心效果。施展“剑气长江”后降低“剑破虚空”0.5秒调息时间。',
      },
      {
        奇穴名称: '广陵月',
        奇穴图片: 'https://icon.jx3box.com/icon/13413.png',
        id: '23935',
        奇穴描述:
          '施展“名动四方”后，可施展二段技能，6秒内每对目标造成一次伤害就额外造成<SUB 23936 1>阴性内功伤害，并提高自身4%的会心效果，最多叠加5层。',
      },
      {
        奇穴名称: '霜重',
        奇穴图片: 'https://icon.jx3box.com/icon/24984.png',
        id: '44357',
        奇穴描述:
          '<TALENT_CORE 46198 1>“剑破虚空”调息时间增加10秒，使当前目标无法施展内外功招式，持续3秒，但不再使目标无法施展轻功招式。',
      },
      {
        奇穴名称: '诉弦',
        奇穴图片: 'https://icon.jx3box.com/icon/25381.png',
        id: '42549',
        奇穴描述:
          '<TALENT_CORE 42516 1>“玳弦急曲”命中“鲤池”区域内的目标时，每跳使“锦鲤”额外攻击一次造成<SUB 42519 2>阴性内功伤害，该攻击只作用于施展“玳弦急曲”时选择的目标。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '流玉',
        奇穴图片: 'https://icon.jx3box.com/icon/19173.png',
        id: '34604',
        奇穴描述:
          '“剑影留痕”不再击退目标且调息时间增加至15秒，但施展距离提高十尺。命中目标后将使10秒内下一个“玳弦急曲”伤害提高90%，“繁音急节”效果期间施展则可作用于下两个“玳弦急曲”。',
      },
      {
        奇穴名称: '琼霄',
        奇穴图片: 'https://icon.jx3box.com/icon/905.png',
        id: '23457',
        奇穴描述:
          '“婆罗门”可触发“剑舞”状态，对自身10尺内的10个目标造成一次<SUB 506 27>阴性内功伤害并附带1层“急曲”不利效果，随后每秒造成<SUB 506 27>阴性内功伤害，持续20秒，无法在水中维持且移动后消失。',
      },
      {
        奇穴名称: '飞袂',
        奇穴图片: 'https://icon.jx3box.com/icon/9542.png',
        id: '18619',
        奇穴描述:
          '“水榭花盈”对其他目标释放时，调息时间降低10秒；释放后使自身免疫控制（击退和被拉除外），受到伤害降低25%，持续8秒。',
      },
      {
        奇穴名称: '耐夜',
        奇穴图片: 'https://icon.jx3box.com/icon/20077.png',
        id: '6572',
        奇穴描述:
          '“蝶弄足”充能时间降低35秒，免控时间延长2秒，并使下一个“江海凝光”引爆“急曲”时根据层数造成额外伤害，免控期间可激活二段招式：向前疾奔30尺，使路径上的10个目标附带“急曲”效果。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '新妆',
        奇穴图片: 'https://icon.jx3box.com/icon/4500.png',
        id: '5852',
        奇穴描述:
          '“玳弦急曲”每0.75秒造成一次阴性内功伤害，每跳附带45%额外伤害，完整运功后不再附带“急曲”效果，持续2.25秒。',
      },
      {
        奇穴名称: '珑韵',
        奇穴图片: 'https://icon.jx3box.com/icon/4509.png',
        id: '5854',
        奇穴描述:
          '“玳弦急曲”立即造成<SUB 18814 1>阴性内功伤害，运功不被打退，能够对目标周围8尺范围内的额外5个目标造成伤害。',
      },
      {
        奇穴名称: '灼桃',
        奇穴图片: 'https://icon.jx3box.com/icon/11878.png',
        id: '21936',
        奇穴描述:
          '“剑气长江”附带1层“急曲”，命中附带“急曲”的目标时，每层“急曲”使该次“剑气长江”会心与会心效果提高10%并使下两跳“急曲”立刻生效。',
      },
      {
        奇穴名称: '剑转流云',
        奇穴图片: 'https://icon.jx3box.com/icon/906.png',
        id: '563',
        奇穴描述: '卸除目标阴性、混元性、阳性、毒性内功气劲各两个。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '霜降',
        奇穴图片: 'https://icon.jx3box.com/icon/24411.png',
        id: '14705',
        奇穴描述:
          '“玳弦急曲”消耗全部剑舞点数，每消耗1点剑舞会增加一跳伤害并使本次“玳弦急曲”受攻击加成提高10%。完整运功后对非侠士目标造成3次基于跳数的阴性内功伤害。',
      },
      {
        奇穴名称: '轻妒',
        奇穴图片: 'https://icon.jx3box.com/icon/7253.png',
        id: '14715',
        奇穴描述: '“繁音急节”变为2层充能技能，50秒充能时间。',
      },
      {
        奇穴名称: '霜天剑泠',
        奇穴图片: 'https://icon.jx3box.com/icon/11419.png',
        id: '21166',
        奇穴描述:
          '释放剑气攻击，使目标获得一层“急曲”效果，6秒内每0.25秒对目标造成<SUB 21170 1>阴性内功伤害并使目标受到的“急曲”伤害提高5%，最多60%，持续6秒，目标离开自身16尺则挣脱剑气攻击。',
      },
      {
        奇穴名称: '合璧知意',
        奇穴图片: 'https://icon.jx3box.com/icon/17703.png',
        id: '32636',
        奇穴描述:
          '一段招式“江海凝波剑”：在敌方目标6尺范围内形成一个6秒的“凝波”区域，每秒为区域内最多3个敌对目标造成阴性内功伤害并添加一层<NounID 164>效果，施展后激活二段招式<NounID 165>。区域结束时对区域内最多3个敌对目标造成阴性内功伤害，<NounID 164>层数越高，此伤害越高，达到8层时额外造成一次<SUB 44573 0>阴性内功伤害。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '化冰',
        奇穴图片: 'https://icon.jx3box.com/icon/898.png',
        id: '24996',
        奇穴描述:
          '“心鼓弦”不再附带救治重伤目标的效果，调息时间降低为30秒，可以对自身施展，使得自身获得“化冰”气劲，无双等级提高30%，且施展“玳弦急曲”命中目标将额外造成<SUB 24999 0>阴性内功伤害，持续3分钟。',
      },
      {
        奇穴名称: '盈袖',
        奇穴图片: 'https://icon.jx3box.com/icon/13416.png',
        id: '24995',
        奇穴描述:
          '“玳弦急曲”每跳使当前目标获得1层“急曲”效果，若命中带有6层“急曲”效果的目标，使对方获得1层“盈袖”效果，其余“猿公剑法”招式与“江海凝光”命中目标会消耗一层“盈袖”并造成伤害，最多可叠加6层。',
      },
      {
        奇穴名称: '钗燕',
        奇穴图片: 'https://icon.jx3box.com/icon/11883.png',
        id: '22732',
        奇穴描述:
          '连续使用3次不同的“猿公剑法”套路招式或“江海凝光”命中目标，将对目标额外造成<SUB 30532 0>阴性内功伤害，并附带一层“急曲”效果。',
      },
      {
        奇穴名称: '冥泽',
        奇穴图片: 'https://icon.jx3box.com/icon/2955.png',
        id: '6567',
        奇穴描述:
          '若自身气血值低于1%，解除自身控制效果，使自身外功闪避几率提高100%并抵御受到的伤害，持续3秒，该效果最多每2分45秒触发1次。',
      },
      {
        奇穴名称: '寒雨',
        奇穴图片: 'https://icon.jx3box.com/icon/27488.png',
        id: '18620',
        奇穴描述: '“水榭花盈”对目标及踩踏的目标，定身5秒，并使其封轻功4秒。',
      },
      {
        奇穴名称: '悲秋',
        奇穴图片: 'https://icon.jx3box.com/icon/4572.png',
        id: '5866',
        奇穴描述:
          '“帝骖龙翔”、“雷霆震怒”调息时间降低50%，若命中后未成功控制目标则使目标4秒内无法施展轻功。',
      },
      {
        奇穴名称: '缠竹',
        奇穴图片: 'https://icon.jx3box.com/icon/9541.png',
        id: '18468',
        奇穴描述:
          '“雷霆震怒”调息时间增加30秒，持续时间缩短至4秒。若目标为敌方，则需运功1.5秒施展，眩晕持续期间，目标可以受到伤害效果。若目标为友方，使友方在眩晕期间免受其他控制效果影响。',
      },
      {
        奇穴名称: '玉骨',
        奇穴图片: 'https://icon.jx3box.com/icon/906.png',
        id: '6907',
        奇穴描述: '施展“鹊踏枝”不再获得外功闪避效果，但使自身受到的伤害降低50%，持续6秒。',
      },
      {
        奇穴名称: '玉素',
        奇穴图片: 'https://icon.jx3box.com/icon/9540.png',
        id: '18202',
        奇穴描述:
          '“江海凝光”会心提高10%，可延长“急曲”效果至最大持续时间，并额外作用于目标10尺内5个目标。当命中不少于3个目标时，“江海凝光”伤害提高100%。',
      },
      {
        奇穴名称: '倾城',
        奇穴图片: 'https://icon.jx3box.com/icon/1497.png',
        id: '5882',
        奇穴描述: '“剑舞”状态下自身受到的伤害降低15%，移动速度增加10%。',
      },
      {
        奇穴名称: '闻月',
        奇穴图片: 'https://icon.jx3box.com/icon/20076.png',
        id: '36013',
        奇穴描述:
          '施展“天地低昂”使得自身回复15%气血值，受到伤害降低55%，持续10秒，此效果不会被卸除，持续时长不受秘籍影响。',
      },
      {
        奇穴名称: '朝露',
        奇穴图片: 'https://icon.jx3box.com/icon/1492.png',
        id: '6779',
        奇穴描述: '“剑舞”期间提高自身5%阴性基础攻击力，施展“鹊踏枝”返还5秒“剑影留痕”调息时间。',
      },
    ],
  },
]

export default 奇穴数据
