import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'

class 太白蚀昴 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '太白蚀昴')
  static 作用间隔帧 = 8
  static 作用次数 = 6

  constructor(模拟循环) {
    super(模拟循环)
    太白蚀昴.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '太白蚀昴')
    this.初始化技能运行数据()
  }

  // 顺序不可随意更改
  命中() {
    // 直接简单粗暴记录6次太白伤害，误差不大
    for (let i = 1; i <= 太白蚀昴.作用次数; i++) {
      this.触发伤害行为('太白蚀昴')
      this.保存释放记录('太白蚀昴')
    }
  }

  // 添加太白蚀昴队列() {
  //   const 待生效事件队列: 待生效事件[] = []
  //   for (let i = 1; i <= 太白蚀昴.作用次数; i++) {
  //     待生效事件队列.push({
  //       事件名称: '太白蚀昴',
  //       事件时间: this.模拟循环.当前时间 + 太白蚀昴.作用间隔帧 * i,
  //       事件备注: {
  //         技能名称: '太白蚀昴',
  //       },
  //     })
  //   }
  //   this.模拟循环.添加待生效事件队列(待生效事件队列)
  // }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表([
        '荧入白',
        '祝祷',
        '鬼遁',
        '镇星',
        '明灯',
        '龙马出河',
      ]),
      特殊标记: 太白蚀昴.作用次数,
    }
  }
}

export default 太白蚀昴

export const 太白蚀昴类型 = typeof 太白蚀昴
