import { 属性类型 } from '@/@types/属性'
import { 阵眼数据类型 } from '../interface'
import 通用阵眼数据 from '../通用'

const 内功阵眼数据: 阵眼数据类型[] = [
  {
    阵眼名称: '无相阵',
    阵眼标题: '无相阵',
    增益集合: [
      // { 属性: 属性类型.内功会心百分比, 值: 0.03 },
      { 属性: 属性类型.郭氏内功会心效果等级, 值: 51 },
      { 属性: 属性类型.郭氏内功破防等级, 值: 102 },
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51, 触发型增益: true },
    ],
    覆盖率: 100,
    图标: 'https://icon.jx3box.com/icon/25442.png',
  },
  {
    阵眼名称: '段氏阵',
    阵眼标题: '段氏阵(胧雾)',
    // 过滤心法: '周天功',
    增益集合: [
      { 属性: 属性类型.破招值, 值: 2666 },
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      // { 属性: 属性类型.全会心百分比, 值: 0.05 },
      { 属性: 属性类型.通用增伤, 值: (62 / 1024) * 0.87, 触发型增益: true },
    ],
    覆盖率: 87,
    说明: '由于4阵计算问题，周天功心法"模拟"循环请勿选择词阵',
    图标: 'https://icon.jx3box.com/icon/23441.png',
  },
  {
    阵眼名称: '段氏阵(一阳)',
    // 过滤心法: '周天功',
    增益集合: [
      { 属性: 属性类型.破招值, 值: 2666 },
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      // { 属性: 属性类型.全会心百分比, 值: 0.05 },
      { 属性: 属性类型.通用增伤, 值: (62 / 1024) * 0.99, 触发型增益: true },
    ],
    覆盖率: 99,
    说明: '由于4阵计算问题，周天功心法"模拟"循环请勿选择词阵',
    图标: 'https://icon.jx3box.com/icon/23441.png',
  },
  {
    阵眼名称: '段氏阵(快照)',
    所属心法: '周天功',
    增益集合: [
      { 属性: 属性类型.破招值, 值: 2666 },
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      { 属性: 属性类型.全会心百分比, 值: 0.05 },
    ],
    说明: '4阵按模拟器的快照计算，循环内无对应buff不会触发对应增伤',
    图标: 'https://icon.jx3box.com/icon/23441.png',
  },
  {
    阵眼名称: '冰心阵',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 50 },
      { 属性: 属性类型.郭氏内功会心效果等级, 值: 51 },
      { 属性: 属性类型.郭氏内功基础攻击, 值: 50, 触发型增益: true },
    ],
    图标: 'https://icon.jx3box.com/icon/1800.png',
  },
  {
    阵眼名称: '花间阵',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      { 属性: 属性类型.郭氏内功破防等级, 值: 300 },
    ],
    图标: 'https://icon.jx3box.com/icon/1806.png',
  },
  {
    阵眼名称: '莫问阵',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 102 },
      { 属性: 属性类型.郭氏额外无双, 值: 20 },
    ],
    图标: 'https://icon.jx3box.com/icon/7047.png',
  },
  {
    阵眼名称: '易筋阵',
    阵眼标题: '易筋阵',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      { 属性: 属性类型.郭氏额外无双, 值: 20 },
      { 属性: 属性类型.郭氏内功破防等级, 值: 102 },
      { 属性: 属性类型.郭氏内功基础攻击, 值: 21 * 5 * 0.97, 触发型增益: true }, // 阵眼施展“守缺式”，则小队成员内功基础攻击力提高2%，最多叠加5层
    ],
    覆盖率: 97,
    图标: 'https://icon.jx3box.com/icon/1802.png',
  },
  {
    阵眼名称: '气纯阵',
    增益集合: [{ 属性: 属性类型.郭氏额外无双, 值: 20 }],
    图标: 'https://icon.jx3box.com/icon/1797.png',
  },
  {
    阵眼名称: '毒经阵',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      { 属性: 属性类型.郭氏内功破防等级, 值: 102 * 0.5, 触发型增益: true }, // 阵眼施展“蝎心”，则小队成员内功破防提高10%，持续5秒。
    ],
    覆盖率: 50,
    图标: 'https://icon.jx3box.com/icon/2714.png',
  },
  {
    阵眼名称: '天罗阵',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      { 属性: 属性类型.郭氏全无视防御, 值: 52 },
      { 属性: 属性类型.郭氏全会心效果等级, 值: 150 },
      { 属性: 属性类型.全会心百分比, 值: 0.05, 触发型增益: true }, // 第五层阵眼-1覆盖率按:100%算
    ],
    图标: 'https://icon.jx3box.com/icon/3152.png',
  },
  {
    阵眼名称: '天罗阵(阵眼)',
    所属心法: '天罗诡道',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      { 属性: 属性类型.郭氏全无视防御, 值: 52 },
      { 属性: 属性类型.郭氏全会心效果等级, 值: 150 },
      { 属性: 属性类型.全会心百分比, 值: 0.05, 触发型增益: true }, // 第五层阵眼-1覆盖率按:100%算
      { 属性: 属性类型.郭氏额外无双, 值: 20, 触发型增益: true }, // 第五层阵眼-1覆盖率按:100%算
    ],
    图标: 'https://icon.jx3box.com/icon/3152.png',
  },
  {
    阵眼名称: '焚影阵',
    增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 51 }],
    图标: 'https://icon.jx3box.com/icon/3878.png',
    // 全团6个人随机吃，大概7秒钟打一个，打一次5Buff持续5秒
  },
  {
    阵眼名称: '衍天阵',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      { 属性: 属性类型.郭氏额外无双, 值: 20 },
    ],
    图标: 'https://icon.jx3box.com/icon/14159.png',
  },
  {
    阵眼名称: '无方阵',
    增益集合: [
      { 属性: 属性类型.郭氏内功基础攻击, 值: 51 },
      { 属性: 属性类型.通用增伤, 值: 31 / 1024 },
      { 属性: 属性类型.全会心百分比, 值: 0.03 },
    ],
    图标: 'https://icon.jx3box.com/icon/15642.png',
  },
  {
    阵眼名称: '剑纯阵',
    增益集合: [
      { 属性: 属性类型.外功会心百分比, 值: 0.03 },
      { 属性: 属性类型.郭氏额外无双, 值: 20 },
      { 属性: 属性类型.郭氏外功会心效果等级, 值: 150 },
      // { 属性: 属性类型.外功会心百分比, 值: 0.05, 触发型增益: true }, // 第五层阵眼-技能会心1%5层-覆盖率:100%
      { 属性: 属性类型.外功会心百分比, 值: 0.05 * 0.92, 触发型增益: true }, // 第五层阵眼-技能会心1%5层-覆盖率:100%（听说130级叠满要40秒 按0.92算）
    ],
    图标: 'https://icon.jx3box.com/icon/1798.png',
  },
  ...通用阵眼数据,
]

export default 内功阵眼数据
