import { 属性类型 } from '@/@types/属性'
import { 小药小吃数据类型 } from '@/@types/小药小吃'
import { 小吃类型枚举 } from '@/@types/枚举'
import 通用小药小吃数据 from '../通用'

const 外功小药小吃数据: 小药小吃数据类型[] = [
  {
    小吃名称: '风语·中品亢龙散（外攻）',
    小吃部位: 小吃类型枚举.药品增强,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/4303.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 1002 }],
  },
  {
    小吃名称: '风语·上品亢龙散（外攻）',
    小吃部位: 小吃类型枚举.药品增强,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/4302.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 2005 }],
  },
  {
    小吃名称: '炼气·秘境·增（外攻）',
    小吃部位: 小吃类型枚举.药品增强,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/4516.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 223 }],
  },
  {
    小吃名称: '风语·中品轻身丹（身法）',
    小吃部位: 小吃类型枚举.药品辅助,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/4275.png',
    增益集合: [{ 属性: 属性类型.身法, 值: 473 }],
  },
  {
    小吃名称: '风语·上品轻身丹（身法）',
    小吃部位: 小吃类型枚举.药品辅助,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/4274.png',
    增益集合: [{ 属性: 属性类型.身法, 值: 946 }],
  },
  {
    小吃名称: '风语·中品大力丸（力道）',
    小吃部位: 小吃类型枚举.药品辅助,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/1365.png',
    增益集合: [{ 属性: 属性类型.力道, 值: 473 }],
  },
  {
    小吃名称: '风语·上品大力丸（力道）',
    小吃部位: 小吃类型枚举.药品辅助,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/1364.png',
    增益集合: [{ 属性: 属性类型.力道, 值: 946 }],
  },
  {
    小吃名称: '风语·煎饼果子（外攻）',
    小吃部位: 小吃类型枚举.食品增强,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/548.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 779 }],
  },
  {
    小吃名称: '风语·太后饼（外攻）',
    小吃部位: 小吃类型枚举.食品增强,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/7531.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 1559 }],
  },
  {
    小吃名称: '强身·秘境·增（外攻）',
    小吃部位: 小吃类型枚举.食品增强,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/4525.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 173 }],
  },
  {
    小吃名称: '风语·杂碎汤（身法）',
    小吃部位: 小吃类型枚举.食品辅助,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/10000.png',
    增益集合: [{ 属性: 属性类型.身法, 值: 368 }],
  },
  {
    小吃名称: '风语·杂锦鱼球粥（身法）',
    小吃部位: 小吃类型枚举.食品辅助,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/9989.png',
    增益集合: [{ 属性: 属性类型.身法, 值: 736 }],
  },
  {
    小吃名称: '风语·三鲜汤（力道）',
    小吃部位: 小吃类型枚举.食品辅助,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/7533.png',
    增益集合: [{ 属性: 属性类型.力道, 值: 368 }],
  },
  {
    小吃名称: '风语·三鲜粥（力道）',
    小吃部位: 小吃类型枚举.食品辅助,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/9996.png',
    增益集合: [{ 属性: 属性类型.力道, 值: 736 }],
  },
  {
    小吃名称: '风语·瀑沙磨石（外攻）',
    小吃部位: 小吃类型枚举.武器磨石,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/7601.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 669 }],
  },
  {
    小吃名称: '风语·瀑沙熔锭（外攻）',
    小吃部位: 小吃类型枚举.武器磨石,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/7595.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 1337 }],
  },
  {
    小吃名称: '汾酒·旬又三（力道）',
    小吃部位: 小吃类型枚举.家园酒品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/88.png',
    增益集合: [{ 属性: 属性类型.力道, 值: 544 }],
  },
  {
    小吃名称: '关外白酒·旬又三（身法）',
    小吃部位: 小吃类型枚举.家园酒品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/1396.png',
    增益集合: [{ 属性: 属性类型.身法, 值: 544 }],
  },
  {
    小吃名称: '风语·葫芦叫花鸡（外攻）',
    小吃部位: 小吃类型枚举.家园菜品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/7646.png',
    增益集合: [{ 属性: 属性类型.外功基础攻击, 值: 1084 }],
  },
  {
    小吃名称: '风语·玉笛谁家听落梅',
    小吃部位: 小吃类型枚举.团队宴席,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/9407.png',
    增益集合: [
      { 属性: 属性类型.外功基础攻击, 值: 891 },
      { 属性: 属性类型.全会心等级, 值: 3280 },
      { 属性: 属性类型.破招值, 值: 3280 },
    ],
  },
  {
    小吃名称: '创意料理（-气血+攻击）',
    小吃部位: 小吃类型枚举.家园菜品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/549.png',
    增益集合: [
      { 属性: 属性类型.外功基础攻击, 值: 1952 },
      { 属性: 属性类型.额外气血上限, 值: -47900 },
    ],
  },
  ...通用小药小吃数据,
]

export default 外功小药小吃数据
