import { 属性类型 } from '@/@types/属性'
import { 小药小吃数据类型 } from '@/@types/小药小吃'
import { 小吃类型枚举 } from '@/@types/枚举'
import 通用小药小吃数据 from '../通用'

const 外功小药小吃数据: 小药小吃数据类型[] = [
  ...通用小药小吃数据,
  {
    小吃名称: '苍生·瀑沙焠晶（武伤）',
    小吃部位: 小吃类型枚举.武器磨石,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/7595.png',
    增益集合: [{ 属性: 属性类型.武器伤害, 值: 22 }],
  },
  {
    小吃名称: '苍生·瀑沙熔锭（武伤）',
    小吃部位: 小吃类型枚举.武器磨石,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/7595.png',
    增益集合: [{ 属性: 属性类型.武器伤害, 值: 18 }],
  },
  {
    小吃名称: '汾酒·旬又三（力道）',
    小吃部位: 小吃类型枚举.家园酒品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/88.png',
    增益集合: [{ 属性: 属性类型.力道, 值: 92 }],
  },
  {
    小吃名称: '关外白酒·旬又三（身法）',
    小吃部位: 小吃类型枚举.家园酒品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/1396.png',
    增益集合: [{ 属性: 属性类型.身法, 值: 92 }],
  },
  {
    小吃名称: '巴山夜雨宴',
    小吃部位: 小吃类型枚举.团队宴席,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/9407.png',
    增益集合: [
      { 属性: 属性类型.无双等级, 值: 72 },
      { 属性: 属性类型.全会心等级, 值: 72 },
      { 属性: 属性类型.外功基础攻击, 值: 72 },
    ],
  },
  {
    小吃名称: '华岳开锋宴',
    小吃部位: 小吃类型枚举.团队宴席,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/9407.png',
    增益集合: [
      { 属性: 属性类型.无双等级, 值: 90 },
      { 属性: 属性类型.全会心等级, 值: 90 },
      { 属性: 属性类型.外功基础攻击, 值: 90 },
    ],
  },
]

export default 外功小药小吃数据
