import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '浮生',
        奇穴图片: 'https://icon.jx3box.com/icon/9530.png',
        id: '18679',
        奇穴描述:
          '“六合独尊”运功1.5秒之后，在目标点形成“八方剑域”效果，区域内最多6个目标每0.6秒受到<SUB 18670 31>混元性内功伤害，并降低80%移动速度，“八方剑域”持续3秒，同时命中多个玩家时则伤害递减，最多递减50%。',
      },
      {
        奇穴名称: '剑出鸿蒙',
        奇穴图片: 'https://icon.jx3box.com/icon/17174.png',
        id: '44519',
        奇穴描述:
          '“五方行尽”命中目标后在其上空生成“古剑”，若成功控制目标则升级为“鸿蒙古剑”，1.5秒后对该位置10尺范围内3个目标造成伤害。若目标已被自身“古剑”、“鸿蒙古剑”命中则伤害降低25%。',
      },
      {
        奇穴名称: '若冲',
        奇穴图片: 'https://icon.jx3box.com/icon/16194.png',
        id: '26684',
        奇穴描述: '“太极无极”不再续气，调息时间提高至9秒，每道剑气都将造成混元性内功伤害。',
      },
      {
        奇穴名称: '洞渊',
        奇穴图片: 'https://icon.jx3box.com/icon/2928.png',
        id: '18694',
        奇穴描述:
          '“飞剑”不再主动飞出。“四象轮回”运功时间减少0.5秒。“两仪化形”命中敌人时，将根据消耗气点数驱动飞剑打击敌人，造成额外伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '同尘',
        奇穴图片: 'https://icon.jx3box.com/icon/4516.png',
        id: '5819',
        奇穴描述:
          '“六合独尊”需要目标施展，施展后“八方剑域”将附着于敌人身上，每次攻击使下一击造成的伤害额外提高50%，命中定身、眩晕的目标时，伤害额外提高10%。<TALENT_CORE 18679 1>',
      },
      {
        奇穴名称: '八卦洞玄',
        奇穴图片: 'https://icon.jx3box.com/icon/1441.png',
        id: '370',
        奇穴描述:
          '打断目标运功并对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元内功伤害，使目标3.5秒内无法施展内功招式。“紫气东来”期间施展该技能，效果提升至5秒。<TALENT_CORE 18694 1>',
      },
      {
        奇穴名称: '穹隆化生',
        奇穴图片: 'https://icon.jx3box.com/icon/14083.png',
        id: '24955',
        奇穴描述:
          '自身将向前冲刺，持续2秒，可以转向，结束后在脚下生成“生太极”气场，并回复自身10%的最大气血值。',
      },
      {
        奇穴名称: '规焉',
        奇穴图片: 'https://icon.jx3box.com/icon/7492.png',
        id: '14837',
        奇穴描述:
          '受到伤害未重伤状态下自身气血值低于40%，则清除自身“化生势”效果并立刻重置“镇山河”调息时间，该效果最多每2分钟触发一次。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '霜寒',
        奇穴图片: 'https://icon.jx3box.com/icon/4570.png',
        id: '6904',
        奇穴描述: '“镇山河”调息时间降低2分钟，效果只作用于自身，施展“镇山河”时清除自身“化生势”。',
      },
      {
        奇穴名称: '无外',
        奇穴图片: 'https://icon.jx3box.com/icon/28313.png',
        id: '34580',
        奇穴描述:
          '施展“万世不竭·二段”时不再使飞剑消失，而是消耗其15秒持续时间，并根据施展时飞剑剩余时间造成额外伤害。',
      },
      {
        奇穴名称: '解牛',
        奇穴图片: 'https://icon.jx3box.com/icon/2929.png',
        id: '5802',
        奇穴描述: '对被定身、锁足、眩晕的目标伤害提高35%。',
      },
      {
        奇穴名称: '跬步',
        奇穴图片: 'https://icon.jx3box.com/icon/9533.png',
        id: '18695',
        奇穴描述:
          '“万世不竭”运功时间降低0.5秒，每存在一柄“气剑”，“四象轮回”“两仪化形”“万世不竭”伤害提高5%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '玄延',
        奇穴图片: 'https://icon.jx3box.com/icon/27487.png',
        id: '38516',
        奇穴描述:
          '“六合独尊”变为充能招式，“紫气东来”期间无需运功即可施展。“八方剑域”每次造成伤害时将定身范围内的敌人0.75秒。<TALENT_CORE 18679 1>',
      },
      {
        奇穴名称: '自化',
        奇穴图片: 'https://icon.jx3box.com/icon/4552.png',
        id: '14836',
        奇穴描述:
          '“万世不竭”一段“气剑”会随机攻击自身20尺内的目标，命中目标有25%几率为目标添加“气竭”效果，持续5秒。自身任何招式命中带有“气竭”效果的目标将引爆造成6尺范围<SUB 20955 0>混元性内功伤害，该效果2秒内对同一目标只生效一次。',
      },
      {
        奇穴名称: '归元',
        奇穴图片: 'https://icon.jx3box.com/icon/11859.png',
        id: '23614',
        奇穴描述: '“破苍穹”变为无调息时间，只对自己生效，处于“破苍穹”期间自身无视目标60%内功防御。',
      },
      {
        奇穴名称: '太牢',
        奇穴图片: 'https://icon.jx3box.com/icon/2941.png',
        id: '5828',
        奇穴描述: '施展“四象轮回”后10秒内下一个“两仪化形”伤害提高30%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '长生',
        奇穴图片: 'https://icon.jx3box.com/icon/11854.png',
        id: '42934',
        奇穴描述:
          '施展气场后额外回复1格气，成功运功施展气场，则使下一个“生太极”气场无需运功。当自身“生太极”气场被引爆时，重置招式“生太极”调息时间。',
      },
      {
        奇穴名称: '有涯',
        奇穴图片: 'https://icon.jx3box.com/icon/1438.png',
        id: '6798',
        奇穴描述:
          '“七星拱瑞”产生的“揣锐”效果调整至5秒，施展距离提高2尺，成功定身目标后获得3秒“紫气东来”效果，并降低“六合独尊”4秒调息时间。<TALENT_CORE 18679 1>',
      },
      {
        奇穴名称: '经首',
        奇穴图片: 'https://icon.jx3box.com/icon/13387.png',
        id: '40824',
        奇穴描述:
          '成功运功施展“四象轮回”命中侠士目标将减少“紫气东来”4秒调息时间。<TALENT_CORE 18694 1>',
      },
      {
        奇穴名称: '心固',
        奇穴图片: 'https://icon.jx3box.com/icon/2023.png',
        id: '5823',
        奇穴描述: '“四象轮回”可移动施展，运功时间减少0.25秒，命中目标时额外获得1.5格气。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '不竭',
        奇穴图片: 'https://icon.jx3box.com/icon/25374.png',
        id: '42301',
        奇穴描述:
          '对气场中心10尺范围内最多5名敌人造成<SUB 32402 0>伤害并定身3秒，强化自身气场所有气场5秒，每秒对最多5个敌方目标造成<SUB 32414 0>混元性内功伤害，场上每存在一个气场将每秒回复自身一格气。<TALENT_CORE 18694 1>',
      },
      {
        奇穴名称: '固本',
        奇穴图片: 'https://icon.jx3box.com/icon/7475.png',
        id: '14613',
        奇穴描述:
          '“紫气东来”调息时间降低18秒，施展“紫气东来”后立刻获得5柄“万世不竭·气剑”，持续期间额外提高30%无双等级。',
      },
      {
        奇穴名称: '际地蟠天',
        奇穴图片: 'https://icon.jx3box.com/icon/20069.png',
        id: '36099',
        奇穴描述:
          '对目标造成<SUB 36102 2>混元性内功伤害，若目标血量高于70%，则该招式必定会心，施展“六合独尊”后重置该招式调息时间。<TALENT_CORE 18679 1>',
      },
      {
        奇穴名称: '六爻有兆',
        奇穴图片: 'https://icon.jx3box.com/icon/16195.png',
        id: '46597',
        奇穴描述:
          '延迟2秒后，对目标点10尺范围内最多3名敌对玩家造成<SUB 34633 1>混元性内功伤害并添加“行兆”效果，持续8秒。自身对拥有“行兆”效果的目标造成控制和封内效果时，会为30尺内拥有自身“行兆”效果的敌人添加同样的效果。“四象轮回”“两仪化形”命中有“行兆”目标时对其他有“行兆”效果的目标再造成一次伤害。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '抱一',
        奇穴图片: 'https://icon.jx3box.com/icon/631.png',
        id: '22703',
        奇穴描述: '“坐忘无我”可额外透支使用一次。',
      },
      {
        奇穴名称: '不移',
        奇穴图片: 'https://icon.jx3box.com/icon/2932.png',
        id: '5830',
        奇穴描述: '“凭虚御风”闪避效果额外提高15%，持续时间增加3秒。',
      },
      {
        奇穴名称: '羽化',
        奇穴图片: 'https://icon.jx3box.com/icon/11855.png',
        id: '21712',
        奇穴描述:
          '“九转归一”变为2层充能招式，调息时间增加3秒，击退中的目标如果碰撞障碍并成功眩晕后则造成<SUB 21716 1>混元性内功伤害。',
      },
      {
        奇穴名称: '定心',
        奇穴图片: 'https://icon.jx3box.com/icon/27090.png',
        id: '24953',
        奇穴描述:
          '“五方行尽”调息时间增加3秒，锁足效果变成定身效果，控制时间降低至5秒，受到伤害不再提前结束定身效果。',
      },
      {
        奇穴名称: '临风',
        奇穴图片: 'https://icon.jx3box.com/icon/625.png',
        id: '6796',
        奇穴描述: '“紫气东来”期间运功不会被打退、打断，不受缴械和无法运功效果的影响，持续10秒。',
      },
      {
        奇穴名称: '心眼',
        奇穴图片: 'https://icon.jx3box.com/icon/2943.png',
        id: '5844',
        奇穴描述:
          '“镇山河”效果范围提高至6尺，受到无法施展内功招式和缴械效果时也可以施展，自身若处于“镇山河”当中，每秒将恢复自身5%气血最大值。',
      },
      {
        奇穴名称: '破势',
        奇穴图片: 'https://icon.jx3box.com/icon/13384.png',
        id: '24945',
        奇穴描述:
          '“镇山河”替换为“破势”。被动效果：“万世不竭”对非侠士目标造成的伤害提高130%。主动效果：消耗5把飞剑召唤鸿蒙巨剑，持续10秒。10秒内再次施展可召唤巨剑打击目标6尺范围内敌人，最多3次，该伤害对非侠士目标提高200%。',
      },
      {
        奇穴名称: '玄通',
        奇穴图片: 'https://icon.jx3box.com/icon/27085.png',
        id: '18798',
        奇穴描述:
          '“九转归一”施展距离增加8尺，成功击退敌人时，使其无法施展轻功招式，持续3秒。<TALENT_CORE 18679 1>',
      },
      {
        奇穴名称: '散华',
        奇穴图片: 'https://icon.jx3box.com/icon/27086.png',
        id: '44496',
        奇穴描述:
          '“太极无极”每道剑气造成伤害时将向20尺范围内敌人扩散并造成<SUB 44497 0>混元性内功伤害，命中被自身“定身”“眩晕”的目标，额外造成<SUB 44507 0>内功伤害，并使其“定身”“眩晕”时间减少1秒，最多弹射6次。',
      },
      {
        奇穴名称: '无我',
        奇穴图片: 'https://icon.jx3box.com/icon/620.png',
        id: '5813',
        奇穴描述:
          '“坐忘无我”调息时间提高50秒，持续时间降低至8秒，化解自身气血最大值50%伤害，每秒恢复自身4%最大气血值，该护盾不受卸除影响。',
      },
      {
        奇穴名称: '正气',
        奇穴图片: 'https://icon.jx3box.com/icon/18284.png',
        id: '32411',
        奇穴描述:
          '“五方行尽”调息时间提高5秒，施展时若目标点存在气场“破苍穹”则会吞噬“破苍穹”气场产生6秒“颠越苍穹”，“颠越苍穹”每秒对8尺内5个敌对目标造成<SUB 36438 1>混元性内功伤害，该伤害命中非侠士目标时额外提高420%，若“颠越苍穹”被自身“五方行尽”“六合独尊”命中则额外触发一次伤害，最多触发5次。',
      },
      {
        奇穴名称: '抱阳',
        奇穴图片: 'https://icon.jx3box.com/icon/7422.png',
        id: '14834',
        奇穴描述:
          '“破苍穹”气场持续时间增加12秒，对自身的增益效果提高100%，范围内施展“四象轮回”“两仪化形”会使飞剑持续时间增加6秒，至多50秒。',
      },
    ],
  },
]

export default 奇穴数据
