import 特效统一类 from '../特效统一类'
import { ERROR_ACTION } from '../../../utils'

class 附灵煌符 extends 特效统一类 {
  释放() {
    if (
      !this.模拟循环.当前自身buff列表['凤凰']?.当前层数 ||
      !this.模拟循环.当前自身buff列表['凤凰起符']?.当前层数 ||
      this.模拟循环.角色状态信息.凤凰已施符
    ) {
      return { 可以释放: false, 异常信息: ERROR_ACTION.BUFF错误 }
    }
    return { 可以释放: true }
  }

  命中() {
    this.模拟循环.角色状态信息.凤凰已施符 = true
    this.模拟循环.添加buff({ 名称: '附灵·煌符', 对象: '自身' })
    this.本次释放记录 = { 实际伤害技能: '附灵·煌符' }
  }

  尝试触发双会(事件时间: number) {
    const 附灵状态 = this.模拟循环.当前自身buff列表['附灵·煌符']
    const 火卦状态 = this.模拟循环.当前自身buff列表['卦象_火离']
    if (!附灵状态?.当前层数 || !火卦状态?.当前层数) {
      return
    }
    if (
      事件时间 < 附灵状态.刷新时间! ||
      事件时间 > 附灵状态.刷新时间! + 附灵状态.最大持续时间! ||
      事件时间 < 火卦状态.刷新时间! ||
      事件时间 > 火卦状态.刷新时间! + 火卦状态.最大持续时间! + (火卦状态.延长时间 || 0)
    ) {
      return
    }
    this.模拟循环.卸除buff({ 名称: '附灵·煌符', 对象: '自身', 事件时间 })
    this.模拟循环.卸除buff({ 名称: '凤凰起符', 对象: '自身', 事件时间 })
    this.模拟循环.卸除buff({ 名称: '凤凰', 对象: '自身', 事件时间 })
    this.模拟循环.添加buff({ 名称: '离火真煌', 对象: '自身', 事件时间 })
  }
}

export default 附灵煌符
