import { 待生效事件 } from '../../type'
import 技能统一类 from '../../通用类/技能统一类'
import { 获取实际帧数 } from '@/工具函数/data'

/**
 * 经过测试的弱点规
 * 弱点自身原始间隔为24帧
 * 实际应用满足 24-N+1 N为加速档位 既计算加速后额外添加1帧
 * 浮游、物化期间间隔变化远离经过对比JCL得
 * 浮游期间加速间隔激素继续计算，遇到间隔校验是否处于浮游状态，若处于浮游状态则不尽兴弱点，但是会记录弱点记时点
 * 释放物化后，刷新加速快照，按上一次弱点记时点按新间隔生成新的弱点轴
 * 在失去物化后，刷新加速快照，按上一次弱点记时点按新间隔生成新的弱点轴
 */

class 弱点 extends 技能统一类 {
  static 原始间隔 = 160
  static 最大事件次数 = 500
  static 弱点记时点 = 4

  constructor(模拟循环) {
    super(模拟循环)
    弱点.弱点记时点 = 4

    const 循环加速值 = this.模拟循环?.加速值
    const 加速后帧数 = 获取实际帧数(160, 循环加速值)
    // 根据实际测试，buff消失以后到下一个buff刷新有一个4帧的固定值
    // 30279是通过24042定时检查添加的
    // 然后这个24042是4帧检查一次
    弱点.原始间隔 = 加速后帧数 + 4
  }

  初始化弱点() {
    弱点.弱点记时点 = 8
    this.刷新弱点序列()
  }

  立即获得并刷新弱点() {
    this.弱点检查()
    this.刷新弱点序列((this.模拟循环?.当前时间 || 0) + 弱点.原始间隔)
  }

  刷新弱点序列(初始时间 = 弱点.弱点记时点, 生成次数 = 弱点.最大事件次数) {
    this.模拟循环.删除待生效事件队列?.('弱点检查')
    const 待生效事件: 待生效事件[] = []
    for (let i = 0; i <= 生成次数; i++) {
      const 事件时间 = 初始时间 + 弱点.原始间隔 * i
      待生效事件.push({
        事件名称: `弱点检查`,
        事件时间: 事件时间,
        事件备注: {},
      })
    }
    this.模拟循环.添加待生效事件队列?.(待生效事件)
  }

  弱点检查() {
    弱点.弱点记时点 = this.模拟循环.当前时间 || 0
    this.获得弱点()
  }

  获得弱点() {
    const 当前弱点_左 = this.模拟循环.当前目标buff列表?.['弱点_左']?.当前层数 || 0
    const 当前弱点_右 = this.模拟循环.当前目标buff列表?.['弱点_右']?.当前层数 || 0
    if (!当前弱点_左 && !当前弱点_右) {
      this.模拟循环.添加buff?.({ 名称: '弱点_左', 对象: '目标' })
    } else if (当前弱点_左 && !当前弱点_右) {
      this.模拟循环.添加buff?.({ 名称: '弱点_右', 对象: '目标' })
    } else if (!当前弱点_左 && 当前弱点_右) {
      this.模拟循环.添加buff?.({ 名称: '弱点_左', 对象: '目标' })
    }

    this.模拟循环.添加buff?.({ 名称: '寻隙', 对象: '自身' })

    // 检查事件是否足够
    this.事件检查()
  }

  事件检查() {
    // 判断当前剩余未生效弱点事件
    const 剩余未生效事件 = this?.模拟循环?.待生效事件队列?.filter(
      (item) => item?.事件名称 === '弱点检查',
    )
    if (剩余未生效事件?.length && 剩余未生效事件?.length < 20) {
      const 最后一个事件时间 = 剩余未生效事件[剩余未生效事件.length - 1]?.事件时间 || 0
      this.刷新弱点序列(最后一个事件时间)
    }
  }

  获取破绽判定(来源) {
    if (this.模拟循环.校验奇穴是否存在?.('涣衍') && this.当前破绽层数() < 3) {
      this.获得破绽(来源)
    }
    this.获得破绽(来源)
  }

  击破弱点(指定弱点 = '') {
    this.获取破绽判定('弱点击破')
    this.触发伤害行为('弱点击破')
    this.触发伤害行为('破·击破')

    // 按击破剩余时间短的那个计算
    const 原弱点_左刷新时间 = this.模拟循环.当前目标buff列表?.['弱点_左']?.刷新时间 || 0
    const 原弱点_右刷新时间 = this.模拟循环.当前目标buff列表?.['弱点_右']?.刷新时间 || 0

    let 实际被击破弱点 = 指定弱点
    if (!指定弱点) {
      if (原弱点_右刷新时间 < 原弱点_左刷新时间) {
        实际被击破弱点 = '弱点_右'
      } else {
        实际被击破弱点 = '弱点_左'
      }
    }

    this.模拟循环.卸除buff?.({ 名称: 实际被击破弱点, 对象: '目标' })

    if (this.模拟循环.校验奇穴是否存在?.('流岚')) {
      this.模拟循环.添加buff?.({ 名称: '流岚', 对象: '自身' })
    }
  }
}

export default 弱点

export const 弱点类型 = typeof 弱点
