import { 创建耦合表 } from '../../通用/耦合默认值'

export const 耦合表 = 创建耦合表({
  隐藏增益: {
    自身: ['风特效_英雄_快照', '风特效_快照'],
  },
  名称: '焚影圣诀',
  资源: {
    sun: '日灵',
    moon: '月魂',
    sun_power: '特殊:满日',
    moon_power: '特殊:满月',
  },
  资源显示: {
    sun: '日灵',
    moon: '月魂',
    sun_power: '满日',
    moon_power: '满月',
  },
  充盈字段: ['sun_power', 'moon_power'],
  排除技能: ['大漠刀法'],
  自身增益: {
    光明相: '光明相',
    日月齐光: '日月齐光',
    日珥: '日珥',
    月芒: '月芒',
    cw: '橙武',
    瀚海引: '橙武',
  },
  目标增益: {
    烈日: '烈日',
    银月斩: '银月斩DOT',
  },
  增益ID: {
    '4930': { 自身: ['橙武'] },
    '4423': { 自身: ['光明相'] },
    '34407': { 自身: ['日月齐光'] },
    '4202': { 目标: ['银月斩DOT'] },
    '25725': { 目标: ['靡业报劫日'] },
    '25726': { 目标: ['靡业报劫月'] },
  },
  示例: '/cast [sun_power|moon_power] 净世破魔击\n/cast 烈日斩\n/cast 赤日轮',
})

耦合表.排除技能 = 耦合表.排除技能?.filter((技能) => 技能 !== '触发橙武')
