import { 属性类型 } from '@/@types/属性'
import { 小药小吃数据类型 } from '@/@types/小药小吃'
import { 小吃类型枚举 } from '@/@types/枚举'
import 通用小药小吃数据 from '../通用'

const 内功小药小吃数据: 小药小吃数据类型[] = [
  ...通用小药小吃数据,
  {
    小吃名称: '高粱酒·旬又三（根骨）',
    小吃部位: 小吃类型枚举.家园酒品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/237.png',
    增益集合: [{ 属性: 属性类型.根骨, 值: 92 }],
  },
  {
    小吃名称: '状元红·旬又三（元气）',
    小吃部位: 小吃类型枚举.家园酒品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/10134.png',
    增益集合: [{ 属性: 属性类型.元气, 值: 92 }],
  },
  {
    小吃名称: '嘉陵月夜宴',
    小吃部位: 小吃类型枚举.团队宴席,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/9408.png',
    增益集合: [
      { 属性: 属性类型.无双等级, 值: 72 },
      { 属性: 属性类型.全会心等级, 值: 72 },
      { 属性: 属性类型.内功基础攻击, 值: 72 },
    ],
  },
  {
    小吃名称: '未央宫庭宴',
    小吃部位: 小吃类型枚举.团队宴席,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/9408.png',
    增益集合: [
      { 属性: 属性类型.无双等级, 值: 90 },
      { 属性: 属性类型.全会心等级, 值: 90 },
      { 属性: 属性类型.内功基础攻击, 值: 90 },
    ],
  },
]

export default 内功小药小吃数据
