import { 属性类型 } from '@/@types/属性'
import { 小药小吃数据类型 } from '@/@types/小药小吃'
import { 小吃类型枚举 } from '@/@types/枚举'
import 通用小药小吃数据 from '../通用'

const 内功小药小吃数据: 小药小吃数据类型[] = [
  {
    小吃名称: '风语·中品展凤散（内攻）',
    小吃部位: 小吃类型枚举.药品增强,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/1361.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 1118 }],
  },
  {
    小吃名称: '风语·上品展凤散（内攻）',
    小吃部位: 小吃类型枚举.药品增强,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/1360.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 2236 }],
  },
  {
    小吃名称: '炼气·秘境·增（内攻）',
    小吃部位: 小吃类型枚举.药品增强,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/4516.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 266 }],
  },
  {
    小吃名称: '风语·中品静心丸（根骨）',
    小吃部位: 小吃类型枚举.药品辅助,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/4267.png',
    增益集合: [{ 属性: 属性类型.根骨, 值: 473 }],
  },
  {
    小吃名称: '风语·上品静心丸（根骨）',
    小吃部位: 小吃类型枚举.药品辅助,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/4266.png',
    增益集合: [{ 属性: 属性类型.根骨, 值: 946 }],
  },
  {
    小吃名称: '风语·中品聚魂丹（元气）',
    小吃部位: 小吃类型枚举.药品辅助,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/1367.png',
    增益集合: [{ 属性: 属性类型.元气, 值: 473 }],
  },
  {
    小吃名称: '风语·上品聚魂丹（元气）',
    小吃部位: 小吃类型枚举.药品辅助,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/1366.png',
    增益集合: [{ 属性: 属性类型.元气, 值: 946 }],
  },
  {
    小吃名称: '风语·鲜肉包子（内攻）',
    小吃部位: 小吃类型枚举.食品增强,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/259.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 869 }],
  },
  {
    小吃名称: '风语·灌汤包（内攻）',
    小吃部位: 小吃类型枚举.食品增强,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/7614.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 1739 }],
  },
  {
    小吃名称: '强身·秘境·增（内攻）',
    小吃部位: 小吃类型枚举.食品增强,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/4525.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 207 }],
  },
  {
    小吃名称: '风语·老火骨汤（根骨）',
    小吃部位: 小吃类型枚举.食品辅助,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/262.png',
    增益集合: [{ 属性: 属性类型.根骨, 值: 368 }],
  },
  {
    小吃名称: '风语·咸骨粥（根骨）',
    小吃部位: 小吃类型枚举.食品辅助,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/261.png',
    增益集合: [{ 属性: 属性类型.根骨, 值: 736 }],
  },
  {
    小吃名称: '风语·鱼头豆腐汤（元气）',
    小吃部位: 小吃类型枚举.食品辅助,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/9998.png',
    增益集合: [{ 属性: 属性类型.元气, 值: 368 }],
  },
  {
    小吃名称: '风语·鱼片砂锅粥（元气）',
    小吃部位: 小吃类型枚举.食品辅助,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/9992.png',
    增益集合: [{ 属性: 属性类型.元气, 值: 736 }],
  },
  {
    小吃名称: '风语·坠宵磨石（内攻）',
    小吃部位: 小吃类型枚举.武器磨石,
    小吃品级: '蓝',
    图标: 'https://icon.jx3box.com/icon/7600.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 746 }],
  },
  {
    小吃名称: '风语·坠宵熔锭（内攻）',
    小吃部位: 小吃类型枚举.武器磨石,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/7596.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 1491 }],
  },
  {
    小吃名称: '高粱酒·旬又三（根骨）',
    小吃部位: 小吃类型枚举.家园酒品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/237.png',
    增益集合: [{ 属性: 属性类型.根骨, 值: 544 }],
  },
  {
    小吃名称: '状元红·旬又三（元气）',
    小吃部位: 小吃类型枚举.家园酒品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/10134.png',
    增益集合: [{ 属性: 属性类型.元气, 值: 544 }],
  },
  {
    小吃名称: '风语·小炒青菜（内攻）',
    小吃部位: 小吃类型枚举.家园菜品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/7607.png',
    增益集合: [{ 属性: 属性类型.内功基础攻击, 值: 1206 }],
  },
  {
    小吃名称: '风语·二十四桥明月夜',
    小吃部位: 小吃类型枚举.团队宴席,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/9408.png',
    增益集合: [
      { 属性: 属性类型.内功基础攻击, 值: 994 },
      { 属性: 属性类型.全会心等级, 值: 3280 },
      { 属性: 属性类型.破招值, 值: 3280 },
    ],
  },
  {
    小吃名称: '创意料理（-气血+攻击）',
    小吃部位: 小吃类型枚举.家园菜品,
    小吃品级: '紫',
    图标: 'https://icon.jx3box.com/icon/549.png',
    增益集合: [
      { 属性: 属性类型.内功基础攻击, 值: 2170 },
      { 属性: 属性类型.额外气血上限, 值: -47900 },
    ],
  },
  ...通用小药小吃数据,
]

export default 内功小药小吃数据
