export default {
  装备基础属性: {
    基础攻击: 6281,
    破防等级: 1132,
    无双等级: 4015,
    会心等级: 1231,
    会心效果等级: 208,
    全能等级: 0,
    武器伤害_最小值: 145,
    武器伤害_最大值: 242,
    力道: 2285,
    元气: 17,
    身法: 18,
    根骨: 18,
    体质: 4724,
    基础气血上限: 3956,
    额外气血上限: 0,
    加速等级: 1092,
    装分: 17188,
  },
  装备镶嵌附魔属性: {
    基础攻击: 2698,
    破防等级: 48,
    无双等级: 36,
    会心等级: 60,
    会心效果等级: 0,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    力道: 53,
    元气: 17,
    身法: 18,
    根骨: 18,
    体质: 18,
    基础气血上限: 3956,
    额外气血上限: 0,
    加速等级: 0,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111790,
      装备部位: '帽子',
      装备部位索引: '_1',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111796,
      装备部位: '衣服',
      装备部位索引: '_2',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111772,
      装备部位: '腰带',
      装备部位索引: '_3',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111766,
      装备部位: '护腕',
      装备部位索引: '_4',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111784,
      装备部位: '下装',
      装备部位索引: '_5',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 111778,
      装备部位: '鞋子',
      装备部位索引: '_6',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 49750,
      装备部位: '项链',
      装备部位索引: '_7',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 49756,
      装备部位: '腰坠',
      装备部位索引: '_8',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 49762,
      装备部位: '戒指',
      装备部位索引: '_9',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 49762,
      装备部位: '戒指',
      装备部位索引: '_10',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 46325,
      装备部位: '暗器',
      装备部位索引: '_11',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 6,
        },
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 6,
        },
      ],
      当前精炼等级: 6,
      id: 46345,
      装备部位: '武器',
      装备部位索引: '_12',
    },
  ],
  五彩石: '彩·见切·斩铁·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 0,
    大附魔_伤衣: 0,
    大附魔_伤腰: 0,
    大附魔_伤腕: 0,
    大附魔_伤鞋: 0,
  },
}
