import { 循环数据 } from '@/@types/循环'

const 紫武_胧雾_四段_1延迟: Partial<循环数据> = {
  名称: '橙武_神阳_二段',
  标题: '橙武_神阳_二段',
  类型: '自定义',
  标记: '自定义',
  奇穴: [
    "玉枕",
    "神封",
    "纷飙",
    "神门",
    "茫缈",
    "摧烟",
    "一阳来复",
    "见飓",
    "悬枢",
    "清激"
  ],
  秘籍: {
    断脉: ['4%伤害', '4%会心', '5%伤害', '3%伤害'],
    截阳: ['4%伤害', '3%伤害', '4%会心', '5%伤害'],
    引窍: ['5%伤害', '4%伤害', '4%会心', '3%会心'],
    破穴: ['5%伤害', '4%伤害', '3%伤害', '4%会心'],
    劈风令: ['4%伤害', '4%会心', '3%会心', '5%伤害'],
    抟风令: ['4%伤害', '3%伤害'],
  },
  技能序列: [
    '引窍', '破穴', '一阳来复', '引窍', '特效腰坠', '一阳来复', '引窍', '触发橙武%{"延迟":20}', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '一阳来复', '引窍', '引窍', '破穴', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '抟风令断', '劈风令', '劈风令', '劈风令', '引窍', '引窍', '破穴', '一阳来复', '引窍', '断脉', '截阳', '引窍', '一阳来复', '引窍', '断脉', '引窍', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '引窍', '破穴', '一阳来复', '引窍', '触发橙武%{"延迟":20}', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '一阳来复', '引窍', '引窍', '破穴', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '抟风令断', '劈风令', '劈风令', '劈风令', '引窍', '引窍', '破穴', '一阳来复', '引窍', '断脉', '截阳', '引窍', '一阳来复', '引窍', '断脉', '引窍', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '引窍', '破穴', '一阳来复', '引窍', '触发橙武%{"延迟":20}', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '一阳来复', '引窍', '引窍', '破穴', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '抟风令断', '劈风令', '劈风令', '劈风令', '引窍', '引窍', '破穴', '一阳来复', '引窍', '断脉', '截阳', '引窍', '一阳来复', '引窍', '断脉', '引窍', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '引窍', '破穴', '一阳来复', '引窍', '触发橙武%{"延迟":20}', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '一阳来复', '引窍', '引窍', '破穴', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '抟风令断', '劈风令', '劈风令', '劈风令', '引窍', '引窍', '破穴', '一阳来复', '引窍', '断脉', '截阳', '引窍', '一阳来复', '引窍', '断脉', '引窍', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '引窍', '破穴', '一阳来复', '特效腰坠', '引窍', '触发橙武%{"延迟":20}', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '一阳来复', '引窍', '引窍', '破穴', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '抟风令断', '劈风令', '劈风令', '劈风令', '引窍', '引窍', '破穴', '一阳来复', '引窍', '断脉', '截阳', '引窍', '一阳来复', '引窍', '断脉', '引窍', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '引窍', '破穴', '一阳来复', '引窍', '触发橙武%{"延迟":20}', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '引窍', '一阳来复', '引窍', '引窍', '破穴', '一阳来复', '骤风令', '骤风劈风', '引窍', '劈风令', '劈风令', '劈风令', '抟风令断', '劈风令', '劈风令', '劈风令', '引窍', '引窍'
  ],
}

export default 紫武_胧雾_四段_1延迟
