import { 循环数据 } from '@/@types/循环'

const 紫武_胧雾_四段_1延迟: Partial<循环数据> = {
  名称: '紫武_滃胧_四段_1延迟',
  标题: '紫武_滃胧_四段_1延迟',
  类型: '自定义',
  标记: '自定义',
  奇穴: [
    "玉枕",
    "神封",
    "纷飙",
    "神门",
    "茫缈",
    "摧烟",
    "胧雾观花",
    "见飓",
    "悬枢",
    "滃从"
  ],
  秘籍: {
    断脉: ['4%伤害', '4%会心', '5%伤害', '3%伤害'],
    截阳: ['4%伤害', '3%伤害', '4%会心', '5%伤害'],
    引窍: ['5%伤害', '4%伤害', '减CD_1_1', '减CD_1_2'],
    破穴: ['5%伤害', '4%伤害', '3%伤害', '4%会心'],
    劈风令: ['4%伤害', '4%会心', '3%会心', '5%伤害'],
    抟风令: ['4%伤害', '3%伤害'],
  },
  技能序列: [
    '破穴', '胧雾观花', '骤风令', '特效腰坠', '骤风劈风', '劈风令', '劈风令', '劈风令', '雾刃飞光', '雾刃飞光', '雾刃飞光', '雾刃飞光', '胧雾观花', '抟风令断', '劈风令', '胧雾观花', '引窍', '劈风令', '劈风令', '断脉', '截阳', '断脉', '引窍', '断脉', '胧雾观花', '引窍', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '断脉', '截阳', '引窍', '胧雾观花', '劈风令', '断脉', '截阳', '断脉', '截阳', '断脉', '引窍', '胧雾观花', '断脉', '截阳', '引窍', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '雾刃飞光', '雾刃飞光', '雾刃飞光', '雾刃飞光', '劈风令', '胧雾观花', '抟风令断', '劈风令', '引窍', '劈风令', '劈风令', '胧雾观花', '断脉', '截阳', '引窍', '断脉', '截阳', '引窍', '破穴', '骤风令', '胧雾观花', '骤风劈风', '劈风令', '劈风令', '断脉', '截阳', '引窍', '劈风令', '断脉', '截阳', '胧雾观花', '断脉', '截阳', '断脉', '引窍', '断脉', '截阳', '引窍', '破穴', '胧雾观花', '骤风令', '骤风劈风', '劈风令', '劈风令', '雾刃飞光', '雾刃飞光', '雾刃飞光', '雾刃飞光', '劈风令', '抟风令断', '胧雾观花', '劈风令', '引窍', '劈风令', '劈风令', '断脉', '截阳', '引窍', '断脉', '胧雾观花', '截阳', '引窍', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '断脉', '截阳', '胧雾观花', '引窍', '劈风令', '断脉', '截阳', '断脉', '截阳', '断脉', '胧雾观花', '引窍', '断脉', '截阳', '引窍', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '雾刃飞光', '雾刃飞光', '雾刃飞光', '雾刃飞光', '劈风令', '胧雾观花', '抟风令断', '劈风令', '引窍', '劈风令', '劈风令', '胧雾观花', '断脉', '截阳', '引窍', '断脉', '截阳', '引窍', '破穴', '胧雾观花', '骤风令', '骤风劈风', '劈风令', '劈风令', '断脉', '截阳', '引窍', '劈风令', '断脉', '胧雾观花', '截阳', '断脉', '截阳', '断脉', '引窍', '断脉', '截阳', '引窍', '胧雾观花', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '雾刃飞光', '雾刃飞光', '雾刃飞光', '雾刃飞光', '劈风令', '胧雾观花', '抟风令断', '劈风令', '引窍', '劈风令', '劈风令', '断脉', '截阳', '引窍', '胧雾观花', '断脉', '截阳', '引窍', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '断脉', '胧雾观花', '截阳', '引窍', '劈风令', '断脉', '截阳', '断脉', '截阳', '断脉', '胧雾观花', '引窍', '断脉', '截阳', '引窍', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '雾刃飞光', '雾刃飞光', '雾刃飞光', '雾刃飞光', '劈风令', '胧雾观花', '抟风令断', '劈风令', '引窍', '劈风令', '胧雾观花', '劈风令', '断脉', '截阳', '引窍', '断脉', '截阳', '引窍', '胧雾观花', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '断脉', '截阳', '引窍', '劈风令', '胧雾观花', '断脉', '截阳', '断脉', '截阳', '断脉', '引窍', '断脉', '截阳', '胧雾观花', '引窍', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '雾刃飞光', '雾刃飞光', '雾刃飞光', '雾刃飞光', '劈风令', '胧雾观花', '抟风令断', '劈风令', '引窍', '劈风令', '劈风令', '断脉', '截阳', '胧雾观花', '引窍', '断脉', '截阳', '引窍', '破穴', '骤风令', '骤风劈风', '劈风令', '劈风令', '断脉', '截阳', '胧雾观花', '引窍', '劈风令'
  ],
}

export default 紫武_胧雾_四段_1延迟
