import type { 技能基础数据模型 } from '@/@types/技能'
import { 获取破招实际系数 } from '../../统一数据/系数计算'

import 通用增益 from './技能增益/通用增益/通用增益'
import 大荒笛法增益 from './技能增益/大荒笛法'
import 百足增益 from './技能增益/百足'
import 蛇影增益 from './技能增益/蛇影'
import 蝎心增益 from './技能增益/蝎心'
import 灵蛊增益 from './技能增益/灵蛊'
import 连缘蛊增益 from './技能增益/连缘蛊'
import 篾片蛊增益 from './技能增益/篾片蛊'
import 千丝增益 from './技能增益/千丝'

import DOT增益 from './技能增益/通用增益/DOT增益'
import 灵蛇增益 from './技能增益/灵蛇'
import { 属性类型 } from '@/@types/属性'
import 大橙武技能增益 from './技能增益/通用增益/大橙武技能增益'
import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'
import 蟾啸增益 from './技能增益/蟾啸'
import 宠物增益 from './技能增益/通用增益/宠物增益'

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '32818',
    技能名称: '破',
    统计名称: '破',
    技能伤害系数: 获取破招实际系数(-376176),
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 获取破招实际系数(-376176) },
      2: { 技能伤害系数: 获取破招实际系数(-703594.496) },
    },
  },
  {
    技能ID: '2183',
    技能名称: '大荒笛法',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 大荒笛法增益,
  },
  {
    技能ID: '13472',
    技能名称: '百足',
    基础伤害_基础值: 212,
    基础伤害_浮动值: 23,
    技能伤害系数: 758.8452320064001,
    技能增益列表: [...百足增益, ...大橙武技能增益],
    // 只有技能吃大橙武，DOT不吃
  },
  {
    技能ID: '18590',
    技能名称: '蛊毒',
    秘籍依赖技能: '灵蛊',
    基础伤害_基础值: 28,
    基础伤害_浮动值: 3,
    技能伤害系数: 16,
    技能增益列表: 灵蛊增益,
  },
  {
    技能ID: '42217',
    技能名称: '降厄·薄瘴',
    基础伤害_基础值: 120,
    基础伤害_浮动值: 16,
    技能伤害系数: 400,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '42295',
    技能名称: '令怖',
    统计名称: '令怖',
    基础伤害_基础值: 20,
    基础伤害_浮动值: 2,
    技能伤害系数: 64,
    技能增益列表: [
      ...通用增益,
      {
        增益名称: '令怖非侠',
        增益所在位置: '职业',
        增益启用: true,
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.非侠增伤, 值: 1843 / 1024 }],
      },
    ],
    技能等级数据: {
      '1,10': {
        技能伤害系数: (i) => 64 * i,
      },
    },
  },
  {
    技能ID: '25044',
    技能名称: '连缘蛊',
    统计名称: '连缘蛊',
    基础伤害_基础值: 40,
    基础伤害_浮动值: 4,
    技能伤害系数: 219.57327315000006,
    技能增益列表: 连缘蛊增益,
  },
  {
    技能ID: '30918',
    技能名称: '连缘蛊·额外',
    统计名称: '连缘蛊',
    基础伤害_基础值: 133,
    基础伤害_浮动值: 14,
    技能伤害系数: 1219.8515175000002,
    技能增益列表: 连缘蛊增益,
    技能等级数据: {
      '1,6': {
        基础伤害_基础值: [40, 66, 89, 111, 133],
        基础伤害_浮动值: [4, 7, 9, 11, 14],
        技能伤害系数: (i) => [243, 487, 731, 975, 1219][i - 1],
      },
    },
  },
  {
    技能ID: '29573',
    技能名称: '篾片蛊',
    基础伤害_基础值: 365,
    基础伤害_浮动值: 23,
    技能伤害系数: 1628.0550000000003,
    技能增益列表: 篾片蛊增益,
  },
  {
    技能ID: '34389',
    技能名称: '黯影',
    基础伤害_基础值: 20,
    基础伤害_浮动值: 2,
    技能伤害系数: 100,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '42222',
    技能名称: '降厄',
    基础伤害_基础值: 118,
    基础伤害_浮动值: 12,
    技能伤害系数: 150,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '6648',
    技能名称: '幻击·食髓',
    技能伤害系数: 900.0,
    基础伤害_基础值: 300,
    基础伤害_浮动值: 26,
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 900.0, 基础伤害_基础值: 300, 基础伤害_浮动值: 26 },
      2: { 技能伤害系数: 1350.0, 基础伤害_基础值: 600, 基础伤害_浮动值: 52 },
    },
  },
  {
    技能ID: '37959',
    技能名称: '不鸣',
    基础伤害_基础值: 157,
    基础伤害_浮动值: 1,
    技能伤害系数: 900.0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '13473',
    技能名称: '蟾啸',
    基础伤害_基础值: 285,
    基础伤害_浮动值: 30,
    技能伤害系数: 245.04480000000007,
    技能增益列表: 蟾啸增益,
  },
  {
    技能ID: '21821',
    技能名称: '千丝',
    基础伤害_基础值: 458,
    基础伤害_浮动值: 10,
    技能伤害系数: 1600,
    技能增益列表: 千丝增益,
  },
  {
    技能ID: '21303',
    技能名称: '蛇影',
    基础伤害_基础值: 204,
    基础伤害_浮动值: 21,
    技能伤害系数: 664.68402,
    技能增益列表: [...蛇影增益],
  },
  {
    技能ID: '38456',
    技能名称: '残香',
    基础伤害_基础值: 220,
    基础伤害_浮动值: 20,
    技能伤害系数: 180,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '38456',
    技能名称: '虫魄',
    基础伤害_基础值: 20,
    基础伤害_浮动值: 2,
    技能伤害系数: 240,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '9331',
    技能名称: '蝎心',
    统计名称: '蝎心',
    基础伤害_基础值: 170,
    基础伤害_浮动值: 16,
    技能伤害系数: 616,
    技能增益列表: [
      // dot和本体的秘籍相同，但是吃的增伤实现不同
      {
        增益名称: '4%伤害',
        增益所在位置: '秘籍',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.通用增伤, 值: 41 / 1024 }],
      },
      {
        增益名称: '3%伤害',
        增益所在位置: '秘籍',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
      },
      ...蝎心增益,
      // dot不吃残香
      {
        增益名称: '残香',
        增益所在位置: '奇穴',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.通用增伤, 值: 205 / 1024 }],
      },
    ],
  },
  {
    技能ID: '6218', // 6218_13476
    技能名称: '蝎心(DOT)',
    统计名称: '蝎心(DOT)',
    秘籍依赖技能: '蝎心',
    基础伤害_基础值: 80,
    DOT生效间隔: 32,
    DOT跳数: 6,
    技能伤害系数: 714,
    技能增益列表: [
      // dot和本体的秘籍相同，但是吃的增伤实现不同
      {
        增益名称: '4%伤害',
        增益所在位置: '秘籍',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.系数增伤, 值: 1.04 }],
      },
      {
        增益名称: '3%伤害',
        增益所在位置: '秘籍',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.系数增伤, 值: 1.03 }],
      },
      ...蝎心增益,
      ...DOT增益,
    ],
  },
  {
    技能ID: '25917', // 25917_34643
    技能名称: '蛇影(DOT)·短',
    统计名称: '蛇影(DOT)',
    秘籍依赖技能: '蛇影',
    基础伤害_基础值: 55,
    DOT生效间隔: 32,
    DOT跳数: 6,
    技能伤害系数: 477.56280000000004,
    技能增益列表: [...蛇影增益, ...DOT增益],
  },
  {
    技能ID: '22730', // 22730_30578
    技能名称: '百足(DOT)·不僵',
    统计名称: '百足(DOT)',
    秘籍依赖技能: '百足',
    基础伤害_基础值: 92,
    DOT生效间隔: 32,
    DOT跳数: 9,
    技能伤害系数: 2322.90957130848,
    技能增益列表: [...百足增益, ...DOT增益],
    跳数系数变动: (跳数: number) => Math.pow(0.92, (跳数 || 1) - 1),
  },
  {
    技能ID: '12557', // 12557_18700
    技能名称: '百足(DOT)',
    统计名称: '百足(DOT)',
    秘籍依赖技能: '百足',
    基础伤害_基础值: 92,
    DOT生效间隔: 32,
    DOT跳数: 9,
    技能伤害系数: 1222.5839848992002,
    技能增益列表: [...百足增益, ...DOT增益],
  },
  {
    技能ID: '2296', // 2296_6237
    技能名称: '蛇影(DOT)',
    统计名称: '蛇影(DOT)',
    秘籍依赖技能: '蛇影',
    基础伤害_基础值: 55,
    DOT生效间隔: 32,
    DOT跳数: 6,
    技能伤害系数: 573.07536,
    技能增益列表: [...蛇影增益, ...DOT增益],
  },
  {
    技能ID: '2295', // 2295_6236
    技能名称: '蟾啸(DOT)',
    统计名称: '蟾啸(DOT)',
    秘籍依赖技能: '蟾啸',
    基础伤害_基础值: 50,
    DOT生效间隔: 32,
    DOT跳数: 7,
    技能伤害系数: 720,
    技能增益列表: [...蟾啸增益, ...DOT增益],
  },
  {
    技能ID: '37352', // 28210_37352
    技能名称: '释灵(DOT)',
    基础伤害_基础值: 180,
    DOT生效间隔: 16,
    DOT跳数: 8,
    技能伤害系数: 693.3333333333334,
    技能增益列表: [...通用增益, ...DOT增益],
  },
  {
    技能ID: '40066',
    技能名称: '万毒',
    技能伤害系数: 150.0,
    基础伤害_基础值: 118,
    基础伤害_浮动值: 12,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '39036',
    技能名称: '赤蝎',
    基础伤害_浮动值: 21,
    技能伤害系数: 2034,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '2477',
    技能名称: '幻击', // 蛇
    基础伤害_基础值: 194,
    基础伤害_浮动值: 20,
    伤害计算类型: '毒经宠物伤害',
    技能伤害系数: 345.0,
    技能增益列表: 灵蛇增益,
  },
  {
    技能ID: '36292',
    技能名称: '幻击·距离', // 蛇
    统计名称: '幻击',
    基础伤害_基础值: 194,
    基础伤害_浮动值: 20,
    伤害计算类型: '毒经宠物伤害',
    技能伤害系数: 115.0,
    技能增益列表: 灵蛇增益,
  },
  {
    技能ID: '2472',
    技能名称: '攻击', // 蛇
    统计名称: '攻击',
    基础伤害_基础值: 40,
    基础伤害_浮动值: 4,
    伤害计算类型: '毒经宠物伤害',
    技能伤害系数: 258.0,
    技能增益列表: 灵蛇增益,
  },
  {
    技能ID: '25039',
    技能名称: '二圣',
    技能伤害系数: 333.2699999999999,
    基础伤害_基础值: 15,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '2470',
    技能名称: '攻击·蝎', // 蝎
    统计名称: '攻击',
    基础伤害_基础值: 40,
    基础伤害_浮动值: 4,
    伤害计算类型: '毒经宠物伤害',
    技能伤害系数: 16.0,
    技能增益列表: 宠物增益,
  },
  {
    技能ID: '22997',
    技能名称: '攻击·距离', // 蛇
    统计名称: '攻击',
    基础伤害_基础值: 40,
    基础伤害_浮动值: 4,
    伤害计算类型: '毒经宠物伤害',
    技能伤害系数: 129.0,
    技能增益列表: 灵蛇增益,
  },
  {
    技能ID: '25019',
    技能名称: '荒息', // 蛇
    统计名称: '荒息',
    基础伤害_基础值: 40,
    基础伤害_浮动值: 4,
    伤害计算类型: '毒经宠物伤害',
    技能伤害系数: 100.0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '25773',
    技能名称: '蛇影·神兵',
    基础伤害_浮动值: 2,
    技能伤害系数: 60,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '23712',
    技能名称: '献祭毒爆', // 特效武器
    技能伤害系数: 0,
    基础伤害_基础值: 8700,
    基础伤害_浮动值: 870,
    技能增益列表: 通用增益,
    技能等级数据: {
      '1,9': {
        基础伤害_基础值: [8700, 87000, 8794, 87948, 29391, 293914, 161969, 1619696],
        基础伤害_浮动值: [870, 8700, 879, 8794, 0, 0, 0, 0],
      },
    },
  },
  {
    技能ID: '40198',
    技能名称: '蝎心·尻尾',
    统计名称: '蝎心',
    技能伤害系数: 600,
    基础伤害_基础值: 118,
    基础伤害_浮动值: 12,
    技能增益列表: 通用增益,
  },
  // --------------
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
}

export { 技能增益 }
