import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import type 循环主类 from '../../main'
import 技能基础数据 from '../../../constant/skill'

class 酒中仙 extends 有CD技能通用类 {
  static 技能数据 = 技能基础数据.find((技能) => 技能.技能名称 === '酒中仙')!
  技能名称 = '酒中仙'

  constructor(模拟循环: 循环主类) {
    super(模拟循环)
    this.初始化技能运行数据()
  }

  释放() {
    if (this.模拟循环.当前自身buff列表.逍遥)
      return { 可以释放: false, 异常信息: '逍遥期间不能施展酒中仙' }
    if (this.模拟循环.角色状态信息.醉意 >= 3)
      return {
        可以释放: false,
        异常信息: this.模拟循环.校验奇穴是否存在('祭湘君')
          ? '醉意已满，请先施展祭湘君消耗醉意'
          : '醉意已满，请施展醉逍遥',
      }
    return { 可以释放: true }
  }

  技能释放后更新运行数据() {
    const 技能数据 = this.模拟循环.技能基础数据.find((技能) => 技能.技能名称 === this.技能名称)!
    const 技能CD = this.模拟循环.当前自身buff列表.酩酊大醉
      ? (this.模拟循环.校验奇穴是否存在('祭湘君') ? 30 : 8) * 16 -
        (this.模拟循环.校验奇穴是否存在('棒挑') ? 48 : 0)
      : 技能数据.技能CD!
    this.模拟循环.技能释放后更新运行数据({ ...技能数据, 技能CD }, this)
    this.模拟循环.添加战斗日志({
      日志: `酒中仙本次调息${技能CD / 16}秒${this.模拟循环.当前自身buff列表.酩酊大醉 ? '（酩酊大醉）' : ''}`,
      日志类型: '技能释放结果',
    })
  }

  命中() {
    this.保存释放记录()
    this.模拟循环.更新内力(20, this.技能名称)
    this.模拟循环.角色状态信息.醉意 += 1
    this.模拟循环.添加buff({ 名称: '昊破', 对象: '自身' })
    this.模拟循环.添加buff({
      名称: '触类',
      对象: '自身',
      新增层数: this.模拟循环.校验奇穴是否存在('酩酊') ? 2 : 1,
    })
    this.模拟循环.添加战斗日志({
      日志: '酒中仙增加1点醉意，醉意变为' + this.模拟循环.角色状态信息.醉意,
      日志类型: '技能释放结果',
    })
  }
}

export default 酒中仙
