import { Buff枚举, 循环基础技能数据类型, 日志类型 } from '../simulator/type'
import { 基础GCD帧 } from '.'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 通用Buff数据, 通用循环模拟技能基础数据 } from '../../通用/通用技能/通用技能定义'

const 起火卦 = 'https://cdn.arkwish.com/jx3dps/simc/起火卦_20260906_065.jpg'
const 起山卦 = 'https://cdn.arkwish.com/jx3dps/simc/起山卦_20260906_066.jpg'
const 起水卦 = 'https://cdn.arkwish.com/jx3dps/simc/起水卦_20260906_067.jpg'
const 变火卦 = 'https://cdn.arkwish.com/jx3dps/simc/变火卦_20260906_068.jpg'
const 变山卦 = 'https://cdn.arkwish.com/jx3dps/simc/变山卦_20260906_062.jpg'
const 变水卦 = 'https://cdn.arkwish.com/jx3dps/simc/变水卦_20260906_063.jpg'
const 变卦 = 'https://cdn.arkwish.com/jx3dps/simc/变卦_20260906_064.jpg'

// 技能图标引入
// 13
// 13
// 4
// 1
// 34
// 12
// 24

const 循环模拟技能基础数据: 循环基础技能数据类型[] = [
  ...(通用循环模拟技能基础数据 as any),
  {
    // 衍天\套路及子技能\衍天_九字诀_临.lua
    技能名称: '三星临', // 24369
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '九字诀',
    图标: 'https://icon.jx3box.com/icon/13860.png',
  },
  {
    // 衍天\套路及子技能\衍天_九字诀_兵.lua
    技能名称: '兵主逆', // 24371
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    是否为倒读条技能: true,
    技能CD: 每秒郭氏帧 * 5,
    技能类型: '九字诀',
    图标: 'https://icon.jx3box.com/icon/13861.png',
  },
  {
    // 衍天\套路及子技能\衍天_九字诀_斗.lua
    技能名称: '天斗旋', // 24372
    技能释放后添加GCD: 基础GCD帧,
    // 是否为倒读条技能: true,
    技能CD: 每秒郭氏帧 * 5,
    技能GCD组: '公共',
    技能类型: '九字诀',
    图标: 'https://icon.jx3box.com/icon/13862.png',
  },
  {
    技能名称: '往者定', // 24373
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 14,
    技能GCD组: '公共',
    技能类型: '九字诀',
    图标: 'https://icon.jx3box.com/icon/13863.png',
  },
  {
    // 衍天\套路及子技能\占术_起卦.lua
    技能名称: '起卦', // 24375
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '起卦',
    技能类型: '占术',
    创建循环不可选: true,
  },
  {
    // 衍天\套路及子技能\占术_起卦.lua
    技能名称: '起水卦', // 24375
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '起卦',
    技能类型: '占术',
    图标: 起水卦,
  },
  {
    // 衍天\套路及子技能\占术_起卦.lua
    技能名称: '起山卦', // 24375
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '起卦',
    技能类型: '占术',
    图标: 起山卦,
  },
  {
    // 衍天\套路及子技能\占术_起卦.lua
    技能名称: '起火卦', // 24375
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '起卦',
    技能类型: '占术',
    图标: 起火卦,
  },
  {
    // 衍天\套路及子技能\占术_变卦.lua
    技能名称: '变卦', // 24491
    技能释放后添加GCD: 每秒郭氏帧 * 0.5,
    最小GCD: 每秒郭氏帧 * 0.5,
    技能CD: 0,
    技能GCD组: '变卦',
    技能类型: '占术',
    图标: 变卦,
  },
  {
    // 衍天\套路及子技能\占术_变卦.lua
    技能名称: '变水卦', // 24491
    技能释放后添加GCD: 8,
    最小GCD: 8,
    技能CD: 每秒郭氏帧 * 0.5,
    技能GCD组: '变卦',
    技能类型: '占术',
    创建循环不可选: true,
    图标: 变水卦,
  },
  {
    // 衍天\套路及子技能\占术_变卦.lua
    技能名称: '变山卦', // 24491
    技能释放后添加GCD: 8,
    最小GCD: 8,
    技能CD: 每秒郭氏帧 * 0.5,
    技能GCD组: '变卦',
    技能类型: '占术',
    创建循环不可选: true,
    图标: 变山卦,
  },
  {
    // 衍天\套路及子技能\占术_变卦.lua
    技能名称: '变火卦', // 24491
    技能释放后添加GCD: 8,
    最小GCD: 8,
    技能CD: 每秒郭氏帧 * 0.5,
    技能GCD组: '变卦',
    技能类型: '占术',
    创建循环不可选: true,
    图标: 变火卦,
  },
  {
    // 衍天\套路及子技能\占术_起卦.lua
    技能名称: '祝由_水坎', // 24376
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '自身',
    技能类型: '占术',
    图标: 'https://icon.jx3box.com/icon/13870.png',
  },
  {
    // 衍天\套路及子技能\占术_起卦.lua
    技能名称: '祝由_山艮', // 24377
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '自身',
    技能类型: '占术',
    图标: 'https://icon.jx3box.com/icon/13868.png',
  },
  {
    // 衍天\套路及子技能\占术_解卦火离.lua
    技能名称: '祝由_火离', // 24431
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 0,
    技能GCD组: '自身',
    技能类型: '占术',
    图标: 'https://icon.jx3box.com/icon/13866.png',
  },
  {
    // 衍天\套路及子技能\奇门_黄泉八伤.lua
    技能名称: '奇门飞宫', // 24378
    技能释放后添加GCD: 0,
    最小GCD: 8,
    技能CD: 每秒郭氏帧 * 17,
    最大充能层数: 3,
    技能GCD组: '自身',
    技能类型: '奇门',
    图标: 'https://icon.jx3box.com/icon/13871.png',
  },
  {
    技能名称: '纵横三才', // 24858
    技能释放后添加GCD: 0,
    最小GCD: 8,
    技能CD: 每秒郭氏帧 * 6,
    技能GCD组: '自身',
    技能类型: '奇门',
    图标: 'https://icon.jx3box.com/icon/14051.png',
  },
  {
    // 衍天\套路及子技能\奇门_鬼星开穴.lua
    技能名称: '鬼星开穴', // 24379
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 16,
    技能GCD组: '公共',
    技能类型: '奇门',
    奇穴存在不可释放: ['御前星'],
    图标: 'https://icon.jx3box.com/icon/13872.png',
  },
  {
    // 衍天宗_镇星入舆_临兵斗存灯
    技能名称: '御前星', // 37505
    技能释放后添加GCD: 0,
    技能GCD组: '公共',
    是否为倒读条技能: true,
    技能CD: 每秒郭氏帧 * 5,
    可中断倒读条最大跳数: 30,
    技能类型: '奇门',
    显示类型: '奇穴技能',
    图标: 'https://icon.jx3box.com/icon/25398.png',
  },
  {
    // 衍天\套路及子技能\奇门_返闭惊魂.lua
    技能名称: '返闭惊魂', // 24380
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 38,
    技能GCD组: '灯',
    技能类型: '奇门',
    图标: 'https://icon.jx3box.com/icon/13873.png',
  },
  {
    // 衍天宗_镇星入舆_临兵斗存灯
    技能名称: '列宿游', // 37505
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '公共',
    技能类型: '其他',
    显示类型: '奇穴技能',
    图标: 'https://icon.jx3box.com/icon/17712.png',
  },
  {
    // 衍天/套路及子技能/沉浊落.lua
    技能名称: '太白蚀昴', // 42504
    技能释放后添加GCD: 基础GCD帧,
    最小GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 16,
    技能GCD组: '公共',
    技能类型: '其他',
    显示类型: '奇穴技能',
    图标: 'https://icon.jx3box.com/icon/19197.png',
  },

  {
    // 衍天宗_镇星入舆_临兵斗存灯
    技能名称: '镇星入舆', // 37505
    技能释放后添加GCD: 8,
    最小GCD: 8,
    技能CD: 每秒郭氏帧 * 25,
    技能GCD组: '镇星入舆',
    技能类型: '其他',
    显示类型: '奇穴技能',
    // Buff存在不可释放: ['入舆'],
    图标: 'https://icon.jx3box.com/icon/18319.png',
  },
  // {
  //   // 衍天\套路及子技能\镇星入舆二段.lua
  //   技能名称: '镇星二段', // 37981
  //   技能释放后添加GCD: 0,
  //   最小GCD: 0,
  //   技能CD: 每秒郭氏帧 * 0.5,
  //   技能GCD组: '自身',
  //   技能类型: '其他',
  //   显示类型: '奇穴技能',
  //   依赖奇穴名: '镇星入舆',
  //   // 释放依赖Buff: ['入舆'],
  //   图标: 'https://icon.jx3box.com/icon/18318.png',
  // },
  {
    // 衍天\套路及子技能\衍天_九字诀_阵.lua
    技能名称: '连极阵', // 25383
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 3,
    技能GCD组: '公共',
    技能类型: '其他',
    显示类型: '奇穴技能',
    依赖奇穴名: '连极阵',
    Buff存在不可释放: ['连极阵'],
    图标: 'https://icon.jx3box.com/icon/14164.png',
  },
  {
    // 衍天/套路及子技能/连极阵·解.lua
    技能名称: '连极阵_解', // 42436
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 3,
    技能GCD组: '自身',
    技能类型: '其他',
    显示类型: '奇穴技能',
    依赖奇穴名: '连极阵',
    释放依赖Buff: ['连极阵'],
    图标: 'https://icon.jx3box.com/icon/18323.png',
  },
  {
    技能名称: '龙马出河',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 36,
    技能GCD组: '自身',
    技能类型: '其他',
    显示类型: '奇穴技能',
    图标: 'https://icon.jx3box.com/icon/14028.png',
    说明: '在20尺内目标点位置，产生12秒“龙马出河”，延迟1秒后将自身传送至“龙马出河”中心位置，使范围内至多5个敌对侠士目标沉默并锁足3秒。自身位于范围内时，伤害提高10%。36秒调息时间。',
  },
  {
    技能名称: '触发橙武',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 50,
    技能GCD组: '自身',
    技能类型: '其他',
    显示类型: '大橙武模拟',
    图标: 'https://icon.jx3box.com/icon/23413.png',
  },
  {
    技能名称: '换行',
    技能释放后添加GCD: 0,
    技能CD: 0,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/13894.png',
    说明: '插入换行将只以”换行“作为展示换行。',
  },
  {
    技能名称: '切换武器',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 180,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/14457.png',
    说明: '瞬发切换至指定武器，不占公共GCD，180秒调息。',
  },
  {
    技能名称: '召唤麒麟',
    技能释放后添加GCD: 每秒郭氏帧,
    技能CD: 每秒郭氏帧 * 120,
    技能GCD组: '公共',
    技能类型: '其他',
    特效武器技能: true,
    图标: 'https://icon.jx3box.com/icon/25905.png',
  },
  {
    技能名称: '起符',
    技能释放后添加GCD: 每秒郭氏帧,
    技能GCD组: '公共',
    技能类型: '其他',
    特效武器技能: true,
    图标: 'https://icon.jx3box.com/icon/25902.png',
  },
  {
    技能名称: '召唤凤凰',
    技能释放后添加GCD: 每秒郭氏帧,
    技能CD: 每秒郭氏帧 * 120,
    技能GCD组: '公共',
    技能类型: '其他',
    特效武器技能: true,
    图标: 'https://icon.jx3box.com/icon/25904.png',
    说明: '读条5.5秒召唤凤凰，与召唤麒麟共用调息时间。',
  },
  {
    技能名称: '附灵·煌符',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '其他',
    特效武器技能: true,
    图标: 'https://icon.jx3box.com/icon/25887.png',
    说明: '15秒内检测到火卦时，获得持续25秒的50%会心、会心效果增益。',
  },
  {
    技能名称: '应卦震符',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '其他',
    特效武器技能: true,
    图标: 'https://icon.jx3box.com/icon/25886.png',
  },
  {
    技能名称: '化卦坠符',
    技能释放后添加GCD: 基础GCD帧,
    技能GCD组: '公共',
    技能类型: '其他',
    特效武器技能: true,
    图标: 'https://icon.jx3box.com/icon/25891.png',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
  '循环异常',
]

export enum 技能GCD组 {
  公共,
  自身,
  换箭,
}

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  // 系统Buff
  卦象_水坎: {
    类型: '自身',
    名称: '卦象_水坎', // 17588
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 20,
    延长后最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/13870.png',
    备注: '“九字诀”套路伤害招式每次命中使自身3秒内加速率提高5%',
  },
  卦象_山艮: {
    类型: '自身',
    名称: '卦象_山艮', // 17801
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 20,
    延长后最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/13868.png',
    备注: '“九字诀”套路伤害招式每次命中目标造成40%减速效果，并额外造成15%伤害',
  },
  卦象_火离: {
    类型: '自身',
    名称: '卦象_火离', // 17802
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 20,
    延长后最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/13866.png',
    备注: '“九字诀”套路伤害招式6尺范围内命中目标数量翻倍',
  },
  荧入白: {
    类型: '自身',
    名称: '荧入白',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 20,
    延长后最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/14031.png',
    备注: '自身无双等级提高20%，无视目标50%内功防御等级，',
  },
  镇星入舆_临: {
    类型: '自身',
    名称: '镇星入舆_临', // 28367
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/18319.png',
    备注: '施展临会额外触发一次，不回复星运，获得常驻25%混元内功基础攻击增益',
  },
  镇星入舆_兵: {
    类型: '自身',
    名称: '镇星入舆_兵', // 28368
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/18319.png',
    备注: '施展兵会额外触发一次，不回复星运，获得常驻25%混元内功基础攻击增益',
  },
  镇星入舆_斗: {
    类型: '自身',
    名称: '镇星入舆_斗', // 28369
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/18319.png',
    备注: '施展斗会额外触发一次，不回复星运，获得常驻25%混元内功基础攻击增益',
  },
  // 入舆: {
  //   类型: '自身',
  //   名称: '入舆', // 30774
  //   最大层数: 2,
  //   最大持续时间: 每秒郭氏帧 * 20,
  //   图标: 'https://icon.jx3box.com/icon/18318.png',
  //   备注: '可释放二段镇星入舆',
  // },
  水卦加速: {
    类型: '自身',
    名称: '水卦加速', // 32130
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 3,
    图标: 'https://icon.jx3box.com/icon/13870.png',
    备注: '增加自身5%加速',
  },
  鬼遁水卦加速: {
    类型: '自身',
    名称: '鬼遁水卦加速', // 32130，等级2
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 3,
    图标: 'https://icon.jx3box.com/icon/13870.png',
    备注: '鬼遁起卦占得水坎，增加自身10%加速',
  },
  鬼遁: {
    类型: '自身', // 18174
    名称: '鬼遁',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 999,
    图标: 'https://icon.jx3box.com/icon/13872.png',
    备注: '星运上限变为300点，连局内起卦必出水卦，鬼遁水卦加速率提高至10%',
  },
  镇星: {
    类型: '自身',
    名称: '镇星',
    最大层数: 1,
    图标: 'https://icon.jx3box.com/icon/18318.png',
    备注: '混元内功基础攻击提高25%，常驻无时间限制',
  },
  明灯: {
    类型: '自身', // 31805
    名称: '明灯',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 12,
    图标: 'https://icon.jx3box.com/icon/17712.png',
    备注: '会心效果提高',
  },
  星芒: {
    类型: '自身', // 31851
    名称: '星芒',
    最大层数: 24,
    最大持续时间: 每秒郭氏帧 * 999,
    图标: 'https://icon.jx3box.com/icon/25396.png',
    备注: '12层以上可释放御前星',
  },
  橙武: {
    类型: '自身',
    名称: '橙武',
    最大层数: 3,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/2589.png',
  },
  连极阵: {
    类型: '对象',
    名称: '连极阵',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 99,
    图标: 'https://icon.jx3box.com/icon/14164.png',
  },
  知微: {
    类型: '自身', // 31795
    名称: '知微',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/14058.png',
  },
  踏斗: {
    类型: '自身', // 30434
    名称: '踏斗',
    最大层数: 4,
    最大持续时间: 每秒郭氏帧 * 20,
    图标: 'https://icon.jx3box.com/icon/14019.png',
  },
  龙马出河: {
    类型: '自身', // 18039
    名称: '龙马出河',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 12,
    图标: 'https://icon.jx3box.com/icon/14028.png',
  },
  // 自创Buff
  灯魂_0: {
    类型: '目标',
    名称: '灯魂_0',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 999,
    图标: 'https://icon.jx3box.com/icon/13871.png',
  },
  灯魂_1: {
    类型: '目标',
    名称: '灯魂_1',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 999,
    图标: 'https://icon.jx3box.com/icon/13871.png',
  },
  灯魂_2: {
    类型: '目标',
    名称: '灯魂_2',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 999,
    图标: 'https://icon.jx3box.com/icon/13871.png',
  },
  起水卦: {
    类型: '自身',
    名称: '起水卦',
    最大层数: 1,
    最大持续时间: 40,
    图标: 起水卦,
    备注: '40帧（2.5秒）后获得水卦',
  },
  起山卦: {
    类型: '自身',
    名称: '起山卦',
    最大层数: 1,
    最大持续时间: 40,
    图标: 起山卦,
    备注: '40帧（2.5秒）后获得山卦',
  },
  起火卦: {
    类型: '自身',
    名称: '起火卦',
    最大层数: 1,
    最大持续时间: 40,
    图标: 起火卦,
    备注: '40帧（2.5秒）后获得火卦',
  },
  祝由释放允许: {
    类型: '自身',
    名称: '祝由释放允许',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 20,
    延长后最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/13.png',
    备注: '允许释放祝由技能，该Buff只能通过起卦获得，但是可以通过变卦刷新',
  },
  麒麟: {
    类型: '自身',
    名称: '麒麟',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 21,
    图标: 'https://icon.jx3box.com/icon/25905.png',
    备注: '麒麟',
  },
  凤凰: {
    类型: '自身',
    名称: '凤凰',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 21,
    图标: 'https://icon.jx3box.com/icon/25904.png',
    备注: '凤凰',
  },
  凤凰起符: {
    类型: '自身',
    名称: '凤凰起符',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 21,
    图标: 'https://icon.jx3box.com/icon/25902.png',
    备注: '凤凰的起符状态',
  },
  '附灵·煌符': {
    类型: '自身',
    名称: '附灵·煌符',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/25887.png',
    备注: '持续期间检测到火卦时，获得25秒离火真煌增益。',
  },
  离火真煌: {
    类型: '自身',
    名称: '离火真煌',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 25,
    图标: 'https://icon.jx3box.com/icon/25887.png',
    备注: '会心等级提高1634点，会心效果等级提高602点。',
  },
  起符: {
    类型: '自身',
    名称: '起符',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 21,
    图标: 'https://icon.jx3box.com/icon/25902.png',
    备注: '起符',
  },
  应卦震符: {
    类型: '自身',
    名称: '应卦震符',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/25886.png',
  },
  化卦坠符: {
    类型: '自身',
    名称: '化卦坠符',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/25891.png',
  },
  免费变卦: {
    类型: '自身',
    名称: '免费变卦',
    最大层数: 2,
    最大持续时间: 每秒郭氏帧 * 999,
    图标: 'https://icon.jx3box.com/icon/25395.png',
  },
  世降共鸣: {
    类型: '自身',
    名称: '世降共鸣',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/22374.png',
    备注: '	施展“祝由·火离”后6秒内消耗星运时“祝由·火离”会产生共鸣，每次共鸣使其持续时间延长2秒并对附着目标额外造成混元内功伤害，若目标非侠士则造成原本130%的伤害。',
  },

  // DOT
  DOT_祝由_火离: {
    类型: '目标',
    名称: 'DOT_祝由_火离',
    最大层数: 1,
    最大作用次数: 12,
    最大持续时间: 每秒郭氏帧 * 26,
    伤害频率: 32,
    图标: 'https://icon.jx3box.com/icon/13866.png',
    备注: '使其每2秒对自身周围4尺内的最多4个目标造成混元性内功伤害，“祝由·火离”持续26秒。',
  },
  DOT_知微: {
    类型: '目标',
    名称: 'DOT_知微',
    最大层数: 2,
    最大作用次数: 15,
    最大持续时间: 每秒郭氏帧 * 30,
    伤害频率: 32,
    图标: 'https://icon.jx3box.com/icon/14058.png',
    备注: '使敌对目标每2秒受到混元性内功伤害，最多叠加2层，持续30秒；若目标已拥有该效果，则立刻生效1跳。',
  },
  ...(通用Buff数据 as any),
}
