import 技能统一类 from '../../通用类/技能统一类'
class 两仪化形 extends 技能统一类 {
  释放() {
    return this.模拟循环.角色状态信息.气点 > 0
      ? { 可以释放: true }
      : { 可以释放: false, 异常信息: '本期暂不支持零气释放两仪化形' }
  }
  命中() {
    const 气点 = this.模拟循环.角色状态信息.气点
    const 档位 = ['一', '二', '三', '四', '五', '六', '七', '八', '九', '十'][气点 - 1]
    this.本次释放记录 = { 实际伤害技能: '两仪化形·' + 档位 }
    this.触发伤害行为('两仪化形·' + 档位)
    this.模拟循环.改变气点(-气点, '两仪化形消耗')
    if (this.模拟循环.秘籍['两仪化形']?.includes('回豆')) this.模拟循环.改变气点(2, '两仪回豆秘籍')
    if (this.模拟循环.会心回豆) this.模拟循环.改变气点(2, '会心回豆')
    this.模拟循环.技能类实例集合.万世不竭.抱阳续剑()
  }
}
export default 两仪化形
