// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 停云势 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '停')
  static 回复锐意 = 0
  static 本次回复锐意 = 0

  constructor(模拟循环) {
    super(模拟循环)

    停云势.回复锐意 = 停云势.技能数据?.回复锐意 || 0

    this.初始化技能运行数据()
  }

  命中() {}

  造成伤害(索引) {
    // this.弱点击破标记()

    this.触发伤害行为('停云势')
    this.弱点击破判定()
  }

  释放后() {
    停云势.本次回复锐意 = 0
    if (this.模拟循环.校验奇穴是否存在?.('择行')) {
      停云势.本次回复锐意 = 停云势.回复锐意 * 3
    } else {
      停云势.本次回复锐意 = 停云势.回复锐意
    }

    this.触发回复锐意(停云势.本次回复锐意, 停云势.技能数据?.技能名称)

    if (this.模拟循环.校验奇穴是否存在?.('潋风')) {
      this.模拟循环.添加buff?.({ 名称: '潋风行云势额外锐意', 对象: '自身', 新增层数: 3 })
      this.模拟循环.添加buff?.({ 名称: '潋风行云势额外伤害', 对象: '自身', 新增层数: 1 })
    }

    this.保存释放记录()
  }

  保存释放记录() {
    // const 造成buff数据 = this.获取施加重要buff信息('潋风行云势额外伤害')

    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['潋风行云势额外伤害', '灭影追风', '流岚']),
      // 造成buff数据: 造成buff数据 ? 造成buff数据 : ({} as any),
    }
  }
}

export default 停云势

export const 停云势类型 = typeof 停云势
