import { 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 蝎心 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '蝎心')

  constructor(模拟循环) {
    super(模拟循环)
    蝎心.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '蝎心')
    this.初始化技能运行数据()
  }
  释放() {}

  获取读条时间() {
    if (this.模拟循环.当前自身buff列表.蛇悉?.当前层数) {
      return 0
    }

    return this.获取实际加速帧数(蝎心.技能数据?.读条时间, this.模拟循环.加速值)
  }

  读条(读条开始时间: number) {
    const 读条时间 = this.获取读条时间()
    if (读条时间) {
      this.模拟循环.添加待生效事件队列([
        {
          事件名称: '技能读条',
          事件时间: 读条开始时间 + 读条时间,
          事件备注: {
            技能名称: '蝎心',
          },
        },
      ])
    }
  }

  命中() {
    const 读条时间 = this.获取读条时间()
    if (!读条时间) {
      this.蝎心命中()
    }
  }

  读条伤害() {
    this.蝎心命中()
  }

  蝎心命中() {
    this.触发伤害行为('蝎心', 1)
    this.模拟循环.卸除buff?.({ 名称: '蛇悉', 对象: '自身', 卸除层数: 1 })

    // 游戏逻辑：先判断不鸣，再处理残香
    this.判断不鸣()

    if (this.模拟循环.校验奇穴是否存在('残香')) {
      this.所有DOT触发一跳()
      this.模拟循环.添加buff({ 名称: '残香', 对象: '自身', 新增层数: 1 })
    }
    this.触发降厄('蝎心')
    this.处理虫魄('蝎心')
    this.判断释灵()
    this.橙武处理()
    this.触发荒息('蝎心')
    this.保存释放记录('蝎心')
  }

  判断释灵() {
    if (
      this.模拟循环.校验奇穴是否存在('释灵') &&
      this.模拟循环.技能类实例集合?.蛇影DOT?.蛇影DOT存在判定()
    ) {
      this.模拟循环.技能类实例集合?.释灵DOT?.获得和刷新释灵DOT()
    }
  }

  判断不鸣() {
    if (
      this.模拟循环.校验奇穴是否存在('不鸣') &&
      this.模拟循环.当前自身buff列表?.['不鸣']?.当前层数
    ) {
      this.模拟循环.卸除buff({ 名称: '不鸣', 对象: '自身', 事件时间: this.模拟循环.当前时间 })
      this.模拟循环.技能类实例集合?.蛇影DOT?.获得和刷新蛇影DOT()
      this.模拟循环.技能类实例集合?.百足DOT?.获得和刷新百足DOT()
      this.模拟循环.技能类实例集合?.蟾啸DOT?.获得和刷新蟾啸DOT()
      this.处理虫魄('蛇影')
      this.处理虫魄('百足')
      this.处理虫魄('蟾啸')
      this.触发伤害行为('不鸣', 1)
    }
  }

  橙武处理() {
    if (this.模拟循环.当前自身buff列表?.['橙武']?.当前层数) {
      const 蛇影 = this.模拟循环.技能类实例集合?.蛇影DOT?.蛇影DOT存在判定()
      const 百足 = this.模拟循环.技能类实例集合?.百足DOT?.百足DOT存在判定()
      const 蟾啸 = this.模拟循环.技能类实例集合?.蟾啸DOT?.蟾啸DOT存在判定()

      if (蛇影) this.模拟循环.技能类实例集合?.蛇影DOT?.获得和刷新蛇影DOT()
      if (百足) this.模拟循环.技能类实例集合?.百足DOT?.获得和刷新百足DOT()
      if (蟾啸) this.模拟循环.技能类实例集合?.蟾啸DOT?.获得和刷新蟾啸DOT()

      if (!this.获取虫魄状态('蛇影') && 蛇影) {
        this.处理虫魄('蛇影')
      } else if (!this.获取虫魄状态('百足') && 百足) {
        this.处理虫魄('百足')
      } else if (!this.获取虫魄状态('蟾啸') && 蟾啸) {
        this.处理虫魄('蟾啸')
      }

      this.触发伤害行为('赤蝎', 1)
    }
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['引魂', '降厄', '圣蝎献祭', '橙武']),
    }
  }
}

export default 蝎心

export const 蝎心类型 = typeof 蝎心
