import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import 通用增益 from './通用增益/通用增益'

const 六合独尊增益: 技能增益列表类型[] = [
  ...通用增益,
  {
    BuffId: 9966,
    Buff等级: 1,
    增益名称: '同尘·1',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 512 / 1024 }],
  },
  {
    BuffId: 9966,
    Buff等级: 2,
    增益名称: '同尘·2',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 1024 / 1024 }],
  },
  {
    BuffId: 9966,
    Buff等级: 3,
    增益名称: '同尘·3',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 1536 / 1024 }],
  },
  {
    BuffId: 9966,
    Buff等级: 4,
    增益名称: '同尘·4',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 2048 / 1024 }],
  },
]

export default 六合独尊增益
