export const JCLEquipPositionMap = {
  2: '暗器',
  3: '衣服',
  4: '帽子',
  5: '项链',
  6: '戒指',
  7: '戒指_2',
  8: '腰带',
  9: '腰坠',
  10: '下装',
  11: '鞋子',
  12: '护腕',
  0: '武器',
}

export const EquipPositionMap = {
  帽子: '_1',
  衣服: '_2',
  腰带: '_3',
  护腕: '_4',
  下装: '_5',
  鞋子: '_6',
  项链: '_7',
  腰坠: '_8',
  戒指: '_9',
  戒指_2: '_10',
  暗器: '_11',
  武器: '_12',
}

export const 五彩石转换 = {
  // 混元
  融天: '星见', // 内功会心
  霹雳: '月华', // 内功会效
  雷鸣: '激流', // 内功攻击
  混沌: '灭气', // 内功破防
  // 阴性
  化雪: '星见', // 内功会心
  杯雪: '月华', // 内功会效
  霜冷: '激流', // 内功攻击
  冻髓: '灭气', // 内功破防
  // 阳性
  燎原: '星见', // 内功会心
  浴火: '月华', // 内功会效
  烈阳: '激流', // 内功攻击
  日炎: '灭气', // 内功破防
  // 阴阳
  虹卷: '星见', // 内功会心
  界影: '月华', // 内功会效
  琉璃: '激流', // 内功攻击
  焚虚: '灭气', // 内功破防
  // 毒性
  蚀骨: '星见', // 内功会心
  穿石: '月华', // 内功会效
  鹤顶: '激流', // 内功攻击
  腐心: '灭气', // 内功破防
}

// 以ohter表为准，enchart表里写错了
export const 五行石映射 = {
  6211: 1,
  6210: 1,
  24442: 1,
  6212: 2,
  6219: 2,
  24443: 2,
  6213: 3,
  6220: 3,
  24444: 3,
  6214: 4,
  6222: 4,
  24445: 4,
  6215: 5,
  6221: 5,
  24446: 5,
  6216: 6,
  6223: 6,
  24447: 6,
  6217: 7,
  6224: 7,
  24448: 7,
  6218: 8,
  6225: 8,
  24449: 8,
}

export const DaFuMoMap = {
  帽子: '大附魔_伤帽',
  衣服: '大附魔_伤衣',
  腰带: '大附魔_伤腰',
  护腕: '大附魔_伤腕',
  鞋子: '大附魔_伤鞋',
}
