import { 按数字生成数组 } from '@/工具函数/help'
import 技能统一类 from '../../通用类/技能统一类'
import { 每秒郭氏帧 } from '@/数据/常量'

class 经脉循行 extends 技能统一类 {
  constructor(模拟循环) {
    super(模拟循环)
  }

  释放() {
    return
  }

  获得经脉循行() {
    const 当前身上有经脉循行 = this.经脉循行状态校验()
    this.模拟循环.添加buff?.({ 名称: '经脉循行', 对象: '自身' })
    if (!当前身上有经脉循行) {
      this.添加经脉循行每秒回复事件()
    }
  }

  添加经脉循行每秒回复事件(初始时间 = 8) {
    if (this.模拟循环.校验奇穴是否存在('玉枕')) {
      return
    }
    let 当前时间 = this.模拟循环.当前时间 || 0
    // 生成100个事件，理论上100秒内必定续费，简单处理

    // 如果是第一次添加，为了错位，提前设置8帧
    if (当前时间 === 0) {
      当前时间 = -(每秒郭氏帧 - 初始时间)
    }
    const 待生效事件 = 按数字生成数组(1000).map((次数) => {
      return {
        事件名称: `经脉循行_秒回`,
        事件时间: 当前时间 + 每秒郭氏帧 * 次数,
      }
    })
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  经脉循行每秒回复() {
    this.模拟循环.回复能量(3, '任脉')
    this.模拟循环.回复能量(3, '督脉')
    if (this.模拟循环.校验奇穴是否存在('相息')) {
      this.模拟循环.回复能量(2, '任脉')
      this.模拟循环.回复能量(2, '督脉')
    }
    if (this?.模拟循环?.当前自身buff列表?.['扬尘']?.当前层数) {
      const 层数 = this?.模拟循环?.当前自身buff列表?.['扬尘']?.当前层数 || 1
      this.模拟循环.回复能量(层数, '任脉')
      this.模拟循环.回复能量(层数, '督脉')
    }
  }

  初始化经脉循行(初始时间) {
    this.添加经脉循行每秒回复事件(初始时间)
  }

  经脉循行状态校验() {
    return !!this?.模拟循环.当前自身buff列表?.['经脉循行']?.当前层数
  }

  经脉循行添加校验() {
    if (
      this.模拟循环.角色状态信息.能量信息.任脉 >= 50 &&
      this.模拟循环.角色状态信息.能量信息.督脉 >= 50
    ) {
      this.获得经脉循行()
    }
  }

  经脉循行卸除校验() {
    if (
      this.模拟循环.角色状态信息.能量信息.任脉 < 50 ||
      this.模拟循环.角色状态信息.能量信息.督脉 < 50
    ) {
      this.模拟循环.卸除buff?.({ 名称: '经脉循行', 对象: '自身', 卸除层数: 1 })
      this.模拟循环.删除待生效事件队列(`经脉循行_秒回`)
    }
  }
}

export default 经脉循行

export const 经脉循行类型 = typeof 经脉循行
