export default {
    "10003": {
        "10003": {
            "name": "易筋经",
            "attributes": {
                "pve_addition_base": 287,
                "magical_shield_base": 2113,
                "physical_shield_base": 1800,
                "spunk_to_solar_attack_power": 2007,
                "spunk_to_solar_critical_strike": 410,
                "max_life_gain": 368,
                "magical_attack_power_base": 7242
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "buffs": [
                24453,
                1919
            ],
            "skills": [
                11,
                19090,
                32887,
                25766
            ],
            "desc": "少林至高绝学，修炼同时调息五脏六腑，奇经八脉，使精神、形体和气息结合起来。",
            "critical_type": "solar",
            "damage_type": "solar",
            "belong_key": "belong_10003"
        },
        "232": {
            "name": "普渡四方",
            "recipes": [
                "recipe_263_1",
                "recipe_264_1",
                "recipe_265_1",
                "recipe_266_1",
                "recipe_267_1",
                "recipe_268_1",
                "recipe_269_1",
                "recipe_270_1"
            ],
            "buffs": [
                890
            ],
            "skills": [
                17641,
                17642
            ],
            "desc": "对目标造成100%武器伤害附加<SUB 17641 0>阳性内功伤害，并使目标获得“普渡”效果，受到“罗汉棍法”“龙爪功”套路招式伤害提高4%，可叠加2层，持续22秒。<TALENT 16890 1 对目标6尺范围内额外2个目标造成伤害><TALENT 2558 2 调息时间降低0.5秒，受到阳性内功攻击加成提高10%><TALENT 2564 1 伤害提高3%><TALENT 5896 1 伤害提高10%><TALENT 6594 1 会心几率提高10%，会心效果提高10%><TALENT 2564 3 伤害提高9%><TALENT 2571 1 伤害提高2%><TALENT 2571 2 伤害提高4%><TALENT 5941 1 附带20%额外威胁值><TALENT 2578 1 招式附带额外的威胁值><TALENT 5929 1 使下一个阳性内功招式的威胁提高30%，并获得1点禅那><TALENT 2582 2 命中目标后有100%几率获得1点禅那，并使下一个阳性内功招式的威胁提高30%><TALENT 6589 1 可叠加的“普渡”效果提高到3层><TALENT 5906 1 无视目标60%内功防御等级><TALENT 17750 1 >",
            "belong_key": "belong_232"
        },
        "235": {
            "name": "横扫六合",
            "recipes": [
                "recipe_254_1",
                "recipe_255_1",
                "recipe_256_1",
                "recipe_257_1",
                "recipe_258_1",
                "recipe_259_1",
                "recipe_260_1",
                "recipe_261_1",
                "recipe_262_1"
            ],
            "buffs": [
                24285
            ],
            "dots": {
                "743": [
                    43073
                ]
            },
            "skills": [
                3830
            ],
            "desc": "对周围6尺内的最多5个目标造成100%武器伤害附加<SUB 3830 0>阳性内功伤害，并使其<BUFF 743 0 desc>(+<SKILLEx {D0} {TotalSolarAP 0.608837}>)，持续<BUFF 743 0 time>。在自身位置产生一个8尺的“金刚日轮阵”，持续25秒，阵法内自身阳性会心会效提高6%。<TALENT 5931 1 命中目标后使自身气血上限提高20%，持续5秒><TALENT 5932 1 每命中一个目标，使自身受到伤害降低10%，可叠加3层，持续6秒><TALENT 14745 1 每命中一个目标，伤害提高20%.每多命中一个目标，调息时间降低1秒><TALENT 2577 1 若只命中一个目标，则在易筋经心法下伤害效果提高65%，在洗髓心法下产生的威胁提高100%><TALENT 5910 1 若只命中一个目标，则在易筋经心法下伤害效果提高65%，在洗髓心法下产生的威胁提高100%><TALENT 5928 1 持续伤害效果期间，目标造成的伤害降低3%><TALENT 6578 1 伤害效果提高50%><EnchantID 10092 横扫六合的持续伤害效果可叠加3层。每多命中一个目标，调息时间降低1秒><TALENT 24884 1 调息时间降低3秒，会心几率提高10%，会心效果提高20%，持续伤害可以叠加3层。每多命中一个目标，调息时间降低1秒><TALENT 32649 1 调息时间增加至20秒。施展“横扫六合”后重置“守缺式”调息时间，下次“守缺式”释放距离提高至15尺并附带冲刺效果，期间使棍子围绕自身旋转，持续9秒。期间对周围四尺最多5个目标每秒造成一次<SUB 28542 0>阳性内功伤害，无法使用武器，施展“守缺式”后激活“拿云式”><TALENT 6579 1 “横扫六合”每多命中一个目标，调息时间降低1.5秒>",
            "belong_key": "belong_235"
        },
        "245": {
            "name": "罗汉金身",
            "buffs": [
                2797
            ],
            "desc": "需禅那点，自身直接伤害的40%转化为内力值且使自身伤害反弹15%，提高20%的破防等级，最少一点禅那持续10秒，最多三点禅那持续30秒。<TALENT 5926 1 持续前5秒反弹受到的20%伤害><TALENT 14752 1 反弹效果提高50%，效果期间受到伤害有10%几率使自身回复5%气血最大值><TALENT 14755 1 会返还消耗的禅那，效果期间使自身不受减速效果影响，受到伤害有15%几率使攻击者倒地3秒><TALENT 2561 2 效果提高30%><TALENT 14820 1 效果期间施展招式有70%几率顺势挥棍对自身前方6尺扇形区域最多6个敌对目标造成<SUB 24028 1>阳性内功伤害><TALENT 17730 1 使自身内功基础攻击提高30%><TALENT 23972 1 会返还消耗的禅那，效果期间自身体质的30%转换为阳性内功攻击且受到伤害有10%几率使自身回复5%气血最大值><TALENT 25063 1 “罗汉金身”效果持续期间，自身被外功伤害命中时，会心几率提高1%，御劲提高1%，持续6秒，最多叠加10层>",
            "belong_key": "belong_245"
        },
        "15165": {
            "name": "二业依缘",
            "buffs": [
                10023
            ],
            "desc": "使自身在“袈裟”“伏魔”状态下切换。\\n“袈裟”状态：受到伤害降低10%，受到治疗效果提高10%，受到控制效果时获得<NounID 88>。“伏魔”状态：移动速度提高10%，自身伤害提高15%，威胁值降低20%。从“袈裟”状态切换为“伏魔”状态时，会获得持续15秒的免控效果（击退和被拉除外），每拥有1层<NounID 88>，该时长减少1.5秒。<TALENT 26762 1 在“袈裟”“伏魔”状态下切换将免疫控制效果（击退和被拉除外）持续3秒><TALENT 32651 1 “二业依缘”调息时间调整为60秒。切换“袈裟”状态后，下一次施展“守缺式”“横扫六合”无调息，施展后重置“二业依缘”调息时间，获得“业因”。切换“伏魔”时将“业因”转化为4层“果报”。每次施展“韦陀献杵”“拿云式”时消耗一层“果报”并且额外回复一点禅那，“业因”为“守缺式”则招式对非侠士目标造成额外伤害，“业因”为“横扫六合”时招式对非侠士目标造成范围伤害><TALENT 38957 1 “伏魔”状态下造成伤害无视目标60%内功防御><TALENT 42406 1 >",
            "belong_key": "belong_15165"
        },
        "260": {
            "name": "擒龙诀",
            "recipes": [
                "recipe_5774_1",
                "recipe_5775_1",
                "recipe_5776_1",
                "recipe_5777_1",
                "recipe_5778_1"
            ],
            "buffs": [
                2686
            ],
            "desc": "瞬间使自身的禅那点数达到三点，使用后每1.5秒回复1点禅那，并使自身阳性内功基础攻击提高20%，持续15秒。<TALENT 14750 1 变为3层充能效果，25秒充能时间，其增益效果持续9秒><TALENT 14794 1 施展“擒龙诀”，每0.5秒使自身基础内外功防御等级提高3%，最高可叠加10层，持续10秒><TALENT 14762 1 自身获得的“弱水”效果持续时间延长至20秒><TALENT 2567 1 施展后获得“弱水”效果，使自身阳性内功基础攻击力提高20%，持续10秒><TALENT 2567 2 施展后获得“弱水”效果，使自身阳性内功基础攻击力提高20%，持续10秒><EnchantID 10094 洗髓心法下不再提升自身的阳性内功基础攻击，而使自身的内外功防御等级提高20%><TALENT 21697 1 自身“禅意”将守护自身，“禅意”会每1秒对10尺范围的一个目标造成<SUB 21700 0>阳性内功伤害，并会优先以攻击自身的目标作为对象。且当“禅意”和自身攻击同一个对象时，“禅意”的该次攻击会变成4尺范围的伤害和减速效果“禅意”持续10秒><TALENT 28348 1 “擒龙诀”效果期间受到目标伤害后会标记目标5秒，最多可叠加5层。“龙爪功”套路伤害招式会引爆目标标记，并依据标记层数造成伤害><TALENT 6580 1 “擒龙诀”期间，禅那值上限提升到6个，每有一个禅那点，每1.5秒恢复0.35%气血最大值><TALENT 38623 1 “擒龙诀”期间获得“正念”效果：使自身移动速度降低15%，无法受到其它减速效果影响。“罗汉棍法”距离增加2尺且伤害提高40%，“捉影式”前两次施展无调息>",
            "belong_key": "belong_260"
        },
        "233": {
            "name": "韦陀献杵",
            "recipes": [
                "recipe_290_1",
                "recipe_291_1",
                "recipe_292_1",
                "recipe_293_1",
                "recipe_294_1",
                "recipe_295_1",
                "recipe_296_1",
                "recipe_297_1",
                "recipe_298_1"
            ],
            "skills": [
                3848,
                3849,
                3850
            ],
            "desc": "对目标造成200%武器伤害，附加最少一点禅那对目标造成<SUB 3833 0>阳性内功伤害，最多三点禅那对目标造成<SUB 3839 0>阳性内功伤害。三点禅那施展将造成一次破招伤害。<TALENT 5906 1 无视目标60%内功防御等级><TALENT 5924 1 消耗3点禅那命中后自身威胁值提高30%，持续10秒><TALENT 2569 2 会心后有60%几率使目标每3秒受到56点阳性内功伤害，持续18秒><TALENT 5913 1 3点禅那施展招式附带“降魔”效果，使目标受到该招式额外25%的阳性内功伤害><TALENT 2570 2 三点禅那施展招式附带“降魔”效果，使目标受到该招式额外25%的阳性内功伤害><TALENT 2571 1 伤害提高2%><TALENT 2571 2 伤害提高4%><TALENT 2571 3 伤害提高6%><TALENT 5899 1 对目标周围6尺范围内最多5个目标造成阳性内功伤害，消耗禅那越多，伤害越高><TALENT 5922 1 3点禅那施展后自身受到下两次攻击伤害降低30%><TALENT 5914 1 使目标获得“自在”效果，获得“自在”效果的玩家攻击带有反弹效果的玩家会强化目标的反弹效果，每层强化30%，持续18秒，可叠加三层><TALENT 6596 1 命中“横扫六合”持续伤害的目标伤害提高20%><TALENT 5912 1 命中附带自身“横扫六合”持续伤害目标时，能使下三次“横扫六合”持续伤害立即生效><TALENT 25353 1 3点禅那施展“韦陀献杵”，使得自身“破招”提高10%，此效果持续15秒，最多叠加5层><TALENT 37455 1 三点禅那施展“拿云式”“韦陀献杵”命中非侠士目标后，下一次“普渡四方”或“韦陀献杵”对非侠士目标附带一次额外伤害><TALENT 6589 1 “韦陀献杵”使目标获得“普渡”效果><TALENT 42406 1 >",
            "belong_key": "belong_233"
        },
        "236": {
            "name": "摩诃无量",
            "attributes": {
                "solar_damage_base": 22,
                "solar_damage_rand": 2
            },
            "skills": [
                236
            ],
            "desc": "击倒目标3秒，造成100%武器伤害附加<SKILL SolarDamage>点(+<SKILLEx {D0} {SkillSolarAP}>)阳性内功伤害，若成功击倒目标使自身获得3点禅那。<TALENT 5919 1 释放距离提高4尺，调息时间降低5秒，附带大量威胁值，并强制目标攻击少林自身><TALENT 6587 1 招式有效距离提高4尺，若成功控制目标使目标无法施展轻功且受到罗汉棍法套路下招式伤害提高10%持续3秒，命中带有自身“普渡”效果的目标，每层“普渡”使击倒和封轻功及易伤效果提高1秒><TALENT 5920 1 命中后目标受到的阳性内功伤害提高10%，持续10秒>",
            "belong_key": "belong_236"
        },
        "238": {
            "name": "捕风式",
            "recipes": [
                "recipe_227_1",
                "recipe_228_1",
                "recipe_229_1",
                "recipe_230_1",
                "recipe_231_1",
                "recipe_232_1",
                "recipe_233_1",
                "recipe_234_1",
                "recipe_235_1"
            ],
            "skills": [
                14951
            ],
            "desc": "对目标造成<SUB 14951 0>阳性内功伤害，并获得一点禅那。施展后可以使“捉影式”无需运功。<TALENT 16897 1 使目标移动速度降低60%，持续12秒><TALENT 5897 1 “捕风式”效果期间“捉影式”施展距离提高5尺，且不消耗自身“捕风式”效果><TALENT 6593 1 目标气血值低于30%，命中后重置“捉影式”的调息时间，每30秒触发1次>",
            "belong_key": "belong_238"
        },
        "2572": {
            "name": "守缺式",
            "recipes": [
                "recipe_281_1",
                "recipe_282_1",
                "recipe_283_1",
                "recipe_284_1",
                "recipe_285_1",
                "recipe_286_1",
                "recipe_287_1",
                "recipe_288_1",
                "recipe_289_1"
            ],
            "skills": [
                3816
            ],
            "desc": "对目标造成<SUB 3816 0>阳性内功伤害，并获得1点禅那。<TALENT 16886 1 使目标被疗伤效果减低25%，持续12秒，可叠加2层><TALENT 5915 1 会心几率提高10%，会心效果提高10%。施展“守缺式”后使自身8秒内会心几率提高5%，会心效果提高5%><TALENT 6596 1 命中“横扫六合”持续伤害的目标伤害提高20%><TALENT 5906 1 无视目标60%内功防御等级><TALENT 37370 1 命中敌方玩家时，获得6500点基础体质，最多叠加6层，持续8秒。满层时提供每秒回复1%最大生命值><TALENT 37371 1 造成伤害时，依据和目标侠士的体质差值造成额外伤害、回复自身气血值>",
            "belong_key": "belong_2572"
        },
        "243": {
            "name": "拿云式",
            "recipes": [
                "recipe_1645_1",
                "recipe_1646_1",
                "recipe_1647_1",
                "recipe_1648_1",
                "recipe_1649_1",
                "recipe_1650_1",
                "recipe_1651_1",
                "recipe_1652_1"
            ],
            "skills": [
                13682,
                13684,
                13686
            ],
            "desc": "当目标气血值少于30%时方可施展此招式，尝试终结目标，最少1点禅那对目标造成<SUB 13682 0>阳性内功伤害，最多3点禅那对目标造成<SUB 13686 0>阳性内功伤害。3点禅那施展将造成一次破招伤害。<TALENT 5906 1 无视目标60%内功防御等级><TALENT 2570 1 三点禅那施展招式附带“降魔”效果，使目标受到该招式额外25%的阳性内功伤害><TALENT 2570 2 三点禅那施展招式附带“降魔”效果，使目标受到该招式额外25%的阳性内功伤害><TALENT 2571 1 伤害提高2%><TALENT 2571 2 伤害提高4%><TALENT 2571 3 伤害提高6%><TALENT 5913 1 3点禅那施展招式附带“降魔”效果，使目标受到该招式额外25%的阳性内功伤害><EnchantID 10091 3点禅那施放“拿云式”，使下一个“韦陀献杵”施展立即回复消耗掉的所有禅那><TALENT 6590 1 命中血量低于30%的目标伤害提高15%。施展内功伤害招式有30%几率获得“拿云”效果:使自身无视目标气血百分比可立刻施展“拿云式”，最多可叠加3层><TALENT 5914 1 使目标获得“自在”效果，获得“自在”效果的玩家攻击带有反弹效果的玩家会强化目标的反弹效果，每层强化30%，持续18秒，可叠加三层><TALENT 6596 1 命中“横扫六合”持续伤害的目标伤害提高20%><TALENT 21703 1 消耗三点禅那施展“拿云式”，施展距离提高至15尺并附带冲刺效果，造成伤害提高20%><TALENT 5912 1 命中附带自身“横扫六合”持续伤害目标时，能使下三次“横扫六合”持续伤害立即生效><TALENT 37369 1 命中目标后，在目标周围6尺引发一次冲击波造成伤害，冲击波依据自身基础体质和敌方目标玩家的差值，使目标获得3秒10—30%的降低加速效果><TALENT 37371 1 造成伤害时，依据和目标侠士的体质差值造成额外伤害、回复自身气血值><TALENT 37455 1 三点禅那施展“拿云式”“韦陀献杵”命中非侠士目标后，下一次“普渡四方”或“韦陀献杵”对非侠士目标附带一次额外伤害><TALENT 42406 1 >",
            "belong_key": "belong_243"
        },
        "18604": {
            "name": "千斤坠",
            "skills": [
                28619
            ],
            "desc": "门派轻功，获得一点禅那，迅速腾空并高速下坠至目标区域，对半径5尺范围内最多10个目标造成<SUB 17775 0>阳性伤害并眩晕持续3秒。<TALENT 5935 1 每命中一个目标提高自身内功和外功防御等级5%，持续6秒，可以叠加4层><TALENT 2551 1 伤害提高30%，每命中一个目标有50%几率获得1点禅那><TALENT 2551 2 伤害提高60%，每命中一个目标有100%几率获得1点禅那><TALENT 6595 1 变为2层充能，施展后解除自身锁足、减速效果，自身不受招式控制（击退和被拉除外），持续4秒><TALENT 24885 1 施展后使得接下来5次跳跃，落地短暂延迟后将会对6尺范围最多5个目标造成<SUB 24886 0>阳性内功伤害。跳跃在空中时间越长，下次下落伤害越高，范围越大><TALENT 5936 1 “千斤坠”充能两层，施展“千斤坠”使得目标强制攻击自身，持续4.5秒><TALENT 30913 1 施展后进入“纷纭”10秒：增加15%气血上限，可施展主动招式“千斤坠·无取”和“千斤坠·无舍”。施展“千斤坠”、“千斤坠·无取”“千斤坠·无舍”每命中一个玩家回复自身5%当前气血值><TALENT 32648 1 在“金刚日轮阵”中，施展“龙爪功”套路伤害招式附带一次<SUB 32656 1>伤害，“千斤坠”落地时可以将自身“金刚日轮阵”移动到自身位置><TALENT 28317 1 高于8尺施展造成伤害提高50%，造成控制时间延长1秒>",
            "belong_key": "belong_18604"
        },
        "32651": {
            "name": "业因",
            "recipes": [
                "recipe_3038_1",
                "recipe_3039_1"
            ],
            "skills": [
                32659,
                32660
            ],
            "desc": "“二业依缘”调息时间调整为60秒。切换“袈裟”状态后，下一次施展“守缺式”“横扫六合”无调息，施展后重置“二业依缘”调息时间，并记录为“业因”。切换“伏魔”时将“业因”转化为4层“果报”。每次施展“韦陀献杵”“拿云式”时消耗一层“果报”并且额外回复一点禅那，“业因”为“守缺式”则招式对非侠士目标造成额外无质伤害，“业因”为“横扫六合”时招式对非侠士目标造成范围无质伤害。",
            "belong_key": "belong_32651"
        },
        "32649": {
            "name": "无诤",
            "recipes": [
                "recipe_2616_1"
            ],
            "dots": {
                "743": [
                    28539
                ]
            },
            "skills": [
                28542
            ],
            "desc": "“横扫六合”调息时间增加至17秒。施展“横扫六合”后重置“守缺式”调息时间，下次“守缺式”释放距离提高至15尺并附带冲刺效果，期间使棍子围绕自身旋转，持续9秒。期间对周围四尺最多5个目标每秒造成<SUB 28542 0>阳性内功伤害，并附带阳性内功持续伤害，无法使用武器，施展“守缺式”后激活“拿云式”。可施展二段招式结束无法使用武器状态。",
            "belong_key": "belong_32649"
        },
        "24819": {
            "name": "醍醐灌顶",
            "skills": [
                24888
            ],
            "desc": "回复1点“禅那”，免疫控制效果2秒，降低自身“擒龙诀”20%调息时间。自身和禅灵都挥棍对自身前方12尺范围最多5个目标造成<SUB 24888 0>阳性内功伤害，伤害命中目标使其眩晕2秒并降低自身“千斤坠”3秒调息时间。该招式视为罗汉棍法套路招式。",
            "belong_key": "belong_24819"
        },
        "42405": {
            "name": "藏识众境",
            "skills": [
                43592,
                42407
            ],
            "desc": "对目标点6尺范围内最多5个目标造成<SUB 43592 1>阳性内功伤害并拉到身前，并激活二段招式<NounID 110>，激活<NounID 110>后6秒内可通过消耗三点禅那获得<NounID 111>效果。",
            "belong_key": "belong_42405"
        },
        "6589": {
            "name": "明法",
            "buffs": [
                12479
            ],
            "desc": "“普渡四方”可叠加的“普渡”效果提高到3层。“韦陀献杵”使目标获得“普渡”效果。",
            "belong_key": "belong_6589"
        },
        "6595": {
            "name": "妙法",
            "recipes": [
                "recipe_5113_1"
            ],
            "desc": "“千斤坠”变为2层充能，施展回复自身10%最大气血值且解除自身锁足、减速效果。",
            "belong_key": "belong_6595"
        },
        "37369": {
            "name": "挂碍",
            "skills": [
                37374
            ],
            "desc": "“拿云式”命中侠士目标后，在目标周围6尺造成范围伤害，并返还“守缺式”调息时间3秒。",
            "belong_key": "belong_37369"
        },
        "240": {
            "name": "抢珠式",
            "desc": "打断目标运功，使其<BUFF 445 4 desc>，持续<BUFF 445 4 time>。",
            "belong_key": "belong_240"
        },
        "6586": {
            "name": "三生",
            "buffs": [
                12590
            ],
            "desc": "每点禅那增加自身10%无双等级，最多增加30%。",
            "belong_key": "belong_6586"
        },
        "42406": {
            "name": "承缘",
            "desc": "切换“伏魔”状态后，下三次消耗3点禅那施展“拿云式”或“韦陀献杵”伤害提高20%，并返还全部消耗。",
            "belong_key": "belong_42406"
        },
        "14758": {
            "name": "静色",
            "recipes": [
                "recipe_5539_1"
            ],
            "desc": "“捉影式”变为2层充能技能，23秒充能时间。战斗状态下“捉影式”处于调息状态，4秒内未施展任何伤害招式，则使“捉影式”调息时间降低5秒。",
            "belong_key": "belong_14758"
        },
        "5912": {
            "name": "善心",
            "desc": "施展“韦陀献杵”“拿云式”命中附带自身“横扫六合”持续伤害目标时能使下三次持续伤害立即生效。",
            "belong_key": "belong_5912"
        },
        "17730": {
            "name": "金刚怒目",
            "buffs": [
                11979,
                11981
            ],
            "desc": "施展“罗汉金身”使自身内功基础攻击提高20%，效果期间造成伤害无视目标60%内功防御。",
            "belong_key": "belong_17730"
        },
        "14750": {
            "name": "系珠",
            "recipes": [
                "recipe_4280_1"
            ],
            "desc": "“擒龙诀”充能时间25秒，其增益效果持续12秒，效果期间提高自身阳性会心几率10%。",
            "belong_key": "belong_14750"
        },
        "38621": {
            "name": "威服",
            "skills": [
                38622
            ],
            "desc": "“大狮子吼”释放后留下一只金刚狮子在原地释放吼叫，每2秒对附近8尺最多5个目标造成<SUB 38622 0>阳性内功伤害，持续6秒。",
            "belong_key": "belong_38621"
        },
        "18623": {
            "name": "狮啸",
            "desc": "“大狮子吼”不再附带控制效果，生成一个半径10尺的阵法，使自身当前气血及气血最大值提高150%，阵法内的队友受到的伤害的99%传递给自身，期间可施展二段招式结束阵法。少林自身不可移动，调息时间50秒。",
            "belong_key": "belong_18623"
        },
        "6596": {
            "name": "众嗔",
            "buffs": [
                13910
            ],
            "skills": [
                3814
            ],
            "desc": "施展“守缺式”、“韦陀献杵”、“拿云式”命中“横扫六合”持续伤害的目标伤害提高30%。",
            "belong_key": "belong_6596"
        },
        "37371": {
            "name": "法身",
            "skills": [
                37376
            ],
            "desc": "“守缺式”、“拿云式”造成伤害时，依据和目标侠士的体质差值造成额外伤害、回复自身气血值。",
            "belong_key": "belong_37371"
        },
        "5909": {
            "name": "善护",
            "desc": "当气血值低于70%时被攻击则获得“善护”气劲，使自身受到伤害降低20%，持续5秒。",
            "belong_key": "belong_5909"
        },
        "5934": {
            "name": "无色",
            "desc": "“无相诀”调息时间降低15秒，不再附带减伤效果，反弹受到的70%伤害，效果不会被卸除，持续10秒。",
            "belong_key": "belong_5934"
        },
        "6590": {
            "name": "净果",
            "skills": [
                13681,
                13683,
                13685,
                36049,
                36050,
                36051
            ],
            "desc": "“拿云式”命中血量低于30%的目标伤害提高15%。施展内功伤害招式有30%几率获得“拿云”效果：使自身无视目标气血百分比可立刻施展“拿云式”，最多可叠加3层。",
            "belong_key": "belong_6590"
        },
        "259": {
            "name": "轮回诀",
            "desc": "重伤倒地后方可施展，救治自身并使自身恢复30%(<SKILLEx {D0} {MaxLife 0.3}>点)气血值最大值与30%(<SKILLEx {D0} {MaxMana 0.3}>点)内力最大值，重伤起身后4秒内受到的伤害降低80%。<TALENT 5907 1 重置“达摩武诀”套路下其他招式的调息时间><TALENT 5908 1 重伤起身后小队成员的基础气血上限提高10%，持续10秒，并回复10%的气血>",
            "belong_key": "belong_259"
        },
        "32647": {
            "name": "无执",
            "desc": "战斗中无法使用武器、无法运功效果期间自身移动速度提高20%且免疫减速，“龙爪功”套路招式公共调息时间降低至1秒。",
            "belong_key": "belong_32647"
        },
        "38623": {
            "name": "正念",
            "buffs": [
                29304
            ],
            "desc": "“擒龙诀”期间获得“正念”效果：不受减速效果影响。“罗汉棍法”距离增加2尺且伤害提高40%，“捉影式”首次施展无调息。",
            "belong_key": "belong_38623"
        },
        "32648": {
            "name": "金刚日轮",
            "skills": [
                32656
            ],
            "desc": "在“金刚日轮阵”中，施展“龙爪功”套路伤害招式附带一次伤害。“千斤坠”落地时可以将自身“金刚日轮阵”移动到自身位置。",
            "belong_key": "belong_32648"
        },
        "21703": {
            "name": "缘觉",
            "buffs": [
                14916
            ],
            "desc": "消耗三点禅那施展“拿云式”，施展距离提高至15尺并附带冲刺效果，造成伤害提高60%。",
            "belong_key": "belong_21703"
        },
        "21697": {
            "name": "明澈",
            "skills": [
                21700
            ],
            "desc": "施展“擒龙诀”，自身“禅意”将守护自身，“禅意”会每1秒对10尺范围的一个目标造成<SUB 21700 0>阳性内功伤害，并会优先以攻击自身的目标作为对象。且当“禅意”和自身攻击同一个对象时，“禅意”的该次攻击会变成4尺范围的伤害和减速效果。“禅意”持续10秒。",
            "belong_key": "belong_21697"
        },
        "14752": {
            "name": "五识",
            "buffs": [
                9809,
                11981
            ],
            "desc": "“罗汉金身”反弹效果提高50%，效果期间受到伤害有20%几率使自身回复5%气血最大值。",
            "belong_key": "belong_14752"
        },
        "5910": {
            "name": "幻身",
            "dots": {
                "743": [
                    43136
                ]
            },
            "skills": [
                3808,
                3810
            ],
            "desc": "“横扫六合”若只命中一个目标，则在易筋经心法下伤害提高65%，在洗髓经心法下产生的威胁值提高100%。",
            "belong_key": "belong_5910"
        },
        "14793": {
            "name": "意相",
            "desc": "“无相诀”可在“眩晕”、“定身”状态下释放，自身气血值每低于10%，减伤效果增加5%，减伤效果最多增加至90%。",
            "belong_key": "belong_14793"
        },
        "14795": {
            "name": "独觉",
            "desc": "“锻骨诀”施展后使自身不受外功伤害影响，持续4秒。",
            "belong_key": "belong_14795"
        },
        "6580": {
            "name": "菩提身",
            "desc": "“擒龙诀”期间，禅那值上限提升到6个，每有一个禅那点，每1.5秒恢复0.35%气血最大值。",
            "belong_key": "belong_6580"
        },
        "5915": {
            "name": "身意",
            "recipes": [
                "recipe_2299_1"
            ],
            "buffs": [
                21859
            ],
            "desc": "“守缺式”会心几率提高10%，会心效果提高10%。施展“守缺式”后使自身8秒内会心几率提高10%，会心效果提高10%。",
            "belong_key": "belong_5915"
        },
        "16886": {
            "name": "尘息",
            "desc": "“守缺式”使目标被疗伤效果减低25%，持续12秒，可叠加2层。",
            "belong_key": "belong_16886"
        },
        "5913": {
            "name": "降魔渡厄",
            "recipes": [
                "recipe_4047_2",
                "recipe_4048_2"
            ],
            "skills": [
                271
            ],
            "desc": "3点禅那施展“韦陀献杵”“拿云式”附带“降魔”效果，使目标受到该招式40%的阳性内功伤害。该伤害不受秘籍奇穴影响。",
            "belong_key": "belong_5913"
        },
        "24884": {
            "name": "我闻",
            "recipes": [
                "recipe_5157_1"
            ],
            "desc": "“横扫六合”会心几率提高10%，会心效果提高20%，持续伤害可以叠加2层。“横扫六合”每多命中一个目标，调息时间降低1秒。",
            "belong_key": "belong_24884"
        },
        "37455": {
            "name": "布泽",
            "skills": [
                38615
            ],
            "desc": "消耗三点禅那施展“拿云式”“韦陀献杵”命中非侠士目标后，获得“布泽”最多3层。下一次“普渡四方”或“韦陀献杵”会消耗一层“布泽”并对非侠士目标附带一次额外伤害。目标气血值少于30%时，“拿云式”也会消耗一层“布泽”并对非侠士目标附带一次额外伤害。",
            "belong_key": "belong_37455"
        },
        "6587": {
            "name": "无量波罗",
            "recipes": [
                "recipe_1258_1"
            ],
            "buffs": [
                30299
            ],
            "desc": "“摩诃无量”招式有效距离提高4尺，若成功控制目标使目标无法施展轻功且受到罗汉棍法套路下招式伤害提高30%持续3秒，命中带有自身“普渡”效果的目标，每层“普渡”使击倒和封轻功效果及易伤提高1秒。",
            "belong_key": "belong_6587"
        },
        "37370": {
            "name": "无可证",
            "desc": "“守缺式”命中敌方玩家时，获得3900点基础体质，最多叠加5层，持续8秒。满层时提供每秒回复1%最大生命值。",
            "belong_key": "belong_37370"
        },
        "42920": {
            "name": "法王身",
            "attributes": {
                "max_life_gain": 154
            },
            "desc": "基础气血上限提高15%。",
            "belong_key": "belong_42920"
        }
    },
    "10014": {
        "10014": {
            "name": "紫霞功",
            "attributes": {
                "magical_shield_base": 2347,
                "physical_shield_base": 2850,
                "spirit_to_neutral_attack_power": 1946,
                "spirit_to_neutral_critical_strike": 625,
                "max_life_gain": 245,
                "magical_attack_power_base": 6518,
                "neutral_critical_strike_base": 5527,
                "pve_addition_base": 522
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "buffs": [
                1916
            ],
            "skills": [
                18121,
                32813,
                25770
            ],
            "desc": "此乃道家内功无上心法，运功之时绵若云霞，更有紫气护体，故名紫霞。",
            "critical_type": "neutral",
            "damage_type": "neutral",
            "belong_key": "belong_10014"
        },
        "359": {
            "name": "破苍穹",
            "recipes": [
                "recipe_46_1",
                "recipe_47_1",
                "recipe_48_1",
                "recipe_49_1",
                "recipe_50_1",
                "recipe_51_1",
                "recipe_52_1",
                "recipe_53_1",
                "recipe_54_1"
            ],
            "buffs": [
                375
            ],
            "desc": "产生一个10尺的气场，范围内自身内功会心率提高5%，内功会心效果提高10%，威胁值降低20%，小队成员内功会心效果提高10%，持续24秒。<TALENT 23614 1 变为无调息时间，只对自己生效，处于“破苍穹”期间自身无视目标60%内功防御><TALENT 14834 1 气场持续时间增加12秒，对自身的增益效果提高100%，在该气场范围内施展“紫气东来”则“紫气东来”持续时间提高4秒><TALENT 6747 1 “人剑合一”引爆“破苍穹”使自己加速率提高3%，持续8秒，可以叠加3层>",
            "belong_key": "belong_359"
        },
        "2674": {
            "name": "五方行尽",
            "buffs": [
                1908
            ],
            "skills": [
                327,
                328,
                329,
                330,
                331,
                461,
                462,
                463,
                464,
                465
            ],
            "desc": "使自身会心效果提高32%，最少半格气对选择区域范围内的最多6个目标均造成<SUB 327 0>混元性内功伤害，并使其锁足5秒，最多五格气均造成<SUB 465 0>混元性内功伤害，并使其锁足10.5秒。目标在被锁足的后半段持续时间里若被伤害招式命中，则有50%几率解除其锁足效果。<TALENT 17755 1 施展“五方行尽”不再消耗自身气点><TALENT 5841 1 “五方行尽”的伤害提高100%，但是不再有后半段锁足效果><TALENT 24953 1 “五方行尽”成功控制目标返还5格气，并使自身“会神”效果提高至40%><TALENT 32411 1 “五方行尽”调息时间提高5秒，施展时若目标点存在气场“破苍穹”则会吞噬“破苍穹”气场产生6秒“颠越苍穹”，“颠越苍穹”每秒对8尺内5个敌对目标造成<SUB 36438 1>混元性内功伤害，该伤害命中非侠士目标时额外提高420%，若“颠越苍穹”被自身“五方行尽”“六合独尊”命中则额外触发一次伤害，最多触发5次><TALENT 34631 1 施展“五方行尽”2秒后，会在自身施展“五方行尽”的位置造成<SUB 34633 1>混元性内功伤害并定身范围内最多6个目标4秒><TALENT 33098 1 >",
            "belong_key": "belong_2674"
        },
        "2681": {
            "name": "紫气东来",
            "buffs": [
                2757
            ],
            "desc": "瞬间聚满气，使<BUFF 2757 1 desc>(<SKILLEx {D0} {BasicNeutralAP 0.25}>点混元内功攻击)(<SKILLEx {D0} {BasicPhysicsAP 0.25}>点外功攻击)。<TALENT 40159 1 “紫气东来”期间施展“四象轮回”“两仪化形”伤害提高30%，但会额外消耗1秒“紫气东来”持续时间><TALENT 30821 1 “紫气东来”持续期间气点上限提高至8点，“四象轮回”可移动施展，“两仪化形”将根据气点造成更多的伤害及破招伤害><TALENT 17731 1 “紫气东来”持续期间不再持续获得气点，但基础攻击力提高至50%，无双等级提高30%，施展“八荒归元”命中气血最大值小于30%的目标将触发最大伤害><TALENT 5829 1 效果持续期间“四象轮回”无需运功><TALENT 6796 1 运功不会被打退、打断，不受缴械和无法运功效果的影响，持续6秒><TALENT 14613 1 不再充能和持续获得气点，调息时间降低30秒，施展“紫气东来”后获得的“紫气东来”效果基础攻击力提高至50%，立刻获得5柄“万世不竭·气剑”><TALENT 5832 1 造成混元内功伤害时调息时间降低1秒,最多降低30秒><TALENT 14598 1 充能时间降低15秒，充能层数提高1层><TALENT 6744 1 充能时间降低15秒，充能层数提高1层><TALENT 5818 1 充能时间降低15秒，充能层数提高1层><TALENT 6758 1 充能时间降低15秒，充能层数提高1层>",
            "belong_key": "belong_2681"
        },
        "367": {
            "name": "四象轮回",
            "recipes": [
                "recipe_82_1",
                "recipe_83_1",
                "recipe_84_1",
                "recipe_85_1",
                "recipe_86_1",
                "recipe_87_1",
                "recipe_88_1",
                "recipe_89_1",
                "recipe_90_1"
            ],
            "skills": [
                896
            ],
            "desc": "对目标造成<SUB 896 0>混元性内功伤害，并使其<BUFF 555 1 desc>，持续<BUFF 555 1 time>，并续气一格。<TALENT 40824 1 成功运功施展“四象轮回”命中侠士目标将减少“紫气东来”4秒调息时间><TALENT 18695 1 每存在一柄“气剑”伤害提高4%><TALENT 5840 1 伤害提高10%，减速效果提高20%><TALENT 5827 1 会心提高10%，会心效果提高10%><TALENT 5823 1 运功时间减少0.25秒，命中目标时额外获得1.5格气><TALENT 5824 1 运功时间降低0.25秒，运功不会被打退，有30%几率使目标锁足3秒><TALENT 2672 3 招式命中目标后有10%几率使目标锁足2秒，若招式会心，则锁足的几率翻倍。若无法成功锁足，则目标还会获得“无形”不利效果><TALENT 2678 1 对定身、锁足的目标的会心率提高10%，会心伤害提高10%><TALENT 2678 2 对定身、锁足的目标的会心率提高20%，会心伤害提高20%><TALENT 2678 3 对定身、锁足的目标的会心率提高30%，会心伤害提高30%><TALENT 2680 1 伤害提高2%><TALENT 2680 2 伤害提高4%><TALENT 2680 3 伤害提高6%><TALENT 5828 1 运功施展“四象轮回”后下一个“两仪化形”无视目标65%化劲等级><TALENT 18694 1 会心提高10%，会心效果提高10%，“万世不竭·二段”命中气血值低于40%的目标时伤害提高15%><TALENT 38516 1 伤害提高4%><TALENT 5829 1 伤害提高4%>",
            "belong_key": "belong_367"
        },
        "301": {
            "name": "两仪化形",
            "recipes": [
                "recipe_19_1",
                "recipe_20_1",
                "recipe_21_1",
                "recipe_22_1",
                "recipe_23_1",
                "recipe_24_1",
                "recipe_25_1",
                "recipe_26_1",
                "recipe_27_1"
            ],
            "skills": [
                3439,
                3440,
                3441,
                3442,
                3443,
                3444,
                3445,
                3446,
                3447,
                3448
            ],
            "desc": "最少半格气对目标造成<SUB 3439 0>混元性内功伤害，最多五格气对目标造成<SUB 3448 0>混元性内功伤害。聚气越多招式效果越强，若消耗3格及以上的气则会根据消耗的气额外造成一次破招伤害。若招式会心，则续气一格。<TALENT 30821 1 “紫气东来”期间可消耗更多的气点造成更高的伤害><TALENT 18695 1 每存在一柄“气剑”伤害提高4%><TALENT 5828 1 运功施展“四象轮回”后下一个“两仪化形”无视目标65%化劲等级><TALENT 2672 3 招式命中目标后有10%几率使目标锁足2秒，若招式会心，则锁足的几率翻倍。若无法成功锁足，则目标还会获得“无形”不利效果，“两仪化形”对该目标的会心率提高30%，会心伤害提高30%><TALENT 2679 1 施展后有20%几率使下1个“四象轮回”无需运功，此效果每10秒内最多出现一次><TALENT 2679 2 施展后有20%几率使下2个“四象轮回”无需运功，此效果每10秒内最多出现一次><TALENT 5846 1 命中目标后，对自身前方20尺内路径上最多5个目标造成混元内功伤害><TALENT 2680 2 伤害提高4%><TALENT 2680 3 伤害提高6%><TALENT 18694 1 >",
            "belong_key": "belong_301"
        },
        "306": {
            "name": "太极无极",
            "recipes": [
                "recipe_91_1",
                "recipe_92_1",
                "recipe_93_1",
                "recipe_94_1",
                "recipe_95_1",
                "recipe_96_1",
                "recipe_97_1",
                "recipe_98_1",
                "recipe_99_1"
            ],
            "skills": [
                2329
            ],
            "desc": "对目标造成<SUB 2329 0>混元性内功伤害，并续气半格。<TALENT 26684 1 不再续气，调息时间提高至9秒，每道剑气都将造成混元性内功伤害><TALENT 17752 1 使目标移动速度降低40%，持续5秒><TALENT 5843 1 调息时间增加6秒，对定身锁足目标会心几率提高30%，会心效果提高30%，并额外续半格气><TALENT 2678 3 对定身、锁足的目标的会心率提高30%，会心伤害提高30%><TALENT 30929 1 拥有增益气场气劲时，施展“太极无极”伤害提高40%>",
            "belong_key": "belong_306"
        },
        "303": {
            "name": "三才化生",
            "attributes": {
                "neutral_damage_base": 78,
                "neutral_damage_rand": 7
            },
            "skills": [
                303
            ],
            "desc": "对自身周围8尺内的最多6个目标对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元性内功伤害，并锁足，持续9秒。目标在被锁足的后半段时间里若被伤害招式命中，则有50%几率解除其锁足效果。<TALENT 14997 1 施展“三才化生”时，若五十尺范围内存在自身“破苍穹”气场，则对“破苍穹”气场中心位置6尺内3个目标造成<SUB 28535 1>混元性内功伤害并定身4秒><TALENT 5835 1 每命中一个目标，获得1格气><TALENT 24942 1 产生三角形剑域，延时1秒后对区域内的最多5个目标造成<SUB 24944 1>混元内功伤害><TALENT 33098 1 产生三角形剑域，延时1秒后对>",
            "belong_key": "belong_303"
        },
        "368": {
            "name": "六合独尊",
            "skills": [
                15209
            ],
            "desc": "对选择的区域内最多6个目标每秒造成<SUB 15209 0>混元性内功伤害，并使其<BUFF 555 1 desc>，持续<BUFF 555 1 time>。<TALENT 6910 1 目标数量降低3个，伤害提高30%><TALENT 21707 1 范围提高2尺，目标数量提高2个，会心命中一个目标则获得一柄“气剑”><TALENT 5826 1 每命中一个目标回复半格气，命中目标3次后，目标锁足2秒><TALENT 2672 3 招式命中目标后有10%几率使目标锁足2秒，若招式会心，则锁足的几率翻倍。若无法成功锁足，则目标还会获得“无形”不利效果><TALENT 2675 1 目标个数提高2个，伤害提高30%><TALENT 2675 2 目标个数提高4个，伤害提高60%><TALENT 5819 1 每次造成伤害，均使下一次伤害效果提高35%>",
            "belong_key": "belong_368"
        },
        "18640": {
            "name": "万世不竭",
            "recipes": [
                "recipe_1581_1",
                "recipe_1582_1",
                "recipe_1583_1",
                "recipe_1586_1",
                "recipe_1587_1",
                "recipe_1588_1"
            ],
            "skills": [
                18649,
                18650,
                18651,
                18652,
                18653,
                22014
            ],
            "desc": "一段：1.25秒内使自身获得最多5柄持续24秒的“气剑”，“气剑”每3秒会攻击1次20尺内当前选择的目标，每柄“气剑”对目标造成<SUB 18653 1>混元性内功伤害，当自身集齐5把“气剑”后可施展二段招式。\\n二段：以气驭剑，控制所有“气剑”攻击目标，对目标造成<SUB 22014 1>混元性内功伤害并附带<SUR 0.6>点破招伤害。<TALENT 18694 1 会心提高10%，会心效果提高10%，“万世不竭·二段”命中气血值低于40%的目标时伤害提高15%><TALENT 37387 1 “万世不竭·二段”调息时间提高至5秒，施展时不会使气剑提前消失><TALENT 18695 1 每柄气剑提高“四象轮回”“两仪化形”4%伤害><TALENT 18669 1 运功时间降低0.375秒，每轮攻击频率提高25%><TALENT 18798 1 调息时间降低8秒，“气剑”持续时间增加12秒，招式有效距离增加10尺><TALENT 14836 1 一段“气剑”会随机攻击自身20尺内的目标，轮命中目标将额外造成一次伤害，命中目标有25%几率锁足目标并为目标添加“气竭”效果，持续5秒。自身任何招式命中带有“气竭”效果的目标将引爆造成6尺范围<SUB 20955 1>混元性内功伤害，该效果2秒内对同一目标只生效一次><TALENT 24954 1 “气剑”每次攻击目标，若自身存在“坐忘无我”气劲，则为其回复根骨的0.5倍吸收量>",
            "belong_key": "belong_18640"
        },
        "305": {
            "name": "九转归一",
            "attributes": {
                "neutral_damage_base": 62
            },
            "skills": [
                305
            ],
            "desc": "对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元性内功伤害，将其击退12尺，击退中的目标如果碰撞障碍则眩晕4秒。<TALENT 6772 1 成功击退后，重置“万世不竭”调息时间且无需运功><TALENT 21712 1 变为2层充能招式，击退中的目标如果碰撞障碍并成功眩晕后则造成<SUB 21716 1>混元性内功伤害><TALENT 32413 1 自身每次移动气场时会聚5格气。“九转归一”对目标施展时也会将自身周围10尺内的最多6个气场往同一方向推动，并引导2把飞剑环绕自身对10-14尺的目标进行打击，持续6秒，每推动一个气场会额外引导一把飞剑并使飞剑伤害提高，最多引导5把飞剑><TALENT 34580 1 命中被\"锁足”“定身”“眩晕”的目标击退距离增加50%>",
            "belong_key": "belong_305"
        },
        "18679": {
            "name": "浮生",
            "skills": [
                18670
            ],
            "desc": "“六合独尊”运功1.5秒之后，在目标点形成“八方剑域”效果，区域内最多6个目标每0.6秒受到<SUB 18670 31>混元性内功伤害，并降低80%移动速度，“八方剑域”持续3秒，同时命中多个玩家时则伤害递减，最多递减50%。",
            "belong_key": "belong_18679"
        },
        "24953": {
            "name": "大成",
            "buffs": [
                30137
            ],
            "desc": "“五方行尽”成功控制目标返还5格气，并使自身“会神”效果提高至40%。",
            "belong_key": "belong_24953"
        },
        "26684": {
            "name": "若冲",
            "recipes": [
                "recipe_2582_1"
            ],
            "skills": [
                28379
            ],
            "desc": "“太极无极”不再续气，调息时间提高至9秒，每道剑气都将造成混元性内功伤害。",
            "belong_key": "belong_26684"
        },
        "18694": {
            "name": "洞渊",
            "buffs": [
                31729
            ],
            "desc": "成功运功施展“四象轮回”命中侠士目标将为自身添加<NounID 85>效果，最多4层，持续6秒。",
            "belong_key": "belong_18694"
        },
        "30821": {
            "name": "绝云",
            "skills": [
                40158
            ],
            "desc": "“紫气东来”持续期间气点上限提高至8点，“两仪化形”将根据气点造成更多的伤害及破招伤害。",
            "belong_key": "belong_30821"
        },
        "370": {
            "name": "八卦洞玄",
            "attributes": {
                "neutral_damage_base": 34,
                "neutral_damage_rand": 0
            },
            "skills": [
                370
            ],
            "desc": "最少半格气对目标造成<SUB 466 0>混元性内功伤害，最多五格气对目标造成<SUB 475 0>混元性内功伤害，并使目标<BUFF 557 0 desc>，持续<BUFF 557 1 time>-<BUFF 557 5 time>。并且命中正在运功的目标能令目标在接下来的5秒内无法使用任何内功招式。<TALENT 2672 1 招式命中目标后有3.3%几率使目标锁足2秒，若招式会心，则锁足的几率翻倍。若无法成功锁足，则目标还会获得“无形”不利效果><TALENT 2672 2 招式命中目标后有6.6%几率使目标锁足2秒，若招式会心，则锁足的几率翻倍。若无法成功锁足，则目标还会获得“无形”不利效果><TALENT 2672 3 招式命中目标后有10%几率使目标锁足2秒，若招式会心，则锁足的几率翻倍。若无法成功锁足，则目标还会获得“无形”不利效果>",
            "belong_key": "belong_370"
        },
        "23969": {
            "name": "剑出鸿蒙",
            "skills": [
                28590
            ],
            "desc": "在距离自身最近的“破苍穹”气场中心上空产生“鸿蒙古剑”，2秒后“鸿蒙古剑”会坠落至气场之中，对10尺范围内的3个目标造成<SUB 28590 2>混元性内功伤害并眩晕3秒。",
            "belong_key": "belong_23969"
        },
        "14837": {
            "name": "规焉",
            "desc": "受到伤害未重伤状态下自身气血值低于40%，则清除自身“化生势”效果并立刻重置“镇山河”调息时间，该效果最多每2分钟触发一次。",
            "belong_key": "belong_14837"
        },
        "5819": {
            "name": "同尘",
            "buffs": [
                9966
            ],
            "desc": "“六合独尊”每次造成伤害，均使下一次伤害效果提高35%。",
            "belong_key": "belong_5819"
        },
        "38516": {
            "name": "渊渟",
            "recipes": [
                "recipe_6164_1"
            ],
            "desc": "“四象轮回”运功时间减少0.5秒，<NounID 85>持续时间增加2秒，在持续时间结束、被卸除时仅消耗一层。<TALENT_CORE 18694 1>",
            "belong_key": "belong_38516"
        },
        "34631": {
            "name": "定迹",
            "skills": [
                34633
            ],
            "desc": "施展“五方行尽”2秒后，会在自身施展“五方行尽”的位置造成<SUB 34633 1>混元性内功伤害并定身范围内最多6个目标4秒。",
            "belong_key": "belong_34631"
        },
        "6904": {
            "name": "霜寒",
            "recipes": [
                "recipe_2399_1",
                "recipe_2400_1",
                "recipe_5305_1"
            ],
            "desc": "“镇山河”调息时间降低2分钟，效果只作用于自身，施展“镇山河”时清除自身“化生势”。",
            "belong_key": "belong_6904"
        },
        "5813": {
            "name": "无我",
            "recipes": [
                "recipe_5872_1",
                "recipe_5875_1"
            ],
            "desc": "“坐忘无我”调息时间提高50秒，持续时间降低至8秒，化解自身气血最大值50%伤害，每秒恢复自身4%最大气血值，该护盾不受卸除影响。",
            "belong_key": "belong_5813"
        },
        "5802": {
            "name": "解牛",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "buffs": [
                27045
            ],
            "desc": "对被定身、锁足、眩晕的目标伤害提高25%。每次命中被定身、锁足、眩晕的目标会使自身会心几率提高2%，持续3秒，最多提高20%。",
            "belong_key": "belong_5802"
        },
        "21707": {
            "name": "抱元",
            "recipes": [
                "recipe_4875_1"
            ],
            "desc": "“六合独尊”范围提高2尺，目标数量提高2个，会心命中一个目标则获得一柄“气剑”。",
            "belong_key": "belong_21707"
        },
        "18695": {
            "name": "跬步",
            "buffs": [
                12550,
                12551,
                31669
            ],
            "desc": "每存在一柄“气剑”，“四象轮回”“两仪化形”“万世不竭”伤害提高5%。",
            "belong_key": "belong_18695"
        },
        "6798": {
            "name": "有涯",
            "buffs": [
                6103
            ],
            "desc": "“七星拱瑞”成功定身目标后，自身混元内功基础攻击力提高20%，持续5秒。",
            "belong_key": "belong_6798"
        },
        "14836": {
            "name": "自化",
            "recipes": [
                "recipe_4859_1",
                "recipe_4860_1",
                "recipe_4861_1",
                "recipe_4862_1",
                "recipe_4863_1",
                "recipe_4864_1",
                "recipe_4865_1",
                "recipe_4866_1",
                "recipe_4867_1",
                "recipe_4868_1"
            ],
            "skills": [
                21860,
                20955
            ],
            "desc": "“万世不竭”一段“气剑”会随机攻击自身20尺内的目标，每轮命中目标将额外造成一次伤害，命中目标有25%几率锁足目标并为目标添加“气竭”效果，持续5秒。自身任何招式命中带有“气竭”效果的目标将引爆造成6尺范围<SUB 20955 0>混元性内功伤害，该效果2秒内对同一目标只生效一次。",
            "belong_key": "belong_14836"
        },
        "23614": {
            "name": "归元",
            "recipes": [
                "recipe_5604_1"
            ],
            "desc": "“破苍穹”变为无调息时间，只对自己生效，处于“破苍穹”期间自身无视目标60%内功防御。",
            "belong_key": "belong_23614"
        },
        "5844": {
            "name": "心眼",
            "desc": "“镇山河”效果范围提高至6尺，受到无法施展内功招式和缴械效果时也可以施展，自身若处于“镇山河”当中，每秒将恢复自身5%气血最大值。",
            "belong_key": "belong_5844"
        },
        "42934": {
            "name": "长生",
            "recipes": [
                "recipe_6186_1"
            ],
            "desc": "“生太极”调息时间减少9秒，施展气场后额外回复1格气，成功运功施展气场，则使下一个“生太极”气场无需运功。",
            "belong_key": "belong_42934"
        },
        "34580": {
            "name": "归本",
            "desc": "“九转归一”成功击退目标则击退目标后立刻清除目标的“揣锐”效果。",
            "belong_key": "belong_34580"
        },
        "40824": {
            "name": "经首",
            "desc": "成功运功施展“四象轮回”命中侠士目标将减少“紫气东来”4秒调息时间。",
            "belong_key": "belong_40824"
        },
        "5823": {
            "name": "心固",
            "recipes": [
                "recipe_5771_1",
                "recipe_5963_1"
            ],
            "desc": "“四象轮回”可移动施展，运功时间减少0.25秒，命中目标时额外获得1.5格气。",
            "belong_key": "belong_5823"
        },
        "42301": {
            "name": "不竭",
            "skills": [
                32402,
                32414
            ],
            "desc": "对气场中心10尺范围内最多5名敌人造成<SUB 32402 0>伤害并定身3秒，强化自身气场所有气场5秒，每秒对最多5个敌方目标造成<SUB 32414 0>混元性内功伤害，场上每存在一个气场将每秒恢复自身一格气。",
            "belong_key": "belong_42301"
        },
        "14613": {
            "name": "固本",
            "recipes": [
                "recipe_2235_1"
            ],
            "desc": "“紫气东来”调息时间降低18秒，施展“紫气东来”后立刻获得5柄“万世不竭·气剑”，持续期间额外提高15%无双等级。",
            "belong_key": "belong_14613"
        },
        "36099": {
            "name": "际地蟠天",
            "skills": [
                36102
            ],
            "desc": "对目标造成<SUB 36102 2>混元性内功伤害，若目标血量高于70%，则该招式必定会心。",
            "belong_key": "belong_36099"
        },
        "24955": {
            "name": "穹隆化生",
            "desc": "自身将向前冲刺，持续2秒，可以转向，结束后在脚下生成“生太极”气场，并回复自身10%的最大气血值。",
            "belong_key": "belong_24955"
        },
        "22703": {
            "name": "抱一",
            "recipes": [
                "recipe_4953_1"
            ],
            "desc": "“坐忘无我”可额外透支使用一次。",
            "belong_key": "belong_22703"
        },
        "5830": {
            "name": "不移",
            "desc": "“凭虚御风”闪避效果额外提高15%，持续时间增加3秒。",
            "belong_key": "belong_5830"
        },
        "21712": {
            "name": "羽化",
            "recipes": [
                "recipe_4876_1"
            ],
            "skills": [
                21716
            ],
            "desc": "“九转归一”变为2层充能招式，击退中的目标如果碰撞障碍并成功眩晕后则造成<SUB 21716 1>混元性内功伤害。",
            "belong_key": "belong_21712"
        },
        "26683": {
            "name": "北辰",
            "desc": "非战斗状态下“梯云纵”大幅提高抗摔能力，期间可以进行二段跳跃。",
            "belong_key": "belong_26683"
        },
        "6796": {
            "name": "临风",
            "desc": "施展“紫气东来”后，若自身存在<NounID 85>气劲，则运功不会被打退、打断，不受缴械和无法运功效果的影响，持续10秒。<TALENT_CORE 18694 1>",
            "belong_key": "belong_6796"
        },
        "5828": {
            "name": "霜锋",
            "recipes": [
                "recipe_6207_1"
            ],
            "desc": "“两仪化形”无视目标36%化劲等级，施展“四象轮回”后下一个“两仪化形”额外无视目标34%化劲等级。",
            "belong_key": "belong_5828"
        },
        "24945": {
            "name": "破势",
            "buffs": [
                17918
            ],
            "desc": "“镇山河”调息时间降低2分钟，施展时不再生成气场，而是强化自身当前“气剑”，使“气剑”和“万世不竭·二段”对非侠士目标伤害提高130%，持续3分钟。",
            "belong_key": "belong_24945"
        },
        "5829": {
            "name": "雨集",
            "desc": "“紫气东来”效果期间“四象轮回”无需运功。",
            "belong_key": "belong_5829"
        },
        "17747": {
            "name": "吐故纳新",
            "desc": "处于自身“生太极”气场当中，自身受到的伤害降低10%，受到攻击有15%几率令攻击者锁足3秒，并回复自身10%的内力，该效果每20秒只能触发一次。",
            "belong_key": "belong_17747"
        },
        "33098": {
            "name": "归衡",
            "desc": "施展“五方行尽”会将30尺内自身所有“破苍穹”移动至释放位置，施展“三才化生”会将30尺内自身“破苍穹”气场收回至自身位置。",
            "belong_key": "belong_33098"
        },
        "32411": {
            "name": "正气",
            "recipes": [
                "recipe_5423_1"
            ],
            "skills": [
                36438
            ],
            "desc": "“五方行尽”调息时间提高5秒，施展时若目标点存在气场“破苍穹”则会吞噬“破苍穹”气场产生6秒“颠越苍穹”，“颠越苍穹”每秒对8尺内5个敌对目标造成<SUB 36438 1>混元性内功伤害，该伤害命中非侠士目标时额外提高420%，若“颠越苍穹”被自身“五方行尽”“六合独尊”命中则额外触发一次伤害，最多触发5次。",
            "belong_key": "belong_32411"
        },
        "14834": {
            "name": "抱阳",
            "desc": "“破苍穹”气场持续时间增加12秒，对自身的增益效果提高100%。",
            "belong_key": "belong_14834"
        }
    },
    "10015": {
        "10015": {
            "name": "太虚剑意",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "agility_to_physical_attack_power": 1731,
                "agility_to_physical_critical_strike": 696,
                "max_life_gain": 245,
                "physical_critical_strike_base": 9025,
                "physical_attack_power_base": 6187,
                "pve_addition_base": 492
            },
            "recipes": [
                "recipe_1711_1",
                "recipe_716_2",
                "recipe_717_2"
            ],
            "buffs": [
                1915
            ],
            "dots": {
                "748": [
                    600
                ]
            },
            "skills": [
                18121,
                32814,
                25771
            ],
            "desc": "此乃纯阳秘传之御剑心法，运功之时真气充塞寰宇，心外无物，天人合一。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10015"
        },
        "362": {
            "name": "碎星辰",
            "buffs": [
                378
            ],
            "desc": "产生一个10尺的气场，范围内自身外功会心率提高5%，外功会心效果提高10%，威胁值降低20%，小队成员外功会心效果提高10%，持续24秒，若距离气场13尺内施展“人剑合一”则会产生“云中剑·碎星辰”在自身5尺内环绕8秒，对范围内4个目标造成<SUB 21979 2>外功伤害。<TALENT 6472 1 拥有增益气场气劲时，自身混元内功和外功基础攻击提高10%，处于该气场中时也会获得“玄应之气”（和“生太极”获取“玄应之气”效果不会同时触发）><TALENT 14829 1 持续时间增加12秒，对自身的效果提高100%><TALENT 2691 1 效果提高25%><TALENT 2691 2 效果提高50%><TALENT 18799 1 只对自己生效，处于“碎星辰”期间自身无视目标60%外功防御，“三环套月”伤害提高30%。“碎星辰”变为无调息时间><TALENT 6914 1 气场存在时间延长15秒><EnchantID 10074 太虚剑意下施展气场，气场每3秒对范围内所有目标造成中等外功伤害效果><TALENT 6747 1 “人剑合一”引爆“碎星辰”使自身基础攻击提高5%，持续8秒，可以叠加3层>",
            "belong_key": "belong_362"
        },
        "2681": {
            "name": "紫气东来",
            "buffs": [
                2757
            ],
            "desc": "瞬间聚满气，使<BUFF 2757 1 desc>(<SKILLEx {D0} {BasicNeutralAP 0.25}>点混元内功攻击)(<SKILLEx {D0} {BasicPhysicsAP 0.25}>点外功攻击)。<TALENT 40159 1 “紫气东来”期间施展“四象轮回”“两仪化形”伤害提高30%，但会额外消耗1秒“紫气东来”持续时间><TALENT 30821 1 “紫气东来”持续期间气点上限提高至8点，“四象轮回”可移动施展，“两仪化形”将根据气点造成更多的伤害及破招伤害><TALENT 17731 1 “紫气东来”持续期间不再持续获得气点，但基础攻击力提高至50%，无双等级提高30%，施展“八荒归元”命中气血最大值小于30%的目标将触发最大伤害><TALENT 5829 1 效果持续期间“四象轮回”无需运功><TALENT 6796 1 运功不会被打退、打断，不受缴械和无法运功效果的影响，持续6秒><TALENT 14613 1 不再充能和持续获得气点，调息时间降低30秒，施展“紫气东来”后获得的“紫气东来”效果基础攻击力提高至50%，立刻获得5柄“万世不竭·气剑”><TALENT 5832 1 造成混元内功伤害时调息时间降低1秒,最多降低30秒><TALENT 14598 1 充能时间降低15秒，充能层数提高1层><TALENT 6744 1 充能时间降低15秒，充能层数提高1层><TALENT 5818 1 充能时间降低15秒，充能层数提高1层><TALENT 6758 1 充能时间降低15秒，充能层数提高1层>",
            "belong_key": "belong_2681"
        },
        "588": {
            "name": "人剑合一",
            "recipes": [
                "recipe_55_1",
                "recipe_57_1",
                "recipe_58_1",
                "recipe_59_1",
                "recipe_60_1",
                "recipe_61_1",
                "recipe_62_1"
            ],
            "dots": {
                "889": [
                    37453
                ]
            },
            "skills": [
                38534,
                21979
            ],
            "desc": "对自身周围4尺内最多5个目标造成<SUB 589 0>外功伤害并定身3秒，若自身能量存在20点则可提前进入“<NounID 87>”状态。<TALENT 36106 1 “云中剑”伤害提高15%，持续时间提高4秒><TALENT 24962 1 “叠刃”效果最高层数提高至7层，处于自身4层“叠刃”及以上的目标15尺内将提高自身25%的移动速度和15%的外功会心效果><TALENT 17743 1 对成功定身的目标添加1层“叠刃”，并使12秒内自身对该目标产生的“定身”“眩晕”不受同类型控制效果衰减><TALENT 5812 1 每命中一个气场，自身回复2格气，5%内力和1%气血，为小队成员回复2%内力和1%气血><TALENT 5805 1 命中目标2次以上，对目标造成额外的外功伤害><EnchantID 10073 施展“人剑合一”获得“清剑”效果，效果期间施展“无我无剑”重置八荒调息时间，并使“八荒归元”无视目标当前血量，发挥最大伤害效果><TALENT 21812 1 自身13尺内存在“生太极”气场后会使“气剑”分别环绕自身6尺运转8秒，“气剑”运转期间会对4个敌对目标造成<SUB 21979 1>外功伤害><TALENT 14833 1 “人剑合一”状态下每秒获得5格气><TALENT 38539 1 “人剑合一”状态下自身免疫控制（被推被拉除外）><TALENT 38540 1 “玄应之气”达到上限时会自动进入“人剑合一”状态，“人剑合一”调息时间降低12秒，定身时间提高2秒，会引爆范围内自身和敌方的气场，自身气场被引爆时周围9尺敌对目标也将受到伤害和定身效果><TALENT 20782 1 “人剑合一”状态下施展“吞日月”将会额外消耗20点“玄应之气”，“吞日月”会在产生的时候标记其中的3个敌方目标6秒，被标记的目标离开“吞日月”1秒后将再次回到“吞日月”中心位置并移除标记><TALENT 38551 1 “人剑合一”状态下施展“生太极”将会额外消耗20点“玄应之气”，在该“生太极”内施展“八荒归元”“无我无剑”命中目标目标将使“剑灵”额外攻击目标4秒><TALENT 21725 1 ><TALENT 6744 1 ><TALENT 6757 1 ><TALENT 34656 1 >",
            "belong_key": "belong_588"
        },
        "364": {
            "name": "三环套月",
            "recipes": [
                "recipe_64_1",
                "recipe_65_1",
                "recipe_66_1",
                "recipe_67_1",
                "recipe_68_1",
                "recipe_69_1",
                "recipe_70_1",
                "recipe_71_1",
                "recipe_72_1"
            ],
            "skills": [
                17689,
                17690
            ],
            "desc": "连续刺出迅猛的三剑，对目标造成100%的武器伤害外加<SUB 17689 0>外功伤害及破招伤害，并续气一格。<TALENT 18701 1 使目标移动速度降低60%，持续5秒><TALENT 17728 1 每格“气点”增加“三环套月”5%伤害，命中目标后额外回复1格气><TALENT 17726 1 命中有自身“叠刃”效果的目标，有10%几率立刻叠加1层叠刃，最多叠加5层><TALENT 2688 3 会心率提高10%，会心后伤害提高20%><TALENT 2698 1 伤害提高2%><TALENT 2698 2 伤害提高4%><TALENT 2698 3 伤害提高6%><TALENT 6757 1 “人剑合一”状态下自身施展“天道剑势”套路下招式时命中带有“叠刃”效果的侠士目标将消耗4点“玄应之气”，根据叠刃层数造成一段额外伤害。><TALENT 6744 1 施展“人剑合一”命中自身“碎星辰”气场后将获得“随物”效果，移动速度增加30%，自身施展“天道剑势”套路下招式额外续气一格。>",
            "belong_key": "belong_364"
        },
        "311": {
            "name": "万剑归宗",
            "skills": [
                14975
            ],
            "desc": "打断周围8尺内最多6个目标运功并造成100%武器伤害附加<SUB 14975 0>外功伤害，并使这些目标锁足2秒且获得5层“玄一”不利效果。每命中一个目标，续气半格。<TALENT 24969 1 “玄一”效果被卸除时只消失1层><TALENT 34656 1 施展时会在当前目标位置落下一柄“灵剑”，“灵剑”每秒对6尺内3个敌对目标造成<SUB 34693 1>外功伤害，并在3秒后爆炸额外造成<SUB 34694 1>外功伤害><TALENT 26700 1 命中拥有自身“吞日月”效果的目标，可在8秒内施展“万剑归宗”二段招式，对目标造成100%武器伤害附加<SUB 27003 1>外功伤害。二段招式命中目标后会标记目标，3秒后对目标额外造成<SUB 31012 1>外功伤害><TALENT 14832 1 自身“叠刃”伤害提高45%。“万剑归宗”会心提高10%，会心效果提高10%，调息时间降低2秒，命中目标将使其获得一层“叠刃”效果><TALENT 5819 1 每命中一个目标，伤害提高5%，并使技能调息时间降低2秒><TALENT 5810 1 目标数量提高2个，伤害提高10%><TALENT 5804 1 每命中一个目标调息时间降低2秒><TALENT 16901 1 每命中一个目标调息时间降低2秒><TALENT 5801 1 锁足时间提高1秒><TALENT 6757 1 “人剑合一”状态下自身施展“天道剑势”套路下招式时命中带有“叠刃”效果的侠士目标将消耗4点“玄应之气”，根据叠刃层数造成一段额外伤害。><TALENT 6744 1 施展“人剑合一”命中自身“碎星辰”气场后将获得“随物”效果，移动速度增加30%，自身施展“天道剑势”套路下招式额外续气一格。><TALENT 41904 1 施展“人剑合一”命中自身“碎星辰”气场后将获得“随物”效果，移动速度增加30%，自身施展“天道剑势”套路下招式额外续气一格。>",
            "belong_key": "belong_311"
        },
        "365": {
            "name": "无我无剑",
            "recipes": [
                "recipe_100_1",
                "recipe_101_1",
                "recipe_102_1",
                "recipe_103_1",
                "recipe_104_1",
                "recipe_105_1",
                "recipe_106_1",
                "recipe_107_1",
                "recipe_108_1"
            ],
            "skills": [
                386,
                387,
                388,
                389,
                390,
                391,
                392,
                393,
                394
            ],
            "desc": "需聚气，最少半格气对目标造成200%武器伤害附加<SUB 383 0>外功伤害，最多五格气对目标造成200%武器伤害附加<SUB 394 0>外功伤害，若消耗3格及以上的气则会根据消耗的气额外造成一次破招伤害。<TALENT 20782 1 命中有自身“剑势”标记的目标则追加4秒“剑灵”攻击><TALENT 17742 1 “人剑合一”状态下5格气施展时将降低0.5秒“八荒归元”调息时间，并给目标叠加1层“风逝”效果，“风逝”最多叠加4层，每层使目标受到的“八荒归元”伤害额外提高50%><TALENT 24969 1 命中自身“玄一”效果的目标则伤害提高10%><TALENT 5818 1 消耗3格气以上施展“无我无剑”，会心几率提高10%，会心效果提高30%><TALENT 5810 1 伤害提高10%><TALENT 2689 2 招式会心后将给目标添加2层“叠刃”效果，每3秒受到额外的外功伤害，持续18秒。该效果受到额外的攻击加成，可叠加20层><TALENT 2689 3 招式会心后将给目标添加3层“叠刃”效果，每3秒受到额外的外功伤害，持续18秒。该效果受到额外的攻击加成，可叠加20层><TALENT 5821 1 命中目标后附带1层叠刃效果，若会心则额外附带1层叠刃效果，最多叠加5层><TALENT 2698 2 伤害提高4%><TALENT 2698 3 伤害提高6%><TALENT 5800 1 命中后对目标周围6尺内最多5个目标造成外功伤害，消耗气越多，伤害越高><TALENT 38551 1 “人剑合一”状态下施展“生太极”将会额外消耗20点“玄应之气”，在该“生太极”内施展“八荒归元”“无我无剑”命中目标目标将使“剑灵”额外攻击目标4秒><TALENT 6757 1 “人剑合一”状态下自身施展“天道剑势”套路下招式时命中带有“叠刃”效果的侠士目标将消耗4点“玄应之气”，根据叠刃层数造成一段额外伤害。><TALENT 6744 1 施展“人剑合一”命中自身“碎星辰”气场后将获得“随物”效果，移动速度增加30%，自身施展“天道剑势”套路下招式额外续气一格。>",
            "belong_key": "belong_365"
        },
        "2699": {
            "name": "八荒归元",
            "recipes": [
                "recipe_1589_1",
                "recipe_1590_1",
                "recipe_1591_1",
                "recipe_1592_1",
                "recipe_1593_1",
                "recipe_1594_1",
                "recipe_1595_1",
                "recipe_1596_1"
            ],
            "skills": [
                4954
            ],
            "desc": "对目标造成200%武器伤害及大量外功伤害，并续气1格。目标气血值越低，造成的伤害越高。最高造成<SUB 4954 3>外功伤害，最低造成<SUB 4954 1>外功伤害，命中40%气血以下目标，能够使“叠刃”的持续伤害立即生效。<TALENT 17731 1 “紫气东来”持续期间不再持续获得气点，但基础攻击力提高至50%，无双等级提高30%，施展“八荒归元”命中气血最大值小于30%的目标将触发最大伤害><TALENT 32407 1 调息时间降低3秒，伤害提高10%><TALENT 5816 1 会心提高10%，会心效果提高20%><TALENT 5822 1 命中有自身“叠刃”效果目标，额外造成30%伤害效果><TALENT 6758 1 命中40%气血以下目标，能够使“叠刃”的持续伤害立即生效。自身“紫气东来”期间生效气血值提高到60%以下><TALENT 38551 1 “人剑合一”状态下施展“生太极”将会额外消耗20点“玄应之气”，在该“生太极”内施展“八荒归元”“无我无剑”命中目标目标将使“剑灵”额外攻击目标4秒><TALENT 34656 1 “人剑合一”状态下施展“生太极”将会额外消耗20点“玄应之气”，在该“生太极”内施展“八荒归元”“无我无剑”命中目标目标将使“剑灵”额外攻击目标4秒><TALENT 6757 1 “人剑合一”状态下自身施展“天道剑势”套路下招式时命中带有“叠刃”效果的侠士目标将消耗4点“玄应之气”，根据叠刃层数造成一段额外伤害。><TALENT 6744 1 施展“人剑合一”命中自身“碎星辰”气场后将获得“随物”效果，移动速度增加30%，自身施展“天道剑势”套路下招式额外续气一格。>",
            "belong_key": "belong_2699"
        },
        "2690": {
            "name": "剑冲阴阳",
            "skills": [
                21431,
                18528
            ],
            "desc": "快速冲向目标，造成<SUB 21431 0>外功伤害并击晕目标3秒，眩晕结束后将产生“剑灵”攻击目标2秒。\\n\\n剑灵：对目标造成伤害并僵直。<TALENT 6466 1 眩晕效果增加1秒，并使自身续气一格><TALENT 32403 1 “剑冲阴阳”使命中目标后会为目标添加2层“叠刃”效果并将把距离目标30尺内最近的自身创建的“吞日月”气场吸引至目标脚下，并强化该“吞日月”5秒，使自身伤害命中该次“吞日月”中的目标会造成0.25秒眩晕效果><TALENT 6757 1 “人剑合一”状态下自身施展“天道剑势”套路下招式时命中带有“叠刃”效果的侠士目标将消耗4点“玄应之气”，根据叠刃层数造成一段额外伤害。><TALENT 6744 1 施展“人剑合一”命中自身“碎星辰”气场后将获得“随物”效果，移动速度增加30%，自身施展“天道剑势”套路下招式额外续气一格。><TALENT 24958 1 施展“人剑合一”命中自身“碎星辰”气场后将获得“随物”效果，移动速度增加30%，自身施展“天道剑势”套路下招式额外续气一格。>",
            "belong_key": "belong_2690"
        },
        "38539": {
            "name": "无尤",
            "recipes": [
                "recipe_6223_1"
            ],
            "desc": "“玄应之气”上限提高20点，“人剑合一”调息时间提高12秒且效果范围提高5尺，<NounID 87>状态下自身免疫控制（被推被拉除外）。",
            "belong_key": "belong_38539"
        },
        "38540": {
            "name": "浑沦",
            "desc": "“玄应之气”达到上限时会自动进入<NounID 87>状态，施展“人剑合一”时定身时间提高1秒，会引爆16尺范围内自身和敌方的气场，自身气场被引爆时周围7尺敌对目标也将受到伤害和定身效果，同时为自身添加3秒“生太极”气劲。",
            "belong_key": "belong_38540"
        },
        "14833": {
            "name": "玄门",
            "skills": [
                40752
            ],
            "desc": "“生太极”持续时间提高5秒，非战斗状态下每秒额外获得6点“玄应之气”。不再触发“生太极”增益及减速效果，<NounID 87>状态下施展“无我无剑”将额外造成<SUB 40752 1>外功伤害，每秒获得5格气，且可激活招式“人剑合一·解”。",
            "belong_key": "belong_14833"
        },
        "21725": {
            "name": "铮鸣",
            "recipes": [
                "recipe_6224_1"
            ],
            "desc": "“玄应之气”获取速度增加50%，“人剑合一”范围提高5尺，<NounID 87>状态下对目标造成定身、锁足、眩晕将会回复与控制时间相关的“玄应之气”。",
            "belong_key": "belong_21725"
        },
        "32400": {
            "name": "心转",
            "skills": [
                40752
            ],
            "desc": "“转乾坤”降低伤害效果持续时间提高4秒，每秒回复6%气血值，期间受到伤害将对攻击者位置8尺6个敌对目标造成<SUB 40752 1>伤害并添加1层“叠刃”，该效果每0.25秒只触发一次。",
            "belong_key": "belong_32400"
        },
        "6744": {
            "name": "云游",
            "desc": "“云中剑”持续期间，移动速度增加30%，自身施展“天道剑势”套路下招式额外续气一格，“紫气东来”期间“云中剑”命中敌人时为其添加一层“叠刃”。",
            "belong_key": "belong_6744"
        },
        "20782": {
            "name": "剑势",
            "desc": "<NounID 87>状态下施展“吞日月”将会额外消耗20点“玄应之气”，“吞日月”会在产生的时候标记其中3个敌方侠士目标6秒，施展“无我无剑”命中被标记的目标则使其受到“剑灵”攻击4秒，被标记的目标离开“吞日月”1秒后将再次回到“吞日月”中心位置并移除标记。",
            "belong_key": "belong_20782"
        },
        "18799": {
            "name": "故长",
            "recipes": [
                "recipe_5605_1"
            ],
            "desc": "“碎星辰”变为无调息时间，持续时间增加12秒，只对自己生效，处于“碎星辰”期间自身无视目标60%外功防御。",
            "belong_key": "belong_18799"
        },
        "17731": {
            "name": "无欲",
            "desc": "“紫气东来”持续期间不再持续获得气点，但基础攻击力提高至50%，无双等级提高30%，施展“八荒归元”命中气血最大值小于30%的目标将触发最大伤害。",
            "belong_key": "belong_17731"
        },
        "6757": {
            "name": "斩勘",
            "skills": [
                42061
            ],
            "desc": "<NounID 87>状态下自身施展“天道剑势”套路下招式时命中带有“叠刃”效果的侠士目标将消耗4点“玄应之气”，根据叠刃层数造成一段额外伤害。",
            "belong_key": "belong_6757"
        },
        "14832": {
            "name": "虚极",
            "recipes": [
                "recipe_4583_1",
                "recipe_5173_1"
            ],
            "desc": "自身“叠刃”伤害提高40%。“万剑归宗”会心提高10%，会心效果提高10%，调息时间降低2秒，命中目标将使其获得一层“叠刃”效果。",
            "belong_key": "belong_14832"
        },
        "14835": {
            "name": "凶年",
            "recipes": [
                "recipe_5676_1"
            ],
            "desc": "“生太极”作用范围提高5尺，减速效果提高到45%。",
            "belong_key": "belong_14835"
        },
        "5821": {
            "name": "叠刃",
            "desc": "“无我无剑”命中目标后附带1层叠刃效果，若会心则额外附带1层叠刃效果，最多叠加5层。",
            "belong_key": "belong_5821"
        },
        "5802": {
            "name": "解牛",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "buffs": [
                27045
            ],
            "desc": "对被定身、锁足、眩晕的目标伤害提高25%。每次命中被定身、锁足、眩晕的目标会使自身会心几率提高2%，持续3秒，最多提高20%。",
            "belong_key": "belong_5802"
        },
        "30831": {
            "name": "湛存",
            "skills": [
                30828
            ],
            "desc": "被自身“吞日月”效果作用的敌方侠士目标每秒获得1层“湛存”效果，最多3层，持续4秒。自身施展“无我无剑”命中带有“湛存”效果的目标，最少1层对目标造成200%武器伤害附加<SUB 30828 1>外功伤害，最多3层对目标造成200%武器伤害附加<SUB 30828 3>外功伤害。",
            "belong_key": "belong_30831"
        },
        "41904": {
            "name": "归剑",
            "recipes": [
                "recipe_5986_1",
                "recipe_5987_1"
            ],
            "desc": "“万剑归宗”不再占用基础调息时间，调息时间增加7秒，施展“万剑归宗”时，消耗20点“玄应之气”可将30尺内周围所有气场回收至自身位置。",
            "belong_key": "belong_41904"
        },
        "14829": {
            "name": "负阴",
            "buffs": [
                6093
            ],
            "desc": "“碎星辰”气场对自身的增益效果提高100%，处于“碎星辰”气场中时，自身外功基础攻击提高5%。",
            "belong_key": "belong_14829"
        },
        "24962": {
            "name": "裂云",
            "buffs": [
                17933
            ],
            "desc": "自身造成的“叠刃”效果最高层数提高至7层，处于自身4层“叠刃”及以上的目标15尺内将提高自身25%的移动速度和15%的外功会心效果。",
            "belong_key": "belong_24962"
        },
        "14598": {
            "name": "若水",
            "recipes": [
                "recipe_5873_1"
            ],
            "desc": "“紫气东来”充能时间降低10秒，充能层数提高1层。",
            "belong_key": "belong_14598"
        },
        "32403": {
            "name": "斗转",
            "recipes": [
                "recipe_5997_1"
            ],
            "desc": "“剑冲阴阳”变为2层透支技能。“剑冲阴阳”命中目标后会为目标添加2层“叠刃”效果并将把距离目标30尺内最近的自身创建的“吞日月”气场吸引至目标脚下并强化该“吞日月”5秒，使自身伤害命中该次“吞日月”中的目标会造成0.25秒眩晕效果。",
            "belong_key": "belong_32403"
        },
        "310": {
            "name": "剑飞惊天",
            "skills": [
                335
            ],
            "desc": "使目标下马并且<BUFF 1097 1 desc>，持续<BUFF 1097 1 time>，续气一格。若你攻击的目标正在运功，对目标造成<SUB 335 1>外功伤害，并令你额外续气两格并使该目标5秒内无法运功。",
            "belong_key": "belong_310"
        },
        "5818": {
            "name": "无意",
            "recipes": [
                "recipe_2263_1"
            ],
            "desc": "消耗3格气及以上施展“无我无剑”，会心效果提高30%，伤害提升5%，施展“紫气东来”后下两次施展“无我无剑”时，将为目标添加一层“重创”效果，使下次治疗无效。",
            "belong_key": "belong_5818"
        },
        "40064": {
            "name": "凭霄破云",
            "skills": [
                40065
            ],
            "desc": "对前方8尺扇形范围4个目标造成200%武器伤害附加<SUB 40065 1>外功伤害，若自身存在“云中剑”，则使自身和目标获得4秒“云中剑”对应气场效果（触发气场效果不受奇穴和秘籍影响）。",
            "belong_key": "belong_40064"
        },
        "34656": {
            "name": "剑入",
            "skills": [
                34693,
                34694
            ],
            "desc": "施展“人剑合一”后，下一次施展“八荒归元”后将在所有气场中心召唤 “灵剑”，持续10秒，再次施展“八荒归元”时将引爆所有“灵剑”，“灵剑”落下与引爆时将对至多3个目标造成12尺范围伤害，该伤害受“八荒归元”秘籍与奇穴影响。",
            "belong_key": "belong_34656"
        },
        "24972": {
            "name": "凌云剑",
            "skills": [
                24973,
                24977
            ],
            "desc": "怒刺一剑，对目标造成<SUB 24973 0>点外功伤害，并标记目标，持续5秒。期间可以施展二段技能，朝被标记目标冲刺，对270度的6尺范围最多5个目标造成<SUB 24977 0>点外功伤害，眩晕3秒并额外附带2层“叠刃”效果，施展二段招式后重置自身“八荒归元”调息时间。",
            "belong_key": "belong_24972"
        },
        "32447": {
            "name": "剑道万象",
            "desc": "强化当前“云中剑”，使其攻击间隔减少0.5秒，“云中剑”连续命中同1个目标4次后将锁足目标2秒。",
            "belong_key": "belong_32447"
        },
        "17742": {
            "name": "风逝",
            "buffs": [
                29451
            ],
            "desc": "“<NounID 87>”状态下5格气施展“无我无剑”将降低0.5秒“八荒归元”调息时间，并给目标叠加1层“风逝”效果，“风逝”最多叠加4层，每层使目标受到的“八荒归元”伤害额外提高50%。<TALENT_CORE 14833 1>",
            "belong_key": "belong_17742"
        },
        "15187": {
            "name": "行天道",
            "desc": "吸收20尺范围内自身的气场，使目标点形成12尺的“天道剑阵”，成功吸收气场时自身会化作“天道剑气”出现在“天道剑阵”中，同时使自身1秒内无法被命中，“天道剑阵”持续12秒，使该区域同时附带“生太极”“吞日月”“碎星辰”效果，剑阵每3秒对区域内5个敌人造成<SUB 32780 2>外功伤害并附带“叠刃”和5层“玄一”效果。",
            "belong_key": "belong_15187"
        },
        "5811": {
            "name": "深埋",
            "desc": "“凭虚御风”闪避效果提高10%，持续期间受到内功伤害降低30%。",
            "belong_key": "belong_5811"
        },
        "24958": {
            "name": "至柔",
            "desc": "“大道无术”命中定身的目标则变为眩晕效果，“大道无术”“剑冲阴阳”控制时间延长1秒。",
            "belong_key": "belong_24958"
        },
        "17743": {
            "name": "物我两忘",
            "desc": "施展“人剑合一”后获得4点“玄应之气”，若成功定身敌人则为其添加1层“叠刃”，并使12秒内自身对该目标产生的“定身”“眩晕”不受同类型控制效果衰减。",
            "belong_key": "belong_17743"
        },
        "14986": {
            "name": "开兑",
            "desc": "“吞日月”可解除友方目标阳性，阴性，混元性和毒性不利效果各一个。",
            "belong_key": "belong_14986"
        },
        "24961": {
            "name": "无为",
            "desc": "“大道无术”成功控制目标获得5格气，使自身立刻获得4秒“紫气东来”效果，且4秒内可额外施展一次“八荒归元”。",
            "belong_key": "belong_24961"
        },
        "36106": {
            "name": "瑞氛",
            "buffs": [
                30766
            ],
            "desc": "“云中剑”持续时间提高4秒，“人剑合一”成功定身目标后将标记其45秒，“云中剑”命中拥有该标记的目标则伤害提高30%。",
            "belong_key": "belong_36106"
        },
        "17747": {
            "name": "吐故纳新",
            "desc": "处于自身“生太极”气场当中，自身受到的伤害降低10%，受到攻击有15%几率令攻击者锁足3秒，并回复自身10%的内力，该效果每20秒只能触发一次。",
            "belong_key": "belong_17747"
        },
        "40375": {
            "name": "妄心",
            "recipes": [
                "recipe_5872_1",
                "recipe_5875_1"
            ],
            "desc": "“坐忘无我”调息时间提高50秒，持续时间降低至8秒，化解自身气血最大值50%伤害，每秒恢复自身4%最大气血值，化解量不再衰减，该护盾不受卸除影响。",
            "belong_key": "belong_40375"
        },
        "6758": {
            "name": "切玉",
            "desc": "“紫气东来”期间施展“八荒归元”命中气血值低于75%的目标，则立刻使“叠刃”持续伤害生效。",
            "belong_key": "belong_6758"
        },
        "32407": {
            "name": "和光",
            "recipes": [
                "recipe_5722_1"
            ],
            "desc": "“八荒归元”调息时间降低3秒，伤害提高10%。",
            "belong_key": "belong_32407"
        },
        "24969": {
            "name": "合虚",
            "buffs": [
                21865
            ],
            "desc": "5格气施展“无我无剑”将会为目标添加1层“玄一”效果，“玄一”效果被卸除时只消失1层，“无我无剑”命中自身“玄一”效果的目标则伤害提高10%。",
            "belong_key": "belong_24969"
        },
        "6481": {
            "name": "雾外江山",
            "recipes": [
                "recipe_4853_1",
                "recipe_4854_1",
                "recipe_4855_1",
                "recipe_4856_1",
                "recipe_4857_1",
                "recipe_4858_1",
                "recipe_4870_1"
            ],
            "desc": "所有气场招式的调息时间降低1秒，施展气场后额外回复1格气，成功运功施展气场，则使下一个“生太极”“吞日月”气场无需运功。",
            "belong_key": "belong_6481"
        }
    },
    "10021": {
        "136": {
            "name": "水月无间",
            "buffs": [
                1487
            ],
            "desc": "恢复20点墨意。若墨意高于20，则下一伤害或疗伤招式无需运功并消耗20墨意，持续10秒。同时自身获得“布散”气劲，使招式造成的威胁降低80%，混元内功基础攻击力和基础疗伤成效提高30%，持续10秒。并使自身免疫控制(击退和被拉除外)，持续5秒。<TALENT 14641 1 “布散”效果持续时间额外增加10秒，持续期间自身受到治疗提高20%><TALENT 2639 1 施展后恢复自身5%内力最大值><TALENT 2639 2 施展后恢复自身10%内力最大值><TALENT 5796 1 “水月无间”额外使2个招式无需运功，并立刻回复自身10%内力值><TALENT 21265 1 “水月无间”变为两层充能招式，立刻回复自身10%内力值，墨意上限提高至100点，并额外恢复40墨意><TALENT 5784 1 免疫控制效果持续时间延长至6秒。期间使自身免疫缴械和无法运功效果的影响，且运功不会被打断><TALENT 24907 1 “布散”效果持续期间，每次受到伤害时，消耗0.4%内力以格挡自身最大气血值1%的伤害值；施展疗伤技能额外消耗1%的内力，额外使其回复<SUB 25897 1>气血值。只在内力值高于30%时生效><TALENT 30737 1 释放后使自身获得5层“挥毫墨意”效果，加速提升15%。每次释放混元伤害技能将消耗一层并书写文字，当书写结束后将激活二段技能“翰墨永誓”：使目标无法受到伤害、治疗及平衡血量效果，持续8秒，该状态将在目标被“阳明指”“玉石俱焚”造成伤害之前结束。对友方施展时持续时间减半><TALENT 34583 1 施展“水月无间”时将挥洒墨圈对自身周围10尺范围最多5个侠士目标造成混元内功伤害，并沾染上墨滴，持续6秒。沾染上墨滴的目标施展招式命中目标几率降低60%><TALENT 37065 1 变为两层充能招式，充能时间50秒。“水月无间”免控效果期间，使自身免疫缴械和无法运功效果的影响，且运功不会被打断>",
            "belong_key": "belong_136"
        },
        "180": {
            "name": "商阳指",
            "recipes": [
                "recipe_457_1",
                "recipe_458_1",
                "recipe_459_1",
                "recipe_460_1",
                "recipe_461_1"
            ],
            "dots": {
                "666": [
                    180,
                    6134
                ]
            },
            "skills": [
                6693
            ],
            "desc": "恢复5点墨意。对目标立即造成<SUB 6693 1>混元内功伤害并使目标<BUFF 666 0 desc>(+<SKILLEx {D0} {TotalNeutralAP 0.3275}>)，持续<BUFF 666 0 time>。<TALENT 21736 1 伤害提高10%，效果持续时间增加至24秒，持续时间增加效果无法与同类效果叠加><TALENT 18261 1 每跳降低目标1%内力><TALENT 18271 1 使目标移动速度降低60%，持续4秒><TALENT 2630 2 伤害提高13%><TALENT 2630 3 伤害提高20%><TALENT 2635 1 伤害提高2%><TALENT 2635 2 伤害提高4%><TALENT 2635 3 伤害提高6%><TALENT 26694 1 有50%几率在目标位置落下一枚黑子，持续8秒。10尺内两枚异色子互相引爆，对10尺范围内最多5个目标造成<SUB 26696 1>混元内功伤害><TALENT 26694 2 在目标位置落下一枚黑子/白子，持续8秒。10尺内两枚异色子互相引爆，对10尺范围内最多5个目标造成<SUB 28645 1>治疗><TALENT 32378 1 额外恢复10点墨意，造成的伤害将受到自身基础治疗量的加成，并使目标造成的伤害降低10%，持续6秒><TALENT 5774 1 命中后可将该效果添加给目标半径8尺内的最多5个目标><TALENT 42155 1 >",
            "belong_key": "belong_180"
        },
        "189": {
            "name": "钟林毓秀",
            "recipes": [
                "recipe_494_1",
                "recipe_495_1",
                "recipe_496_1",
                "recipe_497_1",
                "recipe_498_1",
                "recipe_499_1"
            ],
            "dots": {
                "714": [
                    285,
                    6135,
                    39907
                ]
            },
            "desc": "恢复10点墨意。使目标<BUFF 714 0 desc>(+<SKILLEx {D0} {TotalNeutralAP 0.35597}>)，持续<BUFF 714 0 time>。若该效果被卸除则使目标锁足4秒。<TALENT 18261 1 每跳降低目标1%内力><TALENT 2641 1 施展后使目标立刻受到额外的“钟林毓秀”1跳的伤害><TALENT 2641 2 施展后使目标立刻受到“钟林毓秀”2跳的伤害><TALENT 2635 1 伤害提高2%><TALENT 2635 2 伤害提高4%><TALENT 2635 3 伤害提高6%><TALENT 6690 1 每跳有30%几率使下一个“阳明指”无需运功><TALENT 6691 1 施展立刻对目标造成<SUB 20447 1>混元性内功伤害><TALENT 23945 1 会心几率提高10%，可以在移动中施展且施展过程中移动速度提高30%><TALENT 5774 1 命中后可将该效果添加给目标半径8尺内的最多5个目标><TALENT 26694 1 在目标位置落下一枚白子，持续8秒。10尺内两枚异色子互相引爆，对10尺范围内最多5个目标造成<SUB 26696 1>混元内功伤害><TALENT 25951 1 “钟林毓秀”施展时若目标身上已有“钟林毓秀”不利效果，则使该次“钟林毓秀”伤害提高80%>",
            "belong_key": "belong_189"
        },
        "190": {
            "name": "兰摧玉折",
            "recipes": [
                "recipe_443_1",
                "recipe_444_1",
                "recipe_445_1",
                "recipe_446_1",
                "recipe_447_1",
                "recipe_448_1",
                "recipe_449_1"
            ],
            "dots": {
                "711": [
                    18730,
                    6136,
                    39906
                ]
            },
            "desc": "恢复5点墨意。使目标每3秒受到30点(+<SKILLEx {D0} {TotalNeutralAP 0.3642}>)混元性内功伤害并降低15%化劲等级，持续<BUFF 711 0 time>，只能作用于一个目标。若该效果被卸除则使目标<BUFF 712 1 desc>，持续<BUFF 712 1 time>。<TALENT 5771 1 持续期间降低目标20%攻击力><TALENT 5758 1 若被卸除，则会立刻给卸除者添加“兰摧玉折”效果><TALENT 18257 1 无调息时间，可同时存在于两个目标，对任意存在自身“兰摧玉折”的目标施展“商阳指”“钟林毓秀”，另一个有自身“兰摧玉折”的目标也会获得“商阳指”“钟林毓秀”效果><TALENT 18261 1 每跳降低目标1%内力><TALENT 2633 1 运功时间减少0.125秒><TALENT 2633 2 运功时间减少0.25秒><TALENT 2635 1 伤害提高2%><TALENT 2635 2 伤害提高4%><TALENT 6690 1 每跳有30%几率使下一个“阳明指”无需运功><TALENT 6691 1 施展立刻对目标造成<SUB 20447 1>混元性内功伤害><TALENT 17510 1 若任意目标存在自身的“兰摧玉折”不利状态，则自身内功攻击力提高10%，招式无视目标35%内功防御等级><TALENT 23945 1 会心几率提高10%，可以在移动中施展且施展过程中移动速度提高30%><TALENT 23948 1 持续期间降低目标20%的内外功基础攻击力><TALENT 16855 1 调息时间降低4秒。自身对“兰摧玉折”标记目标伤害提升10%>",
            "belong_key": "belong_190"
        },
        "10021": {
            "name": "花间游",
            "attributes": {
                "magical_shield_base": 1565,
                "physical_shield_base": 2850,
                "spunk_to_neutral_attack_power": 2079,
                "spunk_to_neutral_overcome": 205,
                "max_life_gain": 245,
                "pve_addition_base": 369,
                "magical_attack_power_base": 7242
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "skills": [
                16,
                32467,
                25768
            ],
            "desc": "万花点穴武学之根本。习之可通晓人体之经络穴位及要害之处。一可封经截脉，克敌制胜；二可助人疏通筋脉，祛病除邪。",
            "critical_type": "neutral",
            "damage_type": "neutral",
            "belong_key": "belong_10021"
        },
        "179": {
            "name": "阳明指",
            "recipes": [
                "recipe_486_1",
                "recipe_487_1",
                "recipe_488_1",
                "recipe_489_1",
                "recipe_490_1",
                "recipe_491_1",
                "recipe_492_1",
                "recipe_493_1"
            ],
            "skills": [
                14941
            ],
            "desc": "恢复5点墨意。对目标造成<SUB 14941 0>混元内功伤害。当墨意高于20点施展时，消耗20点墨意使本次招式无需运功。<TALENT 21744 1 “阳明指”变为3层充能招式，充能时间6秒。命中后吞噬目标身上剩余时间最长的持续伤害效果。自身持续伤害被吞噬后，使下一个对应持续伤害招式附带混元伤害><TALENT 5756 1 会心几率提高10%，会心效果提高10%><TALENT 21941 1 命中带有自身定身效果的目标后，为目标添加“兰摧玉折”效果，重置“玉石俱焚”的调息时间><TALENT 5772 1 施展后有20%几率使目标身上的混元性持续性伤害立刻生效><TALENT 5773 1 若目标身上没有“钟林毓秀”效果，则阳明指附带“钟林毓秀”><TALENT 5767 1 命中有自身混元持续伤害效果的目标，每个持续伤害效果使“阳明指”会心几率提高6%，会心效果提高6%><TALENT 2640 1 运功时间减少0.125秒><TALENT 2640 2 运功时间减少0.25秒><TALENT 5764 1 命中目标后使自身获得“梦歌”气劲，每层使加速率提高3%，持续30秒，最多叠加2层><TALENT 6681 1 会心后刷新目标身上的所有混元持续伤害><EnchantID 10079 施展“阳明指获得一层瞬息效果，持续6秒，可叠加5层，5层瞬息下施展“快雪时晴”，瞬间施放出所有伤害><TALENT 26694 2 在目标位置落下一枚黑子/白子，持续8秒。10尺内两枚异色子互相引爆，对10尺范围内最多5个目标造成<SUB 28645 1>治疗><TALENT 32483 1 战斗中每施展两次“阳明指”，吞噬目标身上剩余时间最长的持续伤害效果（对非侠士目标吞噬的持续伤害提升100%并增加2跳）。自身持续伤害被吞噬后，使下一个对应持续伤害招式附带混元伤害><TALENT 32638 1 战斗中累计受到20%最大气血值的伤害时获得“随墨”效果，使下一个“阳明指”命中目标时，短暂延迟后附带“兰摧玉折”“钟林毓秀”“商阳指”中缺少的一个，随后重新记录伤害><TALENT 38954 1 “阳明指”命中后，使自身下次施展持续伤害时附带一次<SUB 38955 1>内功伤害><TALENT 42155 1 >",
            "belong_key": "belong_179"
        },
        "228": {
            "name": "太阴指",
            "skills": [
                497
            ],
            "desc": "门派轻功，恢复5点墨意。解除自身控制效果(击倒除外)并向后疾退，移动速度提高30%，持续8秒，受到的伤害降低35%，持续5秒，对周围8尺内的目标造成<SUB 497 0>混元性内功伤害并锁足3秒，若这些目标处于骑乘状态，则将其击落马下。<TALENT 16857 1 受到伤害导致自身气血值低于40%，立刻重置“太阴指”“星楼月影”调息时间，该效果最多60秒触发一次><TALENT 18268 1 变为2层充能技能，充能时间17秒，但无法被“春泥护花”重置调息时间><TALENT 6684 1 调息时间降低5秒，解除自身减速、锁足效果并使命中目标锁足3秒><TALENT 5763 1 锁足范围内目标3秒><TALENT 6685 1 受到的伤害降低30%，持续8秒><TALENT 13982 1 使自身免疫控制效果，持续4秒><TALENT 34331 1 “太阴指”变为2层充能技能，充能时间17秒，但无法被“春泥护花”重置调息时间。施展“太阴指”后，受到的伤害降低40%，持续8秒><TALENT 5798 1 施展“太阴指”后，额外获得15点墨意，10秒内下一次施展“太素九针”套路下部分技能将附带额外效果：若施展“握针”命中目标将直接引爆“握针”持续效果；若施展“提针”命中目标将附带3秒“碧水滔天”效果；若施展“长针”命中目标将使自身获得6秒“布散”效果><TALENT 42155 1 >",
            "belong_key": "belong_228"
        },
        "182": {
            "name": "玉石俱焚",
            "attributes": {
                "neutral_damage_base": 81,
                "neutral_damage_rand": 10
            },
            "skills": [
                182
            ],
            "desc": "恢复5点墨意。对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元性内功伤害。若该目标正受到万花持续性伤害，则吞噬其剩余伤害使之立即生效。该招式调息时间受加速影响。<TALENT 18820 1 吞噬目标持续伤害后，使自身下一个“阳明指”“商阳指”“钟林毓秀”“兰摧玉折”施展后瞬间造成<SUB 18821 1>伤害，且使“快雪时晴”下5跳的伤害提高。“玉石俱焚”引爆的持续伤害剩余时间越多，“快雪时晴”伤害越高><TALENT 18259 1 每吞噬目标身上一个自身的持续伤害效果，则卸除目标混元、阳性、阴性、毒性有益气劲各一个><TALENT 6682 1 每次消耗墨意，使下一次“玉石俱焚”命中后恢复20墨意并附带“兰摧玉折”持续伤害效果。每吞噬一个持续伤害效果，调息时间降低1秒><TALENT 2644 2 调息时间降低2秒，施展后有40%几率令目标定身，持续4秒><TALENT 5774 1 可以吞噬目标半径8尺内额外5个目标身上属于自身的持续伤害><TALENT 5754 1 成功吞噬持续伤害效果，使“阳明指”“快雪时晴”伤害提高20%，持续5秒，每额外吞噬一个效果，持续时间增加5秒><EnchantID 10080 玉石俱焚每吞噬一跳属于自身的持续伤害效果，使下一招阳明指额外造成10%的伤害。><TALENT 5751 1 命中目标后会在目标10尺范围内随机落下一枚黑子/白子，持续8秒。每吞噬一个持续伤害则会延迟额外生成一个棋子。10尺内两枚异色子互相引爆，对10尺范围内最多5个目标造成<SUB 26696 1>混元内功伤害><TALENT 26692 1 施展“玉石俱焚”触发吞噬时下一运功招式无需运功且消耗20墨意，自身18秒内基础攻击力提升15%><TALENT 30596 1 “玉石俱焚”不再吞噬持续伤害，而是使其剩余伤害提升80%。目标12秒内被自身附带持续伤害的招式命中时，其附带的持续伤害也会提高80%><TALENT 14654 1 命中后，下一次完整运功“快雪时晴”时可触发一次伤害，该伤害受“快雪时晴”秘籍影响><TALENT 30650 1 命中后在目标8尺区域产生墨池持续6秒，墨池每2秒浸染其中最多5个目标造成伤害并减速50%，若墨池浸染的目标有自身持续伤害，则对其造成该持续伤害的一跳伤害。同时画出雨墨雕，延迟1.5秒后对墨池内最多5个敌方目标造成<SUB 30648 1>混元伤害><TALENT 32469 1 吞噬目标持续不利效果时，该效果剩余跳数每有1跳，其触发的“破招”伤害增加20%，最多增加120%><TALENT 5762 1 自身“玉石俱焚”命中后，15秒内下一次“快雪时晴”可在移动中施展><TALENT 42167 1 >",
            "belong_key": "belong_182"
        },
        "186": {
            "name": "芙蓉并蒂",
            "attributes": {
                "neutral_damage_base": 76,
                "neutral_damage_rand": 5
            },
            "recipes": [
                "recipe_4903_1",
                "recipe_4904_1",
                "recipe_4905_1",
                "recipe_4906_1",
                "recipe_4907_1",
                "recipe_4908_1",
                "recipe_4909_1"
            ],
            "skills": [
                186
            ],
            "desc": "恢复5点墨意。对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元性内功伤害，并使其<BUFF 675 1 desc>，持续4秒。“阳明指”命中带有“芙蓉并蒂”定身效果的目标后，重置“芙蓉并蒂”的调息时间。<TALENT 2633 1 施展后有50%几率使下一个“兰摧玉折”无需运功><TALENT 2633 2 施展后有100%几率使下一个“兰摧玉折”无需运功><TALENT 5761 1 伤害提高100%，刷新目标身上所有属于自身的持续伤害效果><TALENT 14635 1 额外造成<SUB 39668 1>伤害，调息时间降低10秒，定身效果持续时间延长1秒><TALENT 26669 1 “芙蓉并蒂”及其附带的刷新持续伤害会心几率提高15%，会心效果提升15%，持续效果期间目标受到伤害提高10%><TALENT 32489 1 命中后使下一个“玉石俱焚”命中时吞噬的持续效果伤害无视目标50%防御><TALENT 36017 1 “芙蓉并蒂”命中敌对侠士后，在其身上放置一个天工铁颅，持续5秒。期间目标无法施展轻功，被自身“玉石俱焚”命中触发吞噬时，铁颅会产生一次共鸣爆破，对目标及其附近6尺最多5名敌对目标造成<SUB 36018 1>混元伤害>",
            "belong_key": "belong_186"
        },
        "2636": {
            "name": "快雪时晴",
            "recipes": [
                "recipe_1677_1",
                "recipe_1678_1",
                "recipe_1679_1",
                "recipe_1681_1",
                "recipe_1682_1",
                "recipe_1683_1",
                "recipe_1684_1"
            ],
            "skills": [
                6233
            ],
            "desc": "恢复5点墨意。每秒对目标及目标附近的最多4个目标造成<SUB 6233 0>混元内功伤害，持续5秒。完整运功后对命中目标造成一段破招伤害。<TALENT 5767 1 命中有自身混元持续伤害效果的目标，每个持续伤害效果使“快雪时晴”会心几率提高6%，会心效果提高6%><TALENT 6681 1 会心后刷新目标身上的所有混元持续伤害><TALENT 5753 1 会心几率提高10%，会心效果提高10%><TALENT 5762 1 “快雪时晴”会心提高20%，会心效果提高20%。自身“玉石俱焚”命中后，15秒内下一次“快雪时晴”可在移动中施展><TALENT 6679 1 命中有自身持续伤害效果的目标，每次伤害有40%几率额外造成一次伤害><TALENT 5764 1 运功结束后获得“梦歌”气劲，每层使加速率提高3%，持续30秒，最多叠加2层><TALENT 18724 1 目标身上每存在一个自身的持续性伤害效果，则对该目标的伤害提高8%><TALENT 24912 1 不会被打退打断，期间免疫控制和封内效果（击退和被拉除外），调息时间变为20秒充能2层，伤害提高170%且额外附带2跳伤害><TALENT 32480 1 使主目标每4秒受到38点(+<SKILLEx {D0} {TotalNeutralAP 0.065}>)伤害，持续28秒，最多叠加6层。完整运功“快雪时晴”时额外叠加1层。若主目标不是侠士，则“快雪时晴”对其伤害提升50%，并使附带持续伤害可以被吞噬。该持续伤害效果不受“快雪时晴”秘籍影响><TALENT 32628 1 命中附带“兰摧玉折”的目标时，额外造成混元伤害><TALENT 32477 1 “快雪时晴”2.81秒内对目标造成5次伤害><TALENT 38850 1 “快雪时晴”每额外命中一个目标，伤害提高50%>",
            "belong_key": "belong_2636"
        },
        "14635": {
            "name": "踏莲",
            "recipes": [
                "recipe_2323_1"
            ],
            "desc": "“芙蓉并蒂”调息时间降低10秒，定身效果持续时间延长1秒，控制效果持续期间目标受到伤害提高10%。",
            "belong_key": "belong_14635"
        },
        "30596": {
            "name": "飞白",
            "buffs": [
                23065
            ],
            "dots": {
                "666": [
                    34280,
                    40085
                ],
                "711": [
                    34278,
                    40084
                ],
                "714": [
                    34279,
                    40086
                ]
            },
            "desc": "“玉石俱焚”不再吞噬持续伤害，而是使其剩余伤害提升120%。目标12秒内被自身附带持续伤害的招式命中时，其附带的持续伤害也会提高120%。",
            "belong_key": "belong_30596"
        },
        "24912": {
            "name": "丹鼎",
            "recipes": [
                "recipe_5164_1",
                "recipe_4661_1"
            ],
            "desc": "“快雪时晴”不会被打退打断，期间免疫控制和封内效果(击退和被拉除外)，调息时间变为20秒充能2层且受加速影响，伤害提高80%且额外附带2跳伤害。",
            "belong_key": "belong_24912"
        },
        "42155": {
            "name": "水佩",
            "buffs": [
                2719
            ],
            "desc": "“青荷”效果期间自身招式伤害提高15%，且会强化下一个点穴截脉套路下所有招式，使其都可附带“兰摧玉折”“钟林毓秀”持续伤害效果。",
            "belong_key": "belong_42155"
        },
        "42168": {
            "name": "晴昼",
            "recipes": [
                "recipe_6153_2"
            ],
            "desc": "“乱洒青荷”变为2层充能技能。",
            "belong_key": "belong_42168"
        },
        "21744": {
            "name": "折花",
            "skills": [
                32501
            ],
            "desc": "“阳明指”命中后吞噬目标身上剩余时间最长的持续伤害效果。自身持续伤害被吞噬后，使下一个对应持续伤害招式附带混元伤害。",
            "belong_key": "belong_21744"
        },
        "40077": {
            "name": "针砭",
            "desc": "“乱洒青荷”强化的招式命中时，使目标1.5秒后无法运功，持续3秒。",
            "belong_key": "belong_40077"
        },
        "18271": {
            "name": "少阳指",
            "desc": "施展“商阳指”使目标移动速度降低60%，持续4秒。",
            "belong_key": "belong_18271"
        },
        "26669": {
            "name": "故幽",
            "recipes": [
                "recipe_2439_1",
                "recipe_2440_1",
                "recipe_2441_1",
                "recipe_2442_1",
                "recipe_2443_1",
                "recipe_3151_1"
            ],
            "desc": "“芙蓉并蒂”及其附带的刷新持续伤害会心几率提高15%，会心效果提高15%。",
            "belong_key": "belong_26669"
        },
        "32484": {
            "name": "放歌",
            "desc": "每次恢复墨意值时，额外恢复2点。",
            "belong_key": "belong_32484"
        },
        "32477": {
            "name": "雪中行",
            "recipes": [
                "recipe_4584_1"
            ],
            "desc": "“快雪时晴”2.81秒内对目标造成5次伤害。",
            "belong_key": "belong_32477"
        },
        "5774": {
            "name": "风烟翠",
            "dots": {
                "666": [
                    13849
                ],
                "714": [
                    13847
                ]
            },
            "skills": [
                42156
            ],
            "desc": "“商阳指”“钟林毓秀”命中时可将该效果添加给目标半径8尺内的最多5个目标。“玉石俱焚”可以吞噬目标半径8尺内额外5个目标身上属于自身的持续伤害并根据吞噬的持续伤害数量造成<SUB 42156 0>额外伤害。",
            "belong_key": "belong_5774"
        },
        "36017": {
            "name": "游斤",
            "skills": [
                36018
            ],
            "desc": "“芙蓉并蒂”命中敌对侠士后，在其身上放置一个天工铁颅，持续5秒。期间目标无法施展轻功，被自身“玉石俱焚”命中触发吞噬时，铁颅会产生一次共鸣爆破，对目标及其附近6尺最多5名敌对目标造成<SUB 36018 1>混元伤害。",
            "belong_key": "belong_36017"
        },
        "32638": {
            "name": "随墨",
            "dots": {
                "666": [
                    13849
                ],
                "714": [
                    13847
                ],
                "711": [
                    13848
                ]
            },
            "desc": "战斗中累计受到20%最大气血值的伤害时获得“随墨”效果，使下一个“阳明指”命中目标时，短暂延迟后附带“兰摧玉折”“钟林毓秀”“商阳指”中缺少的一个，随后重新记录伤害。",
            "belong_key": "belong_32638"
        },
        "5762": {
            "name": "青歌",
            "recipes": [
                "recipe_5497_1"
            ],
            "buffs": [
                32022
            ],
            "desc": "“快雪时晴”会心提高20%，会心效果提高20%。自身“玉石俱焚”命中后，15秒内自身基础攻击力提高15%，下一次“快雪时晴”可在移动中施展。",
            "belong_key": "belong_5762"
        },
        "23945": {
            "name": "生风",
            "recipes": [
                "recipe_6231_1",
                "recipe_6232_1",
                "recipe_5642_1",
                "recipe_5643_1"
            ],
            "desc": "“钟林毓秀”“兰摧玉折”可以在移动中施展，运功时间降低0.5秒，命中后减少0.5秒基础调息时间。",
            "belong_key": "belong_23945"
        },
        "28464": {
            "name": "守拙",
            "desc": "受到控制时可以对8尺内敌对目标施展，唤出“阿甘贰型”，将敌方目标关入“阿甘贰型”体内。期间“阿甘贰型”不可移动，持续4秒。",
            "belong_key": "belong_28464"
        },
        "6682": {
            "name": "流离",
            "dots": {
                "711": [
                    13848
                ]
            },
            "desc": "每次消耗墨意，使下一次“玉石俱焚”命中后恢复20墨意并附带“兰摧玉折”持续伤害效果。每吞噬一个持续伤害效果，调息时间降低1.25秒。",
            "belong_key": "belong_6682"
        },
        "40075": {
            "name": "沁逸",
            "buffs": [
                30444
            ],
            "desc": "“乱洒青荷”施展后使下一次“快雪时晴”最终伤害提高40%。",
            "belong_key": "belong_40075"
        },
        "6686": {
            "name": "兰舟",
            "recipes": [
                "recipe_1301_1",
                "recipe_1302_1",
                "recipe_1303_1",
                "recipe_3199_1"
            ],
            "desc": "混元性持续伤害提高5%，持续伤害效果被卸除后，每个持续伤害使目标1.5秒内无法受到治疗效果，最多叠加4.5秒。",
            "belong_key": "belong_6686"
        },
        "5759": {
            "name": "列宿",
            "desc": "战斗中受击使自身获得一层“春泥护花”。该效果每3秒可触发一次。",
            "belong_key": "belong_5759"
        },
        "38850": {
            "name": "雪弃",
            "recipes": [
                "recipe_5975_1"
            ],
            "skills": [
                38854
            ],
            "desc": "“快雪时晴”伤害提高10%，且每额外命中一个目标，伤害提高50%。",
            "belong_key": "belong_38850"
        },
        "18259": {
            "name": "春脉",
            "desc": "“玉石俱焚”每吞噬目标身上一个自身的持续伤害效果，则卸除目标混元、阳性、阴性、毒性有益气劲各一个。",
            "belong_key": "belong_18259"
        },
        "42164": {
            "name": "风裳",
            "desc": "“青荷”的强化招式命中时重置“芙蓉并蒂”调息时间。",
            "belong_key": "belong_42164"
        },
        "26692": {
            "name": "钟灵",
            "buffs": [
                28116
            ],
            "desc": "施展“玉石俱焚”触发吞噬时下一“兰摧玉折”或“钟林毓秀”无需运功且消耗20墨意，自身18秒内基础攻击提高20%，无双等级提高20%，招式无视敌方65%内功防御等级。",
            "belong_key": "belong_26692"
        },
        "28465": {
            "name": "天工甲士",
            "desc": "持续运功5秒组装天工甲士，随后激活二段招式“天工”操纵天工甲士，每次操纵时间最多持续30秒。天工甲士无法受到治疗，其气血值耗尽时会损坏并使操纵者脱离。当场上存在自身损坏的天工甲士时，“天工甲士”无需运功并使其自我修复5秒。若主动离开天工甲士则记录离开时天工甲士的气血值，25秒后可以再次使用“天工”并继承离开时天工甲士的气血值。",
            "belong_key": "belong_28465"
        },
        "24919": {
            "name": "洛川神韵",
            "attributes": {
                "neutral_damage_base": 122,
                "neutral_damage_rand": 3
            },
            "skills": [
                24920,
                24923
            ],
            "desc": "挥洒墨笔，对目标侠士造成<SUB 24920 0>混元内功伤害，并溅射其周围10尺内的一位敌方侠士造成<SUB 24920 0>混元内功伤害，使其被墨迹相连，持续10秒。墨迹相连期间，两者也会同样受到对方受到的伤害的20%。若两者相距超过12尺则墨迹炸裂，造成<SUB 24923 0>混元内功伤害并且无法施展招式，持续4秒。",
            "belong_key": "belong_24919"
        },
        "14965": {
            "name": "南风吐月",
            "desc": "可对团队友方目标施展，清除其所有移动限制和阴性、混元性、阳性、毒性、持续和点穴的不利效果且不会受到攻击但效果期间无法移动，持续8秒。",
            "belong_key": "belong_14965"
        },
        "133": {
            "name": "清风垂露",
            "recipes": [
                "recipe_450_1",
                "recipe_451_1",
                "recipe_452_1",
                "recipe_453_1",
                "recipe_454_1",
                "recipe_455_1",
                "recipe_456_1"
            ],
            "desc": "为友方目标卸除阳性不利效果、阴性不利效果、混元不利效果、毒性不利效果、点穴不利效果、持续伤害不利效果各一个。“离经易道”心法下返还5秒调息时间。<TALENT 3789 1 施展后,为目标额外卸除一个持续伤害的不利效果>",
            "belong_key": "belong_133"
        },
        "183": {
            "name": "厥阴指",
            "recipes": [
                "recipe_4530_1",
                "recipe_4531_1",
                "recipe_4532_1"
            ],
            "skills": [
                144
            ],
            "desc": "若目标正在运功则进行打断并造成<SUB 144 0>混元性内功伤害，并使其<BUFF 585 1 desc>，持续<BUFF 585 1 time>，使自身招式伤害提高15%，持续8秒。“离经易道”心法下返还10秒调息时间。",
            "belong_key": "belong_183"
        },
        "34573": {
            "name": "如馥",
            "buffs": [
                25858,
                25859,
                25860,
                25861,
                25862
            ],
            "desc": "自身拥有的“春泥护花”最后一层被击破时，根据击破者运转的心法内功类型，使自身受到该类型的伤害额外降低15%，自身混元内功伤害提升7%，持续10秒。",
            "belong_key": "belong_34573"
        },
        "37267": {
            "name": "墨海临源",
            "desc": "战斗中每施展5次“阳明指”“玉石俱焚”“快雪时晴”可激活1层施展次数，最多可累计3层。施展后恢复20墨意，对目标造成<NounID 13>混元伤害，该伤害对非侠士目标提高150%，并附带一段破招伤害。",
            "belong_key": "belong_37267"
        },
        "24914": {
            "name": "空山",
            "desc": "“听风吹雪”可以对敌方侠士施展，运功1秒，将自身与敌方侠士当前气血值百分比互换，互换后目标气血值不会低于50%，调息时间1分钟。",
            "belong_key": "belong_24914"
        },
        "38595": {
            "name": "连劫",
            "desc": "甩出4颗棋子将目标围困，造成6秒“提子”效果，期间目标造成的伤害及治疗效果降低80%。“玉石俱焚”命中时可以降低“连劫”5秒调息时间。",
            "belong_key": "belong_38595"
        },
        "5751": {
            "name": "定式黑白",
            "skills": [
                26696
            ],
            "desc": "施展“玉石俱焚”命中目标后会在目标10尺范围内随机落下一枚黑子/白子，棋子持续8秒。“玉石俱焚”每吞噬一个持续伤害则会延迟额外生成一个棋子。10尺内两枚异色子互相引爆，对10尺范围内最多5个目标造成<SUB 26696 1>混元内功伤害。",
            "belong_key": "belong_5751"
        },
        "18268": {
            "name": "轻鸿",
            "recipes": [
                "recipe_4380_1"
            ],
            "desc": "“太阴指”变为2层充能技能，充能时间17秒，但无法被“春泥护花”重置调息时间。",
            "belong_key": "belong_18268"
        },
        "37065": {
            "name": "活络",
            "recipes": [
                "recipe_5477_1"
            ],
            "desc": "“水月无间”变为两层充能招式，充能时间50秒。“水月无间”免控效果期间，使自身免疫缴械和无法运功效果的影响，且运功不会被打断。",
            "belong_key": "belong_37065"
        },
        "17565": {
            "name": "秋毫",
            "recipes": [
                "recipe_4695_1"
            ],
            "desc": "“清心静气”对自身效果提升至10%最大气血值。调息时间增加至30秒，施展后为友方目标添加7层“毫针”效果。",
            "belong_key": "belong_17565"
        },
        "42167": {
            "name": "春寒",
            "desc": "每次施展“玉石俱焚”时，降低“乱洒青荷”调息时间5秒。",
            "belong_key": "belong_42167"
        },
        "40800": {
            "name": "渲青",
            "desc": "“青荷”效果将强化下两个招式，强化招式命中时重置“玉石俱焚”调息时间，但附带的“兰摧玉折”“钟林毓秀”伤害加成降低至10%。",
            "belong_key": "belong_40800"
        }
    },
    "10026": {
        "404": {
            "name": "撼如雷",
            "buffs": [
                6363
            ],
            "desc": "使周围队友<BUFF 362 0 desc>，持续<BUFF 362 0 time>，使自身获得“激雷”效果，“激雷”效果持续期间外功会心提高30%，持续6秒。<TALENT 5678 1 效果持续期间自身无视目标70%外功防御，效果持续时间提高200%><TALENT 14800 1 调息时间降低5秒，施展后强制半径10尺内最多5个目标攻击自身，持续4秒><TALENT 6806 1 施展后小队成员的外功破防值提高20%，外功基础攻击力提高20%，持续6秒><TALENT 2600 2 效果提高50%><TALENT 37338 1 施展后获得12秒“背水一战”效果。背水一战：每2秒对自身造成最大气血值2%的伤害，同时对自身6尺内2名敌对侠士目标额外造成<SUB 37350 1>外功伤害，持续12秒，若命中目标，则下次伤害增加20%，最多提高100%><TALENT 42310 1 >",
            "belong_key": "belong_404"
        },
        "433": {
            "name": "任驰骋",
            "buffs": [
                6121
            ],
            "desc": "2层充能技能，使自身可在战斗中上马，重置自身“断魂刺”“破坚阵”“沧月”招式调息时间解除自身锁足效果，成功上马后获得5秒“纵轻骑”效果，不受下马效果影响、自身免疫控制以及任何位移招式影响，自身外功基础攻击力提高15%，不消耗坐骑饱食度，持续15秒。<TALENT 18229 1 招式无需运功，且“纵轻骑”效果持续时间提高1秒><TALENT 2607 2 调息时间降低20秒，成功上马后5秒内不受任何招式控制，并且不会被击下马><TALENT 6515 1 下马后若“任驰骋”还在调息中，则立即降低15秒调息时间，该效果每1分钟触发1次><TALENT 5676 1 “任驰骋”上马后移动速度提高50%，“纵轻骑”效果持续过程中将不受任何位移招式影响><TALENT 14824 1 获得的外功基础攻击力效果提高至30%，可以在“骑御”状态施展“灭”><TALENT 24899 1 “任驰骋”上马后移动速度提高50%且无需运功，“纵轻骑”效果持续时间提高1秒，期间自身加速值突破上限，提高50%><TALENT 28442 1 不再充能，“纵轻骑”效果持续时间增加5秒，“纵轻骑”效果下自身每造成三次外功伤害会延长一秒“纵轻骑”效果的时间，最多延长4次><TALENT 24901 1 施展“任驰骋”后10秒内可以对右后方8尺以内倒地状态的敌方目标施展二段招式，维持其倒地状态，自身和目标一起向前冲刺并对其造成100%武器伤害附加最高<SUB 36258 4>外功伤害，自身速度越快，冲刺距离越远伤害越高><TALENT 24896 1 “任驰骋”调息时间降低6秒，施展时获得6层“龙驭”效果，非“骑御”期间每次施展龙牙获得一层“龙驭”效果最多25层，“骑御”期间每次施展龙牙会消耗一层“龙驭”本次龙牙伤害提高30%>",
            "belong_key": "belong_433"
        },
        "403": {
            "name": "龙吟",
            "recipes": [
                "recipe_1557_1",
                "recipe_1558_1",
                "recipe_1559_1",
                "recipe_1560_1",
                "recipe_1561_1",
                "recipe_1562_1",
                "recipe_1563_1",
                "recipe_1564_1"
            ],
            "dots": {
                "3442": [
                    18591
                ]
            },
            "skills": [
                18603
            ],
            "desc": "对目标造成100%的武器伤害外加<SUB 18603 0>点外功伤害并使自身获得2点战意，使目标同时附带“流血”和“破风”效果，“流血”使目标<BUFF 3442 0 desc>(+<SKILLEx {D0} {TotalPhysicsAP 0.69457}>)且可叠加2层，“破风”使目标<BUFF 661 0 desc>，持续<BUFF 3442 0 time>。<TALENT 18226 1 “流血”效果可叠3层，持续效果增加5跳。对有自身三层流血的目标再次添加流血效果，会额外造成<SUB 36568 1>外功伤害><TALENT 14821 1 “流血”作用间隔缩短0.25秒><TALENT 18605 1 命中具有自身“流血”效果的目标增加30%伤害><TALENT 6523 1 可使目标8尺范围内额外5个目标受到“流血”效果影响，且流血伤害提高15%><TALENT 18224 1 对目标周围8尺内最多5个目标造成外功伤害且移动速度降低60%，持续12秒><TALENT 5681 1 “龙吟”威胁值提高20%，调息时间降低2秒><TALENT 5662 1 伤害提高10%，目标移动速度降低50%，持续8秒><TALENT 6527 1 使自身立刻获得3点战意><TALENT 5696 1 附带额外威胁值><TALENT 2610 1 伤害提高2%><TALENT 2610 2 伤害提高4%><TALENT 2610 3 伤害提高6%><TALENT 5666 1 每点“战意”增加5%伤害><TALENT 24899 1 “纵轻骑”期间额外附带一次100%的武器伤害效果><TALENT 5659 1 施展“灭”后，使下一个“龙吟”额外造成<SUB 37618 1>外功伤害><TALENT 32911 1 施展“龙吟”后，20秒内下一次施展“穿云”距离增加4尺并会造成3段<SUB 36097 28>外功伤害><TALENT 18872 1 >",
            "belong_key": "belong_403"
        },
        "10026": {
            "name": "傲血战意",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2715,
                "pve_addition_base": 338,
                "strength_to_physical_attack_power": 1843,
                "strength_to_physical_overcome": 287,
                "max_life_gain": 245,
                "physical_attack_power_base": 7164
            },
            "recipes": [
                "recipe_4892_1",
                "recipe_1110_2",
                "recipe_1711_1"
            ],
            "skills": [
                12,
                32820,
                25772,
                31031
            ],
            "desc": "令人周身血脉畅通，真气爆发，内力激增，所向披靡，无往不利。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10026"
        },
        "400": {
            "name": "穿云",
            "recipes": [
                "recipe_333_1",
                "recipe_334_1",
                "recipe_335_1",
                "recipe_336_1",
                "recipe_337_1",
                "recipe_338_1",
                "recipe_339_1"
            ],
            "skills": [
                18207,
                18208
            ],
            "desc": "对目标造成100%的武器伤害外加<SUB 18207 0>外功伤害，并使自身获得1点战意。<TALENT 21942 1 命中没有自身“流血”或“流血”没有叠加至最高层数的目标则同时附带“流血”“破风”效果><TALENT 18605 1 命中具有自身“流血”效果的目标增加30%伤害><TALENT 5657 1 会心几率提高10%，会心效果提高10%><TALENT 5666 1 每点“战意”增加5%伤害><TALENT 5699 1 威胁值提高20%><TALENT 2602 2 调息时间降低0.5秒><TALENT 2610 1 伤害提高2%><TALENT 2610 2 伤害提高4%><TALENT 2610 3 伤害提高6%><TALENT 24899 1 “纵轻骑”期间额外附带一次100%的武器伤害效果><TALENT 32911 1 施展“龙吟”后，20秒内下一次施展“穿云”距离增加4尺并造成3段<SUB 36097 28>外功伤害>",
            "belong_key": "belong_400"
        },
        "415": {
            "name": "龙牙",
            "recipes": [
                "recipe_355_1",
                "recipe_356_1",
                "recipe_357_1",
                "recipe_358_1",
                "recipe_359_1",
                "recipe_360_1",
                "recipe_361_1",
                "recipe_362_1"
            ],
            "skills": [
                18773
            ],
            "desc": "消耗3点战意，对目标造成100%的武器伤害外加<SUB 18773 0>点外功伤害和一段破招伤害。<TALENT 15001 1 施展距离提高4尺，命中有自身“流血”效果的目标额外造成30%伤害><TALENT 5666 1 每点“战意”增加5%伤害><TALENT 6517 1 每累计施展龙牙3次，使下一次龙牙施展时不消耗战意><TALENT 5658 1 命中目标后，对目标周围6尺的5个目标造成外功伤害><TALENT 5660 1 会心几率提高10%，会心效果提高10%><TALENT 5652 1 命中后刷新目标身上的“破风”效果><TALENT 2610 2 伤害提高4%><TALENT 6512 1 施展后有35%几率刷新“龙吟”的调息时间><TALENT 5688 1 使目标造成的伤害降低10%，持续6秒><TALENT 6869 1 反击效果期间每次使用“龙牙”都使目标外功防御降低10%，最多叠加3层，持续20秒><TALENT 6511 1 牧云效果期间施展“龙牙”都使牧云叠加一层，最多触发3次><TALENT 25354 1 施展“龙牙”，使得自身“破招”提高10%，此效果持续15秒，最多叠加7层><TALENT 24896 1 “任驰骋”调息时间降低6秒施展时获得6层“龙驭”效果，非“骑御”期间每次施展龙牙获得一层“龙驭”效果最多15层，“骑御”期间每次施展龙牙会消耗一层“龙驭”本次龙牙伤害提高30%。>",
            "belong_key": "belong_415"
        },
        "480": {
            "name": "沧月",
            "skills": [
                21251
            ],
            "desc": "击倒当前目标，持续1秒，并击退其周围6尺内最多5个其他的敌对目标，造成<SUB 21251 0>外功伤害并使对其造成大量威胁。成功击倒当前目标后，使自身获得1点战意。<TALENT 14826 1 击退作用目标最高数量提高至7个，每成功击退1个目标，降低自身2秒“守如山”调息时间><TALENT 18233 1 若在马上释放则每0.5秒造成一次击退效果，持续3秒><TALENT 5668 1 造成大量范围伤害，不再击退目标><TALENT 5667 1 成功击倒目标，附带致残效果><TALENT 5692 1 强制周围6尺内的最多5个敌对目标攻击自身><TALENT 5691 1 对当前目标造成大量威胁值><TALENT 18231 1 击退距离提高，每击退1个目标，增加0.5秒“纵轻骑”效果时间，降低0.5秒“沧月”调息时间><TALENT 5696 1 消耗自身战意，每消耗一点战意降低自身“疾”2秒调息时间><TALENT 24899 1 “纵轻骑”期间额外附带一次100%的武器伤害效果><TALENT 30653 1 >",
            "belong_key": "belong_480"
        },
        "418": {
            "name": "突",
            "recipes": [
                "recipe_393_1",
                "recipe_394_1",
                "recipe_395_1",
                "recipe_396_1",
                "recipe_397_1",
                "recipe_398_1",
                "recipe_399_1"
            ],
            "skills": [
                431,
                14882
            ],
            "desc": "使目标眩晕，持续1秒，快速冲向目标，并使自身不受控制招式影响(击退和被拉除外)，持续3秒且回复15%内力，对目标造成<SUB 431 0>外功伤害，并将其击倒1秒，每超过目标8尺将其命中，则击倒时间延长1秒。<TALENT 18228 1 自身将获得“徐如林”效果，使自身外功伤害招式命中敌人后，有50%的几率额外造成一段<SUB 38655 1>伤害并使自身气血与内力在1秒后恢复5%（每1秒最多1次），持续5秒><TALENT 5674 1 施展后将使自身<BUFF 745 2 desc>，持续<BUFF 745 2 time>><TALENT 5675 1 施展后将使自身受到的伤害降低30%，持续8秒><TALENT 5700 1 施展“突”后，自身受到的伤害降低30%，持续8秒，并强迫周围6尺范围的5个敌对目标攻击自身><TALENT 6514 1 变为2层充能，命中目标时使目标获得3秒“破军”效果并回复自身1点“战意”><TALENT 6511 1 调息时间增加37秒，施展后自身获得“牧云”效果><TALENT 40216 1 \"突\"、\"断魂刺\"施展距离提高5尺，距离每超过10尺，额外触发一段伤害最多3段。><TALENT 30653 1 ><TALENT 18602 1 >",
            "belong_key": "belong_418"
        },
        "424": {
            "name": "疾",
            "skills": [
                432
            ],
            "desc": "门派轻功，向前冲刺，并对处于冲刺路径上的最多5名敌人造成<SUB 432 0>外功伤害，并眩晕目标2秒。<TALENT 5685 1 “疾”命中目标降低自身“沧月”5秒调息时间，恢复自身5点战意><TALENT 40266 1 施展\"疾\"后解除自身受控状态（击倒除外）3秒内激活二段招式，该招式不能面向目标释放只能在马下施展，消耗2点战意回转面向并冲刺至35尺内目标身边造成伤害并添加一层“重创”若目标处于击倒状态则延长2秒击倒>",
            "belong_key": "belong_424"
        },
        "423": {
            "name": "灭",
            "recipes": [
                "recipe_363_1",
                "recipe_364_1",
                "recipe_365_1",
                "recipe_366_1",
                "recipe_367_1",
                "recipe_368_1",
                "recipe_369_1",
                "recipe_370_1",
                "recipe_5134_1"
            ],
            "skills": [
                701,
                702
            ],
            "desc": "对自身造成气血最大值3%的外功伤害，对目标造成100%的武器伤害外加<SUB 702 0>外功伤害。若自身气血低于50%，对自身造成的外功伤害降低50%，对目标造成的伤害提高50%。<TALENT 5666 1 每点“战意”增加5%伤害><TALENT 5682 1 不再对自身造成伤害，并回复自身18%气血值><TALENT 6524 1 对气血值低于80%的目标造成100%的额外伤害，施展灭8秒内获得一次额外的施展机会，同时额外附带一段破招伤害。><TALENT 6530 1 施展距离提高到25尺，施展时解除自身锁足减速不利效果并冲向目标，命中后使目标眩晕2秒。命中有自身“流血”效果的目标，每层“流血”额外造成1段<SUB 32909 1>外功伤害><TALENT 6781 1 附带流血和破风效果并使“流血”伤害提高20%，使自身立刻获得3点战意，并每秒回复3%内力和气血，持续3秒><TALENT 2608 2 忽视目标50%外功防御等级，有100%的几率刷新“破风”效果，并对有“致残”效果的目标会心几率提高40%><TALENT 5693 1 命中30%血量以下的目标额外回复5%气血><TALENT 6869 1 成功招架6秒内使用“灭”可获得反击效果><TALENT 18232 1 自身气血每降低20%，“灭”伤害提高5%><TALENT 14824 1 “骑御”期间可以施展“灭”><TALENT 5659 1 施展“灭”后再次施展“龙吟”造成一段额外伤害>",
            "belong_key": "belong_423"
        },
        "427": {
            "name": "战八方",
            "recipes": [
                "recipe_407_1",
                "recipe_408_1",
                "recipe_409_1",
                "recipe_410_1",
                "recipe_411_1",
                "recipe_412_1",
                "recipe_413_1"
            ],
            "skills": [
                14887
            ],
            "desc": "对自身周围6尺内最多5个目标均造成100%的武器伤害外加<SUB 14887 0>外功伤害。<TALENT 18231 1 命中被“沧月”击退的目标，使自身“纵轻骑”持续时间增加1秒><TALENT 5669 1 会心几率提高10%，会心效果提高10%，可以在马下施展><TALENT 14825 1 若只命中单一目标，伤害提高25%且自身获得1点战意><TALENT 14821 1 “流血”作用间隔缩短0.25秒，“战八方”调息时间增加4秒，命中目标附带“流血”“破风”效果><TALENT 5689 1 伤害提高30%，附带额外威胁值><TALENT 42673 1 ><TALENT 42672 1 >",
            "belong_key": "belong_427"
        },
        "428": {
            "name": "断魂刺",
            "recipes": [
                "recipe_340_1",
                "recipe_341_1",
                "recipe_342_1",
                "recipe_343_1",
                "recipe_344_1",
                "recipe_345_1",
                "recipe_346_1"
            ],
            "skills": [
                409
            ],
            "desc": "策马猛冲目标，造成100%的武器伤害外加<SUB 409 0>外功伤害，将其击晕2秒并使自身获得3点战意。骑马时方可施展此招式。<TALENT 18230 1 命中目标后，使目标受到的治疗成效降低50%，持续10秒><TALENT 18228 1 自身将获得“徐如林”效果，使自身外功伤害招式命中敌人后，有50%的几率额外造成一段<SUB 38655 1>外功伤害并使自身气血与内力在1秒后恢复5%（每1秒最多1次），持续5秒><TALENT 40216 1 \"突\"、\"断魂刺\"施展距离提高5尺，距离每超过10尺，额外触发一段伤害最多3段。>",
            "belong_key": "belong_428"
        },
        "2603": {
            "name": "乘龙箭",
            "skills": [
                13778
            ],
            "desc": "运功0.5秒，打断目标运功，对目标造成<SUB 13778 0>外功伤害，并使其<BUFF 3465 0 desc>，持续<BUFF 3465 0 time>，自身将获得一点“战意”，命中超过地面8尺以上的目标会将其击落倒地2秒，马上方可施展。<TALENT 28564 1 运功命中10尺外的目标时，重置自身“断魂刺”和“破坚阵”的招式调息时间,每次骑御状态下只可触发一次><TALENT 18557 1 “乘龙箭”命中有自身“破军”效果的目标，在目标位置生成一个半径6尺持续4秒的“飞鸣镝”区域，区域内最多5个敌对目标每秒会受到<SUB 32979 1>外功伤害。在区域内施展“撼如雷”则会引爆该区域对其中5个敌对目标造成<SUB 32980 1>外功伤害并使目标获得1层“重创”效果>",
            "belong_key": "belong_2603"
        },
        "426": {
            "name": "破坚阵",
            "recipes": [
                "recipe_378_1",
                "recipe_379_1",
                "recipe_380_1",
                "recipe_381_1",
                "recipe_382_1",
                "recipe_383_1",
                "recipe_384_1"
            ],
            "skills": [
                24009
            ],
            "desc": "骑马时方可施展，可在运功中施展，消耗3点战意击倒目标5秒并使目标获得“破军”效果，持续10秒，命中运功目标打断其运功。自身外功招式命中“破军”效果目标会造成<SUB 24009 0>外功伤害。<TALENT 14823 1 可冲刺至15尺内目标身边对其释放，将目标周围8尺范围5个目标击倒并立即造成<SUB 14881 0>外功伤害><TALENT 23997 1 累计5次“破军”伤害则使目标获得8秒“重创”效果：受到的下一次治疗效果无效，最多叠加5层><TALENT 36104 1 命中目标后，10秒内可在马上施展“载干戈·穿云”，获得1点战意并对目标造成200%武器伤害附加外功伤害，移动速度超过50则伤害提升20%。若目标有自身“破军”效果，则使目标获得1层“重创”效果，持续8秒><TALENT 30653 1 ><TALENT 42273 1 >",
            "belong_key": "belong_426"
        },
        "6517": {
            "name": "虎贲",
            "desc": "每累计施展龙牙3次，使下一次龙牙施展时不消耗战意。",
            "belong_key": "belong_6517"
        },
        "30654": {
            "name": "车悬阵",
            "skills": [
                30800,
                30808
            ],
            "desc": "该招式“骑御”状态会替换“龙牙”招式，不受“龙牙”秘籍影响，消耗3点战意。施展后自身向右侧划出枪刃，移动状态下对右侧6尺范围内最多5个敌方目标持续造成100%武器伤害外加<SUB 30800 0>外功伤害，持续4秒，期间可以施展冲刺招式。再次释放或者结束时会对前方8尺范围造成100%武器伤害外加<SUB 30808 0>外功伤害。<TALENT 42670 1 >",
            "belong_key": "belong_30654"
        },
        "15158": {
            "name": "破重围",
            "skills": [
                15163
            ],
            "desc": "纵马疾驰，自身免疫控制、沉默、缴械，受到的伤害降低30%，自身招式施展距离提高2尺，控制目标并连续造成13次共计<SUB 15163 0>外功伤害效果并使目标无法施展轻功，命中击倒中的目标伤害提高50%，骑马时方可施展此招式。",
            "belong_key": "belong_15158"
        },
        "38671": {
            "name": "啸西风",
            "desc": "施展后对50尺距离内随机身上存在“流血”效果的最多3名侠士目标周围召唤战狼对其进行攻击，持续9秒，持续期间内目标受到的疗伤成效降低30%，战狼伤害频率受召唤时的“流血”效果层数影响，层数越高频率越快。",
            "belong_key": "belong_38671"
        },
        "6524": {
            "name": "破楼兰",
            "skills": [
                6525,
                6526
            ],
            "desc": "“灭”对于气血值低于80%的目标造成100%的额外伤害，施展灭8秒内获得一次额外施展的机会，同时额外附带一段破招伤害。",
            "belong_key": "belong_6524"
        },
        "6514": {
            "name": "长征",
            "recipes": [
                "recipe_2309_1"
            ],
            "desc": "“突”变为2层充能，调息时间提高1秒，命中目标时使目标获得3秒“破军”效果并回复自身1点“战意”。",
            "belong_key": "belong_6514"
        },
        "28442": {
            "name": "铁骑",
            "recipes": [
                "recipe_2576_1"
            ],
            "desc": "“任驰骋”不再充能，“纵轻骑”效果持续时间增加5秒，“纵轻骑”效果下自身每造成三次外功伤害会延长一秒“纵轻骑”效果的时间，最多延长4次。",
            "belong_key": "belong_28442"
        },
        "2628": {
            "name": "渊",
            "recipes": [
                "recipe_5468_1",
                "recipe_5469_1",
                "recipe_5470_1",
                "recipe_5471_1"
            ],
            "buffs": [
                2779
            ],
            "desc": "解除自身所有移动限制(击倒和被击僵直除外)，冲刺到友方目标身边，使其3秒内受到的伤害降低20%且由自身承担，并使自身外功基础攻击力提高35%(<SKILLEx {D0} {BasicPhysicsAP 0.35}>点)，持续10秒。",
            "belong_key": "belong_2628"
        },
        "18226": {
            "name": "击水",
            "recipes": [
                "recipe_4961_1"
            ],
            "dots": {
                "12461": [
                    401
                ]
            },
            "skills": [
                36568
            ],
            "desc": "“流血”效果可叠3层，持续效果增加5跳。对有自身三层流血的目标再次添加流血效果，会额外造成<SUB 36568 1>外功伤害。",
            "belong_key": "belong_18226"
        },
        "5673": {
            "name": "飞将",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "skills": [
                20778
            ],
            "desc": "对击倒状态的目标伤害提高35%。",
            "belong_key": "belong_5673"
        },
        "24896": {
            "name": "龙驭",
            "recipes": [
                "recipe_5158_1"
            ],
            "buffs": [
                21638
            ],
            "desc": "“任驰骋”调息时间降低6秒，施展时获得6层“龙驭”效果，非“骑御”期间每次施展龙牙获得一层“龙驭”效果最多25层，“骑御”期间每次施展龙牙会消耗一层“龙驭”本次龙牙伤害提高40%。",
            "belong_key": "belong_24896"
        },
        "37338": {
            "name": "背水一战",
            "desc": "施展“撼如雷”获得12秒“背水一战”效果。\\n背水一战：效果持续期间每2秒对自身造成最大气血值1%的伤害，同时对自身6尺内8名敌对侠士目标额外造成<SUB 37350 1>外功伤害，持续12秒，若命中目标，降低“撼如雷”调息时间1秒且下次伤害增加20%，最多提高100%。",
            "belong_key": "belong_37338"
        },
        "23997": {
            "name": "破军",
            "desc": "累计6次“破军”伤害则使目标获得<NounID 75>",
            "belong_key": "belong_23997"
        },
        "6530": {
            "name": "青阳",
            "recipes": [
                "recipe_1231_1"
            ],
            "skills": [
                32909
            ],
            "desc": "“灭”的施展距离提高到25尺，施展时解除自身锁足减速不利效果并冲向目标，命中后使目标眩晕2秒。命中有自身“流血”效果的目标，每层“流血”额外造成1段<SUB 32909 1>外功伤害。",
            "belong_key": "belong_6530"
        },
        "42310": {
            "name": "执旌",
            "desc": "“纵轻骑”效果持续期间成功击倒目标则给目标添加“执旌”持续10秒，施展“撼如雷”时，若周围50尺内存在2名及以上被自身添加的“执旌”目标，使其3秒内无法施展内外招式。",
            "belong_key": "belong_42310"
        },
        "6511": {
            "name": "牧云",
            "recipes": [
                "recipe_1776_1"
            ],
            "buffs": [
                7671
            ],
            "desc": "“突”的调息时间增加37秒，施展后自身获得“牧云”效果，持续65秒，效果期间施展“龙牙”则叠加一层“牧云”效果，最多作用3次。",
            "belong_key": "belong_6511"
        },
        "32911": {
            "name": "挫锐",
            "skills": [
                36097
            ],
            "desc": "施展“龙吟”后，20秒内下一次施展“穿云”距离增加4尺并会造成3段<SUB 36097 28>外功伤害。",
            "belong_key": "belong_32911"
        },
        "5659": {
            "name": "大漠",
            "skills": [
                37618
            ],
            "desc": "施展“灭”后，使下一个“龙吟”额外造成<SUB 37618 1>外功伤害。",
            "belong_key": "belong_5659"
        },
        "42673": {
            "name": "围魏",
            "recipes": [
                "recipe_6109_1"
            ],
            "desc": "“战八方”作用目标数提高2个，作用范围提高2尺，每命中一个目标，自身获得一层2%最大生命值护盾，持续5秒。",
            "belong_key": "belong_42673"
        },
        "18602": {
            "name": "骁勇",
            "desc": "“突”附带“流血”和“破风”效果，命中拥有破军的目标额外添加一层“流血”。",
            "belong_key": "belong_18602"
        },
        "5669": {
            "name": "出云",
            "recipes": [
                "recipe_2482_1"
            ],
            "desc": "“战八方”会心几率提高10%，会心效果提高10%，可以在马下施展。",
            "belong_key": "belong_5669"
        },
        "24841": {
            "name": "力破万钧",
            "skills": [
                24843
            ],
            "desc": "只能在马下施展，蓄力刺出长枪，蓄力期间自身免疫控制，移动速度降低50%，最多蓄力1.5秒，对面前12尺最多4个目标击退并最多造成<SUB 24843 3>点外功伤害。若将目标击退至障碍上，使得目标击倒，最多3秒。蓄力时间越长，伤害越高，击倒时间越长。对气血值低于80%的目标该招式会心率提高100%，每施展“龙牙”降低该招式4秒调息时间。",
            "belong_key": "belong_24841"
        },
        "14824": {
            "name": "驰骋",
            "desc": "施展“任驰骋”获得的外功基础攻击力效果提高至30%，可以在“骑御”状态施展“灭”。",
            "belong_key": "belong_14824"
        },
        "30653": {
            "name": "振弦",
            "skills": [
                24894
            ],
            "desc": "施展“突”、“沧月”、“破坚阵”成功击倒目标后，会延迟对目标位置发射一波半径6尺的箭雨，对最多5个目标造成<SUB 24894 0>外功伤害，视作“乘龙箭”效果。",
            "belong_key": "belong_30653"
        },
        "6806": {
            "name": "激雷",
            "desc": "施展“撼如雷”后小队成员的外功破防值提高25%，外功基础攻击力提高30%，持续6秒。",
            "belong_key": "belong_6806"
        },
        "5678": {
            "name": "夜征",
            "desc": "“激雷”效果持续期间自身无视目标70%外功防御，效果持续时间提高200%。",
            "belong_key": "belong_5678"
        },
        "42672": {
            "name": "追穷寇",
            "desc": "“战八方”命中有自身“流血”效果的目标每层“流血”使该伤害提高30%。",
            "belong_key": "belong_42672"
        },
        "24899": {
            "name": "破国",
            "recipes": [
                "recipe_3068_1"
            ],
            "desc": "“任驰骋”上马后移动速度提高50%且无需运功，“纵轻骑”效果持续时间提高1秒，期间自身加速值突破上限，提高50%。",
            "belong_key": "belong_24899"
        },
        "18557": {
            "name": "流电",
            "skills": [
                32979,
                32980
            ],
            "desc": "“乘龙箭”命中有自身“破军”效果的目标，在目标位置生成一个半径6尺持续4秒的“飞鸣镝”区域，区域内最多5个敌对目标每秒会受到<SUB 32979 1>外功伤害。在区域内施展“撼如雷”则会引爆该区域对其中5个敌对目标造成<SUB 32980 1>外功伤害并使目标获得1层<NounID 75>。",
            "belong_key": "belong_18557"
        },
        "42670": {
            "name": "戎行",
            "skills": [
                36258
            ],
            "desc": "“车悬阵”持续期间内命中击倒目标额外造成100%武器伤害附加最高<SUB 36258 4>点外功伤害再向前拖行一段距离并结束该技能。<TALENT_CORE 30654 1>",
            "belong_key": "belong_42670"
        },
        "6781": {
            "name": "战心",
            "buffs": [
                26008
            ],
            "desc": "“灭”附带流血和破风效果并使“流血”伤害提高20%，使自身立刻获得3点战意，并每秒回复3%内力和气血，持续3秒。",
            "belong_key": "belong_6781"
        },
        "42671": {
            "name": "徐如林",
            "desc": "“啸如虎”结束后若自身气血值低于10%，回复40%气血值。",
            "belong_key": "belong_42671"
        },
        "15001": {
            "name": "龙血",
            "recipes": [
                "recipe_4894_1"
            ],
            "skills": [
                15002
            ],
            "desc": "“龙牙”施展距离提高4尺，命中有自身“流血”效果的目标额外造成30%伤害。",
            "belong_key": "belong_15001"
        },
        "14821": {
            "name": "牙璋",
            "recipes": [
                "recipe_2365_1",
                "recipe_2498_1"
            ],
            "dots": {
                "19317": [
                    26773
                ]
            },
            "desc": "“流血”作用间隔缩短0.25秒，“战八方”调息时间增加4秒，命中目标附带“流血”“破风”效果。",
            "belong_key": "belong_14821"
        },
        "28564": {
            "name": "易险",
            "desc": "“乘龙箭”命中10尺外的目标时，重置自身“断魂刺”和“破坚阵”的招式调息时间，每次骑御状态下只可触发一次。",
            "belong_key": "belong_28564"
        },
        "42273": {
            "name": "贯颐",
            "recipes": [
                "recipe_6206_1"
            ],
            "skills": [
                42274
            ],
            "desc": "“破坚阵”可基础调息时间中施展，若命中被击倒目标则延长该击倒3秒并造成<SUB 42274 1>伤害。",
            "belong_key": "belong_42273"
        },
        "18487": {
            "name": "守孤城",
            "desc": "“御”持续时间延长4秒，施展后每秒回复3%的气血与内力，持续5秒。",
            "belong_key": "belong_18487"
        },
        "5666": {
            "name": "风虎",
            "buffs": [
                12608
            ],
            "desc": "每点“战意”增加“穿云”“龙吟”“龙牙”“灭”5%伤害。",
            "belong_key": "belong_5666"
        },
        "18233": {
            "name": "千驰",
            "desc": "“沧月”若在马上释放则每0.5秒造成一次击退效果，且对刀气障碍具有额外的伤害，持续3秒。释放期间具有“纵轻骑”效果。",
            "belong_key": "belong_18233"
        },
        "2611": {
            "name": "霹雳",
            "attributes": {
                "physical_damage_base": 203,
                "physical_damage_rand": 21
            },
            "recipes": [
                "recipe_1549_1",
                "recipe_1550_1",
                "recipe_1551_1",
                "recipe_1552_1",
                "recipe_1553_1",
                "recipe_1554_1",
                "recipe_1555_1",
                "recipe_1556_1",
                "recipe_5148_1"
            ],
            "skills": [
                2611
            ],
            "desc": "对目标及其附近额外的3个目标造成200%武器伤害并附加<SKILL PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP}>)外功伤害，使目标<BUFF 2774 0 desc>，持续12秒，并附带“流血”“破风”效果。若玩家目标身上存在护盾，则基于自身最大生命值的40%击碎其护盾值，再造成外功伤害。<TALENT 2610 1 伤害提高2%><TALENT 2610 2 伤害提高4%><TALENT 2610 3 伤害提高6%>",
            "belong_key": "belong_2611"
        }
    },
    "10062": {
        "10062": {
            "name": "铁牢律",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 6522,
                "vitality_to_max_life": 2253,
                "max_life_gain": 245,
                "vitality_to_physical_attack_power": 41
            },
            "recipes": [
                "recipe_1110_2",
                "recipe_1240_1",
                "recipe_4039_3",
                "recipe_1771_1",
                "recipe_1772_1",
                "recipe_1773_1",
                "recipe_1774_1",
                "recipe_4892_1",
                "recipe_1775_1",
                "recipe_1711_1"
            ],
            "buffs": [
                17885,
                29938
            ],
            "skills": [
                12,
                32820,
                25795
            ],
            "desc": "习之者周身罡气护体，若有铁甲，牢不可破，故名铁牢律。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10062"
        },
        "404": {
            "name": "撼如雷",
            "buffs": [
                6363
            ],
            "desc": "使周围队友<BUFF 362 0 desc>，持续<BUFF 362 0 time>，使自身获得“激雷”效果，“激雷”效果持续期间外功会心提高30%，持续6秒。<TALENT 5678 1 效果持续期间自身无视目标70%外功防御，效果持续时间提高200%><TALENT 14800 1 调息时间降低5秒，施展后强制半径10尺内最多5个目标攻击自身，持续4秒><TALENT 6806 1 施展后小队成员的外功破防值提高20%，外功基础攻击力提高20%，持续6秒><TALENT 2600 2 效果提高50%><TALENT 37338 1 施展后获得12秒“背水一战”效果。背水一战：每2秒对自身造成最大气血值2%的伤害，同时对自身6尺内2名敌对侠士目标额外造成<SUB 37350 1>外功伤害，持续12秒，若命中目标，则下次伤害增加20%，最多提高100%><TALENT 42310 1 >",
            "belong_key": "belong_404"
        },
        "433": {
            "name": "任驰骋",
            "buffs": [
                6121
            ],
            "desc": "2层充能技能，使自身可在战斗中上马，重置自身“断魂刺”“破坚阵”“沧月”招式调息时间解除自身锁足效果，成功上马后获得5秒“纵轻骑”效果，不受下马效果影响、自身免疫控制以及任何位移招式影响，自身外功基础攻击力提高15%，不消耗坐骑饱食度，持续15秒。<TALENT 18229 1 招式无需运功，且“纵轻骑”效果持续时间提高1秒><TALENT 2607 2 调息时间降低20秒，成功上马后5秒内不受任何招式控制，并且不会被击下马><TALENT 6515 1 下马后若“任驰骋”还在调息中，则立即降低15秒调息时间，该效果每1分钟触发1次><TALENT 5676 1 “任驰骋”上马后移动速度提高50%，“纵轻骑”效果持续过程中将不受任何位移招式影响><TALENT 14824 1 获得的外功基础攻击力效果提高至30%，可以在“骑御”状态施展“灭”><TALENT 24899 1 “任驰骋”上马后移动速度提高50%且无需运功，“纵轻骑”效果持续时间提高1秒，期间自身加速值突破上限，提高50%><TALENT 28442 1 不再充能，“纵轻骑”效果持续时间增加5秒，“纵轻骑”效果下自身每造成三次外功伤害会延长一秒“纵轻骑”效果的时间，最多延长4次><TALENT 24901 1 施展“任驰骋”后10秒内可以对右后方8尺以内倒地状态的敌方目标施展二段招式，维持其倒地状态，自身和目标一起向前冲刺并对其造成100%武器伤害附加最高<SUB 36258 4>外功伤害，自身速度越快，冲刺距离越远伤害越高><TALENT 24896 1 “任驰骋”调息时间降低6秒，施展时获得6层“龙驭”效果，非“骑御”期间每次施展龙牙获得一层“龙驭”效果最多25层，“骑御”期间每次施展龙牙会消耗一层“龙驭”本次龙牙伤害提高30%>",
            "belong_key": "belong_433"
        },
        "403": {
            "name": "龙吟",
            "recipes": [
                "recipe_1557_1",
                "recipe_1558_1",
                "recipe_1559_1",
                "recipe_1560_1",
                "recipe_1561_1",
                "recipe_1562_1",
                "recipe_1563_1",
                "recipe_1564_1"
            ],
            "dots": {
                "3442": [
                    18591
                ]
            },
            "skills": [
                18603
            ],
            "desc": "对目标造成100%的武器伤害外加<SUB 18603 0>点外功伤害并使自身获得2点战意，使目标同时附带“流血”和“破风”效果，“流血”使目标<BUFF 3442 0 desc>(+<SKILLEx {D0} {TotalPhysicsAP 0.69457}>)且可叠加2层，“破风”使目标<BUFF 661 0 desc>，持续<BUFF 3442 0 time>。<TALENT 18226 1 “流血”效果可叠3层，持续效果增加5跳。对有自身三层流血的目标再次添加流血效果，会额外造成<SUB 36568 1>外功伤害><TALENT 14821 1 “流血”作用间隔缩短0.25秒><TALENT 18605 1 命中具有自身“流血”效果的目标增加30%伤害><TALENT 6523 1 可使目标8尺范围内额外5个目标受到“流血”效果影响，且流血伤害提高15%><TALENT 18224 1 对目标周围8尺内最多5个目标造成外功伤害且移动速度降低60%，持续12秒><TALENT 5681 1 “龙吟”威胁值提高20%，调息时间降低2秒><TALENT 5662 1 伤害提高10%，目标移动速度降低50%，持续8秒><TALENT 6527 1 使自身立刻获得3点战意><TALENT 5696 1 附带额外威胁值><TALENT 2610 1 伤害提高2%><TALENT 2610 2 伤害提高4%><TALENT 2610 3 伤害提高6%><TALENT 5666 1 每点“战意”增加5%伤害><TALENT 24899 1 “纵轻骑”期间额外附带一次100%的武器伤害效果><TALENT 5659 1 施展“灭”后，使下一个“龙吟”额外造成<SUB 37618 1>外功伤害><TALENT 32911 1 施展“龙吟”后，20秒内下一次施展“穿云”距离增加4尺并会造成3段<SUB 36097 28>外功伤害><TALENT 18872 1 >",
            "belong_key": "belong_403"
        },
        "400": {
            "name": "穿云",
            "recipes": [
                "recipe_333_1",
                "recipe_334_1",
                "recipe_335_1",
                "recipe_336_1",
                "recipe_337_1",
                "recipe_338_1",
                "recipe_339_1"
            ],
            "skills": [
                18207,
                18208
            ],
            "desc": "对目标造成100%的武器伤害外加<SUB 18207 0>外功伤害，并使自身获得1点战意。<TALENT 21942 1 命中没有自身“流血”或“流血”没有叠加至最高层数的目标则同时附带“流血”“破风”效果><TALENT 18605 1 命中具有自身“流血”效果的目标增加30%伤害><TALENT 5657 1 会心几率提高10%，会心效果提高10%><TALENT 5666 1 每点“战意”增加5%伤害><TALENT 5699 1 威胁值提高20%><TALENT 2602 2 调息时间降低0.5秒><TALENT 2610 1 伤害提高2%><TALENT 2610 2 伤害提高4%><TALENT 2610 3 伤害提高6%><TALENT 24899 1 “纵轻骑”期间额外附带一次100%的武器伤害效果><TALENT 32911 1 施展“龙吟”后，20秒内下一次施展“穿云”距离增加4尺并造成3段<SUB 36097 28>外功伤害>",
            "belong_key": "belong_400"
        },
        "415": {
            "name": "龙牙",
            "recipes": [
                "recipe_355_1",
                "recipe_356_1",
                "recipe_357_1",
                "recipe_358_1",
                "recipe_359_1",
                "recipe_360_1",
                "recipe_361_1",
                "recipe_362_1"
            ],
            "skills": [
                18773
            ],
            "desc": "消耗3点战意，对目标造成100%的武器伤害外加<SUB 18773 0>点外功伤害和一段破招伤害。<TALENT 15001 1 施展距离提高4尺，命中有自身“流血”效果的目标额外造成30%伤害><TALENT 5666 1 每点“战意”增加5%伤害><TALENT 6517 1 每累计施展龙牙3次，使下一次龙牙施展时不消耗战意><TALENT 5658 1 命中目标后，对目标周围6尺的5个目标造成外功伤害><TALENT 5660 1 会心几率提高10%，会心效果提高10%><TALENT 5652 1 命中后刷新目标身上的“破风”效果><TALENT 2610 2 伤害提高4%><TALENT 6512 1 施展后有35%几率刷新“龙吟”的调息时间><TALENT 5688 1 使目标造成的伤害降低10%，持续6秒><TALENT 6869 1 反击效果期间每次使用“龙牙”都使目标外功防御降低10%，最多叠加3层，持续20秒><TALENT 6511 1 牧云效果期间施展“龙牙”都使牧云叠加一层，最多触发3次><TALENT 25354 1 施展“龙牙”，使得自身“破招”提高10%，此效果持续15秒，最多叠加7层><TALENT 24896 1 “任驰骋”调息时间降低6秒施展时获得6层“龙驭”效果，非“骑御”期间每次施展龙牙获得一层“龙驭”效果最多15层，“骑御”期间每次施展龙牙会消耗一层“龙驭”本次龙牙伤害提高30%。>",
            "belong_key": "belong_415"
        },
        "480": {
            "name": "沧月",
            "skills": [
                21251
            ],
            "desc": "击倒当前目标，持续1秒，并击退其周围6尺内最多5个其他的敌对目标，造成<SUB 21251 0>外功伤害并使对其造成大量威胁。成功击倒当前目标后，使自身获得1点战意。<TALENT 14826 1 击退作用目标最高数量提高至7个，每成功击退1个目标，降低自身2秒“守如山”调息时间><TALENT 18233 1 若在马上释放则每0.5秒造成一次击退效果，持续3秒><TALENT 5668 1 造成大量范围伤害，不再击退目标><TALENT 5667 1 成功击倒目标，附带致残效果><TALENT 5692 1 强制周围6尺内的最多5个敌对目标攻击自身><TALENT 5691 1 对当前目标造成大量威胁值><TALENT 18231 1 击退距离提高，每击退1个目标，增加0.5秒“纵轻骑”效果时间，降低0.5秒“沧月”调息时间><TALENT 5696 1 消耗自身战意，每消耗一点战意降低自身“疾”2秒调息时间><TALENT 24899 1 “纵轻骑”期间额外附带一次100%的武器伤害效果><TALENT 30653 1 >",
            "belong_key": "belong_480"
        },
        "418": {
            "name": "突",
            "recipes": [
                "recipe_393_1",
                "recipe_394_1",
                "recipe_395_1",
                "recipe_396_1",
                "recipe_397_1",
                "recipe_398_1",
                "recipe_399_1"
            ],
            "skills": [
                431,
                14882
            ],
            "desc": "使目标眩晕，持续1秒，快速冲向目标，并使自身不受控制招式影响(击退和被拉除外)，持续3秒且回复15%内力，对目标造成<SUB 431 0>外功伤害，并将其击倒1秒，每超过目标8尺将其命中，则击倒时间延长1秒。<TALENT 18228 1 自身将获得“徐如林”效果，使自身外功伤害招式命中敌人后，有50%的几率额外造成一段<SUB 38655 1>伤害并使自身气血与内力在1秒后恢复5%（每1秒最多1次），持续5秒><TALENT 5674 1 施展后将使自身<BUFF 745 2 desc>，持续<BUFF 745 2 time>><TALENT 5675 1 施展后将使自身受到的伤害降低30%，持续8秒><TALENT 5700 1 施展“突”后，自身受到的伤害降低30%，持续8秒，并强迫周围6尺范围的5个敌对目标攻击自身><TALENT 6514 1 变为2层充能，命中目标时使目标获得3秒“破军”效果并回复自身1点“战意”><TALENT 6511 1 调息时间增加37秒，施展后自身获得“牧云”效果><TALENT 40216 1 \"突\"、\"断魂刺\"施展距离提高5尺，距离每超过10尺，额外触发一段伤害最多3段。><TALENT 30653 1 ><TALENT 18602 1 >",
            "belong_key": "belong_418"
        },
        "424": {
            "name": "疾",
            "skills": [
                432
            ],
            "desc": "门派轻功，向前冲刺，并对处于冲刺路径上的最多5名敌人造成<SUB 432 0>外功伤害，并眩晕目标2秒。<TALENT 5685 1 “疾”命中目标降低自身“沧月”5秒调息时间，恢复自身5点战意><TALENT 40266 1 施展\"疾\"后解除自身受控状态（击倒除外）3秒内激活二段招式，该招式不能面向目标释放只能在马下施展，消耗2点战意回转面向并冲刺至35尺内目标身边造成伤害并添加一层“重创”若目标处于击倒状态则延长2秒击倒>",
            "belong_key": "belong_424"
        },
        "423": {
            "name": "灭",
            "recipes": [
                "recipe_363_1",
                "recipe_364_1",
                "recipe_365_1",
                "recipe_366_1",
                "recipe_367_1",
                "recipe_368_1",
                "recipe_369_1",
                "recipe_370_1",
                "recipe_5134_1"
            ],
            "skills": [
                701,
                702
            ],
            "desc": "对自身造成气血最大值3%的外功伤害，对目标造成100%的武器伤害外加<SUB 702 0>外功伤害。若自身气血低于50%，对自身造成的外功伤害降低50%，对目标造成的伤害提高50%。<TALENT 5666 1 每点“战意”增加5%伤害><TALENT 5682 1 不再对自身造成伤害，并回复自身18%气血值><TALENT 6524 1 对气血值低于80%的目标造成100%的额外伤害，施展灭8秒内获得一次额外的施展机会，同时额外附带一段破招伤害。><TALENT 6530 1 施展距离提高到25尺，施展时解除自身锁足减速不利效果并冲向目标，命中后使目标眩晕2秒。命中有自身“流血”效果的目标，每层“流血”额外造成1段<SUB 32909 1>外功伤害><TALENT 6781 1 附带流血和破风效果并使“流血”伤害提高20%，使自身立刻获得3点战意，并每秒回复3%内力和气血，持续3秒><TALENT 2608 2 忽视目标50%外功防御等级，有100%的几率刷新“破风”效果，并对有“致残”效果的目标会心几率提高40%><TALENT 5693 1 命中30%血量以下的目标额外回复5%气血><TALENT 6869 1 成功招架6秒内使用“灭”可获得反击效果><TALENT 18232 1 自身气血每降低20%，“灭”伤害提高5%><TALENT 14824 1 “骑御”期间可以施展“灭”><TALENT 5659 1 施展“灭”后再次施展“龙吟”造成一段额外伤害>",
            "belong_key": "belong_423"
        },
        "427": {
            "name": "战八方",
            "recipes": [
                "recipe_407_1",
                "recipe_408_1",
                "recipe_409_1",
                "recipe_410_1",
                "recipe_411_1",
                "recipe_412_1",
                "recipe_413_1"
            ],
            "skills": [
                14887
            ],
            "desc": "对自身周围6尺内最多5个目标均造成100%的武器伤害外加<SUB 14887 0>外功伤害。<TALENT 18231 1 命中被“沧月”击退的目标，使自身“纵轻骑”持续时间增加1秒><TALENT 5669 1 会心几率提高10%，会心效果提高10%，可以在马下施展><TALENT 14825 1 若只命中单一目标，伤害提高25%且自身获得1点战意><TALENT 14821 1 “流血”作用间隔缩短0.25秒，“战八方”调息时间增加4秒，命中目标附带“流血”“破风”效果><TALENT 5689 1 伤害提高30%，附带额外威胁值><TALENT 42673 1 ><TALENT 42672 1 >",
            "belong_key": "belong_427"
        },
        "428": {
            "name": "断魂刺",
            "recipes": [
                "recipe_340_1",
                "recipe_341_1",
                "recipe_342_1",
                "recipe_343_1",
                "recipe_344_1",
                "recipe_345_1",
                "recipe_346_1"
            ],
            "skills": [
                409
            ],
            "desc": "策马猛冲目标，造成100%的武器伤害外加<SUB 409 0>外功伤害，将其击晕2秒并使自身获得3点战意。骑马时方可施展此招式。<TALENT 18230 1 命中目标后，使目标受到的治疗成效降低50%，持续10秒><TALENT 18228 1 自身将获得“徐如林”效果，使自身外功伤害招式命中敌人后，有50%的几率额外造成一段<SUB 38655 1>外功伤害并使自身气血与内力在1秒后恢复5%（每1秒最多1次），持续5秒><TALENT 40216 1 \"突\"、\"断魂刺\"施展距离提高5尺，距离每超过10尺，额外触发一段伤害最多3段。>",
            "belong_key": "belong_428"
        },
        "2603": {
            "name": "乘龙箭",
            "skills": [
                13778
            ],
            "desc": "运功0.5秒，打断目标运功，对目标造成<SUB 13778 0>外功伤害，并使其<BUFF 3465 0 desc>，持续<BUFF 3465 0 time>，自身将获得一点“战意”，命中超过地面8尺以上的目标会将其击落倒地2秒，马上方可施展。<TALENT 28564 1 运功命中10尺外的目标时，重置自身“断魂刺”和“破坚阵”的招式调息时间,每次骑御状态下只可触发一次><TALENT 18557 1 “乘龙箭”命中有自身“破军”效果的目标，在目标位置生成一个半径6尺持续4秒的“飞鸣镝”区域，区域内最多5个敌对目标每秒会受到<SUB 32979 1>外功伤害。在区域内施展“撼如雷”则会引爆该区域对其中5个敌对目标造成<SUB 32980 1>外功伤害并使目标获得1层“重创”效果>",
            "belong_key": "belong_2603"
        },
        "426": {
            "name": "破坚阵",
            "recipes": [
                "recipe_378_1",
                "recipe_379_1",
                "recipe_380_1",
                "recipe_381_1",
                "recipe_382_1",
                "recipe_383_1",
                "recipe_384_1"
            ],
            "skills": [
                24009
            ],
            "desc": "骑马时方可施展，可在运功中施展，消耗3点战意击倒目标5秒并使目标获得“破军”效果，持续10秒，命中运功目标打断其运功。自身外功招式命中“破军”效果目标会造成<SUB 24009 0>外功伤害。<TALENT 14823 1 可冲刺至15尺内目标身边对其释放，将目标周围8尺范围5个目标击倒并立即造成<SUB 14881 0>外功伤害><TALENT 23997 1 累计5次“破军”伤害则使目标获得8秒“重创”效果：受到的下一次治疗效果无效，最多叠加5层><TALENT 36104 1 命中目标后，10秒内可在马上施展“载干戈·穿云”，获得1点战意并对目标造成200%武器伤害附加外功伤害，移动速度超过50则伤害提升20%。若目标有自身“破军”效果，则使目标获得1层“重创”效果，持续8秒><TALENT 30653 1 ><TALENT 42273 1 >",
            "belong_key": "belong_426"
        },
        "14804": {
            "name": "温邑",
            "desc": "自身气血值每降低10%，“守如山”减伤效果持续时间增加1秒。",
            "belong_key": "belong_14804"
        },
        "14826": {
            "name": "戈矛",
            "recipes": [
                "recipe_5135_1"
            ],
            "desc": "“沧月”击退作用目标最高数量提高至7个，每成功击退1个目标，降低自身2秒“守如山”调息时间。",
            "belong_key": "belong_14826"
        },
        "15115": {
            "name": "号令三军",
            "desc": "一鼓，自身每2820点基础体质使团队成员无双等级提高715点，最多100层，持续30秒；二鼓，团队成员的无双提高层数衰减一半，持续30秒；三鼓，团队成员受到的所有伤害提高10%，持续至战斗结束，该招式每场战斗只能施展一次。<TALENT 42574 1 >",
            "belong_key": "belong_15115"
        },
        "14805": {
            "name": "在握",
            "recipes": [
                "recipe_2578_1"
            ],
            "desc": "“疾如风”调息时间降低7秒，施展后10秒内自身受到技能伤害被会心几率降低30%。",
            "belong_key": "belong_14805"
        },
        "14822": {
            "name": "于役",
            "desc": "“啸如虎”可在受控状态下施展，效果期间受到会心攻击恢复自身5%气血值，最多作用5次。",
            "belong_key": "belong_14822"
        },
        "14802": {
            "name": "至武",
            "desc": "受到伤害未重伤状态下自身气血值低于35%，立刻重置“守如山”调息时间，该效果每90秒最多出现一次。",
            "belong_key": "belong_14802"
        },
        "24902": {
            "name": "辅国",
            "recipes": [
                "recipe_5161_1"
            ],
            "desc": "施展“啸如虎”不再有气血值限制，期间自身受到伤害将会在“啸如虎”气劲结束之后使得自身获得可以化解等量伤害的吸收盾，最大为自身3倍的最大气血值，持续10秒。",
            "belong_key": "belong_24902"
        },
        "6781": {
            "name": "战心",
            "buffs": [
                26008
            ],
            "desc": "“灭”附带流血和破风效果并使“流血”伤害提高20%，使自身立刻获得3点战意，并每秒回复3%内力和气血，持续3秒。",
            "belong_key": "belong_6781"
        },
        "14799": {
            "name": "反岳",
            "desc": "“御”成功抵挡一次伤害则会降低2秒“守如山”调息时间。",
            "belong_key": "belong_14799"
        },
        "14800": {
            "name": "烈雷",
            "recipes": [
                "recipe_2311_1"
            ],
            "desc": "“撼如雷”调息时间降低5秒，施展后强制半径10尺内最多5个目标攻击自身，持续4秒。",
            "belong_key": "belong_14800"
        },
        "18239": {
            "name": "昂如岳",
            "desc": "“御”施展后恢复自身10%气血值并使自身基础气血值上限提高20%，持续10秒。",
            "belong_key": "belong_18239"
        },
        "5694": {
            "name": "坚城",
            "recipes": [
                "recipe_1244_1"
            ],
            "desc": "“守如山”调息时间降低55秒，减伤效果变为50%，在“守如山”效果期间受到“定身”、“眩晕”、“击倒”控制效果缩短30%，持续时间额外增加5秒。",
            "belong_key": "belong_5694"
        },
        "42574": {
            "name": "破阵乐",
            "desc": "将“号令三军”替换为“破阵乐”，持续运功20秒，运功期间免疫负面效果（除伤害外），每秒使周围团队成员获得“破阵势”气劲持续3秒，若存在该气劲则延长3秒。<TALENT_CORE 15115 1>",
            "belong_key": "belong_42574"
        },
        "6514": {
            "name": "长征",
            "recipes": [
                "recipe_2309_1"
            ],
            "desc": "“突”变为2层充能，调息时间提高1秒，命中目标时使目标获得3秒“破军”效果并回复自身1点“战意”。",
            "belong_key": "belong_6514"
        },
        "25354": {
            "name": "崩决",
            "buffs": [
                18222
            ],
            "desc": "施展“龙牙”，使得自身“破招”提高10%，此效果持续15秒，最多叠加7层。",
            "belong_key": "belong_25354"
        },
        "2628": {
            "name": "渊",
            "recipes": [
                "recipe_5468_1",
                "recipe_5469_1",
                "recipe_5470_1",
                "recipe_5471_1"
            ],
            "buffs": [
                2779
            ],
            "desc": "解除自身所有移动限制(击倒和被击僵直除外)，冲刺到友方目标身边，使其3秒内受到的伤害降低20%且由自身承担，并使自身外功基础攻击力提高35%(<SKILLEx {D0} {BasicPhysicsAP 0.35}>点)，持续10秒。",
            "belong_key": "belong_2628"
        },
        "14827": {
            "name": "载戎",
            "desc": "“御”每成功抵御一次伤害，调息时间降低2秒。",
            "belong_key": "belong_14827"
        },
        "18487": {
            "name": "守孤城",
            "desc": "“御”持续时间延长4秒，施展后每秒回复3%的气血与内力，持续5秒。",
            "belong_key": "belong_18487"
        },
        "5700": {
            "name": "傲骨",
            "desc": "施展“突”后，自身受到的伤害降低30%，持续8秒，并强迫周围6尺范围的5个敌对目标攻击自身。",
            "belong_key": "belong_5700"
        },
        "24895": {
            "name": "疾雨",
            "skills": [
                24894
            ],
            "desc": "“乘龙箭”每0.8秒朝目标区域发射箭雨，持续2.4秒。每波箭雨延迟0.8秒后对目标6尺范围最多5个目标造成<SUB 24894 0>外功伤害，每波箭雨范围内有3个及以上敌方目标会降低“乘龙箭”8秒调息时间。",
            "belong_key": "belong_24895"
        },
        "5696": {
            "name": "狮心",
            "recipes": [
                "recipe_1322_1"
            ],
            "desc": "施展“沧月”将消耗自身战意，每消耗一点战意降低自身“疾”2秒调息时间。",
            "belong_key": "belong_5696"
        },
        "5701": {
            "name": "旗渊",
            "desc": "气血值低于50%时，被攻击使自身御劲率提高8%，持续8秒。",
            "belong_key": "belong_5701"
        },
        "5697": {
            "name": "将威",
            "recipes": [
                "recipe_1112_2"
            ],
            "desc": "“啸如虎”期间被疗伤成效额外提高30%，持续期间每2秒进行一次“虎震”使周围6尺内5个目标眩晕1.5秒。",
            "belong_key": "belong_5697"
        },
        "18238": {
            "name": "掠如火",
            "desc": "施展“疾如风”后自身威胁值提高75%，团队成员获得无威胁气劲，持续8秒。",
            "belong_key": "belong_18238"
        },
        "5669": {
            "name": "出云",
            "recipes": [
                "recipe_2482_1"
            ],
            "desc": "“战八方”会心几率提高10%，会心效果提高10%，可以在马下施展。",
            "belong_key": "belong_5669"
        },
        "18872": {
            "name": "劲风",
            "desc": "“龙吟”附带的“破风”效果提高33%，并使目标造成的伤害降低10%。",
            "belong_key": "belong_18872"
        },
        "5681": {
            "name": "留侯",
            "recipes": [
                "recipe_1111_1"
            ],
            "desc": "“龙吟”威胁值提高20%，调息时间降低4秒。",
            "belong_key": "belong_5681"
        },
        "18233": {
            "name": "千驰",
            "desc": "“沧月”若在马上释放则每0.5秒造成一次击退效果，且对刀气障碍具有额外的伤害，持续3秒。释放期间具有“纵轻骑”效果。",
            "belong_key": "belong_18233"
        },
        "18602": {
            "name": "骁勇",
            "desc": "“突”附带“流血”和“破风”效果，命中拥有破军的目标额外添加一层“流血”。",
            "belong_key": "belong_18602"
        },
        "5658": {
            "name": "龙啸",
            "desc": "“龙牙”命中目标后，对目标周围6尺的5个目标造成外功伤害。该伤害不受到“龙牙”秘籍的影响。",
            "belong_key": "belong_5658"
        },
        "5659": {
            "name": "大漠",
            "skills": [
                37618
            ],
            "desc": "施展“灭”后，使下一个“龙吟”额外造成<SUB 37618 1>外功伤害。",
            "belong_key": "belong_5659"
        },
        "402": {
            "name": "定军",
            "attributes": {
                "physical_attack_power_gain": -1024,
                "physical_damage_base": 20,
                "physical_damage_rand": 5
            },
            "skills": [
                402
            ],
            "desc": "对敌人造成<SKILL PhysicsDamage>点(+<SKILLEx {D0+D1} {SkillPhysicsAP},{BasicPhysicsAP -0.1}>)外功伤害，并强迫其对你发起攻击。<TALENT 2623 1 成功招架后有15%几率重置调息时间><TALENT 5666 1 每点“战意\"增加5%伤害><TALENT 2623 2 成功招架后有30%几率重置调息时间><TALENT 5698 1 成功招架后有50%几率重置调息时间><TALENT 2626 1 调息时间降低1秒，招式有效距离提高2尺，伤害提高50%><TALENT 2626 2 调息时间降低2秒，招式有效距离提高4尺，伤害提高100%>",
            "belong_key": "belong_402"
        },
        "18226": {
            "name": "击水",
            "recipes": [
                "recipe_4961_1"
            ],
            "dots": {
                "12461": [
                    401
                ]
            },
            "skills": [
                36568
            ],
            "desc": "“流血”效果可叠3层，持续效果增加5跳。对有自身三层流血的目标再次添加流血效果，会额外造成<SUB 36568 1>外功伤害。",
            "belong_key": "belong_18226"
        },
        "5682": {
            "name": "仗剑",
            "desc": "“灭”不再对自身造成伤害，并回复自身18%气血值。",
            "belong_key": "belong_5682"
        },
        "5695": {
            "name": "望西京",
            "attributes": {
                "max_life_gain": 102
            },
            "desc": "基础气血和内力上限提高10%。",
            "belong_key": "belong_5695"
        },
        "482": {
            "name": "崩",
            "skills": [
                483
            ],
            "desc": "对运功状态的目标造成<SUB 483 0>外功伤害，并使其晕眩且加速率降低30%，持续5秒。",
            "belong_key": "belong_482"
        },
        "5686": {
            "name": "雷心",
            "desc": "受到攻击若气血值低于40%，每秒回复3%气血最大值，自身气血值高于40%后该效果消失。",
            "belong_key": "belong_5686"
        },
        "5702": {
            "name": "踏北邙",
            "desc": "受到攻击后若气血值低于40%，则自身被疗伤成效提高20%，受到所有伤害降低20%，当气血值高于40%时该效果消失。",
            "belong_key": "belong_5702"
        },
        "40300": {
            "name": "振甲",
            "desc": "“乘龙箭”命中具有“破军”的目标额外造成一次破招伤害。",
            "belong_key": "belong_40300"
        },
        "6518": {
            "name": "岳峙",
            "desc": "施展“守如山”后，立刻强制周围8尺内的5个敌人攻击自身，每3秒再次强制攻击自身。",
            "belong_key": "belong_6518"
        }
    },
    "10081": {
        "537": {
            "name": "名动四方",
            "recipes": [
                "recipe_5896_1"
            ],
            "buffs": [
                409
            ],
            "desc": "使自身进入剑舞状态，“剑舞”最多可获得5点，非战斗状态下每5秒获得1点。“剑舞”状态下提高自身15%阴性基础攻击力和30%基础疗伤成效，每秒回复2%内力。<TALENT 2710 1 效果提高25%><TALENT 2710 2 效果提高50%><TALENT 2718 1 “剑舞”状态下每秒恢复自身0.05%内力值><TALENT 2718 2 “剑舞”状态下每秒恢复自身0.1%内力值><TALENT 18210 1 施展“名动四方”后，可施展二段技能“雨霖铃”><TALENT 23935 1 施展“名动四方”后，可施展二段技能“广陵月”><TALENT 5882 1 “剑舞”状态下自身受到的伤害降低10%，移动速度增加10%>",
            "belong_key": "belong_537"
        },
        "568": {
            "name": "繁音急节",
            "recipes": [
                "recipe_169_1",
                "recipe_170_1",
                "recipe_171_1",
                "recipe_174_1",
                "recipe_175_1",
                "recipe_2418_1"
            ],
            "buffs": [
                538,
                10240
            ],
            "desc": "立即获得2点剑舞，使自身<BUFF 538 4 desc>(<SKILLEx {D0} {BasicLunarAP 0.45}>点)(<SKILLEx {D0} {BasicTherapyAP 0.45}>点)，持续20秒，并获得“雾雨”效果，使自身不受缴械和无法运功效果的影响，运功不会被打断，外功闪避几率提高55%，持续5秒，“云裳心经”心法下额外免疫<NounID 15>效果。<TALENT 14710 1 施展后获得的内功攻击力和疗伤成效效果提高至45%><TALENT 5859 1 “繁音急节”施展后，使自身每秒回复2%自身气血值最大值><EnchantID 10078 施展“繁音急节”，小队所有成员均获得增益效果。><TALENT 14715 1 “繁音急节”变为2层充能技能，50秒充能时间><TALENT 15745 1 “繁音急节”施展后，“雾雨”效果时间延长5秒><TALENT 18198 1 施展“繁音急节”，立刻使自身剑舞达到当前剑舞的最高层，招式不消耗剑舞，持续6秒><TALENT 24981 1 调息时间降低8秒，且“雾雨”持续期间免疫被击僵直效果>",
            "belong_key": "belong_568"
        },
        "542": {
            "name": "冰心",
            "dots": {
                "18512": [
                    25757
                ]
            },
            "desc": "基础气血提高24%\\n外功防御等级提高2850点\\n内功防御等级提高2850点\\n外功防御等级提高1721点\\n内功防御等级提高2191点\\n化劲率提高10%\\n内力最大值提高496472点\\n阴性内功攻击提高7387点\\n每点根骨额外提高2点阴性内功攻击，0.29点阴性内功会心等级\\n每点体质额外提高1.5点内力最大值\\n对非侠士目标造成的伤害提高11%",
            "belong_key": "belong_542"
        },
        "2707": {
            "name": "玳弦急曲",
            "recipes": [
                "recipe_1637_1",
                "recipe_1638_1",
                "recipe_1639_1",
                "recipe_1640_1",
                "recipe_1641_1",
                "recipe_1642_1",
                "recipe_1643_1",
                "recipe_1644_1"
            ],
            "dots": {
                "2920": [
                    3009,
                    6207,
                    18716
                ]
            },
            "skills": [
                6234,
                32889
            ],
            "desc": "持续运功2.81秒对目标造成3次<SUB 6234 0>阴性内功伤害并附带破招伤害。使目标移动速度降低50%，持续1.5秒，完整运功后使目标获得“急曲”不利效果：使目标<BUFF 2920 0 desc>(+<SKILLEx {D0} {TotalLunarAP 0.21}>)，持续<BUFF 2920 0 time>，最多可叠加6层。若存在剑舞点数则消耗1点剑舞使本次“玳弦急曲”可移动运功，运功时间与每跳间隔时间减少40%。<TALENT 5849 1 会心提高10%，会心效果提高10%><TALENT 5852 1 每0.75秒造成一次伤害，每跳附带45%额外伤害，不再附带“急曲”效果，持续2.25秒><TALENT 5854 1 立即造成<SUB 18814 1>伤害，运功不被打退，对目标周围8尺内的额外5个目标造成伤害><TALENT 18907 1 “玳弦急曲”无视目标20%内功防御等级，命中带有“急曲”效果的目标，有一定几率额外造成<SUB 18908 28>伤害><TALENT 14705 1 “玳弦急曲”消耗全部剑舞点数，每次命中额外造成一次破招伤害，每消耗1点剑舞会增加一跳伤害><EnchantID 10077 “急曲”伤害效果可以叠加至4层><TALENT 22732 1 连续使用3次不同的“猿公剑法”套路招式或“江海凝光”命中目标，将对目标额外造成<SUB 30532 1>阴性内功伤害和一段破招伤害，并附带一层“急曲”效果><TALENT 24995 1 “玳弦急曲”每跳使当前目标获得1层“急曲”效果，若命中满层“急曲”效果的目标则本次伤害提高20%><TALENT 42549 1 需要核心奇穴【梦鲤】“玳弦急曲”命中锦鲤池区域内的目标时，每跳使锦鲤额外攻击一次，该攻击只作用于施展“玳弦急曲”时选择的目标><TALENT 42512 1 完整运功“玳弦急曲”时，可额外消耗1点剑舞使目标封轻功3秒>",
            "belong_key": "belong_2707"
        },
        "10081": {
            "name": "冰心诀",
            "attributes": {
                "magical_shield_base": 2191,
                "physical_shield_base": 1721,
                "pve_addition_base": 113,
                "spirit_to_lunar_attack_power": 2048,
                "spirit_to_lunar_critical_strike": 297,
                "max_life_gain": 245,
                "lunar_attack_power_base": 7387
            },
            "recipes": [
                "recipe_1711_1",
                "recipe_680_2",
                "recipe_681_2"
            ],
            "skills": [
                15,
                25769
            ],
            "desc": "七秀内功。此功飘逸轻盈，若九天飞仙。且攻势凌厉，厉害非常。据传乃是公孙大娘之师所创，旁人问及，大娘只是笑而不答。",
            "critical_type": "lunar",
            "damage_type": "lunar",
            "belong_key": "belong_10081"
        },
        "561": {
            "name": "剑气长江",
            "recipes": [
                "recipe_139_1",
                "recipe_140_1",
                "recipe_143_1",
                "recipe_144_1",
                "recipe_145_1",
                "recipe_146_1",
                "recipe_149_1",
                "recipe_150_1",
                "recipe_153_1",
                "recipe_2525_1"
            ],
            "skills": [
                30524
            ],
            "desc": "需要“名动四方”触发的剑舞状态，获得1点剑舞，对目标造成<SUB 30524 0>阴性内功伤害。并使其移动速度降低50%，持续12秒。<TALENT 2713 1 施展后使小队成员内功破防提高5%，持续5秒><TALENT 2713 2 施展后使小队成员内功破防提高10%，持续5秒><TALENT 2715 1 伤害提高2%><TALENT 2715 2 伤害提高4%><TALENT 5869 1 伤害提高15%><TALENT 6848 1 “剑气长江”的调息时间增加8秒，使目标锁足4秒><TALENT 14934 1 “剑气长江”命中无法运功目标后自身2秒内造成的伤害提高10%><TALENT 6847 1 有30%几率使目标获得一层“急曲”效果并重置“剑气长江”调息时间><TALENT 21936 1 命中附带“急曲”的目标时，每层“急曲”为该次“剑气长江”增加8%的会心和8%的会心效果><TALENT 30522 1 可对目标半径8尺内额外4个目标造成伤害><TALENT 22732 1 连续使用3次不同的“猿公剑法”套路招式或“江海凝光”命中目标，将对目标额外造成<SUB 30532 1>阴性内功伤害和一段破招伤害，并附带一层“急曲”效果><TALENT 34603 1 “江海凝光”调息时间增加4秒，命中目标将为目标添加1层“凝华”效果，最多叠加3层。该效果可被“剑气长江”引爆，根据层数造成阴性内功伤害。若命中非侠士目标，则造成额外阴性伤害>",
            "belong_key": "belong_561"
        },
        "2716": {
            "name": "剑破虚空",
            "skills": [
                40182,
                32957
            ],
            "desc": "需要“名动四方”触发的剑舞状态，获得1点剑舞，获得一个自身10%最大气血值的护盾，持续4秒。对目标及其周围最多2个目标造成阴性内功伤害，使当前目标<BUFF 2838 1 desc>，持续2秒，获得一层“急曲”效果并造成一次破招伤害。<TALENT 5848 1 伤害提高10%><TALENT 5868 1 会心几率提高10%，会心效果提高10%，命中目标后回复自身10%的内力值，若会心则额外回复20%的内力值><TALENT 6556 1 不再对周围造成伤害，对当前目标的伤害提高35%且额外获得1点剑舞><TALENT 6557 1 调息时间降低5秒，额外命中4个目标，不再附带无法施展内功和轻功招式效果><TALENT 22732 1 连续使用3次不同的“猿公剑法”套路招式或“江海凝光”命中目标，将对目标额外造成<SUB 30532 1>阴性内功伤害和一段破招伤害，并附带一层“急曲”效果><TALENT 38617 1 “剑破虚空”调息时间降低6秒，不再打断目标运功、不会使目标无法施展内功招式和施展轻功招式，获得的“剑舞长空”效果持续时间变为6秒，不再附带护盾，提高自身5%会心和15%会心效果><TALENT 40177 1 可充能三次，命中侠士目标后使其4.5秒内受到来自自身的“剑破虚空”伤害提高60%，最多可叠加3次。叠加3次后下次“剑破虚空”命中会清除计数>",
            "belong_key": "belong_2716"
        },
        "544": {
            "name": "帝骖龙翔",
            "skills": [
                15366
            ],
            "desc": "对周围8尺内最多5个目标造成<SUB 15366 4>点阴性内功伤害，并使其<BUFF 686 0 desc>，持续5秒。<TALENT 5866 1 调息时间降低50%，若命中后未成功控制目标则使目标3秒内无法施展轻功><TALENT 24988 1 需运功1.5秒，使得自身周围8尺目标定身4秒，并使得正对自身的侠士目标无法运功4秒>",
            "belong_key": "belong_544"
        },
        "553": {
            "name": "江海凝光",
            "recipes": [
                "recipe_154_1",
                "recipe_155_1",
                "recipe_156_1",
                "recipe_157_1",
                "recipe_158_1",
                "recipe_159_1",
                "recipe_160_1",
                "recipe_161_1"
            ],
            "skills": [
                6559
            ],
            "desc": "对目标造成<SUB 6559 0>阴性内功伤害。若目标带有“急曲”不利效果，则使这些伤害立刻生效。<TALENT 18202 1 会心提高10%，对目标周围8尺的额外5个目标造成伤害，刷新目标身上“急曲”持续时间，并使其身上的“急曲”效果立即生效><TALENT 5869 1 伤害提高15%><TALENT 5860 1 命中有自身满层“急曲”不利效果的目标，额外造成100%的伤害><TALENT 25000 1 “江海凝光”调息时间变为6秒，2层充能，不会使得当前目标身上的“急曲”效果立即生效，对目标造成大量伤害并获得“疾光”效果：下一个“江海凝光”受攻击力加成提高40%，持续4.5秒><TALENT 34603 1 “江海凝光”调息时间增加4秒，命中目标将为目标添加1层“凝华”效果，最多叠加3层。该效果可被“剑气长江”引爆，根据层数造成阴性内功伤害。若命中非侠士目标，则造成额外阴性伤害><TALENT 22732 1 连续使用3次不同的“猿公剑法”套路招式或“江海凝光”命中目标，将对目标额外造成<SUB 30532 1>阴性内功伤害和一段破招伤害，并附带一层“急曲”效果>",
            "belong_key": "belong_553"
        },
        "37316": {
            "name": "芳姿畅音",
            "buffs": [
                28183,
                28184,
                28185,
                28186
            ],
            "skills": [
                37317,
                37318,
                37319,
                37320
            ],
            "desc": "将根据5秒内施展的下一个“猿公剑法”套路下招式产生不同的“留芳仙姿”，每携带一种“留芳仙姿”使自身最终伤害提高5%，“留芳仙姿”在战斗状态下持续25秒，持续时间内，自身施展对应“猿公剑法”后获得1点剑舞，命中目标造成伤害追加额外阴性内功伤害，触发该次阴性内功伤害视作施展“猿公剑法”套路下招式。",
            "belong_key": "belong_37316"
        },
        "40177": {
            "name": "步生花",
            "recipes": [
                "recipe_5802_1"
            ],
            "desc": "“剑破虚空”可充能三次，不再附带无法施展轻功招式效果，命中侠士目标后使其6秒受到来自自身的“剑破虚空”伤害提高60%，最多可叠加2次，叠加2次后下次“剑破虚空”命中会清除计数。",
            "belong_key": "belong_40177"
        },
        "547": {
            "name": "剑心通明",
            "attributes": {
                "lunar_damage_base": 60,
                "lunar_damage_rand": 6
            },
            "skills": [
                547
            ],
            "desc": "对目标造成<SKILL LunarDamage>点(+<SKILLEx {D0} {SkillLunarAP}>)阴性内功伤害，使其<BUFF 690 1 desc>，持续<BUFF 690 1 time>，并打断目标运功。",
            "belong_key": "belong_547"
        },
        "42516": {
            "name": "梦鲤拂波",
            "skills": [
                42519
            ],
            "desc": "在目标点放置一个半径12尺的“鲤池”，持续5秒，使区域内最多5个敌方目标眩晕4秒，而后锦鲤游动，每0.5秒对区域内最多5个目标造成<SUB 42519 0>伤害。<TALENT 42549 1 需要核心奇穴【梦鲤】“玳弦急曲”命中锦鲤池区域内的目标时，每跳使锦鲤额外攻击一次，该攻击只作用于施展“玳弦急曲”时选择的目标>",
            "belong_key": "belong_42516"
        },
        "5864": {
            "name": "枕上",
            "buffs": [
                5788
            ],
            "desc": "“猿公剑法”套路下招式会心后，自身加速率提高1%，无视目标10%内功防御，持续15秒，可叠加5层。",
            "belong_key": "belong_5864"
        },
        "21936": {
            "name": "灼桃",
            "buffs": [
                15220
            ],
            "desc": "“剑气长江”命中附带“急曲”的目标时，每层“急曲”为该次“剑气长江”增加10%的会心和10%的会心效果。",
            "belong_key": "belong_21936"
        },
        "6558": {
            "name": "成玉",
            "buffs": [
                15912
            ],
            "skills": [
                35366
            ],
            "desc": "“剑影留痕”命中目标附带一次“成玉”阴性伤害。成功击退目标后，使目标获得“成玉”效果：受到伤害提高10%，持续3秒。",
            "belong_key": "belong_6558"
        },
        "14727": {
            "name": "繁姿",
            "desc": "阴性招式会心后，自身回复2%气血值。",
            "belong_key": "belong_14727"
        },
        "6556": {
            "name": "生莲",
            "recipes": [
                "recipe_1254_1",
                "recipe_5890_1"
            ],
            "desc": "“剑破虚空”不再对周围造成伤害，但是对当前目标的伤害提高35%。",
            "belong_key": "belong_6556"
        },
        "23935": {
            "name": "广陵月",
            "buffs": [
                17010
            ],
            "skills": [
                23936
            ],
            "desc": "施展“名动四方”后，可施展二段技能，6秒内每对目标造成一次伤害就额外造成<SUB 23936 1>阴性内功伤害，并提高自身2%的会心效果，最多叠加10层。",
            "belong_key": "belong_23935"
        },
        "18620": {
            "name": "寒雨",
            "desc": "“水榭花盈”对目标及踩踏的目标，定身5秒，并使其封轻功4秒。对其他目标施展“水榭花盈”后返还5秒招式“鹊踏枝”和“水榭花盈”的调息时间。",
            "belong_key": "belong_18620"
        },
        "18202": {
            "name": "玉素",
            "recipes": [
                "recipe_2494_1"
            ],
            "skills": [
                18203
            ],
            "desc": "“江海凝光”会心提高10%，对目标周围8尺的额外5个目标造成伤害，刷新目标身上“急曲”持续时间，并使其身上的“急曲”效果立即生效。",
            "belong_key": "belong_18202"
        },
        "34604": {
            "name": "流玉",
            "recipes": [
                "recipe_3247_1"
            ],
            "buffs": [
                25902
            ],
            "desc": "“剑影留痕”不再击退目标且调息时间增加至15秒，但施展距离提高十尺。命中目标后将使10秒内下一个“玳弦急曲”伤害提高90%，“繁音急节”效果期间施展则可作用于下两个“玳弦急曲”。",
            "belong_key": "belong_34604"
        },
        "23457": {
            "name": "琼霄",
            "skills": [
                506
            ],
            "desc": "“婆罗门”可触发“剑舞”状态，对自身10尺内的10个目标造成一次<SUB 506 27>伤害并附带1层“急曲”不利效果，随后每秒造成<SUB 506 27>阴性内功伤害，持续20秒，无法在水中维持且移动后消失。",
            "belong_key": "belong_23457"
        },
        "18467": {
            "name": "飞竹",
            "desc": "对20尺内目标施展“水榭花盈”，自身免疫控制（击退和被拉除外），受到伤害降低25%，持续8秒。",
            "belong_key": "belong_18467"
        },
        "35980": {
            "name": "珠袖",
            "recipes": [
                "recipe_5506_1"
            ],
            "skills": [
                37308
            ],
            "desc": "“蝶弄足”调息时间降低15秒，附带的免控时间延长2秒，并使下一个“江海凝光”引爆“急曲”时根据层数造成额外伤害。",
            "belong_key": "belong_35980"
        },
        "38617": {
            "name": "明空",
            "recipes": [
                "recipe_5660_1"
            ],
            "buffs": [
                25435
            ],
            "desc": "“剑破虚空”调息时间降低6秒，不再打断目标运功、不会使目标无法施展内功招式和施展轻功招式，获得的“剑舞长空”效果持续时间变为6秒，不再附带护盾，提高自身5%会心和20%会心效果。施展“剑气长江”后降低“剑破虚空”0.5秒调息时间。",
            "belong_key": "belong_38617"
        },
        "18619": {
            "name": "飞袂",
            "recipes": [
                "recipe_2350_1",
                "recipe_5784_1",
                "recipe_5785_1"
            ],
            "desc": "“水榭花盈”对其他目标释放时，调息时间降低20秒；“鹊踏枝”充能时间降低5秒。",
            "belong_key": "belong_18619"
        },
        "6907": {
            "name": "玉骨",
            "desc": "施展“鹊踏枝”，使自身受到的内功伤害降低50%，持续6秒。",
            "belong_key": "belong_6907"
        },
        "6572": {
            "name": "耐夜",
            "recipes": [
                "recipe_4334_1"
            ],
            "dots": {
                "2920": [
                    13986
                ]
            },
            "desc": "“蝶弄足”充能时间降低20秒，施展后在免控期间激活二段招式：向前疾奔30尺，使路径上的10个目标附带“急曲”效果。",
            "belong_key": "belong_6572"
        },
        "5852": {
            "name": "新妆",
            "recipes": [
                "recipe_1500_1",
                "recipe_1248_1",
                "recipe_1801_1",
                "recipe_1498_1"
            ],
            "skills": [
                6554
            ],
            "desc": "“玳弦急曲”每0.75秒造成一次伤害，每跳附带45%额外伤害，完整运功后不再附带“急曲”效果，持续2.25秒。",
            "belong_key": "belong_5852"
        },
        "5854": {
            "name": "珑韵",
            "recipes": [
                "recipe_1249_1",
                "recipe_1926_1"
            ],
            "skills": [
                18814
            ],
            "desc": "“玳弦急曲”立即造成<SUB 18814 1>伤害，运功不被打退，能够对目标周围8尺范围内的额外5个目标造成伤害。",
            "belong_key": "belong_5854"
        },
        "5882": {
            "name": "倾城",
            "desc": "“剑舞”状态下自身受到的伤害降低10%，移动速度增加10%。",
            "belong_key": "belong_5882"
        },
        "563": {
            "name": "剑转流云",
            "desc": "卸除目标阴性、混元性、阳性、毒性内功气劲各两个。",
            "belong_key": "belong_563"
        },
        "14705": {
            "name": "霜降",
            "buffs": [
                30273,
                30274
            ],
            "skills": [
                40289
            ],
            "desc": "“玳弦急曲”消耗全部剑舞点数，每消耗1点剑舞会增加一跳伤害并使本次“玳弦急曲”受攻击加成提高10%。完整运功后造成3次基于跳数的破招伤害。",
            "belong_key": "belong_14705"
        },
        "14715": {
            "name": "轻妒",
            "recipes": [
                "recipe_4112_1"
            ],
            "desc": "“繁音急节”变为2层充能技能，50秒充能时间。",
            "belong_key": "belong_14715"
        },
        "21166": {
            "name": "霜天剑泠",
            "skills": [
                21170
            ],
            "desc": "释放剑气攻击，使目标获得一层“急曲”效果，3秒内每0.25秒对目标造成<SUB 21170 0>阴性内功伤害并使目标的“急曲”效果被引爆时伤害提高5%，持续5秒，目标离开自身16尺则挣脱剑气攻击。",
            "belong_key": "belong_21166"
        },
        "32636": {
            "name": "合璧知意",
            "desc": "一段招式“江海凝波剑”：在敌方侠士6尺范围内形成一个6秒的“凝波”区域，每秒为区域内最多3个敌对侠士添加一层“凝波”效果并造成伤害。“凝波”区域结束根据来源于自身的“凝波”层数对区域内最多3个敌对侠士造成伤害。“凝波”不可被驱散，最高叠加7层，每15秒消失一层；层数越高，“凝波”区域结束时受到的伤害越高。二段招式“山河流云剑”：提前引爆属于自身的“凝波”区域。",
            "belong_key": "belong_32636"
        },
        "24996": {
            "name": "化冰",
            "buffs": [
                17969
            ],
            "skills": [
                24999
            ],
            "desc": "“心鼓弦”不再附带救治重伤目标的效果，调息时间降低为30秒，可以对自身施展，使得自身获得“化冰”气劲，无双等级提高30%，且施展“玳弦急曲”命中目标将额外造成<SUB 24999 0>阴性内功伤害，持续3分钟。",
            "belong_key": "belong_24996"
        },
        "24995": {
            "name": "盈袖",
            "skills": [
                33140
            ],
            "desc": "“玳弦急曲”每跳使当前目标获得1层“急曲”效果，若命中带有6层“急曲”效果的目标，使对方获得1层“盈袖”效果，其余“猿公剑法”招式与“江海凝光”命中目标会消耗一层“盈袖”并造成伤害，最多可叠加6层。",
            "belong_key": "belong_24995"
        },
        "22732": {
            "name": "钗燕",
            "skills": [
                30532,
                34611
            ],
            "desc": "连续使用3次不同的“猿公剑法”套路招式或“江海凝光”命中目标，将对目标额外造成<SUB 30532 0>阴性内功伤害和一段破招伤害，并附带一层“急曲”效果。",
            "belong_key": "belong_22732"
        },
        "18621": {
            "name": "镜花",
            "skills": [
                21715
            ],
            "desc": "对目标施展“水榭花盈”后，自身立刻获得7秒“繁音急节”效果。每踩踏一个目标或者跳跃至目标身旁时，对自身6尺范围最多5个敌方目标造成<SUB 21715 0>阴性内功伤害，并附带一层“急曲”效果。",
            "belong_key": "belong_18621"
        },
        "6779": {
            "name": "朝露",
            "buffs": [
                12571
            ],
            "desc": "“剑舞”期间提高自身10%阴性基础攻击力，施展“鹊踏枝”返还5秒“剑影留痕”调息时间。",
            "belong_key": "belong_6779"
        },
        "5866": {
            "name": "悲秋",
            "recipes": [
                "recipe_1251_1",
                "recipe_3007_1"
            ],
            "desc": "“帝骖龙翔”、“雷霆震怒”调息时间降低50%，若命中后未成功控制目标则使目标4秒内无法施展轻功。",
            "belong_key": "belong_5866"
        },
        "18468": {
            "name": "缠竹",
            "recipes": [
                "recipe_2894_1"
            ],
            "desc": "“雷霆震怒”调息时间降低10秒，持续时间缩短至4秒。若目标为敌方，则需运功1秒施展，眩晕持续期间，目标可以受到伤害效果。若目标为友方，使友方在眩晕期间免受其他控制效果影响。",
            "belong_key": "belong_18468"
        },
        "42512": {
            "name": "如缕",
            "desc": "完整运功“玳弦急曲”时，可额外消耗1点剑舞使目标封轻功3秒。",
            "belong_key": "belong_42512"
        },
        "6567": {
            "name": "冥泽",
            "desc": "若自身气血值低于1%，解除自身控制效果并使自身外功闪避几率提高100%，受到伤害降低100%，持续3秒，该效果最多每2分45秒触发1次。",
            "belong_key": "belong_6567"
        },
        "36013": {
            "name": "闻月",
            "desc": "施展“天地低昂”使得自身回复15%气血值，受到伤害降低55%，持续10秒，此效果不会被卸除，持续时长不受秘籍影响。",
            "belong_key": "belong_36013"
        },
        "25000": {
            "name": "疾光",
            "buffs": [
                29297
            ],
            "skills": [
                25001
            ],
            "desc": "“江海凝光”调息时间变为6秒，2层充能，不会使得当前目标身上的“急曲”效果立即生效，对目标造成大量伤害并获得“疾光”效果：下一个“江海凝光”受攻击力加成提高40%，持续4.5秒。",
            "belong_key": "belong_25000"
        },
        "42549": {
            "name": "诉弦",
            "desc": "<TALENT_CORE 42516 1>“玳弦急曲”命中“鲤池”区域内的目标时，每跳使“锦鲤”额外攻击一次，该攻击只作用于施展“玳弦急曲”时选择的目标。",
            "belong_key": "belong_42549"
        }
    },
    "10144": {
        "1663": {
            "name": "莺鸣柳",
            "buffs": [
                1728
            ],
            "desc": "回复135点剑气，使自身获得“莺鸣”效果：<BUFF 1728 0 desc>，持续<BUFF 1728 3 time>。<TALENT 18315 1 变为3层充能技能，充能时间1分30秒，效果持续8秒><TALENT 6549 1 “莺鸣”效果持续期间额外提高自身15%基础外功攻击><TALENT 20942 1 持续期间“梦泉虎跑”每次命中目标将降低4秒调息时间><TALENT 25013 1 “莺鸣柳”不再充能，调息时间降低至45秒，持续时间提高至10秒><TALENT 18313 1 使敌方目标获得“梅隐香”效果，持续8秒><TALENT 30777 1 每秒恢复5点剑气，“莺鸣柳”不再充能和恢复剑气，调息时间降低45秒，“莺鸣”持续期间内首次剑气达到上限时自身无双等级提高30%，并延长15秒><TALENT 40178 1 >",
            "belong_key": "belong_1663"
        },
        "10144": {
            "name": "问水诀",
            "attributes": {
                "pve_addition_base": 82,
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "agility_to_physical_attack_power": 1843,
                "agility_to_physical_overcome": 287,
                "max_life_gain": 245,
                "physical_attack_power_base": 6513,
                "physical_critical_strike_base": 7827
            },
            "recipes": [
                "recipe_1711_1",
                "recipe_4087_1"
            ],
            "skills": [
                18383,
                25785,
                6954,
                1795,
                25776,
                35051,
                32821
            ],
            "desc": "轻灵飘逸，行云流水。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10144"
        },
        "1579": {
            "name": "九溪弥烟",
            "recipes": [
                "recipe_560_1",
                "recipe_561_1",
                "recipe_562_1",
                "recipe_563_1",
                "recipe_564_1",
                "recipe_565_1",
                "recipe_566_1"
            ],
            "skills": [
                26673
            ],
            "desc": "旋风般的轻剑攻击，对周围6尺内的最多10个目标造成<SUB 26673 0>外功伤害，每命中一个目标可使你获得5点剑气。<TALENT 18682 1 调息时间增加至24秒，施展“九溪弥烟”后立即造成<SUR 0.8>点破招伤害并在原地产生4尺“剑泽”效果，“剑泽”内敌对目标移动速度降低80%，持续过程中每1秒对范围内的5个目标造成<SUB 18685 32>伤害，持续24秒><TALENT 26672 1 “黄龙吐翠”施展后使下一个“九溪弥烟”会造成三段<SUB 26674 32>外功伤害>",
            "belong_key": "belong_1579"
        },
        "1578": {
            "name": "平湖断月",
            "recipes": [
                "recipe_545_1",
                "recipe_546_1",
                "recipe_547_1",
                "recipe_548_1",
                "recipe_549_1",
                "recipe_550_1",
                "recipe_551_1"
            ],
            "skills": [
                13470
            ],
            "desc": "向前冲刺，穿透当前目标，造成<SUB 13470 0>外功伤害，附加额外100%武器伤害，获得20点剑气并锁足目标3秒。该招式受额外的外功攻击加成。<TALENT 18309 1 可以在基础调息时间中施展，施展距离提高5尺，命中运功中的目标使其眩晕3秒><TALENT 23922 1 控制效果持续时间增加1秒><TALENT 38665 1 施展“平湖断月”后2秒内自身获得50%减伤，下一个“黄龙吐翠”造成额外<SUB 38666 1>外功伤害>",
            "belong_key": "belong_1578"
        },
        "1581": {
            "name": "黄龙吐翠",
            "recipes": [
                "recipe_552_1",
                "recipe_553_1",
                "recipe_554_1",
                "recipe_555_1",
                "recipe_556_1",
                "recipe_557_1",
                "recipe_558_1",
                "recipe_559_1",
                "recipe_2581_1"
            ],
            "skills": [
                13471
            ],
            "desc": "穿透目标，对其造成<SUB 13471 0>外功伤害，附加额外100%武器伤害，使你获得25点剑气。该招式不能面对目标施展，造成的伤害受额外的外功攻击加成。<TALENT 2738 2 会心伤害提高20%><TALENT 26672 1 调息时间降低1秒，伤害提高70%，施展后使下一个“九溪弥烟”会造成三段<SUB 26674 32>外功伤害><TALENT 38665 1 施展“平湖断月”后2秒内自身获得50%减伤，下一个“黄龙吐翠”造成额外<SUB 38666 1>外功伤害>",
            "belong_key": "belong_1581"
        },
        "1589": {
            "name": "梦泉虎跑",
            "recipes": [
                "recipe_1573_1",
                "recipe_1574_1",
                "recipe_1575_1",
                "recipe_1576_1",
                "recipe_1577_1",
                "recipe_1578_1",
                "recipe_1579_1",
                "recipe_1580_1"
            ],
            "skills": [
                1590
            ],
            "desc": "施展藏剑秘传剑技，向15尺内目标快速移动并发起猛烈的攻击，每次攻击命中敌人会造成<SUB 1590 0>外功伤害，并使你获得5点剑气。在施展此招式期间你不受任何控制效果影响，受到伤害降低35%。<TALENT 2737 1 施展招式时受到的伤害降低33%><TALENT 2737 2 施展招式时受到的伤害降低66%><TALENT 2737 3 施展招式时受到的伤害降低99%><TALENT 2741 1 调息时间降低1秒><TALENT 5943 1 对周围6尺内的5个敌人造成外功伤害><TALENT 6544 1 减伤效果提高35%，期间施展“听雷”可以额外造成<SUB 14609 33>外功伤害><TALENT 5957 1 不再附带减伤效果><TALENT 21737 1 “梦泉虎跑”每次命中目标则在目标位置生成剑魂，最多5个存在12秒>",
            "belong_key": "belong_1589"
        },
        "1593": {
            "name": "云飞玉皇",
            "recipes": [
                "recipe_567_1",
                "recipe_568_1",
                "recipe_569_1",
                "recipe_570_1",
                "recipe_571_1",
                "recipe_572_1",
                "recipe_573_1",
                "recipe_574_1"
            ],
            "skills": [
                1595,
                1594,
                18317
            ],
            "desc": "消耗15点剑气，对半径8尺范围内的单体目标造成<SUB 1595 0>外功伤害，附加200%武器伤害和一段破招伤害，对半径4尺范围内的单体目标造成额外的<SUB 1594 0>外功伤害，附加200%武器伤害。<TALENT 5957 1 伤害提高10%><TALENT 5954 1 会心几率提高10%，会心效果提高10%><TALENT 6533 1 伤害提高10%><TALENT 2763 3 会心提高6%><TALENT 2758 2 调息时间降低1秒><TALENT 2755 1 剑气消耗降低2点><TALENT 2755 2 剑气消耗降低4点><TALENT 2767 1 会心后提高外功会心伤害3%，持续30秒，可叠加4层><TALENT 2767 2 会心后提高外功会心伤害6%，持续30秒，可叠加4层><TALENT 2767 3 会心后提高外功会心伤害10%，持续30秒，可叠加4层><TALENT 5964 1 战斗状态下自身剑气高于50点施展，剑气消耗降低2点，伤害提高10%。若剑气高于75点施展，伤害提高至15%><TALENT 5959 1 施展“听雷”命中目标后使自身下两次“夕照雷锋”“云飞玉皇”会心几率及招式伤害提高15%><TALENT 25016 1 每次施展“啸日”切换并处于“山居剑意”状态下，首次施展降低“莺鸣柳”1.5秒的调息时间，并额外造成<SUB 26689 1>外功伤害><TALENT 5952 1 可移动施展，命中非侠士目标后使自身获得一层“岱宗”效果：每层使自身会心效果提高8%，持续15秒，最多可叠加3层><TALENT 42179 1 ><TALENT 42218 1 ><TALENT 5963 1 >",
            "belong_key": "belong_1593"
        },
        "1600": {
            "name": "夕照雷峰",
            "recipes": [
                "recipe_575_1",
                "recipe_576_1",
                "recipe_577_1",
                "recipe_578_1",
                "recipe_579_1",
                "recipe_580_1",
                "recipe_581_1",
                "recipe_582_1"
            ],
            "skills": [
                2896
            ],
            "desc": "消耗15点剑气，以重剑猛击目标，对其造成<SUB 2896 0>外功伤害，附加额外200%武器伤害和一段破招伤害。<TALENT 6534 1 命中目标使自身无视目标45%外功防御等级，持续7秒><TALENT 5960 1 可对目标半径8尺内额外4个目标造成伤害><TALENT 5953 1 会心提高10%，会心效果提高10%><TALENT 2752 3 会心伤害提高15%><TALENT 2763 1 会心提高2%><TALENT 2763 2 会心提高4%><TALENT 2763 3 会心提高6%><TALENT 2755 1 剑气消耗降低2点><TALENT 5955 1 伤害提高15%，会心后使自身下一个“云飞玉皇”无需运功且造成破招伤害提高20%><TALENT 2765 3 施展后有30%几率使自身下一个“云飞玉皇”无需运功且造成破招伤害提高30%><TALENT 5957 1 伤害提高10%><TALENT 5964 1 战斗状态下自身剑气高于50点施展，剑气消耗降低2点，伤害提高10%。若剑气高于75点施展，伤害提高至15%><TALENT 5959 1 施展“听雷”命中目标后使自身下两次“夕照雷峰”“云飞玉皇”会心几率及招式伤害提高15%><TALENT 25016 1 每次施展“啸日”切换并处于“山居剑意”状态下，首次施展降低“莺鸣柳”1.5秒的调息时间，并额外造成<SUB 26689 1>外功伤害><TALENT 38674 1 运功时间降低0.25秒，若目标在4尺外12尺内则附带冲刺效果><TALENT 42179 1 >",
            "belong_key": "belong_1600"
        },
        "18322": {
            "name": "鹤归孤山",
            "recipes": [
                "recipe_1565_1",
                "recipe_1566_1",
                "recipe_1567_1",
                "recipe_1568_1",
                "recipe_1569_1",
                "recipe_1570_1",
                "recipe_1571_1",
                "recipe_1572_1",
                "recipe_2587_1"
            ],
            "skills": [
                1598
            ],
            "desc": "消耗20点剑气，跳跃至正前方15尺处并以重剑猛击地面，对半径6尺范围内的最多10个目标造成<SUB 1598 0>外功伤害并使其眩晕，附加200%武器伤害。该伤害会逐渐向外扩散，分别对6-8尺，8-10尺的敌对目标造成<SUB 30861 1>外功伤害。<TALENT 2763 3 会心提高6%><TALENT 2761 1 招式作用范围提高1尺，伤害提高5%><TALENT 2761 2 招式作用范围提高2尺，伤害提高10%><TALENT 18326 1 施展后5秒内自身身法提高10%且每点身法化解30点伤害，当周围30尺敌对玩家人数大于等于6人时，每点身法化解120点伤害；命中目标则击倒3秒><TALENT 5957 1 伤害提高10%><TALENT 23922 1 控制效果持续时间增加1秒><TALENT 25014 1 “鹤归孤山”伤害提高70%，命中50%以上气血的目标时，将额外造成<SUB 30771 1>外功伤害><TALENT 30862 1 伤害扩散结束后会生成一个半径10尺的“九皋鹤野”区域，持续6秒，在区域内施展“夕照雷峰”“云飞玉皇”会形成落剑造成<SUB 32967 1>外功伤害附加200%武器并降低2秒“云飞玉皇”调息时间最多触发5次><TALENT 5951 1 会心几率提高10%，会心效果提高10%><TALENT 42179 1 >",
            "belong_key": "belong_18322"
        },
        "1645": {
            "name": "风来吴山",
            "recipes": [
                "recipe_583_1",
                "recipe_584_1",
                "recipe_585_1",
                "recipe_586_1",
                "recipe_587_1",
                "recipe_588_1",
                "recipe_589_1"
            ],
            "skills": [
                1905
            ],
            "desc": "消耗50点剑气，发动旋风般的重剑攻击，5秒内对周围10尺内的最多10个目标造成8次<SUB 1905 0>外功伤害附加200%武器伤害。在此过程中获得“不工”效果：<BUFF 1856 1 desc>。<TALENT 5956 1 变为2层透支招式，透支充能时间1分20秒，持续时间降低1.5秒，只能攻击3个目标，攻击频率提高33%><TALENT 5963 1 连续命中目标5次后则会将目标武器卷飞，使目标无法使用武器，持续2秒><TALENT 5957 1 伤害提高10%><TALENT 14600 1 会心几率提高10%，会心效果提高10%><TALENT 6542 1 在地面施展“风来吴山”时，每命中一个目标减少5秒调息时间并恢复自身3%气血最大值，该效果最多作用6次。若施展时周围20尺内敌对侠士目标少于等于5人，该效果可额外作用4次><TALENT 6548 1 不再消耗剑气，每命中一个目标回复5点剑气并使目标移动速度降低30%，持续5秒。该效果每累计回复10点剑气，可使下一次施展其余“灵峰剑式”伤害提高30%，该效果最多叠加4层，持续9秒><TALENT 2756 1 使周围目标多承受2次伤害><TALENT 2756 2 使周围目标多承受4次伤害><TALENT 18683 1 每施展招式成功定身、眩晕目标，“风来吴山”调息时间降低3秒><TALENT 2756 2 使周围目标多承受4次伤害><EnchantID 10104 “风来吴山”若命中单一目标则使下一跳伤害提高5%>",
            "belong_key": "belong_1645"
        },
        "1646": {
            "name": "听雷",
            "recipes": [
                "recipe_592_1",
                "recipe_593_1",
                "recipe_594_1",
                "recipe_595_1",
                "recipe_596_1",
                "recipe_597_1",
                "recipe_598_1"
            ],
            "skills": [
                1706,
                1707
            ],
            "desc": "对目标造成<SUB 1706 0>外功伤害，附加额外的100%武器伤害。问水诀内功下获得20点剑气。<TALENT 5957 1 “山居剑意”心法下伤害提高10%><TALENT 6799 1 “山居剑意”下“听雷”有3秒的调息时间，会心几率提高10%，会心效果提高10%，会心则获得5点剑气><TALENT 5944 1 “山居剑意”下每点剑气有0.5%几率使“听雷”额外触发一次伤害><TALENT 2736 2 施展后额外获得20点剑气><TALENT 2739 1 伤害提高5%><TALENT 5959 1 “听雷”伤害提高10%，施展“听雷”命中目标后使自身下两次“夕照雷峰”“云飞玉皇”会心几率及招式伤害提高15%><TALENT 5958 1 “问水诀”下施展获得1层“声趣”效果，使下1次“夕照雷峰”会心几率和会心效果提高15%且不需要运功，可以叠加3层，持续15秒><TALENT 25016 1 每次施展“啸日”切换并处于“山居剑意”状态下，首次施展降低“莺鸣柳”1.5秒的调息时间，并额外造成<SUB 26689 1>外功伤害><TALENT 29090 1 会心几率提高10%，会心效果提高10%， 命中目标后，使目标获得“惊雷”效果，持续10秒>",
            "belong_key": "belong_1646"
        },
        "33136": {
            "name": "断潮",
            "skills": [
                18299
            ],
            "desc": "对目标造成<SUB 18299 0>外功伤害，附加额外的200%武器伤害。",
            "belong_key": "belong_33136"
        },
        "30777": {
            "name": "听晓",
            "recipes": [
                "recipe_5672_1"
            ],
            "desc": "每秒恢复5点剑气，“莺鸣柳”不再充能和恢复剑气，调息时间降低45秒，“莺鸣”持续期间内首次剑气达到上限时自身无双等级提高50%，并延长15秒。",
            "belong_key": "belong_30777"
        },
        "42179": {
            "name": "无锋",
            "desc": "完整运功“夕照雷峰”，完整运功“云飞玉皇”,“鹤归孤山”成功命中目标给自身分别添加1、2、3层<NounID 97>气劲。",
            "belong_key": "belong_42179"
        },
        "1610": {
            "name": "霞流宝石",
            "skills": [
                1611
            ],
            "desc": "立即对周围6尺内的最多10个目标均造成<SUB 1611 0>外功伤害并卸除其阳性、混元性、阴性、毒性气劲各一个，附加额外100%武器伤害，并使其4.5秒内无法使用武器。<TALENT 2746 1 剑气消耗降低3点，招式的有效目标人数增加2个><TALENT 2746 2 剑气消耗降低6点，招式的有效目标人数增加4个><TALENT 2753 1 伤害提高5%，会心几率提高3%><TALENT 2753 2 伤害提高10%，会心几率提高6%>",
            "belong_key": "belong_1610"
        },
        "40178": {
            "name": "叠锋意",
            "recipes": [
                "recipe_6170_1"
            ],
            "desc": "“莺鸣柳”调息时间降低65秒，增益效果替换为外功会心提高10%，可突破上限的外功会心效果提高25%。每施展招式消耗剑气造成伤害时，“莺鸣柳”调息时间降低1.5秒，3秒内连续施展“莺鸣柳”获得的增益可叠加。",
            "belong_key": "belong_40178"
        },
        "21737": {
            "name": "莺语",
            "skills": [
                34710
            ],
            "desc": "“梦泉虎跑”每次命中目标则在目标位置生成剑魂，最多5个存在12秒，山居剑意下施展“云飞玉皇”命中目标可引发剑魂共鸣延迟攻击目标，每把造成100%武器伤害附带<SUB 34710 1>外功伤害并降低“莺鸣柳”1秒调息时间。",
            "belong_key": "belong_21737"
        },
        "6544": {
            "name": "云体",
            "skills": [
                14609
            ],
            "desc": "“梦泉虎跑”期间减伤效果提高35%，施展“听雷”可以额外造成<SUB 14609 33>外功伤害。",
            "belong_key": "belong_6544"
        },
        "5957": {
            "name": "怜光",
            "buffs": [
                12317
            ],
            "desc": "“梦泉虎跑”不再附带减伤效果，“山居剑意”下所有招式伤害提高10% 。",
            "belong_key": "belong_5957"
        },
        "42218": {
            "name": "宜秋",
            "recipes": [
                "recipe_6018_1"
            ],
            "desc": "“云飞玉皇”伤害提高10%，完整运功“云飞玉皇”直接造成最大伤害。",
            "belong_key": "belong_42218"
        },
        "6545": {
            "name": "层云",
            "buffs": [
                21640
            ],
            "skills": [
                18991
            ],
            "desc": "“风来吴山”伤害每跳递增10%，最多递增5次。施展期间，无需自身旋转，而是使剑芒在自身当前位置维持，并可以通过“峰插云景”击退自身和敌对的剑芒。",
            "belong_key": "belong_6545"
        },
        "23922": {
            "name": "逍遥",
            "buffs": [
                26988
            ],
            "desc": "自身控制招式持续效果（减速除外）提高1秒，若成功控制目标则武器伤害提高40%，基础外功攻击提高5%，持续10秒最多强化2次。",
            "belong_key": "belong_23922"
        },
        "5956": {
            "name": "山色",
            "recipes": [
                "recipe_4964_1",
                "recipe_2447_1"
            ],
            "desc": "“风来吴山”伤害提高35%，变为2层透支招式，透支充能时间1分05秒，持续时间降低1.5秒，只能攻击3个目标，攻击频率提高33%。",
            "belong_key": "belong_5956"
        },
        "18682": {
            "name": "景行",
            "recipes": [
                "recipe_4477_1"
            ],
            "skills": [
                18685
            ],
            "desc": "“九溪弥烟”调息时间增加至24秒，施展“九溪弥烟”后立即造成<SUR 0.8>点破招伤害并在原地产生4尺“剑泽”效果，“剑泽”内敌对目标移动速度降低80%，持续过程中每1秒对范围内的5个目标造成<SUB 18685 32>伤害，持续24秒。",
            "belong_key": "belong_18682"
        },
        "29093": {
            "name": "剑锋百锻",
            "buffs": [
                29354
            ],
            "desc": "运功3秒，运功期间免疫一切负面效果，使自身以及10尺内2个小队成员获得“百锻”持续60秒，“百锻”期间破防值提高，若已有该效果，则它将获得强化，最多2次，“百锻”期间，对侠士造成伤害或重伤都会延长时间最多延长至5分钟。",
            "belong_key": "belong_29093"
        },
        "36274": {
            "name": "山岳乘风",
            "skills": [
                36275,
                37379
            ],
            "desc": "山居剑意下可施展，最多蓄力3秒，期间自身移动速度降低50%并完全抵挡受到的内外功伤害。每蓄力0.5秒回复10点剑气，蓄力后释放反击招式对前方8尺最多5个敌方目标造成最多<SUB 36275 3>外功伤害附带200%武器伤害，蓄力1.5至2.5秒期间释放则继续发动旋风般的重剑攻击（伤害视作“风来吴山”），持续2.5秒。",
            "belong_key": "belong_36274"
        },
        "5952": {
            "name": "岱宗",
            "buffs": [
                2705
            ],
            "desc": "“云飞玉皇”可移动施展，命中非侠士目标后使自身获得一层“岱宗”效果：每层使自身会心效果提高8%，持续15秒，最多可叠加3层。",
            "belong_key": "belong_5952"
        },
        "1647": {
            "name": "惊涛",
            "skills": [
                1709
            ],
            "desc": "消耗10点剑气，对其造成<SUB 1709 0>外功伤害，附加额外200%武器伤害，并使目标<BUFF 1720 0 desc>，持续<BUFF 1720 0 time>。“山居剑意”下施展使目标定身3秒。<TALENT 5961 1 “山居剑意”下施展后使目标定身，持续3秒><TALENT 5962 1 不消耗剑气><TALENT 23922 1 控制效果持续时间增加1秒>",
            "belong_key": "belong_1647"
        },
        "18309": {
            "name": "摘星",
            "recipes": [
                "recipe_4963_1"
            ],
            "desc": "“平湖断月”可以在基础调息时间中施展，施展距离提高5尺，命中运功中的目标使其眩晕3秒。",
            "belong_key": "belong_18309"
        },
        "6549": {
            "name": "残雪",
            "desc": "“莺鸣”持续期间额外提高自身15%基础外功攻击。",
            "belong_key": "belong_6549"
        },
        "14604": {
            "name": "凭风",
            "buffs": [
                17976
            ],
            "desc": "“问水诀”下施展“啸日”，每秒回复3%气血最大值，持续8秒。“山居剑意”下施展“啸日”，自身身法提高30%，持续15秒，该气劲只可在“问水诀”心法下维持。",
            "belong_key": "belong_14604"
        },
        "18326": {
            "name": "云台",
            "desc": "施展招式“鹤归孤山”后5秒内自身身法提高10%且每点身法化解30点伤害，当周围30尺敌对玩家人数大于等于6人时，每点身法化解120点伤害；命中目标则击倒3秒。",
            "belong_key": "belong_18326"
        },
        "5959": {
            "name": "映波锁澜",
            "recipes": [
                "recipe_3178_1"
            ],
            "buffs": [
                19187
            ],
            "desc": "“听雷”伤害提高10%，命中目标后使自身下两次“夕照雷峰”“云飞玉皇”会心几率及招式伤害提高15%。",
            "belong_key": "belong_5959"
        },
        "28578": {
            "name": "冰天",
            "buffs": [
                20796
            ],
            "desc": "自身闪避后，可为自身添加一层“冰天”效果，最多三层，持续12秒。效果期间自身若触发“断潮”则消耗一层“冰天”并使得“断潮”伤害额外提高100%。",
            "belong_key": "belong_28578"
        },
        "5964": {
            "name": "造化",
            "buffs": [
                9903
            ],
            "desc": "战斗状态下自身剑气高于50点施展“夕照雷峰”“云飞玉皇”，剑气消耗降低2点，招式伤害提高10%。若剑气高于75点施展“夕照雷峰”“云飞玉皇”，则招式伤害提高至15%。",
            "belong_key": "belong_5964"
        },
        "6541": {
            "name": "气爽",
            "desc": "“泉凝月”每点身法化解的伤害提升70%。",
            "belong_key": "belong_6541"
        },
        "6542": {
            "name": "山重水复",
            "desc": "在地面施展“风来吴山”时，每命中一个目标减少5秒调息时间并恢复自身3%气血最大值，该效果最多作用6次。若施展时周围20尺内敌对侠士目标少于等于5人，该效果可额外作用4次。",
            "belong_key": "belong_6542"
        },
        "6534": {
            "name": "雾锁",
            "buffs": [
                9714
            ],
            "desc": "“夕照雷峰”命中目标使自身无视目标45%外功防御等级，持续15秒。",
            "belong_key": "belong_6534"
        },
        "14910": {
            "name": "松舍问霞",
            "skills": [
                14911,
                20806
            ],
            "desc": "重击20尺内的敌对目标，对其造成200%武器伤害外加<SUB 14911 1>外功伤害，30%几率附带“断潮”效果，每1%会心会提高1%断潮触发几率。若目标距离自身8尺外则附带冲刺效果，命中高度高于8尺的目标时，造成伤害提高30%并将其直接击落，使其击倒4秒，若成功击落目标，可在3秒内施展“松舍问霞·跃”追击攻击目标。<TALENT 5957 1 “梦泉虎跑”不再附带减伤效果，“山居剑意”下所有招式伤害提高10% ><TALENT 23922 1 自身控制招式持续效果（减速除外）提高1秒，若成功控制目标则武器伤害提高50%，持续6秒最多强化3次>",
            "belong_key": "belong_14910"
        },
        "32776": {
            "name": "剑引龙泉",
            "skills": [
                32777,
                33608
            ],
            "desc": "被动：<NounID 97>可叠至20层。主动：运功1.25秒（期间免疫打断运功效果），对前方20尺内目标进行重击造成两段200%武器伤害附加<SUB 32777 1>外功伤害并为自身添加1层<NounID 97>。若目标距离自身8尺外则附带冲刺效果。<TALENT 5957 1 伤害提高10%><TALENT_CORE 42179 1>",
            "belong_key": "belong_32776"
        },
        "29090": {
            "name": "撼岳",
            "recipes": [
                "recipe_2740_1"
            ],
            "skills": [
                29129
            ],
            "desc": "“听雷”会心几率提高10%，会心效果提高10%， 命中目标后，使目标获得“惊雷”效果：每次受到添加者的“风来吴山”伤害则会触发一道惊雷受到<SUB 29129 1>外功伤害，持续10秒。",
            "belong_key": "belong_29090"
        },
        "30772": {
            "name": "危峦",
            "recipes": [
                "recipe_2347_1"
            ],
            "desc": "“峰插云景”不再消耗剑气，造成的封轻功效果提高2秒，击退目标后使其锁足4秒。",
            "belong_key": "belong_30772"
        },
        "38674": {
            "name": "长晖",
            "recipes": [
                "recipe_5670_1"
            ],
            "desc": "“夕照雷峰”施展距离提高2尺，若目标在4尺外12尺内则附带冲刺效果。",
            "belong_key": "belong_38674"
        },
        "30862": {
            "name": "山倾",
            "skills": [
                30861,
                32967
            ],
            "desc": "“鹤归孤山”伤害扩散结束后会生成一个半径10尺的“九皋鹤野”区域，持续7秒，在区域内施展“夕照雷峰”“云飞玉皇”会形成落剑造成<SUB 32967 1>外功伤害附加200%武器伤害并降低2秒“云飞玉皇”调息时间最多触发5次。",
            "belong_key": "belong_30862"
        },
        "6548": {
            "name": "碧归",
            "recipes": [
                "recipe_2246_1",
                "recipe_4510_1"
            ],
            "buffs": [
                26207
            ],
            "desc": "“风来吴山”不再消耗剑气，每命中一个目标回复5点剑气并使目标移动速度降低30%，持续5秒。该效果每累计回复10点剑气，可使下一次施展其余“灵峰剑式”伤害提高30%，该效果最多叠加4层，持续9秒。",
            "belong_key": "belong_6548"
        },
        "14607": {
            "name": "片玉",
            "desc": "受到攻击导致自身气血值低于1%，立刻回复40%气血，并重置“泉凝月”，该效果最多150秒触发一次。",
            "belong_key": "belong_14607"
        },
        "1665": {
            "name": "风吹荷",
            "recipes": [
                "recipe_617_1",
                "recipe_618_1",
                "recipe_619_1",
                "recipe_620_1",
                "recipe_621_1",
                "recipe_622_1",
                "recipe_623_1",
                "recipe_624_1",
                "recipe_625_1"
            ],
            "desc": "强制目标攻击自身，并使自身获得3层持续3秒的“风吹荷”效果：外功闪避几率提高100%，闪避1次攻击后消失（每0.5秒最多消失1层）。",
            "belong_key": "belong_1665"
        },
        "25017": {
            "name": "岫烟",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "desc": "对定身、眩晕、击倒的目标造成伤害提高30%。",
            "belong_key": "belong_25017"
        },
        "14605": {
            "name": "如风",
            "recipes": [
                "recipe_6025_1"
            ],
            "desc": "“啸日”不再解除控制，调息时间以及附带“啸日”气劲降低50%，施展“啸日”使自身加速率提高8%，威胁值降低10%，持续10秒，且任何外功招式会心都会使该效果持续时间延长5秒。",
            "belong_key": "belong_14605"
        },
        "5963": {
            "name": "浮云",
            "recipes": [
                "recipe_4417_1"
            ],
            "desc": "“风来吴山”连续命中目标4次后或“云飞玉皇”命中目标，使目标获得一层持续8秒的6%的治疗吸收盾最多8层。",
            "belong_key": "belong_5963"
        },
        "1655": {
            "name": "探梅",
            "desc": "若目标为队友，解除其受到的控制效果（击倒除外）并使其3秒内免疫控制效果，且获得化解自身最大气血值25%伤害的护盾，同时目标和自身移动速度提高20%，持续10秒，若目标为敌人，则对目标的目标施展。<TALENT 5950 1 施展后使你和目标受到的伤害降低20%，持续8秒><TALENT 5949 1 施展后使你和目标的移动速度提高40%，持续8秒>",
            "belong_key": "belong_1655"
        },
        "6537": {
            "name": "斩岳",
            "desc": "“峰插云景”成功命中目标则立刻重置“云飞玉皇”“鹤归孤山”调息时间。",
            "belong_key": "belong_6537"
        }
    },
    "10175": {
        "2226": {
            "name": "蛊虫献祭",
            "recipes": [
                "recipe_732_1",
                "recipe_733_1",
                "recipe_734_1",
                "recipe_735_1",
                "recipe_736_1",
                "recipe_737_1",
                "recipe_738_1"
            ],
            "buffs": [
                2543
            ],
            "desc": "五毒用秘法将自带的毒虫献祭，该招式可以在被控制时施展。献祭将解除自身控制效果，并自身免疫控制（击退和被拉除外）持续4秒，期间首次释放宠物不占用基础调息时间，造成的威胁值降低40%，持续10秒。同时附加效果：\\n圣蝎献祭：8秒内自身技能调息速度提高30%。\\n玉蟾献祭：使主人获得一个护盾，吸收自身气血最大值20%的伤害，持续8秒。\\n灵蛇献祭：使主人毒性内功基础攻击力、基础疗伤成效提高50%，持续12秒。\\n风蜈献祭：获得4秒逐渐衰减的80%移速。\\n天蛛献祭：使主人招式施展距离增加5尺，持续5秒。\\n碧蝶献祭：使主人4秒内被蝴蝶簇拥持续回复<SUB 18884 0>气血值并使下一个疗伤效果会心几率提高100%，持续10秒。<TALENT 14864 1 “百足”会心几率提高10%，会心效果提高10%。施展“蛊虫献祭”后立刻重置“百足”调息时间><TALENT 14861 1 施展后，使自身受到的伤害降低40%，持续4秒><TALENT 6035 1 施展后解除小队成员的控制效果，每1分钟触发1次><TALENT 6033 1 施展后不献祭毒虫，获得毒虫的献祭效果，每2分钟触发一次><TALENT 6878 1 施展“蛊虫献祭”后释放的第一个“千劫万毒手”套路招式会同时释放对应蛊虫的主动技能，该效果不受奇穴修饰><TALENT 2961 1 施展后使下1次“冰蚕牵丝”无需运功><TALENT 2961 2 施展后使下2次\"冰蚕牵丝\"无需运功><EnchantID 10085 献祭蝴蝶后获得“化蝶”效果，每2秒治疗周围半径8尺内的最多6名友方玩家，持续10秒><TALENT 18883 1 在非战斗状态下施展“碧蝶引”则返还招式调息时间。献祭“碧蝶”后，蝴蝶不再簇拥自身产生治疗而是在脚下生成一个半径8尺的蝶池，每秒回复范围内最多10个友方目标<SUB 18884 0>气血值，持续4秒><TALENT 18311 1 调息时间降低2秒，施展后立即重置所有宠物技能调息时间。“蛊虫献祭”后30秒内首次施展召唤宠物招式，额外获得一次对应的献祭宠物的效果><TALENT 23456 1 “蛊虫献祭”或宠物死亡时重置宠物的调息时间。“蛊虫献祭”的内力消耗降低100%><TALENT 30088 1 施展“蛊虫献祭”后自身获得“嗜蛊”效果，持续40秒。“嗜蛊”效果持续期间自身攻击无视目标60%内功防御等级，无双等级提高30%，并且成功运功“蝎心”会对目标6尺内额外五个目标造成伤害><TALENT 33576 1 “蛊虫献祭”调息时间降低2秒，施展后立即重置所有宠物技能调息时间，“蛊虫献祭”免疫控制效果期间自身受到治疗效果提高40%且自身施展“女娲补天”不占用基础调息时间><TALENT 42306 1 召唤蛊虫时获得一次对应的献祭宠物的效果，“蛊虫献祭”不再获得附加效果>",
            "belong_key": "belong_2226"
        },
        "2211": {
            "name": "蛇影",
            "recipes": [
                "recipe_762_1",
                "recipe_763_1",
                "recipe_764_1",
                "recipe_765_1",
                "recipe_766_1",
                "recipe_767_1",
                "recipe_768_1"
            ],
            "dots": {
                "2296": [
                    6237
                ]
            },
            "desc": "回复自身15%内力值，使目标<BUFF 2296 0 desc>(+<SKILLEx {D0} {TotalPoisonAP 0.2731}>)，持续<BUFF 2296 0 time>。\\n若目标带有以下三种蛊其中之一，将触发特定的蛊毒效果：\\n迷心蛊：使目标移动速度额外降低10%，持续12秒。\\n枯残蛊：使目标移动速度额外降低15%，持续12秒。\\n夺命蛊：使目标移动速度额外降低20%，持续12秒。<TALENT 6630 1 命中携带“灵蛊”效果的目标，使其周围6尺范围内4个目标受到“蛇影”不利效果><TALENT 2948 3 招式及其触发的夺命蛊毒伤害提高6%><TALENT 25040 1 “蛇影”持续时间提高4秒，“灵蛇”攻击“蛇影”目标将提升30%的会心几率><TALENT 28393 1 “蛇影”持续期间降低目标10%内外功基础攻击力，该效果同时只能作用一个目标。“灵蛇”的“幻击”会使“蛇涎”效果提高到20%><TALENT 37351 1 带有自身“蛇影”效果的目标被触发“万毒”时，会额外添加一个6秒的持续性伤害效果><TALENT 34640 1 “蛇影”持续不利效果可叠加两层，并且每次被驱散或者转移时，只会被作用一层><TALENT 40617 1 “蛇影”和“蟾啸”不再触发“蛊毒”效果，受攻击力加成提高60%><TALENT 42309 1 “蛇影”可以叠加两层，每次被卸除只会卸除一层，“灵蛇”的主动技能替换为“腾影”：化身巨蟒虚影扑向20尺内目标并击飞6尺范围内的5个目标，对其造成毒性伤害，同时使目标身上属于自身的“蛇影”效果立即生效>",
            "belong_key": "belong_2211"
        },
        "2212": {
            "name": "百足",
            "recipes": [
                "recipe_769_1",
                "recipe_770_1",
                "recipe_771_1",
                "recipe_772_1",
                "recipe_773_1",
                "recipe_774_1",
                "recipe_775_1",
                "recipe_776_1"
            ],
            "dots": {
                "2509": [
                    6238
                ]
            },
            "skills": [
                13472
            ],
            "desc": "对指定区域施放风蜈之毒，使6尺半径区域内最多5个目标立即受到<SUB 13472 0>毒性伤害，并使这些目标<BUFF 2509 0 desc>(+<SKILLEx {D0} {TotalPoisonAP 0.3838}>)，持续<BUFF 2509 0 time>。\\n若目标带有以下三种蛊其中之一，将触发特定的蛊毒效果：\\n迷心蛊：使目标锁足4秒，且任何形式的疗伤对目标产生的成效降低50%，持续4秒。\\n枯残蛊：使目标锁足5秒，且任何形式的疗伤对目标产生的成效降低50%，持续6秒。\\n夺命蛊：使目标锁足6秒，且任何形式的疗伤对目标产生的成效降低50%，持续8秒。<TALENT 6016 1 锁足目标2秒><TALENT 6623 1 每命中给一个目标，回复自身0.5%气血最大值><TALENT 18330 1 调息时间降低2秒，持续效果作用间隔缩短1秒，总持续时间保持不变><TALENT 30572 1 “百足”作用目标增加1个，首跳造成的伤害提高100%，且“百足”持续效果每跳造成的效果衰减6%>",
            "belong_key": "belong_2212"
        },
        "2210": {
            "name": "蟾啸",
            "dots": {
                "2295": [
                    6236
                ]
            },
            "desc": "使目标及其8尺周围内的最多8个目标<BUFF 2295 0 desc>(+<SKILLEx {D0} {TotalPoisonAP 0.2674}>)，持续<BUFF 2295 0 time>；可以打断目标运功，命中运功目标使其无法使用内功招式，持续4秒。\\n若目标带有以下三种蛊其中之一，将触发特定的蛊毒效果：\\n迷心蛊：打断目标运功并使其落马，无法施展内功招式持续1秒。\\n枯残蛊：打断目标运功并使其落马，无法施展内功招式持续1.5秒。\\n夺命蛊：打断目标运功并使其落马，无法施展内功招式持续2秒。<TALENT 20538 1 “玉蟾”存在期间，施展“蟾啸”重置“蟾躁”><TALENT 18306 1 “玉蟾”存在时“毒经”心法下施展“蟾啸”；“补天诀”心法下施展“圣手织天”“玉蟾”会产生共鸣，使“玉蟾”附近12尺范围内最多5个友方目标获得5%最大气血值伤害吸收盾，并使其受到的“锁足”“定身”“眩晕”“击倒”控制效果持续时间降低30%，持续4秒><TALENT 40617 1 “蛇影”和“蟾啸”不再触发“蛊毒”效果，受攻击力加成提高60%><TALENT 42180 1 “蟾啸”调息时间提高18秒，蛊毒效果变为：无法施展内外功招式持续3秒>",
            "belong_key": "belong_2210"
        },
        "10175": {
            "name": "毒经",
            "attributes": {
                "pve_addition_base": 205,
                "magical_shield_base": 3913,
                "physical_shield_base": 2850,
                "spirit_to_poison_attack_power": 2079,
                "spirit_to_poison_overcome": 205,
                "max_life_gain": 245,
                "magical_attack_power_base": 7242
            },
            "recipes": [
                "recipe_1711_1",
                "recipe_688_3"
            ],
            "skills": [
                2183,
                32818,
                25773,
                39036
            ],
            "desc": "苗疆绝学，五仙教历代前辈传下的用毒之术精粹。",
            "critical_type": "poison",
            "damage_type": "poison",
            "belong_key": "belong_10175"
        },
        "2209": {
            "name": "蝎心",
            "recipes": [
                "recipe_791_1",
                "recipe_792_1",
                "recipe_793_1",
                "recipe_794_1",
                "recipe_795_1",
                "recipe_796_1",
                "recipe_797_1"
            ],
            "skills": [
                9331
            ],
            "desc": "对目标造成<SUB 9331 0>毒性伤害。\\n若目标带有以下三种蛊其中之一，将触发特定的蛊毒效果：\\n迷心蛊：使目标眩晕3秒，15秒内最多触发一次。\\n枯残蛊：使目标眩晕3.5秒，15秒内最多触发一次。\\n夺命蛊：使目标眩晕4秒，15秒内最多触发一次。<TALENT 6618 1 可以在移动中施展，伤害提高10%。若命中没有自身持续不利效果的目标则额外造成一次伤害><TALENT 6622 1 会心提高10%，会心效果提高10%><TALENT 2935 3 伤害提高15%><TALENT 2939 1 运功时间降低0.125秒><TALENT 2939 2 运功时间降低0.25秒><TALENT 2948 1 招式及其触发的夺命蛊毒伤害提高2%><TALENT 2948 2 招式及其触发的夺命蛊毒伤害提高4%><TALENT 6030 1 命中夺命蛊后自己加速率提高10%，每秒回复1%内力，持续6秒，每30秒触发一次><TALENT 6031 1 命中“迷心蛊”的目标后，使目标周围6尺范围的2个目标眩晕><TALENT 6632 1 命中“灵蛊”效果目标伤害提高30%，并回复宠物5%气血最大值，且每次施展非“蝎心”的“千劫万毒手”套路招式会使下一次成功运功“蝎心”伤害提高60%><EnchantID 10083 毒经心法下，成功吟唱\"蝎心\"，为所有小队成员回复\"蝎心\"伤害5%的血量。><EnchantID 10084 毒经心法下，成功吟唱“蝎心”，若目标存在自身的“蛇影”、“百足”、“蟾啸”持续伤害效果，每个持续伤害使蝎心伤害提高15%。><TALENT 38455 1 伤害提高40%，运功“蝎心”招式命中非侠士目标后使目标身上已有的属于自身“千劫万毒手”套路的持续不利效果立即额外造成一跳伤害，且获得“残香”效果：下一次施展除“蝎心”外的“千劫万毒手”套路招式时返还6秒的调息时间并造成一次额外伤害，该效果最多可叠加两层><TALENT 40067 1 “蝎心”命中玩家目标会使对方获得12秒的“蝎蚀”气劲：下次被自身除“蝎心”外的“千劫万毒手”招式命中后会引爆并造成一段毒性伤害><TALENT 40246 1 释放“冰蚕牵丝”与“蝎心”时会获得“天墟玉”，累积获得五颗后会合成“五色石”：下一次“圣手织天”额外附带3段治疗效果，若命中气血值达最大值的目标，则该治疗效果会作用于20尺范围内气血值最少的队友><TALENT 37351 1 带有自身“蛇影”效果的目标被触发“万毒”时，会额外添加一个6秒的持续性伤害效果><TALENT 42211 1 “蝎心”运功时间减少0.75秒，施展距离提高5尺，“毒体”期间施展“蝎心”可延长一秒“毒体”的持续时间，最多延长3次>",
            "belong_key": "belong_2209"
        },
        "2213": {
            "name": "千丝",
            "recipes": [
                "recipe_1701_1",
                "recipe_1702_1",
                "recipe_1703_1",
                "recipe_1704_1",
                "recipe_1705_1",
                "recipe_1706_1",
                "recipe_1707_1",
                "recipe_1708_1"
            ],
            "skills": [
                13474
            ],
            "desc": "对目标造成<SUB 13474 0>毒性伤害，并使其<BUFF 2297 1 desc>，持续<BUFF 2297 1 time>。\\n若目标带有以下三种蛊其中之一，将触发特定的蛊毒效果：\\n迷心蛊：使目标无法施展任何轻功，持续3秒。\\n枯残蛊：使目标无法施展任何轻功，持续3.5秒。\\n夺命蛊：使目标无法施展任何轻功，持续4秒。<TALENT 6022 1 使目标周围6尺内的2个目标获得减速效果><TALENT 6021 1 伤害提高100%，刷新目标的“蛇影”效果，但不再造成减速效果><TALENT 6624 1 伤害提高50%，减速效果提高15%><TALENT 21819 1 每释放两次后15秒内的下一个“千丝”可对目标范围释放，释放后从天而降一个巨大的蜘蛛，并吐出一个半径7尺的蛛网，范围内敌对目标移动速度降低60%，敌对侠士目标受到范围类伤害提高10%，并且无法施展轻功，持续4秒，4秒后蜘蛛自爆，对7尺范围内敌对目标造成<SUB 21821 1>毒性伤害，网内的目标会被拉向蛛网中心并封轻功4秒>",
            "belong_key": "belong_2213"
        },
        "42288": {
            "name": "虫魄",
            "skills": [
                42277
            ],
            "desc": "每种“千劫万毒手”招式命中时会获得对应“虫魄”，集齐五种时会自动消耗所有“虫魄”并对目标造成5段<SUB 42277 0>毒性伤害与破招伤害。<TALENT 42292 1 “虫魄”会对目标10尺范围最多3个目标造成伤害><TALENT 42293 1 “引魂蛊术”招式命中敌方目标后自身会获得1层“XX”，最多6层。触发“虫魄”时会消耗所有“XX”，对目标造成基于层数的额外毒性伤害和破招伤害><TALENT 42180 1 “蟾啸”调息时间提高18秒，蛊毒效果变为：无法施展内外功招式持续3秒>",
            "belong_key": "belong_42288"
        },
        "18584": {
            "name": "灵蛊",
            "recipes": [
                "recipe_746_1",
                "recipe_747_1",
                "recipe_748_1",
                "recipe_749_1",
                "recipe_750_1",
                "recipe_751_1",
                "recipe_752_1",
                "recipe_753_1"
            ],
            "skills": [
                18590
            ],
            "desc": "消耗内力对一名敌方目标施种“迷心蛊”，若敌方目标已有“迷心蛊”效果则施种“枯残蛊”，若敌方目标已有“枯残蛊”效果则施种“夺命蛊”“蛊毒”效果持续2分钟，“蛊毒”能被【千劫万毒手】套路下的五种毒素激发，额外受到各种控制效果。可以打断目标内功运功，命中运功目标使其无法使用内功招式，持续4秒，20秒充能时间。<TALENT 18689 1 “灵蛊”可对自身、队友或者团队成员释放，使其免疫控制（击退和被拉除外），侠士目标受到的伤害降低30%，持续4秒。最多叠加到20秒。若对没有“迷心蛊”、“枯残蛊”、“夺命蛊”的敌方目标施展“灵蛊”则返还10秒调息时间><TALENT 18691 1 调息时间增加10秒，可对自身、队友或者团队成员释放，使其免疫控制（击退和被拉除外）且侠士目标受到的伤害降低20%，持续5秒。最多叠加到20秒><TALENT 6880 1 恢复自身20%内力最大值><TALENT 32746 1 施展“灵蛊”后3秒内自身施展“蝎心”无需运功，且不会使自身获得“蝎毒”不利效果。且若该次“蝎心”成功眩晕目标则使目标“蝎心”眩晕期间受到的伤害增加15%><TALENT 34388 1 “引魂蛊术”套路招式命中敌对目标使自身恢复10%内力最大值，若命中带有“夺命蛊”效果的目标则6秒内“引魂蛊术”套路招式伤害提高15%><TALENT 40069 1 施展距离增加5尺，每触发两次“万毒”会给目标添加一层“蛊毒”效果并减少“灵蛊”4秒调息时间>",
            "belong_key": "belong_18584"
        },
        "2223": {
            "name": "灵蛇引",
            "skills": [
                2472,
                2477
            ],
            "desc": "释放你的灵蛇。<TALENT 6025 1 灵蛇的会心攻击都有30%几率使主人小队成员内功会心率提高10%，持续5秒><TALENT 6024 1 灵蛇的攻击能够降低自身的召唤调息时间1秒，最多降低15秒><TALENT 18325 1 “灵蛇”招式“幻击”施展距离提高至15尺。“灵蛇引”不再立即召唤宠物，而是使宠物残影附身在自身身上，宠物攻击距离提高10尺，伤害提高40%，自身伤害提高10%，移动速度提高20%，持续10秒，10秒后分离><TALENT 22986 1 “灵蛇”攻击若会心，则使自身下一次伤害招式附带一次额外伤害>",
            "belong_key": "belong_2223"
        },
        "2225": {
            "name": "天蛛引",
            "skills": [
                2474
            ],
            "desc": "释放你的天蛛。<TALENT 18690 1 存在期间，小队成员受到攻击有10%几率使目标定身2秒>",
            "belong_key": "belong_2225"
        },
        "2222": {
            "name": "玉蟾引",
            "skills": [
                2471
            ],
            "desc": "释放你的玉蟾。<TALENT 2941 1 玉蟾攻击命中目标有15%几率能使主人小队成员获得减少20%威胁的气劲，持续10秒><TALENT 6015 1 玉蟾攻击命中目标有30%几率能使主人小队成员获得减少20%威胁的气劲，持续10秒>",
            "belong_key": "belong_2222"
        },
        "2221": {
            "name": "圣蝎引",
            "skills": [
                2470
            ],
            "desc": "释放你的圣蝎。",
            "belong_key": "belong_2221"
        },
        "2224": {
            "name": "风蜈引",
            "skills": [
                2473
            ],
            "desc": "释放你的风蜈。",
            "belong_key": "belong_2224"
        },
        "32753": {
            "name": "寂灭蛊",
            "skills": [
                32759
            ],
            "desc": "施展蛊术链接自身与蛊虫，3秒内每0.5秒对自身与蛊虫6尺范围最多3个敌方玩家造成<SUB 32759 1>伤害，每跳延长目标身上属于自己的持续不利伤害效果1跳，效果结束后会将范围内的敌方目标拉至中心位置。期间自身免疫控制、免疫打断、打退、无法运功、缴械效果，可以施展二段招式催动蛊术与50尺内的蛊虫互换位置。该招式视为“引魂蛊术”套路招式。<TALENT 42902 1 >",
            "belong_key": "belong_32753"
        },
        "34654": {
            "name": "怀泽蛊",
            "desc": "为一名敌方玩家施种持续6秒的“怀泽蛊”并附带6秒<NounID 21>效果，若施种目标为治疗心法，则在6秒后激活二段招式“大荒泽域”：持续25秒，每秒使目标叠加一层<NounID 20>效果并对6尺内最多5个敌方玩家目标造成一次毒性内功伤害。该招式视为“引魂蛊术”套路招式。",
            "belong_key": "belong_34654"
        },
        "25043": {
            "name": "连缘蛊",
            "buffs": [
                19513
            ],
            "skills": [
                25044,
                30918
            ],
            "desc": "运功每0.312秒对目标造成<SUB 25044 0>毒性内功伤害，持续期间不被打退、打断、不受无法施展内功招式和缴械效果的影响，自身免疫控制，持续1.56秒。目标每存在一个自身持续伤害，则伤害额外提高80%，最多提高320%。每跳降低自身“玄水蛊”1.5秒的调息时间。若完整运功则将额外对目标造成一次基于自身持续伤害数量的伤害。该招式视为“引魂蛊术”套路招式。",
            "belong_key": "belong_25043"
        },
        "42174": {
            "name": "降厄",
            "skills": [
                42222
            ],
            "desc": "施展后进入6.5秒<NounID 57>状态，每次触发“虫魄”降低5秒“降厄”调息时间。<TALENT 42211 1 “蝎心”运功时间减少0.75秒，施展距离提高5尺，“毒体”期间施展“蝎心”可延长一秒“毒体”的持续时间，最多延长3次><TALENT 42183 1 “厄难毒体”期间每1.5秒会以自身为中心释放一次8尺范围的毒波，对最多五个目标造成范围伤害，并使其身上所有来源自身的“千劫万毒手”持续效果立即生效一跳>",
            "belong_key": "belong_42174"
        },
        "38455": {
            "name": "残香",
            "recipes": [
                "recipe_5608_1"
            ],
            "skills": [
                38456
            ],
            "desc": "“蝎心”伤害提高40%，运功“蝎心”招式命中非侠士目标后使目标身上已有的属于自身“千劫万毒手”套路的持续不利效果立即额外造成一跳伤害，且获得<NounID 76>效果。",
            "belong_key": "belong_38455"
        },
        "6877": {
            "name": "生发",
            "desc": "所有宠物的技能的调息时间降低20%，攻击附带50%减速效果，持续4秒。",
            "belong_key": "belong_6877"
        },
        "6620": {
            "name": "蝎毒",
            "dots": {
                "6218": [
                    13476
                ]
            },
            "desc": "“蝎心”不再运功，不再立刻对目标造成伤害，但使目标每2秒受到一次毒性内功伤害，持续12秒。",
            "belong_key": "belong_6620"
        },
        "42211": {
            "name": "节尾",
            "recipes": [
                "recipe_6017_1"
            ],
            "desc": "“蝎心”运功时间减少0.75秒，施展距离提高5尺，“降厄”期间施展“蝎心”可延长一秒“降厄”的持续时间，最多延长3次。<TALENT_CORE 42174 1>",
            "belong_key": "belong_42211"
        },
        "6628": {
            "name": "随风",
            "recipes": [
                "recipe_1268_1"
            ],
            "desc": "“化蝶”后会向前额外冲刺一段距离。",
            "belong_key": "belong_6628"
        },
        "6629": {
            "name": "黯影",
            "recipes": [
                "recipe_1269_1",
                "recipe_1270_1",
                "recipe_1271_1",
                "recipe_1272_1",
                "recipe_2436_1",
                "recipe_4550_1",
                "recipe_3263_1",
                "recipe_5538_1"
            ],
            "skills": [
                34389
            ],
            "desc": "所有持续伤害提高25%，且添加持续伤害的招式命中已有对应持续伤害目标时会额外造成<SUB 34389 0>毒性伤害。",
            "belong_key": "belong_6629"
        },
        "42292": {
            "name": "怀荼",
            "recipes": [
                "recipe_6041_1"
            ],
            "desc": "“虫魄”会对目标10尺范围最多3个目标造成伤害。",
            "belong_key": "belong_42292"
        },
        "30572": {
            "name": "不僵",
            "recipes": [
                "recipe_3071_1"
            ],
            "dots": {
                "22730": [
                    30578
                ],
                "22731": [
                    30579
                ]
            },
            "desc": "“百足”作用目标增加1个，首跳造成的伤害提高100%，且“百足”持续效果每跳造成的效果衰减6%。",
            "belong_key": "belong_30572"
        },
        "37952": {
            "name": "不鸣",
            "skills": [
                37959
            ],
            "desc": "宠物死亡时将对周围10尺最多5个目标造成<SUB 37959 1>毒性伤害，并给其添加“蛇影”“蟾啸”“百足”持续伤害效果。",
            "belong_key": "belong_37952"
        },
        "42902": {
            "name": "毒濛",
            "desc": "“寂灭蛊”与“寂灭蛊·蛊虫”命中目标时添加1层<NounID 99>效果，并为其添加“蛇影”至层数上限。<TALENT_CORE 32753 1>",
            "belong_key": "belong_42902"
        },
        "40617": {
            "name": "忘情",
            "recipes": [
                "recipe_5891_1",
                "recipe_5898_1",
                "recipe_5901_1"
            ],
            "desc": "“蛇影”和“蟾啸”不再触发“蛊毒”效果，持续不利效果时间增加4秒，受攻击力加成提高60%。",
            "belong_key": "belong_40617"
        },
        "42180": {
            "name": "疑蟾",
            "desc": "通过“蟾啸”触发“虫魄”伤害时，立即额外获得一点对应“虫魄”，“蟾啸”调息时间延长13秒，蛊毒效果变为：无法施展内外功招式持续4秒。",
            "belong_key": "belong_42180"
        },
        "30088": {
            "name": "嗜蛊",
            "buffs": [
                22232
            ],
            "skills": [
                30090
            ],
            "desc": "施展“蛊虫献祭”后自身获得“嗜蛊”效果，持续40秒。“嗜蛊”效果持续期间自身攻击无视目标60%内功防御等级，基础攻击力提高5%，无双等级提高30%，并且成功运功“蝎心”会对目标6尺内额外五个目标造成<SUB 30090 0>伤害。",
            "belong_key": "belong_30088"
        },
        "42183": {
            "name": "薄瘴",
            "skills": [
                42217
            ],
            "desc": "“降厄”期间每秒会以自身为中心释放一次8尺范围的毒波，对最多五个目标造成<SUB 42217 0>范围伤害，并使其身上所有来源自身的“千劫万毒手”持续效果立即生效一跳。<TALENT_CORE 42174 1>",
            "belong_key": "belong_42183"
        },
        "42309": {
            "name": "腾影",
            "dots": {
                "25917": [
                    34643
                ]
            },
            "skills": [
                42338
            ],
            "desc": "“蛇影”可以叠加两层，每次被卸除只会卸除一层，“灵蛇”的主动技能替换为“腾影”：扑向20尺内目标并击飞目标6尺范围内的5个目标，对其造成毒性伤害，同时使目标身上属于自身的“蛇影”效果立即生效。",
            "belong_key": "belong_42309"
        },
        "2218": {
            "name": "幻蛊",
            "desc": "将目标定身5秒并使其获得2层“灵蛊”效果，目标定身期间受到的所有伤害提高10%。<TALENT 14860 1 命中有“迷心蛊”效果的目标，使定身效果持续时间增加1秒><TALENT 6646 1 被驱散后，目标无法使用轻功，持续时间为被驱散时剩余时间的3倍><TALENT 6647 1 调息时间降低30秒，并使目标定身期间受到的所有伤害提高10%>",
            "belong_key": "belong_2218"
        },
        "32741": {
            "name": "驭虫",
            "recipes": [
                "recipe_3072_1",
                "recipe_3073_1",
                "recipe_3074_1",
                "recipe_3075_1",
                "recipe_3076_1"
            ],
            "desc": "使自身宠物召唤招式拥有15秒公用调息时间，宠物可以召唤到目标位置并且每次召唤宠物会使自身获得免疫控制效果（推拉除外）和移动速度提高20%，持续6秒。施展招式“蛊虫献祭”时会重置该公用调息时间。",
            "belong_key": "belong_32741"
        },
        "25018": {
            "name": "荒息",
            "skills": [
                25019
            ],
            "desc": "在非战斗状态下施展“灵蛇引”则返还招式调息时间。“凤凰蛊”不再附带重伤起身效果，调息时间降低为30秒，对自身施展，使得自身获得持续3分钟的<NounID 90>效果。",
            "belong_key": "belong_25018"
        },
        "18689": {
            "name": "蛊影",
            "desc": "“灵蛊”释放后自身免疫控制（击退和被拉除外），受到的伤害降低15%，持续6.5秒，该持续时间可以累加。",
            "belong_key": "belong_18689"
        },
        "25027": {
            "name": "蟾噬",
            "desc": "替换“蟾躁”，施展后“玉蟾”可以对团队成员施展，解除其受到的控制效果，将其吞入口中保护，期间“玉蟾”不可移动，持续3秒。",
            "belong_key": "belong_25027"
        },
        "21302": {
            "name": "蛇悉",
            "skills": [
                21303
            ],
            "desc": "“蛇影”变为可移动运功技能，运功1.25秒，调息时间6秒，立即对目标造成<SUB 21303 0>毒性伤害，同时使6秒内下两次施展“蝎心”无需运功。",
            "belong_key": "belong_21302"
        },
        "6652": {
            "name": "蝉蜕",
            "desc": "任何伤害使你的当前气血值低于1%时，若自身存在宠物，则牺牲宠物并解除自身控制，回复自身50%最大气血值，3秒内免疫控制效果，该效果最多每150秒触发一次。",
            "belong_key": "belong_6652"
        },
        "2227": {
            "name": "蛊虫狂暴",
            "buffs": [
                12556,
                2830
            ],
            "desc": "移除自身及小队成员所有控制效果，移动速度提高40%并免疫控制（击退和被拉除外）持续5秒，并使当前宠物恢复全部气血值，气血最大值提高50%，移动速度提高50%，免疫控制（击退和被拉除外），防御等级提高100%，伤害提高50%，持续16秒。自身招式伤害提高10%，加速率提高10%，持续16秒。有宠物时方能施展。",
            "belong_key": "belong_2227"
        },
        "30540": {
            "name": "忘攸蛊",
            "desc": "五毒侠士为自身添加“忘攸蛊”保护自身，最多可持续8秒，“忘攸蛊”持续时间内自身受到的伤害降低50%，并可施展二段招式“忘攸蛊·迭迷”：将“忘攸蛊”对敌方侠士施展，使其移动速度和加速率降低30%，持续4秒，并为目标添加一层“蛊毒”。4秒后“忘攸蛊”毒性会更强，对敌方侠士施展，会使其移动速度和加速率降低60%，持续4秒，且为目标添加两层“蛊毒”。该招式视为“引魂蛊术”套路招式。",
            "belong_key": "belong_30540"
        },
        "6627": {
            "name": "凄切",
            "desc": "宠物招式伤害造成的威胁值提高，宠物攻击目标则自身与宠物恢复5%最大气血值。宠物死亡时回复自身20%最大气血值。",
            "belong_key": "belong_6627"
        },
        "37356": {
            "name": "荒骨",
            "desc": "自身不利效果被卸除时会基于被卸除时的剩余跳数造成额外伤害。",
            "belong_key": "belong_37356"
        },
        "42306": {
            "name": "悸心",
            "recipes": [
                "recipe_6193_1",
                "recipe_6194_1",
                "recipe_6195_1",
                "recipe_6196_1",
                "recipe_6197_1",
                "recipe_6198_1"
            ],
            "desc": "召唤蛊虫不再占用基础调息时间，召唤时获得一次对应的献祭效果，“蛊虫献祭”不再获得附加效果。",
            "belong_key": "belong_42306"
        },
        "37351": {
            "name": "释灵",
            "dots": {
                "28210": [
                    37352
                ]
            },
            "desc": "“蝎心”命中带有自身“蛇影”效果的目标时，会额外添加一个8秒的持续性伤害效果。",
            "belong_key": "belong_37351"
        },
        "18330": {
            "name": "固灵",
            "recipes": [
                "recipe_2500_1"
            ],
            "dots": {
                "12557": [
                    18700
                ],
                "22731": [
                    30579
                ]
            },
            "desc": "“百足”调息时间降低2秒，持续效果作用间隔缩短1秒，总持续时间保持不变。",
            "belong_key": "belong_18330"
        },
        "21819": {
            "name": "蛛魄",
            "recipes": [
                "recipe_6031_1"
            ],
            "skills": [
                21821
            ],
            "desc": "“千丝”调息时间提高9秒，可对目标范围释放，释放后从天而降一个巨大的蜘蛛，并吐出一个半径7尺的蛛网，范围内敌对目标移动速度降低60%，敌对侠士目标受到范围类伤害提高10%，并且无法施展轻功，持续4秒，4秒后蜘蛛自爆，对7尺范围内敌对目标造成<SUB 21821 0>毒性伤害并封轻功4秒。",
            "belong_key": "belong_21819"
        },
        "18312": {
            "name": "蝎噬",
            "desc": "“圣蝎”每攻击一次目标则减少“驭虫奇术”套路下技能调息时间2秒。",
            "belong_key": "belong_18312"
        },
        "42293": {
            "name": "令怖",
            "skills": [
                42295
            ],
            "desc": "“引魂蛊术”招式命中敌方目标后自身会获得1层“令怖”，最多8层。触发“虫魄”时会消耗所有“令怖”，对目标造成基于层数的额外<NounID 13>毒性伤害，该伤害对非侠士目标提高180%。",
            "belong_key": "belong_42293"
        },
        "25038": {
            "name": "二圣",
            "skills": [
                25039,
                36044
            ],
            "desc": "施展“化蝶”，召唤蝴蝶从自身脚底位置扩散，对20尺范围最多5个目标造成<SUB 25039 0>毒性内功伤害，且刷新目标身上属于自身的持续伤害效果时间。并为目标添加“展缓”不利效果，使其6秒后受到和累计移动距离有关的伤害。",
            "belong_key": "belong_25038"
        },
        "6644": {
            "name": "毒手",
            "skills": [
                28717
            ],
            "desc": "“玄水蛊”可以对20尺内的敌方玩家施展，造成<SUB 28717 1>伤害，从自身转移一个减益效果给敌方玩家，并且效果持续期间自身受到的60%伤害将由敌方玩家承担，期间目标气血低于1%或距离超过自身50尺则效果消失。（气血和距离限制不在名剑大会，阵营战场，绝境战场场景生效）",
            "belong_key": "belong_6644"
        },
        "32788": {
            "name": "奇术",
            "skills": [
                40801
            ],
            "desc": "5秒内对不同的玩家添加“蛊毒”会将他们连接起来，持续6秒，对被连接的任一目标添加持续伤害效果时，会对所有链接目标造成<SUB 40801 0>伤害并添加该持续伤害效果，同时有25%几率重置自身“百足”招式调息时间。",
            "belong_key": "belong_32788"
        },
        "38581": {
            "name": "急星",
            "desc": "自身“千劫万毒手”套路招式添加的持续伤害效果间隔时间降低30%，总跳数不变。",
            "belong_key": "belong_38581"
        }
    },
    "10224": {
        "3093": {
            "name": "暴雨梨花针",
            "recipes": [
                "recipe_834_1",
                "recipe_835_1",
                "recipe_836_1",
                "recipe_837_1",
                "recipe_838_1",
                "recipe_840_1",
                "recipe_841_1",
                "recipe_842_1"
            ],
            "buffs": [
                3254,
                7659
            ],
            "skills": [
                3227
            ],
            "desc": "消耗30点神机值，2.19秒内对目标造成5次<SUB 3227 0>外功伤害或<SUB 3228 0>毒性内功伤害。惊羽诀心法下完整运功获得<NounID 67>和<NounID 93>。<TALENT 16953 1 立刻对目标造成一次伤害且使目标无法施展轻功，持续2秒><TALENT 14853 1 可在移动中施展><TALENT 3280 1 会心率提高5%，会心伤害提高10%><TALENT 6887 1 会心率提高20%，会心伤害提高40%><TALENT 6441 1 会心提高10%，会心效果提高10%，暴雨梨花针若会心，则回复30点神机值，该效果最多每8秒触发一次><TALENT 6891 1 能额外造成2次伤害，过程中7次伤害将会逐次提高，同时消耗的神机值提高至50点，完整施展将获得1层“无声”气劲><TALENT 6473 1 完整运功后，使自身外功基础攻击提高30%，威胁值降低20%，无双等级提高15%，持续30秒><TALENT 6459 1 每次命中目标延长“穿心弩”降低目标治疗效果2秒持续时间><TALENT 21838 1 无视目标60%外功防御，能额外造成2次伤害><TALENT 6890 1 命中带有“化血”效果的目标，有70%几率使“化血”下一跳伤害立即生效><TALENT 25141 1 额外消耗30点神机值，若完整运功，额外造成<SUB 25144 1>毒性内功伤害，并使得目标眩晕，持续3秒><TALENT 33118 1 “暴雨梨花针”无视目标40%防御><TALENT 18249 1 化血迷心><TALENT 42472 1 天风汲雨>",
            "belong_key": "belong_3093"
        },
        "3096": {
            "name": "追命箭",
            "recipes": [
                "recipe_851_1",
                "recipe_852_1",
                "recipe_853_1",
                "recipe_854_1",
                "recipe_855_1",
                "recipe_856_1",
                "recipe_857_1",
                "recipe_858_1",
                "recipe_3242_1",
                "recipe_5144_1"
            ],
            "buffs": [
                17103
            ],
            "skills": [
                6920
            ],
            "desc": "消耗40点神机值，对目标造成<SUB 6920 0>外功伤害，附加300%武器伤害，并使目标获得<NounID 66>，该效果最多对一个目标生效。该招式不产生任何威胁，需消耗一枚弩箭。<TALENT 14850 1 无视目标50%外功防御。命中后有50%几率立刻重置“追命箭”调息时间，返还8秒“暴雨梨花针”调息时间，“心无旁骛”期间效果触发几率和触发效果提高至100%><TALENT 5721 1 招式命中70%以上气血的目标额外造成80%伤害><TALENT 5718 1 在“浮光掠影”状态下，额外造成100%伤害><TALENT 5722 1 命中目标后，对自身前方25尺路径上的最多5个目标造成外功伤害，并减速80%，每命中一个目标，调息时间降低2秒。目标每远离自身5尺，路径伤害提高15%><TALENT 6438 1 “追命箭”伤害提高10%，使下个“夺魄箭”无需运功，此效果最多15秒触发一次><TALENT 6874 1 “浮光掠影”效果下，“追命箭”运功时间降低至1秒，自身基础调息时间降低至1秒，每秒获得一层“穷尽九泉”效果，提高“追命箭”10%会心和8%会心效果，“穷尽九泉”叠加至5层后效果翻倍><TALENT 21826 1 神机值消耗降低20点，调息时间降低2秒；施展“追命箭”后使下一招式的神机消耗降低100%><TALENT 5703 1 命中“穿心”效果的目标会心后则使得目标获得一层“穿心”持续伤害效果><TALENT 6454 1 神机值不高于70时，“追命箭”造成伤害提高20%><TALENT 37325 1 调息时间降低6秒，成功施展后获得25点神机值，获得一层的“牢甲利兵”效果：下次“夺魄箭”额外造成110%伤害，可移动施展。“牢甲利兵”效果可叠加两层，持续10秒><TALENT 37324 1 “追命无声”状态下施展后获得“蹑景”效果：下三次非浮光掠影状态下施展的“追命箭”读条时间降低1.5秒，非侠士伤害提高50%、45%、40%><TALENT 21724 1 “追命箭”“夺魄箭”先后连续攻击同一个目标后打出目标标记，6秒内“百步穿杨”套路招式造成伤害时额外造成外功伤害，并延长标记1秒。施展孔雀翎引爆标记并造成5次“掠影穹苍”伤害，降低“百步穿杨”套路招式7秒调息时间><TALENT 40218 1 “百步穿杨”套路招式对20尺目标外侠士额外造成一次“贯天穹”伤害><TALENT 6451 1 施展“心无旁骛”持续时间增加5秒，并且获得20%急速效果，效果期间施展“追命箭”立即重置其调息时间><TALENT 42451 1 施展“逐星箭”额外获得一层“无声”效果并使10秒内下两次“百步穿杨”招式施展距离提高5尺><TALENT 42490 1 “窥影”期间“追命箭”无视目标75%外功防御，完整蓄力“凝形逐踪”后在背后生成一个机关枢甲人，自身施展“追命箭”时机关枢甲人会同步攻击附带一段额外伤害>",
            "belong_key": "belong_3096"
        },
        "3094": {
            "name": "心无旁骛",
            "buffs": [
                3468
            ],
            "desc": "回复全部神机值，并使自身<BUFF 3468 0 desc>，持续<BUFF 3468 0 time>，惊羽诀心法下获得1层无声效果。<TALENT 5739 1 “蚀肌弹”命中后调息时间降低1秒，最多降低30秒><TALENT 6451 1 持续时间增加5秒，加速率提高20%><TALENT 25116 1 期间“逐星箭”使目标被命中几率额外提高20%，持续10秒。>",
            "belong_key": "belong_3094"
        },
        "3098": {
            "name": "穿心弩",
            "recipes": [
                "recipe_859_1",
                "recipe_860_1",
                "recipe_861_1",
                "recipe_862_1",
                "recipe_863_1",
                "recipe_864_1",
                "recipe_866_1",
                "recipe_867_1"
            ],
            "dots": {
                "2237": [
                    3125
                ]
            },
            "desc": "消耗30点神机值，使目标<BUFF 3195 0 desc>，该效果最多对一个人生效，且使目标<BUFF 2237 0 desc>(+<SKILLEx {D0} {TotalPhysicsAP 0.442}>)，持续<BUFF 3195 0 time>，可叠加2层，该招式消耗一枚弩箭，可在移动中施展。对目标造成一次破招伤害。 <TALENT 18874 1 伤害提高15%><TALENT 6775 1 附带的持续伤害效果“穿心”可叠加3层><TALENT 28903 1 “穿心”效果两秒生效一次，效果持续时间增加至22秒，持续时间增加效果无法与同类效果叠加><TALENT 34735 1 “浮光掠影”状态下施展“穿心弩”，使目标额外获得一层”穿心”，并使目标6秒内无法获取持续治疗效果><TALENT 40218 1 “百步穿杨”套路招式对20尺目标外侠士额外造成一次“贯天穹”伤害><TALENT 42451 1 施展“逐星箭”额外获得一层“无声”效果并使10秒内下两次“百步穿杨”招式施展距离提高5尺><TALENT 42490 1 >",
            "belong_key": "belong_3098"
        },
        "10224": {
            "name": "惊羽诀",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "pve_addition_base": 246,
                "strength_to_physical_attack_power": 1731,
                "strength_to_physical_critical_strike": 707,
                "max_life_gain": 245,
                "physical_overcome_base": 9025,
                "physical_attack_power_base": 6187
            },
            "recipes": [
                "recipe_1711_1",
                "recipe_936_2",
                "recipe_937_2",
                "recipe_938_2",
                "recipe_939_2",
                "recipe_940_2",
                "recipe_941_2",
                "recipe_942_2"
            ],
            "skills": [
                3121,
                32884,
                25775,
                43208
            ],
            "desc": "惊羽穿杨连百中，鹰视狼顾壮志雄。唐门无上心法，利用各种奇巧锐器远距离精准打击敌人，使其插翅难飞。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10224"
        },
        "3091": {
            "name": "孔雀翎",
            "recipes": [
                "recipe_827_1",
                "recipe_828_1",
                "recipe_829_1",
                "recipe_830_1",
                "recipe_831_1",
                "recipe_832_1",
                "recipe_833_1"
            ],
            "skills": [
                3222
            ],
            "desc": "消耗20点神机值，对目标造成<SUB 3222 0>外功伤害或<SUB 3223 0>毒性内功伤害，使目标<BUFF 3226 0 desc>，持续<BUFF 3226 0 time>。<TALENT 16902 1 调息时间降低8秒，不再消耗神机值><TALENT 18237 1 使目标锁足4秒并标记目标，若目标4秒内若受到的伤害超过最大血量的30%，则触发虚弱效果，减速封轻功，基础内外功攻击力和基础治疗效果降低50%，持续5秒><TALENT 18241 1 卸除当前目标的阴性、阳性、毒性、混元气劲各两个><TALENT 21732 1 使目标锁足4秒并标记目标，若目标4秒内若受到的伤害超过最大血量的30%，则触发虚弱效果，减速封轻功，基础内外功攻击力和基础治疗效果降低50%，持续5秒><TALENT 30721 1 施展“孔雀翎”后标记目标8秒，千机变攻击标记目标时消耗“鬼斧弹药”则返还><TALENT 28904 1 命中有自身“穿心”效果目标后，使目标获得一层“穿心”效果持续时间并使得目标受到的剩余“穿心”伤害提高15%，“穿心”效果被刷新后该效果消失><TALENT 34679 1 施展“孔雀翎”后，在目标脚下生成“雀引”机关，并在2秒之后激活，若8尺范围内有敌对目标则对其造成伤害并定身4秒且附带18秒持续伤害效果><TALENT 30724 1 “激射”效果上限提高10层，施展“孔雀翎”可以把30尺内10个目标的“激射”标记转移至一个目标身上>",
            "belong_key": "belong_3091"
        },
        "3095": {
            "name": "夺魄箭",
            "recipes": [
                "recipe_843_1",
                "recipe_844_1",
                "recipe_845_1",
                "recipe_846_1",
                "recipe_848_1",
                "recipe_849_1",
                "recipe_850_1",
                "recipe_3243_1"
            ],
            "skills": [
                42439
            ],
            "desc": "消耗25点神机值，对目标造成<SUB 42439 1>外功伤害，附加200%武器伤害。每次施展获得一层<NounID 67>。该招式消耗一枚弩箭。<TALENT 6436 1 伤害提高10%><TALENT 6437 1 会心提高10%，会心效果提高10%><TALENT 5703 1 命中“穿心”效果的目标会心后则使得目标获得一层“穿心”持续伤害效果><TALENT 5705 1 伤害提高10%><TALENT 3274 3 伤害提高6%><TALENT 3273 1 每施展6次“夺魄箭”将使下一次“追命箭”无需运功><TALENT 5704 1 每施展3次“夺魄箭”将使下一次“追命箭”无需运功><TALENT 21724 1 “追命箭”“夺魄箭”先后连续攻击同一个目标后打出目标标记，6秒内“百步穿杨”套路招式造成伤害时额外造成外功伤害，并延长标记1秒。施展孔雀翎引爆标记并造成5次“掠影穹苍”伤害，降低“百步穿杨”套路招式7秒调息时间><TALENT 25118 1 施展“夺魄箭”命中自身“穿杨”效果目标，额外使得目标化劲等级额外降低10%并刷新“穿杨”效果持续时间，最多额外降低20%><EnchantID 10068 “夺魄箭”伤害提高30%，每次命中目标使“追命箭”调息时间降低1秒，目标血量每降低10%，”追命箭”伤害提高10%。><TALENT 40218 1 “百步穿杨”套路招式对20尺目标外侠士额外造成一次“贯天穹”伤害><TALENT 42451 1 施展“逐星箭”额外获得一层“无声”效果并使10秒内下两次“百步穿杨”招式施展距离提高5尺>",
            "belong_key": "belong_3095"
        },
        "3097": {
            "name": "裂石弩",
            "skills": [
                6483
            ],
            "desc": "消耗20点神机值，对目标及其周围4尺内最多9个目标造成<SUB 6483 0>外功伤害，附加100%武器伤害。该招式消耗一枚弩箭。<TALENT 6446 1 施展“裂石弩”能获得一层“无声”气劲><TALENT 6449 1 只对当前目标造成伤害，伤害提高10%，并附带“穿心”效果，神机值消耗降低15点><TALENT 40218 1 “百步穿杨”套路招式对20尺目标外侠士额外造成一次“贯天穹”伤害><TALENT 42451 1 施展“逐星箭”额外获得一层“无声”效果并使10秒内下两次“百步穿杨”招式施展距离提高5尺>",
            "belong_key": "belong_3097"
        },
        "3101": {
            "name": "逐星箭",
            "recipes": [
                "recipe_1661_1",
                "recipe_1662_1",
                "recipe_1663_1",
                "recipe_1664_1",
                "recipe_1665_1",
                "recipe_1667_1",
                "recipe_1668_1"
            ],
            "skills": [
                3187
            ],
            "desc": "对目标造成<SUB 3187 0>外功伤害，附加100%武器伤害，自身获得1层<NounID 67>。若目标在10尺之外，则击退目标并锁足3秒。该招式消耗一枚弩箭。<TALENT 6733 1 恢复30点神机><TALENT 6776 1 命中“锁足”、“眩晕”的目标额外造成一次伤害效果><TALENT 3274 3 伤害提高6%><TALENT 18248 1 若目标在十尺内，则自身受到伤害降低25%，持续6秒，且额外返还5秒雷震子调息时间><TALENT 28363 1 命中目标后附带12秒“逐星”持续伤害效果><TALENT 28366 1 施展后减少1秒“百步穿杨”套路招式调息时间，减少2秒“心无旁骛”调息时间><TALENT 28904 1 命中有自身“穿心”效果目标后，使目标获得一层“穿心”效果持续时间并使得目标受到的剩余“穿心”伤害提高15%，“穿心”效果被刷新后该效果消失><TALENT 28903 1 命中“穿心”目标后造成一次额外伤害><TALENT 28599 1 伤害提高100%，击退结束后使目标5尺范围的敌方目标获得一层重创><TALENT 40217 1 对“眩晕”，“定身”的目标造成4次伤害><TALENT 40218 1 “百步穿杨”套路招式对20尺目标外侠士额外造成一次“贯天穹”伤害><TALENT 42451 1 施展“逐星箭”额外获得一层“无声”效果并使10秒内下两次“百步穿杨”招式施展距离提高5尺>",
            "belong_key": "belong_3101"
        },
        "34644": {
            "name": "敛影无锋",
            "skills": [
                25133,
                33870
            ],
            "desc": "施展后，选择一个“凝形逐踪”“百里追魂”“流火连星”18秒内使用。选出的招式独立调息时间且比原调息时间长6秒。",
            "belong_key": "belong_34644"
        },
        "30588": {
            "name": "凝形逐踪",
            "desc": "使自身进入追踪状态标记目标，蓄力0.75秒。锁定目标并使自身进入“窥影”5秒，获得一层“追命无声”效果。每蓄力0.18秒消耗10点神机值上限，增加标记目标时间和自身“窥影”时间1秒。“窥影”：“追命箭”无调息，可移动施展，神机值消耗降低20点。施展“夺魄箭”“追命箭”“穿心弩”运功时间降低0.5，2，0.5秒，自身基础调息时间降低至1秒，每次攻击锁定目标后，增加3尺伤害招式施展距离。“窥影”效果对非标记目标效果施展后消失。<TALENT 42490 1 “窥影”期间“追命箭”无视目标75%外功防御，完整蓄力“凝形逐踪”后在背后生成一个机关枢甲人，自身施展“追命箭”时机关枢甲人会同步攻击附带一段额外伤害>",
            "belong_key": "belong_30588"
        },
        "25132": {
            "name": "流火连星",
            "skills": [
                25133
            ],
            "desc": "投掷暗器命中目标1秒后爆炸，在目标8尺范围对最多额外3个目标造成<SUB 25133 0>外功伤害，使下1跳“穿心”效果立即生效，并附带“爆裂”效果，爆裂效果将在1秒延迟后再次引爆，对周围8尺范围最多额外3个目标再次造成<SUB 25133 0>外功伤害，并使目标获得1层“重创”效果。",
            "belong_key": "belong_25132"
        },
        "18672": {
            "name": "百里追魂",
            "skills": [
                33870
            ],
            "desc": "使自身进入狙击状态，蓄力4次总计1.25秒，蓄力期间免疫打断，沉默，控制，对目标点范围最多3个目标造成最少<SUB 33870 1>外功伤害，最多<SUB 33870 4>外功伤害，蓄力时间越长，伤害越高且范围越小。每蓄力1次，会心提高22.5%，无视目标25%外功防御。该招式视为“百步穿杨”套路招式该招式消耗一枚弩箭。在攻防和据点环境伤害降低40%。<TALENT 42451 1 施展“逐星箭”额外获得一层“无声”效果并使10秒内下两次“百步穿杨”招式施展距离提高5尺>",
            "belong_key": "belong_18672"
        },
        "5721": {
            "name": "百步穿杨",
            "recipes": [
                "recipe_1195_1",
                "recipe_4599_1"
            ],
            "skills": [
                3291
            ],
            "desc": "“追命箭”命中70%以上气血的目标，将额外造成80%的伤害。",
            "belong_key": "belong_5721"
        },
        "6438": {
            "name": "惊心裂胆",
            "recipes": [
                "recipe_1201_1"
            ],
            "desc": "“追命箭”伤害提高10%，使下个“夺魄箭”无需运功，该效果可以叠加两层。",
            "belong_key": "belong_6438"
        },
        "42927": {
            "name": "寒江夜雨",
            "buffs": [
                32054
            ],
            "desc": "在自身“飞星遁影”范围内时，自身最终伤害提高10%。",
            "belong_key": "belong_42927"
        },
        "3115": {
            "name": "荆天棘地",
            "recipes": [
                "recipe_907_1",
                "recipe_908_1",
                "recipe_909_1",
                "recipe_910_1",
                "recipe_911_1",
                "recipe_912_1",
                "recipe_913_1"
            ],
            "skills": [
                3220
            ],
            "desc": "消耗15点神机值，对目标发射一个荆棘机关，使其受到<SUB 3220 0>外功伤害或<SUB 3221 0>毒性内功伤害，并使周围最多5个目标获得“荆天棘地”效果：外功命中降低100%，内功造成伤害降低100%，持续<BUFF 3215 0 time>。外功命中降低，内功造成伤害降低效果每秒递减10%。",
            "belong_key": "belong_3115"
        },
        "21724": {
            "name": "掠影穹苍",
            "skills": [
                22789
            ],
            "desc": "“追命箭”“夺魄箭”先后连续攻击同一个目标后打出目标标记，6秒内“百步穿杨”套路招式造成伤害时额外造成外功伤害，并延长标记1秒。施展孔雀翎引爆标记并造成5次“掠影穹苍”伤害，降低“百步穿杨”套路招式7秒调息时间。",
            "belong_key": "belong_21724"
        },
        "6775": {
            "name": "摧心",
            "dots": {
                "12663": [
                    18815
                ]
            },
            "desc": "“穿心弩”附带的持续伤害效果“穿心”可叠加3层，“流火连星”再次引爆时立即生效2跳“穿心”。<TALENT_CORE 25132 1>",
            "belong_key": "belong_6775"
        },
        "40218": {
            "name": "贯天穹",
            "skills": [
                40221
            ],
            "desc": "“百步穿杨”套路招式对20尺目标外侠士额外造成一次“贯天穹”伤害。",
            "belong_key": "belong_40218"
        },
        "3092": {
            "name": "梅花针",
            "desc": "若目标正在运功则进行打断，并使其<BUFF 3227 0 desc>，持续<BUFF 3227 0 time>。“浮空”期间不可施展。",
            "belong_key": "belong_3092"
        },
        "42449": {
            "name": "避锐击惰",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "desc": "对锁足，眩晕状态的目标伤害提高15%。",
            "belong_key": "belong_42449"
        },
        "37324": {
            "name": "蹑景追风",
            "buffs": [
                28225,
                28226,
                28227
            ],
            "desc": "“追命无声”状态下施展“追命箭”后获得“蹑景”效果：下3次非浮光掠影状态下施展的“追命箭”读条时间降低1.5秒并可移动施展，非侠士伤害提高50%、45%、40%。",
            "belong_key": "belong_37324"
        },
        "6449": {
            "name": "裂石穿云",
            "desc": "“裂石弩”只对当前目标造成伤害，伤害提高10%，并附带“穿心”持续伤害效果。",
            "belong_key": "belong_6449"
        },
        "25119": {
            "name": "储锋锐",
            "recipes": [
                "recipe_5201_1"
            ],
            "buffs": [
                18036
            ],
            "skills": [
                25121
            ],
            "desc": "强化“弩箭制造”招式，不再制作普通弩箭，每次运功1.5秒，制造出10枚“锋锐”，每层“锋锐”提高武器伤害40%，持续30秒。调息时间30秒。每施展“百步穿杨”套路招式会消耗一枚“锋锐”并造成外功伤害。",
            "belong_key": "belong_25119"
        },
        "14851": {
            "name": "空山独立",
            "buffs": [
                10169
            ],
            "desc": "“百步穿杨”套路招式命中后返还5点神机值。自身半径4尺内没有额外敌对目标，则“百步穿杨”套路招式伤害提高10%。",
            "belong_key": "belong_14851"
        },
        "5719": {
            "name": "绝伦逸群",
            "recipes": [
                "recipe_919_2",
                "recipe_1991_1"
            ],
            "desc": "“浮光掠影”调息时间降低30秒，施展“浮光掠影”获得的“浮光掠影”效果消失后移除移动限制，并使自身免疫移动限制、受到的伤害降低40%，持续4秒。",
            "belong_key": "belong_5719"
        },
        "38676": {
            "name": "嘹然有声",
            "desc": "“飞星遁影”范围内自身获得<NounID 65>，发动“飞星遁影”距离提高10尺，发动后“夺魄箭”“追命箭”可以移动施展，持续10秒。",
            "belong_key": "belong_38676"
        },
        "28904": {
            "name": "鹰扬虎视",
            "dots": {
                "2237": [
                    29148
                ],
                "12663": [
                    29154
                ]
            },
            "desc": "“逐星箭”“孔雀翎”命中有自身“穿心”效果目标后，使目标获得一层“穿心”效果持续时间并使得目标受到的剩余“穿心”伤害提高15%，“穿心”效果被刷新后该效果消失。",
            "belong_key": "belong_28904"
        },
        "38678": {
            "name": "连星逐月",
            "recipes": [
                "recipe_5962_1"
            ],
            "desc": "“飞星遁影”调息时间增加8秒。“飞星遁影”持续期间可以发动2次，发动后只获得2秒“流火飞星”效果，并将“飞星遁影”移动至发动前的位置。",
            "belong_key": "belong_38678"
        },
        "37325": {
            "name": "牢甲利兵",
            "recipes": [
                "recipe_5531_1"
            ],
            "desc": "“追命箭”调息时间降低6秒，成功施展“追命箭”后获得25点神机值，获得一层的“牢甲利兵”效果：下次“夺魄箭”额外造成70%伤害，可移动施展。“牢甲利兵”效果可叠加两层，持续10秒。",
            "belong_key": "belong_37325"
        },
        "6452": {
            "name": "雷动九天",
            "recipes": [
                "recipe_1710_1"
            ],
            "desc": "“雷震子”眩晕时间增加2秒，命中目标后立刻回复20点神机值。若成功眩晕目标，则使目标受到的伤害提高20%。",
            "belong_key": "belong_6452"
        },
        "28905": {
            "name": "临影连星",
            "buffs": [
                3223
            ],
            "desc": "发动“飞星遁影”机关或施展“鸟翔碧空 ”二段招式后，进入“浮光掠影”状态3秒。",
            "belong_key": "belong_28905"
        },
        "42490": {
            "name": "追锋断念",
            "recipes": [
                "recipe_6152_1"
            ],
            "skills": [
                42491
            ],
            "desc": "“追命箭”无视目标50%外功防御，完整蓄力“凝形逐踪”后在背后生成一个机关枢甲人，自身施展“追命箭”时机关枢甲人会同步攻击附带一段额外伤害并降低2秒“穿心弩”调息时间。<TALENT_CORE 30588 1>",
            "belong_key": "belong_42490"
        },
        "18664": {
            "name": "飞鸢逐月",
            "desc": "“鸟翔碧空”浮空期间施展第三段技能，使自身获得浮空剩余时间加3秒的免疫控制效果（击退和被拉除外），移动速度提高50%。",
            "belong_key": "belong_18664"
        },
        "28599": {
            "name": "白雨跳珠",
            "recipes": [
                "recipe_5817_1"
            ],
            "desc": "“逐星箭”伤害提高100%，击退目标的距离提高5尺。",
            "belong_key": "belong_28599"
        },
        "38681": {
            "name": "鸩羽游",
            "desc": "“鸟翔碧空”浮空状态移动速度提高80%。",
            "belong_key": "belong_38681"
        },
        "6874": {
            "name": "穷尽九泉",
            "recipes": [
                "recipe_1474_1",
                "recipe_1501_1"
            ],
            "skills": [
                6921
            ],
            "desc": "“浮光掠影”效果下，“追命箭”运功时间降低至1秒，自身基础调息时间降低至1秒，每秒获得一层“穷尽九泉”效果，提高“追命箭”40%会心和50%会心效果，最多叠加两层。",
            "belong_key": "belong_6874"
        },
        "6473": {
            "name": "千里无痕",
            "desc": "<NounID 93>效果期间外功基础攻击力额外提高10%，无双等级提高15%。",
            "belong_key": "belong_6473"
        },
        "14811": {
            "name": "飞光流转",
            "desc": "“飞星遁影”存在期间，自身受到的伤害降低15%。",
            "belong_key": "belong_14811"
        },
        "34735": {
            "name": "月出惊山",
            "desc": "施展“穿心弩”后使目标获得“穿心”效果至层数上限。",
            "belong_key": "belong_34735"
        },
        "6451": {
            "name": "聚精凝神",
            "recipes": [
                "recipe_1207_1"
            ],
            "buffs": [
                8210
            ],
            "desc": "施展“心无旁骛”持续时间增加5秒，并且获得20%急速效果，效果期间施展“追命箭”立即重置其调息时间。",
            "belong_key": "belong_6451"
        },
        "42451": {
            "name": "穿杨贯柳",
            "buffs": [
                31816
            ],
            "desc": "施展“逐星箭”立即重置“追命箭”调息时间，额外获得一层“追命无声”效果并使10秒内下两次“百步穿杨”招式施展距离提高5尺，伤害提高10%。<TALENT_CORE 18672 1>",
            "belong_key": "belong_42451"
        },
        "28903": {
            "name": "穿林打叶",
            "recipes": [
                "recipe_2632_1",
                "recipe_2864_1"
            ],
            "skills": [
                37616
            ],
            "desc": "“穿心”效果两秒生效一次，效果持续时间增加至22秒，持续时间增加效果无法与同类效果叠加。“逐星箭”命中“穿心”目标后造成一次额外伤害。",
            "belong_key": "belong_28903"
        },
        "18241": {
            "name": "卸元归魂",
            "desc": "施展“孔雀翎”卸除当前目标的阴性、阳性、毒性、混元气劲各两个。",
            "belong_key": "belong_18241"
        },
        "6461": {
            "name": "秋风散影",
            "buffs": [
                9981
            ],
            "desc": "当你与当前敌对目标距离超过10尺时，获得8秒“秋风散影”效果：招式会心几率提高10%，会心效果提高10%。",
            "belong_key": "belong_6461"
        },
        "6464": {
            "name": "危峰屹立",
            "recipes": [
                "recipe_4960_1"
            ],
            "desc": "“惊鸿游龙”调息时间降低5秒，闪避几率提高至80%，内功伤害降低提高至60%，若躲闪攻击则减少1秒“浮光掠影”调息时间并回复自身3%气血最大值，该效果每1秒最多触发一次。",
            "belong_key": "belong_6464"
        },
        "6439": {
            "name": "夺魄之威",
            "buffs": [
                9844
            ],
            "desc": "自身连续攻击同一目标超过3秒时，获得绝对专注，神机值消耗降低20%，自身会心会效提高7%。",
            "belong_key": "belong_6439"
        },
        "25118": {
            "name": "灵机卸甲",
            "recipes": [
                "recipe_6082_1",
                "recipe_6081_1"
            ],
            "desc": "“夺魄箭”运功时间降低0.25秒，命中自身“穿杨”效果目标时强化并刷新“穿杨”，使其降低目标15%化劲等级。",
            "belong_key": "belong_25118"
        }
    },
    "10225": {
        "3093": {
            "name": "暴雨梨花针",
            "recipes": [
                "recipe_834_1",
                "recipe_835_1",
                "recipe_836_1",
                "recipe_837_1",
                "recipe_838_1",
                "recipe_840_1",
                "recipe_841_1",
                "recipe_842_1"
            ],
            "buffs": [
                3254
            ],
            "skills": [
                3228
            ],
            "desc": "消耗30点神机值，2.19秒内对目标造成5次<SUB 3227 0>外功伤害或<SUB 3228 0>毒性内功伤害。惊羽诀心法下完整运功获得<NounID 67>和<NounID 93>。<TALENT 16953 1 立刻对目标造成一次伤害且使目标无法施展轻功，持续2秒><TALENT 14853 1 可在移动中施展><TALENT 3280 1 会心率提高5%，会心伤害提高10%><TALENT 6887 1 会心率提高20%，会心伤害提高40%><TALENT 6441 1 会心提高10%，会心效果提高10%，暴雨梨花针若会心，则回复30点神机值，该效果最多每8秒触发一次><TALENT 6891 1 能额外造成2次伤害，过程中7次伤害将会逐次提高，同时消耗的神机值提高至50点，完整施展将获得1层“无声”气劲><TALENT 6473 1 完整运功后，使自身外功基础攻击提高30%，威胁值降低20%，无双等级提高15%，持续30秒><TALENT 6459 1 每次命中目标延长“穿心弩”降低目标治疗效果2秒持续时间><TALENT 21838 1 无视目标60%外功防御，能额外造成2次伤害><TALENT 6890 1 命中带有“化血”效果的目标，有70%几率使“化血”下一跳伤害立即生效><TALENT 25141 1 额外消耗30点神机值，若完整运功，额外造成<SUB 25144 1>毒性内功伤害，并使得目标眩晕，持续3秒><TALENT 33118 1 “暴雨梨花针”无视目标40%防御><TALENT 18249 1 化血迷心><TALENT 42472 1 天风汲雨>",
            "belong_key": "belong_3093"
        },
        "3110": {
            "name": "鬼斧神工",
            "buffs": [
                3316
            ],
            "desc": "与千机弩距离在4尺以内方可施展。消耗20点神机值并持续运功3秒，期间免疫伤害和控制效果，为千机弩装填15发“鬼斧弹药”，自身获得15秒<NounID 96>。<TALENT 3286 1 施展后使自身受到的伤害降低30%，内功基础攻击力提高50%，持续5秒><TALENT 6889 1 施展“鬼斧神工”后，自身受到伤害降低40%，受到的“锁足”“定身”“眩晕”控制效果持续时间降低40%，持续时间与“扬威”持续时间相同><TALENT 27267 1 “鬼斧神工”调息降低40秒，运功时间降低至1.5秒，为千机弩装填15发“鬼斧弹药”，“扬威”持续时间降低至10秒><TALENT 42473 1 鬼斧备弹>",
            "belong_key": "belong_3110"
        },
        "3111": {
            "name": "暗藏杀机",
            "recipes": [
                "recipe_1669_1",
                "recipe_1670_1",
                "recipe_1671_1",
                "recipe_1672_1",
                "recipe_1673_1",
                "recipe_1674_1",
                "recipe_1675_1",
                "recipe_1676_1"
            ],
            "buffs": [
                31800
            ],
            "skills": [
                3313
            ],
            "desc": "陷阱技。消耗一个机关，在目标点投掷一个“暗藏杀机”陷阱，持续60秒。场上至多同时存在3个自身的“暗藏杀机”陷阱。\\n“暗藏杀机”陷阱：1.5秒后激活并隐匿，并在6尺范围内首次出现敌方目标时触发。\\n“暗藏杀机”触发：对6尺内至多4个目标造成<SUB 3313 0>毒性内功伤害和一次破招伤害，并使其锁足5秒。同一侠士目标0.75秒内受到多个“暗藏杀机”伤害递减50%，至多叠加2层。<TALENT 3289 1 伤害提高2%><TALENT 3289 2 伤害提高4%><TALENT 3289 3 伤害提高6%><EnchantID 10070 暗藏杀机一次可施展3个机关，图穷匕见调息时间增加至15秒，每引爆一个机关，使目标受到的毒性内功伤害增加2%，使自身每秒回复2点神机值，可叠加3层，持续24秒。><TALENT 6504 1 引爆“暗藏杀机”时击退周围最多4名敌对目标10尺，“千机变·连弩”或“千机变·重弩”会对锁定攻击的目标追加一发“震爆弹”，对其造成<SUB 38882 1>毒性内功伤害并击退10尺。“暗藏杀机”或“震爆弹”命中玩家后“暗藏杀机”调息时间提高至16秒><TALENT 33134 1 每存在一个“千机变”提高30%“暗藏杀机”造成的伤害><TALENT 42473 1 鬼斧备弹><TALENT 42476 1 暗藏击倒><TALENT 42475 1 尽刑彻毒>",
            "belong_key": "belong_3111"
        },
        "3094": {
            "name": "心无旁骛",
            "buffs": [
                3468
            ],
            "desc": "回复全部神机值，并使自身<BUFF 3468 0 desc>，持续<BUFF 3468 0 time>，惊羽诀心法下获得1层无声效果。<TALENT 5739 1 “蚀肌弹”命中后调息时间降低1秒，最多降低30秒><TALENT 6451 1 持续时间增加5秒，加速率提高20%><TALENT 25116 1 期间“逐星箭”使目标被命中几率额外提高20%，持续10秒。>",
            "belong_key": "belong_3094"
        },
        "3106": {
            "name": "天女散花",
            "dots": {
                "3221": [
                    3126
                ]
            },
            "skills": [
                3393
            ],
            "desc": "消耗25点神机值和一个机关，对目标所在位置投掷“天女散花”机关并立即使其获得“化血”效果，使其每3秒受到毒性内功伤害，持续24秒。\\n“天女散花”机关：1.5秒后触发，对12尺内至多10个目标造成<SUB 3393 0>毒性内功伤害，命中有自身“化血”效果的目标伤害提高100%。<TALENT 16903 1 每跳降低敌对玩家目标1%内力值><TALENT 42481 1 困孤悬饵>",
            "belong_key": "belong_3106"
        },
        "10225": {
            "name": "天罗诡道",
            "attributes": {
                "pve_addition_base": 225,
                "magical_shield_base": 3130,
                "physical_shield_base": 2850,
                "spunk_to_poison_attack_power": 1946,
                "spunk_to_physical_critical_strike": 635,
                "max_life_gain": 245,
                "poison_attack_power_base": 6518,
                "physical_critical_strike_base": 3962
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "skills": [
                3121,
                32885,
                25774,
                3480
            ],
            "desc": "天罗地网困龙蛇，神惊魄悸向黄泉。唐家堡秘传心法，利用特制淬毒机关和武器杀敌，实乃波谲云诡、出奇制胜之道。",
            "critical_type": "physical",
            "damage_type": "poison",
            "belong_key": "belong_10225"
        },
        "3091": {
            "name": "孔雀翎",
            "recipes": [
                "recipe_827_1",
                "recipe_828_1",
                "recipe_829_1",
                "recipe_830_1",
                "recipe_831_1",
                "recipe_832_1",
                "recipe_833_1"
            ],
            "skills": [
                3223
            ],
            "desc": "消耗20点神机值，对目标造成<SUB 3222 0>外功伤害或<SUB 3223 0>毒性内功伤害，使目标<BUFF 3226 0 desc>，持续<BUFF 3226 0 time>。<TALENT 16902 1 调息时间降低8秒，不再消耗神机值><TALENT 18237 1 使目标锁足4秒并标记目标，若目标4秒内若受到的伤害超过最大血量的30%，则触发虚弱效果，减速封轻功，基础内外功攻击力和基础治疗效果降低50%，持续5秒><TALENT 18241 1 卸除当前目标的阴性、阳性、毒性、混元气劲各两个><TALENT 21732 1 使目标锁足4秒并标记目标，若目标4秒内若受到的伤害超过最大血量的30%，则触发虚弱效果，减速封轻功，基础内外功攻击力和基础治疗效果降低50%，持续5秒><TALENT 30721 1 施展“孔雀翎”后标记目标8秒，千机变攻击标记目标时消耗“鬼斧弹药”则返还><TALENT 28904 1 命中有自身“穿心”效果目标后，使目标获得一层“穿心”效果持续时间并使得目标受到的剩余“穿心”伤害提高15%，“穿心”效果被刷新后该效果消失><TALENT 34679 1 施展“孔雀翎”后，在目标脚下生成“雀引”机关，并在2秒之后激活，若8尺范围内有敌对目标则对其造成伤害并定身4秒且附带18秒持续伤害效果><TALENT 30724 1 “激射”效果上限提高10层，施展“孔雀翎”可以把30尺内10个目标的“激射”标记转移至一个目标身上>",
            "belong_key": "belong_3091"
        },
        "3105": {
            "name": "蚀肌弹",
            "attributes": {
                "poison_damage_base": 180,
                "poison_damage_rand": 20,
                "physical_attack_power_gain": -1024
            },
            "recipes": [
                "recipe_868_1",
                "recipe_869_1",
                "recipe_870_1",
                "recipe_871_1",
                "recipe_872_1",
                "recipe_873_1",
                "recipe_874_1"
            ],
            "skills": [
                3105,
                18776
            ],
            "desc": "消耗25点神机值，对目标造成<SKILL PoisonDamage>点(+<SKILLEx {D0} {SkillPoisonAP}>)毒性内功伤害，附加100%武器伤害。该招式消耗一个机关。<TALENT 6870 1 施展距离增加5尺><TALENT 5739 1 命中后“心无旁骛”的调息时间降低1秒，最多降低30秒><TALENT 6490 1 伤害提高10%><TALENT 6491 1 会心提高10%，会心效果提高10%><TALENT 3289 2 伤害提高4%><TALENT 3289 3 伤害提高6%><TALENT 6890 1 命中带有“化血”效果的目标，有70%几率使“化血”下一跳伤害立即生效><TALENT 24037 1 “鸟翔碧空·浮空”“杨威”期间命中“重弩”“连弩”范围内的目标，则“重弩”或“连弩”将使用特殊子弹进行一次追击，“重弩”造成<SUB 26901 1>毒性内功伤害，“连弩”<SUB 26900 1>毒性内功伤害><TALENT 18249 1 化血迷心>",
            "belong_key": "belong_3105"
        },
        "3108": {
            "name": "天绝地灭",
            "recipes": [
                "recipe_883_1",
                "recipe_884_1",
                "recipe_885_1",
                "recipe_886_1",
                "recipe_887_1",
                "recipe_888_1",
                "recipe_890_1",
                "recipe_891_1"
            ],
            "skills": [
                36502
            ],
            "desc": "陷阱技。消耗30点神机值和一个机关，在目标点投掷一个“天绝地灭”陷阱，持续15秒。\\n“天绝地灭”陷阱：1.5秒后激活，并在6尺范围内首次出现敌方目标时触发。\\n“天绝地灭”触发：立即将范围内至多4个目标拉扯至中心并使其锁足5秒，并在15秒内每3秒对范围内至多4个目标造成<SUB 36502 0>毒性内功伤害。同时命中多名侠士目标时伤害递减至多50%。<TALENT 6493 1 目标数量降低3个，持续时间降低6秒，命中已命中目标后额外触发一次<SUB 36633 0>伤害，若该目标为非侠士目标则伤害提高200%><TALENT 6492 1 伤害提高10%，调息时间降低5秒><TALENT 21961 1 持续效果全部失效，持续时间固定9秒，期间可以被二段招式引爆并造成伤害。将“天绝地灭”周围范围内最多3个敌方目标和自身除“千机变”、“飞星遁影”以外的机关拉扯到“天绝地灭”所在点，并且延长10秒被拉扯机关持续时间。“天绝地灭”初始状态可牵引8尺范围目标，每过1秒拉扯范围增大1尺，最大拉扯范围15尺><EnchantID 10069 “天绝地灭”机关持续时间延长15秒，每命中一个目标，使自身回复20点神机值，最多回复40点><TALENT 33134 1 每存在一个“暗藏杀机”提高20%“天绝地灭”造成的伤害><TALENT 42474 1 黑云翻墨><TALENT 42477 1 林寒涧肃>",
            "belong_key": "belong_3108"
        },
        "38879": {
            "name": "连弩",
            "skills": [
                3401,
                3404
            ],
            "desc": "将千机变转换为千机连弩，持续2分钟。连弩有25尺攻击范围，每1.5秒攻击一次。攻击会向目标发射快速飞行的弩箭，立即造成<SUB 3401 0>毒性内功伤害，命中目标后恢复10点神机值。<TALENT 6495 1 弩击急骤><TALENT 24037 1 云奔雨骤>",
            "belong_key": "belong_38879"
        },
        "38880": {
            "name": "重弩",
            "skills": [
                3819,
                3824
            ],
            "desc": "将千机变转换为千机重弩，持续2分钟。重弩有25尺攻击范围，每3秒攻击一次。攻击会先锁定目标当前位置，填装2秒后发射重型弩箭，到达锁定目标点后炸开，对4尺内至多5个敌方目标造成<SUB 3819 0>毒性内功伤害。<TALENT 37326 1 “重弩”命中有2层及以上“激射”效果的目标使其体质降低10%，可叠加4层，持续8秒><TALENT 37327 1 “鬼斧弹药”持续期间“千机变·重弩”命中锁定目标后的爆炸范围提高4尺，并将锁定目标所消耗的“激射”效果转移至其他被命中的目标身上><TALENT 24037 1 云奔雨骤><TALENT 42482 1 穿肌透骨><TALENT 6498 1 弩击轰雷>",
            "belong_key": "belong_38880"
        },
        "38881": {
            "name": "毒刹",
            "skills": [
                3367
            ],
            "desc": "将千机变转换为毒刹机关，8秒内每秒对10尺内至多4个敌方目标造成<SUB 3367 0>毒性内功伤害（同时命中多名侠士目标时伤害递减至多50%）。毒刹机关不可再转换为其他形态。",
            "belong_key": "belong_38881"
        },
        "42482": {
            "name": "穿肌透骨",
            "desc": "重弩对原地受控状态下的目标填装速度和造成伤害翻倍，攻击间隔减半。",
            "belong_key": "belong_42482"
        },
        "42481": {
            "name": "困孤悬饵",
            "skills": [
                42483
            ],
            "desc": "自身“化血”效果的目标受到治疗则下一跳“化血”生效时额外造成<SUB 42483 1>毒性内功伤害。",
            "belong_key": "belong_42481"
        },
        "20544": {
            "name": "九霄风雷",
            "desc": "“鬼斧神工”替换为“九霄风雷”，不受原招式秘籍影响，调息时间固定为70秒。施展时<SUB 21847 1>",
            "belong_key": "belong_20544"
        },
        "34679": {
            "name": "雀引彀中",
            "desc": "“孔雀翎”命中目标附带18秒“鸩羽”效果，使其被自身“蚀肌弹”命中后附带“化血”并触发一次破招，成功造成破招伤害后返还全额“孔雀翎”调息时间。",
            "belong_key": "belong_34679"
        },
        "5719": {
            "name": "绝伦逸群",
            "recipes": [
                "recipe_919_2",
                "recipe_1991_1"
            ],
            "desc": "“浮光掠影”调息时间降低30秒，施展“浮光掠影”获得的“浮光掠影”效果消失后移除移动限制，并使自身免疫移动限制、受到的伤害降低40%，持续4秒。",
            "belong_key": "belong_5719"
        },
        "5715": {
            "name": "回肠荡气",
            "desc": "神机值提高10点。招式会心后有50%几率回复25点神机值，每4秒只能触发一次。",
            "belong_key": "belong_5715"
        },
        "6498": {
            "name": "弩击轰雷",
            "recipes": [
                "recipe_4925_1",
                "recipe_4926_1"
            ],
            "desc": "重弩的弹道速度提高100%。",
            "belong_key": "belong_6498"
        },
        "6495": {
            "name": "弩击急骤",
            "buffs": [
                6105
            ],
            "desc": "连弩攻击会心后获得8秒可叠加时间的“弩心”效果：毒性内功破防等级提高15%。",
            "belong_key": "belong_6495"
        },
        "42473": {
            "name": "波诡云谲",
            "desc": "“鬼斧神工”会额外预留9发“鬼斧备弹”。千机弩锁定的目标被“暗藏杀机”命中后，会自动消耗3发“鬼斧备弹”，将其装填为“鬼斧弹药”并使自身获得5秒<NounID 96>。",
            "belong_key": "belong_42473"
        },
        "6506": {
            "name": "千机之威",
            "buffs": [
                6112
            ],
            "desc": "当自身位于千机变25尺范围内时，自身基础攻击提高15%。",
            "belong_key": "belong_6506"
        },
        "6778": {
            "name": "神机千算",
            "recipes": [
                "recipe_2372_1"
            ],
            "desc": "“毒刹”伤害提高40%且对目标造成伤害后回复自身3%气血最大值，最多每1秒触发一次。",
            "belong_key": "belong_6778"
        },
        "3092": {
            "name": "梅花针",
            "desc": "若目标正在运功则进行打断，并使其<BUFF 3227 0 desc>，持续<BUFF 3227 0 time>。“浮空”期间不可施展。",
            "belong_key": "belong_3092"
        },
        "24037": {
            "name": "云奔雨骤",
            "skills": [
                26900,
                26901
            ],
            "desc": "“扬威”期间“蚀肌弹”命中目标，使其6秒内下一次被连弩或重弩攻击命中时额外附带一段<SUB 26900 1>或<SUB 26901 1>毒性内功伤害，至多叠加3层。该伤害视为千机弩造成。",
            "belong_key": "belong_24037"
        },
        "18249": {
            "name": "化血迷心",
            "skills": [
                3304
            ],
            "desc": "“蚀肌弹”“暴雨梨花针”命中有自身“化血”效果的目标附带一次<SUB 3304 1>毒性内功伤害。",
            "belong_key": "belong_18249"
        },
        "42474": {
            "name": "黑云翻墨",
            "desc": "“天绝地灭”伤害提高100%，触发和生效范围提高4尺。",
            "belong_key": "belong_42474"
        },
        "38750": {
            "name": "雷骇九天",
            "desc": "“鸟翔碧空”浮空期间施展第三段技能，使自身4秒内不受招式控制（击退和被拉除外），且重置“雷震子”调息时间。",
            "belong_key": "belong_38750"
        },
        "42476": {
            "name": "藏形待时",
            "recipes": [
                "recipe_6115_1"
            ],
            "desc": "“暗藏杀机”调息时间提高7秒，命中锁足、定身、眩晕的目标将其击倒4秒。",
            "belong_key": "belong_42476"
        },
        "42475": {
            "name": "尽刑彻毒",
            "desc": "“暗藏杀机”命中目标使其剩余“化血”效果作用间隔降低至1秒，持续时间不变。",
            "belong_key": "belong_42475"
        },
        "6508": {
            "name": "千机不殆",
            "recipes": [
                "recipe_1223_1"
            ],
            "desc": "“鬼斧弹药”期间重弩的爆炸范围提高4尺，连弩的攻击间隔降低0.5秒。",
            "belong_key": "belong_6508"
        },
        "14856": {
            "name": "曙色催寒",
            "buffs": [
                10005
            ],
            "desc": "招式伤害会心后使自身15秒内招式无视目标50%防御等级。",
            "belong_key": "belong_14856"
        },
        "42478": {
            "name": "图穷匕见",
            "desc": "被动效果：“暗藏杀机”变为遥控陷阱，投掷时立即激活并隐匿，不再自动触发，战斗中施展返还全额调息时间。\\n主动效果：遥控全部“暗藏杀机”立即触发，并额外附带10尺击退效果。调息时间20秒。",
            "belong_key": "belong_42478"
        },
        "42477": {
            "name": "林寒涧肃",
            "desc": "“天绝地灭”放置后直接激活触发，触发时不再附带拉扯和锁足。持续期间范围每秒增大4尺（至多增大至15尺），并可施展二段招式，将范围内至多4个敌方目标和自身其他陷阱拉至中心位置。",
            "belong_key": "belong_42477"
        },
        "3115": {
            "name": "荆天棘地",
            "recipes": [
                "recipe_907_1",
                "recipe_908_1",
                "recipe_909_1",
                "recipe_910_1",
                "recipe_911_1",
                "recipe_912_1",
                "recipe_913_1"
            ],
            "skills": [
                3221
            ],
            "desc": "消耗15点神机值，对目标发射一个荆棘机关，使其受到<SUB 3220 0>外功伤害或<SUB 3221 0>毒性内功伤害，并使周围最多5个目标获得“荆天棘地”效果：外功命中降低100%，内功造成伤害降低100%，持续<BUFF 3215 0 time>。外功命中降低，内功造成伤害降低效果每秒递减10%。",
            "belong_key": "belong_3115"
        },
        "30921": {
            "name": "擘两分星",
            "buffs": [
                23081,
                23082
            ],
            "desc": "“神机值”低于80点时，造成内功伤害增加20%。“神机值”高于20点时，“陷阱技”造成伤害增加10%。",
            "belong_key": "belong_30921"
        },
        "25151": {
            "name": "诡面埋伏",
            "skills": [
                25154
            ],
            "desc": "陷阱技。消耗30点神机值和一个机关，在目标点投掷一个“诡面埋伏”陷阱，持续10秒。\\n“诡面埋伏”陷阱：1.5秒后激活，并在6尺范围内首次出现敌方侠士目标时触发。\\n“诡面埋伏”触发：对6尺范围最多3个目标造成毒性内功伤害，并使之无法运功，无法受到治疗效果，持续3秒。",
            "belong_key": "belong_25151"
        },
        "18675": {
            "name": "千秋万劫",
            "skills": [
                18677,
                28441
            ],
            "desc": "使自身进入20秒开火状态，期间可施展4次“千秋万劫”：对目标点范围10尺内至多5个目标造成<SUB 18677 0>毒性内功伤害，并使其剩余“化血”效果伤害提高100%。",
            "belong_key": "belong_18675"
        },
        "30723": {
            "name": "千机连环",
            "buffs": [
                29361
            ],
            "skills": [
                31026,
                31027
            ],
            "desc": "连弩存在时可施展。立即在连弩周围产生2个“千机连环弩”，持续15秒。“千机连环弩”会与连弩攻击同样的目标，造成<SUB 31027 1>毒性内功伤害，“扬威”效果下附带“易损”：6秒内受到连弩和“千机连环弩”伤害提高10%，可叠加10层。",
            "belong_key": "belong_30723"
        },
        "42479": {
            "name": "星离雨散",
            "skills": [
                42664
            ],
            "desc": "消耗30点神机值和一个机关，对目标所在位置投掷“星离雨散”机关并立即对其及其4尺内至多3个目标造成<SUB 42664 1>“封喉”毒性内功伤害。\\n“星离雨散”机关：2秒后触发，对6尺内至多5个目标造成<SUB 42664 2>毒性内功伤害，命中被“封喉”命中过的目标时伤害提高100%，若目标非侠士则引爆其全部“化血”。",
            "belong_key": "belong_42479"
        },
        "6461": {
            "name": "秋风散影",
            "buffs": [
                9981
            ],
            "desc": "当你与当前敌对目标距离超过10尺时，获得8秒“秋风散影”效果：招式会心几率提高10%，会心效果提高10%。",
            "belong_key": "belong_6461"
        },
        "6464": {
            "name": "危峰屹立",
            "recipes": [
                "recipe_4960_1"
            ],
            "desc": "“惊鸿游龙”调息时间降低5秒，闪避几率提高至80%，内功伤害降低提高至60%，若躲闪攻击则减少1秒“浮光掠影”调息时间并回复自身3%气血最大值，该效果每1秒最多触发一次。",
            "belong_key": "belong_6464"
        },
        "23642": {
            "name": "袍泽故旧",
            "desc": "“子母飞爪”可对友方目标施展。若目标为队友，则自身与目标队友之间生成一条锁链持续7秒。友方目标获得一个增益技能“子母飞爪·子”：解除自身控制效果，并位移至唐门队友身旁；自身可施展二段技能“子母飞爪·子”：解除自身控制效果并位移至队友身旁。施展技能后队友和自身免疫控制（击退和被拉除外），持续2秒，锁链效果作用一次消失。",
            "belong_key": "belong_23642"
        },
        "18241": {
            "name": "卸元归魂",
            "desc": "施展“孔雀翎”卸除当前目标的阴性、阳性、毒性、混元气劲各两个。",
            "belong_key": "belong_18241"
        },
        "33577": {
            "name": "天幕藏锋",
            "desc": "“浮空”状态期间可以在空中双击W、S按键中任意一个，快速冲向指定的前方或者后方，获得5秒“扬威”效果。",
            "belong_key": "belong_33577"
        },
        "17572": {
            "name": "分水逐旌",
            "desc": "“惊鸿游龙”状态持续时间内，若自身受到的伤害累积超过自身气血最大值的10%，则自动触发“浮光掠影”隐身效果并卸除自身所有不利效果，持续5秒。",
            "belong_key": "belong_17572"
        },
        "33134": {
            "name": "杀机断魂",
            "buffs": [
                24668
            ],
            "desc": "每存在一个“天绝地灭”提高10%“千机变”造成的伤害。\\n每存在一个“暗藏杀机”提高20%“天绝地灭”造成的伤害。\\n每存在一个“千机变”提高30%“暗藏杀机”造成的伤害。",
            "belong_key": "belong_33134"
        },
        "36279": {
            "name": "平地风雷",
            "desc": "“雷震子”会在15尺内敌方目标间弹跳6次，每次控制时间变为2秒。",
            "belong_key": "belong_36279"
        },
        "6510": {
            "name": "击搏挽裂",
            "buffs": [
                3281
            ],
            "desc": "“鸟翔碧空”一、二、三段施展后分别获得1、2、3层“击搏挽裂”：“蚀肌弹”伤害提高30%且可无需运功直接施展，施展后消耗一层。",
            "belong_key": "belong_6510"
        },
        "27267": {
            "name": "神威穿彻",
            "recipes": [
                "recipe_2522_1"
            ],
            "desc": "“鬼斧神工”调息降低40秒，运功时间降低至1.5秒，获得的“扬威”持续时间降低至10秒。",
            "belong_key": "belong_27267"
        },
        "18237": {
            "name": "千回百转",
            "desc": "“孔雀翎”使目标锁足4秒并标记目标，若目标4秒内若受到的伤害超过最大血量的30%，则触发虚弱效果，减速封轻功，基础内外功攻击力和基础治疗效果降低50%，持续5秒。",
            "belong_key": "belong_18237"
        },
        "42472": {
            "name": "天风汲雨",
            "buffs": [
                31833
            ],
            "skills": [
                42484
            ],
            "desc": "“暴雨梨花针”命中自身“天绝地灭”内的目标附带<SUB 42484 1>毒性内功伤害，若完整运功命中则使自身无双等级提高10%，持续20秒。",
            "belong_key": "belong_42472"
        }
    },
    "10242": {
        "3962": {
            "name": "赤日轮",
            "recipes": [
                "recipe_999_1",
                "recipe_1000_1",
                "recipe_1001_1",
                "recipe_1002_1",
                "recipe_1003_1",
                "recipe_1004_1",
                "recipe_1005_1",
                "recipe_1006_1"
            ],
            "buffs": [
                28355
            ],
            "skills": [
                4028,
                4029,
                4030
            ],
            "desc": "三段招式，需连续施展，每次施展获得20点日灵。\\n第一段：对目标造成<SUB 4028 0>阳性内功伤害和100%武器伤害。\\n第二段：对目标及其周围5尺内至多3个敌对目标造成<SUB 4029 0>阳性内功伤害和100%武器伤害。\\n第三段：对目标及其周围6尺内至多6个敌对目标造成<SUB 4030 0>阳性内功伤害和100%武器伤害。<TALENT 3988 1 伤害提高5%><TALENT 3988 2 伤害提高10%><TALENT 4004 2 获得的日灵提高20%><TALENT 5988 1 命中眩晕效果的目标，伤害提高15%；第3段额外获得10点日灵><TALENT 18632 1 命中目标背后将获得“明光”气劲，每层增加自身6%阴、阳性基础攻击力，最多叠加4层，持续30秒><TALENT 18635 1 使下一个“幽月轮”额外获得20点月魂><TALENT 5971 1 日月凌天><TALENT 5969 1 无幽不烛><TALENT 37274 1 无往不复><TALENT 5979 1 天地诛戮><TALENT 6740 1 食肉众生><TALENT 36093 1 净恶瑕诛>",
            "belong_key": "belong_3962"
        },
        "3969": {
            "name": "光明相",
            "recipes": [
                "recipe_1029_1",
                "recipe_1030_1",
                "recipe_1031_1",
                "recipe_1033_1",
                "recipe_1034_1",
                "recipe_1035_1"
            ],
            "buffs": [
                4423
            ],
            "desc": "使自身<BUFF 4423 1 time>内<BUFF 4423 1 desc>。<TALENT 6726 1 获得“光明相”效果时额外获得“圣法光明”气劲，持续5秒。每秒解除自身控制效果（击倒除外），若成功解除，则自身下次攻击附带该效果><TALENT 16851 1 效果持续期间内，造成伤害的40%转化为自身气血值><TALENT 21757 1 在自身范围内生成8尺“羁影”效果，效果持续期间范围内自身被命中的几率降低35%，最多4名敌对玩家目标招式命中降低35%且持续期间视觉会产生影响，效果持续6秒><TALENT 25160 1 五明乐见><TALENT 30776 1 影随光生><TALENT 6749 1 涅槃路><TALENT 18818 1 归寂道><TALENT 18296 1 性命海><TALENT 21835 1 孤月无心><TALENT 6771 1 光明心><TALENT 41889 1 灵光破晓>",
            "belong_key": "belong_3969"
        },
        "3960": {
            "name": "银月斩",
            "recipes": [
                "recipe_992_1",
                "recipe_993_1",
                "recipe_994_1",
                "recipe_995_1",
                "recipe_996_1",
                "recipe_997_1",
                "recipe_998_1"
            ],
            "dots": {
                "4202": [
                    13359
                ]
            },
            "skills": [
                40089
            ],
            "desc": "获得40点月魂，对目标造成<SUB 40089 0>阴性内功伤害和100%武器伤害。命中后附带“银月斩”效果，使目标<BUFF 4202 0 desc>，持续<BUFF 4202 0 time>。若命中有自身“烈日”效果的目标则额外造成破招伤害。<TALENT 5970 1 会心后获得的月魂提高50%><TALENT 25166 1 变为2层充能招式。命中“烈日”效果的目标时，造成<SUB 26709 1>阴性内功伤害><TALENT 18279 1 净身明礼><TALENT 5972 1 腾焰飞芒><TALENT 5978 1 洞若观火><TALENT 6741 1 圣光明>",
            "belong_key": "belong_3960"
        },
        "10242": {
            "name": "焚影圣诀",
            "attributes": {
                "pve_addition_base": 123,
                "magical_shield_base": 3314,
                "physical_shield_base": 2850,
                "spunk_to_solar_and_lunar_attack_power": 2038,
                "spunk_to_solar_and_lunar_critical_strike": 307,
                "max_life_gain": 245,
                "lunar_attack_power_base": 7604,
                "solar_attack_power_base": 7604
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "skills": [
                4326,
                19055,
                32816,
                25777,
                35065
            ],
            "desc": "光明妙火常辉耀，焚影驱暗恒如意。攻其所不备，却必救之处，寻觅机会，一击挫敌。明教功法之中，以此最擅于在对决中捕获那稍纵即逝之制胜良机。",
            "critical_type": "lunar",
            "damage_type": "lunar",
            "belong_key": "belong_10242"
        },
        "3963": {
            "name": "烈日斩",
            "recipes": [
                "recipe_1007_1",
                "recipe_1008_1",
                "recipe_1009_1",
                "recipe_1010_1",
                "recipe_1011_1",
                "recipe_1012_1",
                "recipe_1013_1"
            ],
            "skills": [
                40088
            ],
            "desc": "获得40点日灵，对目标造成<SUB 40088 0>阳性内功伤害和100%武器伤害。命中后附带“烈日”效果，使目标受到自身“赤日轮”伤害提高10%，持续<BUFF 4418 1 time>。若命中有自身“银月斩”效果的目标则额外造成破招伤害。<TALENT 5970 1 会心后获得的日灵提高50%><TALENT 25166 1 变为2层充能招式，命中“银月斩”持续伤害效果的目标时，造成<SUB 26708 1>阳性内功伤害><TALENT 18279 1 净身明礼><TALENT 5972 1 腾焰飞芒><TALENT 5978 1 洞若观火><TALENT 34395 1 日月同辉><TALENT 6741 1 圣光明>",
            "belong_key": "belong_3963"
        },
        "3966": {
            "name": "生死劫",
            "recipes": [
                "recipe_1621_1",
                "recipe_1622_1",
                "recipe_1623_1",
                "recipe_1624_1",
                "recipe_1625_1",
                "recipe_1626_1",
                "recipe_1627_1",
                "recipe_1628_1",
                "recipe_5207_1"
            ],
            "skills": [
                6257,
                6258
            ],
            "desc": "耗灵技，需消耗满日或满月，两者对应效果不同。\\n满日：对目标造成<SUB 6257 0>阳性内功伤害和100%武器伤害，并使其<BUFF 4029 0 desc>，持续4秒。\\n满月：对目标造成<SUB 6258 0>阴性内功伤害和100%武器伤害，并使其<BUFF 4030 2 desc>，持续12秒。<TALENT 32623 1 施展“生死劫”后6秒内对敌对玩家施展的“无明魂锁”的眩晕效果降低2秒，在目标气血值高于40%的时受到攻击不会苏醒><TALENT 32640 1 施展“生死劫·日”“生死劫·月”后6秒内可施展二段招式“晦明·日”“晦明·月”对目标造成阳性内功伤害或阴性内功伤害且附带额外效果。“晦明·日”会为目标施加6秒“陨日”效果，使目标伤害随机降低10%到50%并每秒降低的值依次变化，“晦明·月”使目标身上属于自身的“月劫”效果提升5%且无法被驱散和刷新，但目标每次受到自身阳性内功伤害后减少4秒持续时间><TALENT 22888 1 诛邪镇魔><TALENT 5967 1 燎原烈火><TALENT 32622 1 赤日赫炎><TALENT 34372 1 靡业报劫><TALENT 6727 1 善恶如梦><TALENT 17567 1 用晦而明><TALENT 30928 1 采曜生明><TALENT 6760 1 纵遇善缘><TALENT 41889 1 光明相增强劫>",
            "belong_key": "belong_3966"
        },
        "3967": {
            "name": "净世破魔击",
            "recipes": [
                "recipe_1014_1",
                "recipe_1015_1",
                "recipe_1016_1",
                "recipe_1017_1",
                "recipe_1018_1",
                "recipe_1019_1",
                "recipe_1020_1",
                "recipe_1021_1",
                "recipe_5206_1"
            ],
            "skills": [
                14701,
                4476
            ],
            "desc": "耗灵技，需消耗满日或满月，两者对应效果不同。\\n满日：对自身面向180度15尺扇形区域内至多5个敌对目标造成至多<SUB 4483 0>阳性内功伤害和200%武器伤害。优先命中当前选择的目标，且其会受到全额伤害；其余目标则受到半额伤害。\\n满月：快速冲向侠士或4尺外目标，使其眩晕2秒；并连续攻击三次，每次对目标造成<SUB 4476 0>阴性内功伤害和100%武器伤害。<TALENT 6732 1 “净世破魔击·日”的范围扩大到360度；“净世破魔击·月”可以解除自身锁足减速不利效果><TALENT 3993 2 伤害提高6%><TALENT 3993 3 伤害提高9%><TALENT 3997 1 净世破魔击·日命中目标后有50%几率使目标灼烧，使目标<BUFF 4464 1 desc>(+<SKILLEx {D0} {TotalSolarAP 0.2396}>)，持续8秒。净世破魔击·月施展后立刻获得10点日灵、月魂><TALENT 6755 1 威胁值提高30%，施展后恢复5%气血值><TALENT 4005 2 招式附带大量威胁><EnchantID 10097 施展“净世破魔击”，有35%的几率使自身获得“暗尘”效果，可立即施展“驱夜断愁”。><EnchantID 10098 施展“净世破魔击”后随机恢复10至80点日灵和月魂。><TALENT 6895 1 施展后使自身加速率提高2%，可叠加5层，持续20秒><TALENT 25166 1 净体不畏><TALENT 22888 1 诛邪镇魔><TALENT 5985 1 幽隐尘迹><TALENT 5967 1 燎原烈火><TALENT 5968 1 辉耀红尘><TALENT 40190 1 寂灭劫灰><TALENT 25178 1 昭昭><TALENT 14698 1 驱夷逐法><TALENT 25355 1 怜世人>",
            "belong_key": "belong_3967"
        },
        "3959": {
            "name": "幽月轮",
            "recipes": [
                "recipe_984_1",
                "recipe_985_1",
                "recipe_986_1",
                "recipe_987_1",
                "recipe_988_1",
                "recipe_989_1",
                "recipe_990_1",
                "recipe_991_1"
            ],
            "skills": [
                4024,
                4025,
                4026
            ],
            "desc": "三段招式，需连续施展，每次施展获得20点月魂。\\n第一段：对目标造成<SUB 4024 0>阴性内功伤害和100%武器伤害。\\n第二段：对目标造成<SUB 4025 0>阴性内功伤害和100%武器伤害，本段会心额外提高5%。\\n第三段：对目标造成<SUB 4026 0>阴性内功伤害和100%武器伤害，本段会心额外提高10%。<TALENT 4004 2 获得的月魂提高20%><TALENT 5988 1 命中眩晕效果的目标，伤害提高15%；第3段额外获得10点月魂><TALENT 18632 1 命中目标背后将获得“明光”气劲，每层增加自身6%阴、阳性基础攻击力，最多叠加4层，持续30秒><TALENT 18635 1 使下一个“赤日轮”额外获得20点日灵><TALENT 5971 1 日月凌天><TALENT 5969 1 无幽不烛><TALENT 37274 1 无往不复><TALENT 5979 1 天地诛戮><TALENT 6740 1 食肉众生><TALENT 36093 1 净恶瑕诛>",
            "belong_key": "belong_3959"
        },
        "3979": {
            "name": "驱夜断愁",
            "recipes": [
                "recipe_1032_1",
                "recipe_1045_1",
                "recipe_1050_1",
                "recipe_1051_1",
                "recipe_1052_1",
                "recipe_1053_1",
                "recipe_1054_1",
                "recipe_1055_1",
                "recipe_1056_1"
            ],
            "skills": [
                4480
            ],
            "desc": "<NounID 46>状态下或离开伪装后3秒内方可施展。获得60点日灵、月魂，对目标造成<SUB 4480 0>点阴性内功伤害和200%武器伤害。在背后施展时伤害提高30%。<TALENT 5980 1 对50%血量以下的目标伤害提高40%><TALENT 5981 1 施展“净世破魔击”3秒内可以施展“驱夜断愁”，施展后立即获得20点日灵、月魂，每30秒触发1次><TALENT 40059 1 施展后6秒内：“赤日轮”“幽月轮”变为2秒持续运功招式，完整施展后对目标造成一次破招伤害。运功期间满灵则尾跳变为“净世破魔击”><TALENT 37275 1 普愿离诸><TALENT 18282 1 秽孽如形><TALENT 17567 1 用晦而明><TALENT 5979 1 天地诛戮><TALENT 5989 1 恶秽满路><TALENT 25163 1 夷数神光><TALENT 6724 1 万念俱寂>",
            "belong_key": "belong_3979"
        },
        "28593": {
            "name": "日月晦",
            "skills": [
                30321,
                30322,
                29932
            ],
            "desc": "三段冲刺招式，各段施展后依次获得满日、满月、满日和满月。\\n每段施展时，获得1秒<NounID 4>并向目标点方向冲刺12尺，对4尺宽冲刺路径上的至多6个敌对目标造成<SUB 30321 1>对应属性内功伤害，并附带“烈日”和“银月斩”效果。\\n该招式可在冲刺过程中施展。完整施展后，会在“超然”效果结束后获得3秒<NounID 46>。",
            "belong_key": "belong_28593"
        },
        "18626": {
            "name": "伏明众生",
            "buffs": [
                12487
            ],
            "desc": "100点日灵方可施展。获得6秒<NounID 4>，并使自身6秒内消耗满灵施展“净世破魔击”后获得满日，期间“净世破魔击”伤害提高20%，且“净世破魔击·日”范围扩大至360度。",
            "belong_key": "belong_18626"
        },
        "37337": {
            "name": "崇光斩恶",
            "skills": [
                37336
            ],
            "desc": "“光明相”替换为“崇光斩恶”，<SUB 37335 1>",
            "belong_key": "belong_37337"
        },
        "41762": {
            "name": "圣焰令",
            "skills": [
                43410,
                41765
            ],
            "desc": "在20尺内目标点6尺区域燃起<NounID 108>并遁入<NounID 55>，短暂延迟后于其中现身，延迟期间可通过跳跃按键打断并留在原地。“微妙风”期间激活二段招式<NounID 109>。<TALENT 6717 1 无明业火>",
            "belong_key": "belong_41762"
        },
        "5974": {
            "name": "血泪成悦",
            "desc": "造成伤害的10%转化为自身气血。",
            "belong_key": "belong_5974"
        },
        "37274": {
            "name": "无往不复",
            "buffs": [
                28142
            ],
            "desc": "对有自身“烈日”效果的目标施展“赤日轮”“幽月轮”伤害提高40%。",
            "belong_key": "belong_37274"
        },
        "18279": {
            "name": "净身明礼",
            "recipes": [
                "recipe_5149_1",
                "recipe_5150_1"
            ],
            "skills": [
                40931,
                40932
            ],
            "desc": "“烈日斩”“银月斩”伤害提高25%，施展时对目标周围6尺的5个目标造成<SUB 40931 1>阳性或<SUB 40932 1>阴性内功伤害，并附带“烈日”或“银月斩”效果。",
            "belong_key": "belong_18279"
        },
        "3961": {
            "name": "寒月耀",
            "attributes": {
                "lunar_damage_base": 20,
                "lunar_damage_rand": 5,
                "physical_attack_power_gain": -1024
            },
            "skills": [
                3961
            ],
            "desc": "打断目标运功，并对其造成<SKILL LunarDamage>点(+<SKILLEx {D0} {SkillLunarAP}>)阴性内功伤害和100%武器伤害。命中正在运功的侠士目标后使自身获得满月。",
            "belong_key": "belong_3961"
        },
        "22888": {
            "name": "诛邪镇魔",
            "skills": [
                26916
            ],
            "desc": "2.5秒内分别消耗满日与满月施展招式命中目标，根据招式类型造成一次阴阳混合各至多<SUB 26916 1>内功伤害，并使自身<BUFF 28886 1 desc>，持续10秒。",
            "belong_key": "belong_22888"
        },
        "5968": {
            "name": "辉耀红尘",
            "desc": "消耗满日施展“净世破魔击”后获得20点月魂，消耗满月施展“净世破魔击”后获得20点日灵。",
            "belong_key": "belong_5968"
        },
        "3971": {
            "name": "极乐引",
            "desc": "在自身当前位置生成15尺“极乐引”，4秒内可施展二段招式，<SUB 3972 0>\\n“明尊琉璃体”心法下强制“极乐引”范围内及被二段招式命中的目标攻击自身，持续4秒，并使自身造成的威胁值提高100%，周围30尺范围内所有团队成员获得无威胁气劲，持续8秒。",
            "belong_key": "belong_3971"
        },
        "6717": {
            "name": "无明业火",
            "buffs": [
                31456,
                6277
            ],
            "desc": "施展“暗尘弥散”或“圣焰令”后获得“无明业火”：<BUFF 31456 1 desc>。该效果不处于<NounID 46>或<NounID 55>15秒后消失。",
            "belong_key": "belong_6717"
        },
        "25166": {
            "name": "净体不畏",
            "recipes": [
                "recipe_5507_1",
                "recipe_5508_1"
            ],
            "buffs": [
                30644
            ],
            "skills": [
                26708,
                26709
            ],
            "desc": "“烈日斩”“银月斩”调息时间降低1秒，命中自身异色斩不利效果的目标会将其消耗并使本次造成的伤害提高50%。“净世破魔击”命中自身同色斩不利效果的目标造成<SUB 26708 0>对应属性内功额外伤害，若目标非侠士则此伤害提高75%。",
            "belong_key": "belong_25166"
        },
        "34372": {
            "name": "靡业报劫",
            "recipes": [
                "recipe_3221_1"
            ],
            "dots": {
                "25725": [
                    34373
                ],
                "25726": [
                    34374
                ]
            },
            "desc": "消耗满日或满月施展“生死劫”使目标每2秒受到对应属性内功伤害，持续20秒，每种属性的效果只可作用于一个目标。该伤害视为“生死劫”，享受其秘籍加成。",
            "belong_key": "belong_34372"
        },
        "21174": {
            "name": "圣裁刑晷",
            "recipes": [
                "recipe_6100_1"
            ],
            "skills": [
                40209
            ],
            "desc": "施展“怖畏暗刑”会标记当前目标6秒并布下圣裁庭，标记结束后对其降下圣裁，造成(<SUB 40209 11>-<SUB 40209 20>点)<NounID 13>阳性内功伤害，期间目标受到伤害越多则圣裁伤害越高。若降下圣裁时目标仍位于圣裁庭内，则最终伤害提高50%(<SUB 40209 1>-<SUB 40209 10>点)。目标被标记期间不再受自身缴械效果影响。",
            "belong_key": "belong_21174"
        },
        "6727": {
            "name": "善恶如梦",
            "skills": [
                13851,
                13852
            ],
            "desc": "消耗满日或满月施展“生死劫”，额外附带另一种“生死劫”的效果，该额外效果不受其他奇穴或秘籍效果影响。",
            "belong_key": "belong_6727"
        },
        "5979": {
            "name": "天地诛戮",
            "buffs": [
                4754
            ],
            "desc": "施展“驱夜断愁”，或完整施展“赤日轮”或“幽月轮”，使自身<BUFF 4754 1 desc>，持续<BUFF 4754 1 time>。",
            "belong_key": "belong_5979"
        },
        "5989": {
            "name": "恶秽满路",
            "desc": "“驱夜断愁”在背后命中自身“月劫”效果的目标使其3秒内无法施展轻功，不处于<NounID 46>状态下时也可施展且拥有25秒独立调息时间。",
            "belong_key": "belong_5989"
        },
        "25160": {
            "name": "五明乐见",
            "recipes": [
                "recipe_5208_1"
            ],
            "desc": "“光明相”调息时间降低5秒，效果提高至3次。",
            "belong_key": "belong_25160"
        },
        "41889": {
            "name": "灵光破晓",
            "desc": "“光明相”期间消耗满月施展“生死劫”额外附带40%最大气血值的治疗吸收盾，持续6秒，效果存在期间目标受到自身的伤害提高10%。",
            "belong_key": "belong_41889"
        },
        "32661": {
            "name": "清静心",
            "desc": "使自身6秒内<BUFF 24369 1 desc>。",
            "belong_key": "belong_32661"
        },
        "18634": {
            "name": "秘影诡行",
            "desc": "“幻光步”变为瞬间释放，并可解除自身受控状态(击倒除外)。",
            "belong_key": "belong_18634"
        },
        "34511": {
            "name": "灼业焚心",
            "skills": [
                34510
            ],
            "desc": "“贪魔体”期间每秒对周围8尺内10个目标造成<SUB 34510 1>阳性内功伤害并使其减速90%。每次命中侠士目标时使该伤害提高20%，至多生效10次，且对每个目标有15秒独立调息时间。",
            "belong_key": "belong_34511"
        },
        "38526": {
            "name": "降灵尊",
            "skills": [
                34985
            ],
            "desc": "战斗中施展“暗尘弥散”，效果变更为：使自身获得100点日灵、月魂和8秒“降灵尊”：<BUFF 25731 1 desc>。",
            "belong_key": "belong_38526"
        },
        "41988": {
            "name": "明赦尊谕",
            "skills": [
                35056,
                35057,
                34353,
                34354,
                34355,
                34356,
                34359,
                34361,
                34362,
                34363
            ],
            "desc": "“怖畏暗刑”替换为“明赦尊谕”：<SUB 34347 0>\\n以此方式替换的“明赦尊谕”视为“怖畏暗刑”，但不再充能、施展需基础调息时间、无需目标。\\n",
            "belong_key": "belong_41988"
        },
        "40190": {
            "name": "寂灭劫灰",
            "desc": "“净世破魔击”命中侠士目标使其6秒内受到“净世破魔击·日”伤害提高30%，至多叠加3层，若已叠加至满层则额外使时间延长2秒。消耗满月施展“生死劫”会回收40尺内目标的上述效果并施加给当前目标，以此方式施加最大层数时本次“生死劫·月”造成的伤害提高60%，“月劫”效果提升至60%。",
            "belong_key": "belong_40190"
        },
        "3978": {
            "name": "生灭予夺",
            "desc": "立刻重置“暗尘弥散”“驱夜断愁” “流光囚影”“无明魂锁”调息时间，并使自身<BUFF 4056 0 desc>，持续<BUFF 4056 0 time>。<TALENT 5973 1 伤害招式命中后生灭予夺的调息时间减少1秒，最多降低30秒>",
            "belong_key": "belong_3978"
        },
        "38523": {
            "name": "超凡入圣",
            "desc": "自身“怖畏暗刑”期间目标每受到一次伤害，使自身“日月净世”“幻魔妙相”“御暗烬灭令”套路下所有其他招式调息时间降低1秒，该效果每0.5秒最多触发一次。",
            "belong_key": "belong_38523"
        },
        "41888": {
            "name": "彻世逐邪",
            "recipes": [
                "recipe_5996_1"
            ],
            "desc": "“无明魂锁”调息时间提高8秒，使目标失去行动力期间：不会受到伤害和治疗效果，不可被敌方和友方选中。",
            "belong_key": "belong_41888"
        },
        "41887": {
            "name": "流曜昭劫",
            "desc": "自身的“日劫”效果不会被驱散；“月劫”效果被驱散时根据剩余时间返还至多100点月魂。",
            "belong_key": "belong_41887"
        },
        "14695": {
            "name": "劳心忡寿",
            "desc": "“超然”期间自身受到的范围类伤害降低20%，受治疗成效提高10%。",
            "belong_key": "belong_14695"
        },
        "17567": {
            "name": "用晦而明",
            "recipes": [
                "recipe_5921_1"
            ],
            "buffs": [
                12575
            ],
            "desc": "施展阴阳内功招式造成伤害时无视目标<BUFF 12575 1 desc>防御等级。“生死劫”调息时间提高至12秒，消耗满日或满月施展时使对应阳性或阴性的下3次效果强化至<BUFF 12575 2 desc>。",
            "belong_key": "belong_17567"
        },
        "34395": {
            "name": "日月同辉",
            "desc": "施展“烈日斩”时获得“日月灵魂”，叠满4层后进入“日月同辉”，使自身可施展一次“驱夜断愁”。对非侠士目标施展时直接获得“日月同辉”。",
            "belong_key": "belong_34395"
        },
        "34383": {
            "name": "明光恒照",
            "buffs": [
                25758,
                25759
            ],
            "desc": "消耗满日或满月后，下一次消耗异色满灵施展招式时对应属性内功攻击力提高18%。",
            "belong_key": "belong_34383"
        },
        "6893": {
            "name": "光影",
            "desc": "施展“幻光步”解除自身封内、缴械效果，并使自身不受此类效果影响，持续3秒。",
            "belong_key": "belong_6893"
        },
        "36093": {
            "name": "净恶瑕诛",
            "desc": "施展“流光囚影”后8秒内下三次<BUFF 27062 1 desc>。",
            "belong_key": "belong_36093"
        },
        "32622": {
            "name": "赤日赫炎",
            "desc": "消耗满日施展“生死劫”会标记侠士目标5秒，时间结束后使其受到等同于效果期间受到治疗量30%的伤害。",
            "belong_key": "belong_32622"
        },
        "5985": {
            "name": "幽隐尘迹",
            "recipes": [
                "recipe_5652_1"
            ],
            "desc": "消耗满日施展“净世破魔击”伤害无视目标8%化劲。",
            "belong_key": "belong_5985"
        },
        "5967": {
            "name": "燎原烈火",
            "desc": "消耗满日或满月后获得5%最大气血值的护盾，可叠加2层，持续8秒。",
            "belong_key": "belong_5967"
        },
        "6718": {
            "name": "秽身浴露",
            "desc": "“贪魔体”施展后卸除自身所有混元、阳性、阴性、毒性及持续伤害不利效果，期间每秒回复4%最大气血值，提前结束则获取剩余恢复值。",
            "belong_key": "belong_6718"
        }
    },
    "10243": {
        "10243": {
            "name": "明尊琉璃体",
            "attributes": {
                "magical_shield_base": 3261,
                "physical_shield_base": 3261,
                "vitality_to_max_life": 2253,
                "vitality_to_solar_attack_power": 51,
                "vitality_to_lunar_attack_power": 51,
                "max_life_gain": 245
            },
            "recipes": [
                "recipe_1711_1",
                "recipe_1154_1",
                "recipe_1155_1",
                "recipe_1156_1",
                "recipe_1157_1",
                "recipe_1158_1",
                "recipe_1159_1",
                "recipe_1160_1",
                "recipe_1161_1",
                "recipe_1162_1",
                "recipe_1163_1"
            ],
            "buffs": [
                17885,
                29938
            ],
            "skills": [
                4326,
                19055,
                32816,
                25796,
                35065
            ],
            "desc": "倚托清净解脱门，普愿离诸生死苦。显化妙法无尽藏，明尊肉身琉璃相。动静随心，身化琉璃。",
            "critical_type": "lunar",
            "damage_type": "lunar",
            "belong_key": "belong_10243"
        },
        "3962": {
            "name": "赤日轮",
            "recipes": [
                "recipe_999_1",
                "recipe_1000_1",
                "recipe_1001_1",
                "recipe_1002_1",
                "recipe_1003_1",
                "recipe_1004_1",
                "recipe_1005_1",
                "recipe_1006_1"
            ],
            "buffs": [
                28355
            ],
            "skills": [
                4028,
                4029,
                4030
            ],
            "desc": "三段招式，需连续施展，每次施展获得20点日灵。\\n第一段：对目标造成<SUB 4028 0>阳性内功伤害和100%武器伤害。\\n第二段：对目标及其周围5尺内至多3个敌对目标造成<SUB 4029 0>阳性内功伤害和100%武器伤害。\\n第三段：对目标及其周围6尺内至多6个敌对目标造成<SUB 4030 0>阳性内功伤害和100%武器伤害。<TALENT 3988 1 伤害提高5%><TALENT 3988 2 伤害提高10%><TALENT 4004 2 获得的日灵提高20%><TALENT 5988 1 命中眩晕效果的目标，伤害提高15%；第3段额外获得10点日灵><TALENT 18632 1 命中目标背后将获得“明光”气劲，每层增加自身6%阴、阳性基础攻击力，最多叠加4层，持续30秒><TALENT 18635 1 使下一个“幽月轮”额外获得20点月魂><TALENT 5971 1 日月凌天><TALENT 5969 1 无幽不烛><TALENT 37274 1 无往不复><TALENT 5979 1 天地诛戮><TALENT 6740 1 食肉众生><TALENT 36093 1 净恶瑕诛>",
            "belong_key": "belong_3962"
        },
        "3969": {
            "name": "光明相",
            "recipes": [
                "recipe_1029_1",
                "recipe_1030_1",
                "recipe_1031_1",
                "recipe_1033_1",
                "recipe_1034_1",
                "recipe_1035_1"
            ],
            "buffs": [
                4423
            ],
            "desc": "使自身<BUFF 4423 1 time>内<BUFF 4423 1 desc>。<TALENT 6726 1 获得“光明相”效果时额外获得“圣法光明”气劲，持续5秒。每秒解除自身控制效果（击倒除外），若成功解除，则自身下次攻击附带该效果><TALENT 16851 1 效果持续期间内，造成伤害的40%转化为自身气血值><TALENT 21757 1 在自身范围内生成8尺“羁影”效果，效果持续期间范围内自身被命中的几率降低35%，最多4名敌对玩家目标招式命中降低35%且持续期间视觉会产生影响，效果持续6秒><TALENT 25160 1 五明乐见><TALENT 30776 1 影随光生><TALENT 6749 1 涅槃路><TALENT 18818 1 归寂道><TALENT 18296 1 性命海><TALENT 21835 1 孤月无心><TALENT 6771 1 光明心><TALENT 41889 1 灵光破晓>",
            "belong_key": "belong_3969"
        },
        "3960": {
            "name": "银月斩",
            "recipes": [
                "recipe_992_1",
                "recipe_993_1",
                "recipe_994_1",
                "recipe_995_1",
                "recipe_996_1",
                "recipe_997_1",
                "recipe_998_1"
            ],
            "dots": {
                "4202": [
                    13359
                ]
            },
            "skills": [
                40089
            ],
            "desc": "获得40点月魂，对目标造成<SUB 40089 0>阴性内功伤害和100%武器伤害。命中后附带“银月斩”效果，使目标<BUFF 4202 0 desc>，持续<BUFF 4202 0 time>。若命中有自身“烈日”效果的目标则额外造成破招伤害。<TALENT 5970 1 会心后获得的月魂提高50%><TALENT 25166 1 变为2层充能招式。命中“烈日”效果的目标时，造成<SUB 26709 1>阴性内功伤害><TALENT 18279 1 净身明礼><TALENT 5972 1 腾焰飞芒><TALENT 5978 1 洞若观火><TALENT 6741 1 圣光明>",
            "belong_key": "belong_3960"
        },
        "3963": {
            "name": "烈日斩",
            "recipes": [
                "recipe_1007_1",
                "recipe_1008_1",
                "recipe_1009_1",
                "recipe_1010_1",
                "recipe_1011_1",
                "recipe_1012_1",
                "recipe_1013_1"
            ],
            "skills": [
                40088
            ],
            "desc": "获得40点日灵，对目标造成<SUB 40088 0>阳性内功伤害和100%武器伤害。命中后附带“烈日”效果，使目标受到自身“赤日轮”伤害提高10%，持续<BUFF 4418 1 time>。若命中有自身“银月斩”效果的目标则额外造成破招伤害。<TALENT 5970 1 会心后获得的日灵提高50%><TALENT 25166 1 变为2层充能招式，命中“银月斩”持续伤害效果的目标时，造成<SUB 26708 1>阳性内功伤害><TALENT 18279 1 净身明礼><TALENT 5972 1 腾焰飞芒><TALENT 5978 1 洞若观火><TALENT 34395 1 日月同辉><TALENT 6741 1 圣光明>",
            "belong_key": "belong_3963"
        },
        "3966": {
            "name": "生死劫",
            "recipes": [
                "recipe_1621_1",
                "recipe_1622_1",
                "recipe_1623_1",
                "recipe_1624_1",
                "recipe_1625_1",
                "recipe_1626_1",
                "recipe_1627_1",
                "recipe_1628_1",
                "recipe_5207_1"
            ],
            "skills": [
                6257,
                6258
            ],
            "desc": "耗灵技，需消耗满日或满月，两者对应效果不同。\\n满日：对目标造成<SUB 6257 0>阳性内功伤害和100%武器伤害，并使其<BUFF 4029 0 desc>，持续4秒。\\n满月：对目标造成<SUB 6258 0>阴性内功伤害和100%武器伤害，并使其<BUFF 4030 2 desc>，持续12秒。<TALENT 32623 1 施展“生死劫”后6秒内对敌对玩家施展的“无明魂锁”的眩晕效果降低2秒，在目标气血值高于40%的时受到攻击不会苏醒><TALENT 32640 1 施展“生死劫·日”“生死劫·月”后6秒内可施展二段招式“晦明·日”“晦明·月”对目标造成阳性内功伤害或阴性内功伤害且附带额外效果。“晦明·日”会为目标施加6秒“陨日”效果，使目标伤害随机降低10%到50%并每秒降低的值依次变化，“晦明·月”使目标身上属于自身的“月劫”效果提升5%且无法被驱散和刷新，但目标每次受到自身阳性内功伤害后减少4秒持续时间><TALENT 22888 1 诛邪镇魔><TALENT 5967 1 燎原烈火><TALENT 32622 1 赤日赫炎><TALENT 34372 1 靡业报劫><TALENT 6727 1 善恶如梦><TALENT 17567 1 用晦而明><TALENT 30928 1 采曜生明><TALENT 6760 1 纵遇善缘><TALENT 41889 1 光明相增强劫>",
            "belong_key": "belong_3966"
        },
        "3967": {
            "name": "净世破魔击",
            "recipes": [
                "recipe_1014_1",
                "recipe_1015_1",
                "recipe_1016_1",
                "recipe_1017_1",
                "recipe_1018_1",
                "recipe_1019_1",
                "recipe_1020_1",
                "recipe_1021_1",
                "recipe_5206_1"
            ],
            "skills": [
                14701,
                4476
            ],
            "desc": "耗灵技，需消耗满日或满月，两者对应效果不同。\\n满日：对自身面向180度15尺扇形区域内至多5个敌对目标造成至多<SUB 4483 0>阳性内功伤害和200%武器伤害。优先命中当前选择的目标，且其会受到全额伤害；其余目标则受到半额伤害。\\n满月：快速冲向侠士或4尺外目标，使其眩晕2秒；并连续攻击三次，每次对目标造成<SUB 4476 0>阴性内功伤害和100%武器伤害。<TALENT 6732 1 “净世破魔击·日”的范围扩大到360度；“净世破魔击·月”可以解除自身锁足减速不利效果><TALENT 3993 2 伤害提高6%><TALENT 3993 3 伤害提高9%><TALENT 3997 1 净世破魔击·日命中目标后有50%几率使目标灼烧，使目标<BUFF 4464 1 desc>(+<SKILLEx {D0} {TotalSolarAP 0.2396}>)，持续8秒。净世破魔击·月施展后立刻获得10点日灵、月魂><TALENT 6755 1 威胁值提高30%，施展后恢复5%气血值><TALENT 4005 2 招式附带大量威胁><EnchantID 10097 施展“净世破魔击”，有35%的几率使自身获得“暗尘”效果，可立即施展“驱夜断愁”。><EnchantID 10098 施展“净世破魔击”后随机恢复10至80点日灵和月魂。><TALENT 6895 1 施展后使自身加速率提高2%，可叠加5层，持续20秒><TALENT 25166 1 净体不畏><TALENT 22888 1 诛邪镇魔><TALENT 5985 1 幽隐尘迹><TALENT 5967 1 燎原烈火><TALENT 5968 1 辉耀红尘><TALENT 40190 1 寂灭劫灰><TALENT 25178 1 昭昭><TALENT 14698 1 驱夷逐法><TALENT 25355 1 怜世人>",
            "belong_key": "belong_3967"
        },
        "3959": {
            "name": "幽月轮",
            "recipes": [
                "recipe_984_1",
                "recipe_985_1",
                "recipe_986_1",
                "recipe_987_1",
                "recipe_988_1",
                "recipe_989_1",
                "recipe_990_1",
                "recipe_991_1"
            ],
            "skills": [
                4024,
                4025,
                4026
            ],
            "desc": "三段招式，需连续施展，每次施展获得20点月魂。\\n第一段：对目标造成<SUB 4024 0>阴性内功伤害和100%武器伤害。\\n第二段：对目标造成<SUB 4025 0>阴性内功伤害和100%武器伤害，本段会心额外提高5%。\\n第三段：对目标造成<SUB 4026 0>阴性内功伤害和100%武器伤害，本段会心额外提高10%。<TALENT 4004 2 获得的月魂提高20%><TALENT 5988 1 命中眩晕效果的目标，伤害提高15%；第3段额外获得10点月魂><TALENT 18632 1 命中目标背后将获得“明光”气劲，每层增加自身6%阴、阳性基础攻击力，最多叠加4层，持续30秒><TALENT 18635 1 使下一个“赤日轮”额外获得20点日灵><TALENT 5971 1 日月凌天><TALENT 5969 1 无幽不烛><TALENT 37274 1 无往不复><TALENT 5979 1 天地诛戮><TALENT 6740 1 食肉众生><TALENT 36093 1 净恶瑕诛>",
            "belong_key": "belong_3959"
        },
        "3980": {
            "name": "戒火斩",
            "attributes": {
                "solar_damage_base": 272,
                "solar_damage_rand": 28
            },
            "recipes": [
                "recipe_1613_1",
                "recipe_1614_1",
                "recipe_1615_1",
                "recipe_1616_1",
                "recipe_1617_1",
                "recipe_1618_1",
                "recipe_1619_1",
                "recipe_1620_1"
            ],
            "skills": [
                3980
            ],
            "desc": "对目标造成<SKILL SolarDamage>点(+<SKILLEx {D0} {SkillSolarAP}>)阳性内功伤害，并使其<BUFF 4058 1 desc>，持续<BUFF 4058 1 time>。该招式附带额外威胁值。<TALENT 6766 1 施展后获得20点日灵、月魂><EnchantID 10096 戒火斩使目标的易伤效果由2%提高到5%>",
            "belong_key": "belong_3980"
        },
        "14678": {
            "name": "圣浴明心",
            "desc": "完整运功“朝圣言”使自身“朝圣”效果延长5分钟，但层数衰减至十分之一；“朝圣”每层提供的无双等级提高至835点。",
            "belong_key": "belong_14678"
        },
        "14679": {
            "name": "耀火生瑞",
            "desc": "“朝圣言”效果期间团队成员不再获得无双等级提升效果，但是受到的所有伤害降低30%。",
            "belong_key": "belong_14679"
        },
        "14680": {
            "name": "流沙渡",
            "desc": "“朝圣言”施展时会消耗掉所有日灵、月魂，每2点日灵、月魂将降低1秒“朝圣言”调息时间。",
            "belong_key": "belong_14680"
        },
        "14922": {
            "name": "心火叹",
            "attributes": {
                "solar_damage_base": 200,
                "solar_damage_rand": 15
            },
            "skills": [
                14922
            ],
            "desc": "消耗一次满日和满月后方可施展，立刻攻击目标造成大量威胁值，并使自身吸收下一次受到的伤害效果，最多不超过自身气血值上限的20%。",
            "belong_key": "belong_14922"
        },
        "5974": {
            "name": "血泪成悦",
            "desc": "造成伤害的10%转化为自身气血。",
            "belong_key": "belong_5974"
        },
        "6743": {
            "name": "慈悲心",
            "recipes": [
                "recipe_1324_1"
            ],
            "desc": "“慈悲愿”调息时间降低5秒。",
            "belong_key": "belong_6743"
        },
        "18279": {
            "name": "净身明礼",
            "recipes": [
                "recipe_5149_1",
                "recipe_5150_1"
            ],
            "skills": [
                40931,
                40932
            ],
            "desc": "“烈日斩”“银月斩”伤害提高25%，施展时对目标周围6尺的5个目标造成<SUB 40931 1>阳性或<SUB 40932 1>阴性内功伤害，并附带“烈日”或“银月斩”效果。",
            "belong_key": "belong_18279"
        },
        "3961": {
            "name": "寒月耀",
            "attributes": {
                "lunar_damage_base": 20,
                "lunar_damage_rand": 5,
                "physical_attack_power_gain": -1024
            },
            "skills": [
                3961
            ],
            "desc": "打断目标运功，并对其造成<SKILL LunarDamage>点(+<SKILLEx {D0} {SkillLunarAP}>)阴性内功伤害和100%武器伤害。命中正在运功的侠士目标后使自身获得满月。",
            "belong_key": "belong_3961"
        },
        "14698": {
            "name": "驱夷逐法",
            "buffs": [
                12578
            ],
            "desc": "日灵月魂均高于60点时，“净世破魔击”伤害提高40%。",
            "belong_key": "belong_14698"
        },
        "3984": {
            "name": "渡厄力",
            "recipes": [
                "recipe_1065_1",
                "recipe_1066_1",
                "recipe_1067_1",
                "recipe_1070_1",
                "recipe_1071_1"
            ],
            "desc": "为自身周围8尺范围内最多25个团队成员添加一层护盾，可化解2859点伤害，并可额外化解相当于该团队成员10%气血最大值的伤害，持续10秒。<TALENT 4010 1 每点体质可额外化解3点伤害，该效果只对自己生效><TALENT 6003 1 每点体质可额外化解3点伤害，该效果只对自己生效><TALENT 6004 1 化解伤害的比例提高到15%>",
            "belong_key": "belong_3984"
        },
        "3971": {
            "name": "极乐引",
            "desc": "在自身当前位置生成15尺“极乐引”，4秒内可施展二段招式，<SUB 3972 0>\\n“明尊琉璃体”心法下强制“极乐引”范围内及被二段招式命中的目标攻击自身，持续4秒，并使自身造成的威胁值提高100%，周围30尺范围内所有团队成员获得无威胁气劲，持续8秒。",
            "belong_key": "belong_3971"
        },
        "3981": {
            "name": "归寂道",
            "desc": "使目标<BUFF 4429 4 desc>，持续<BUFF 4429 4 time>。",
            "belong_key": "belong_3981"
        },
        "25166": {
            "name": "净体不畏",
            "recipes": [
                "recipe_5507_1",
                "recipe_5508_1"
            ],
            "buffs": [
                30644
            ],
            "skills": [
                26708,
                26709
            ],
            "desc": "“烈日斩”“银月斩”调息时间降低1秒，命中自身异色斩不利效果的目标会将其消耗并使本次造成的伤害提高50%。“净世破魔击”命中自身同色斩不利效果的目标造成<SUB 26708 0>对应属性内功额外伤害，若目标非侠士则此伤害提高75%。",
            "belong_key": "belong_25166"
        },
        "6896": {
            "name": "伐魔忏罪",
            "desc": "当自身气血值低于40%时，受到伤害后立刻重置“贪魔体”的调息时间，并使自身每秒回复8%气血最大值，持续5秒,该效果每80秒最多触发一次。",
            "belong_key": "belong_6896"
        },
        "5977": {
            "name": "火舞长空",
            "skills": [
                29933
            ],
            "desc": "“贪魔体”效果消失时，在自身位置生成10尺“火舞长空”效果，持续10秒。“火舞长空”会持续灼烧范围内至多6个敌对目标，且每次“灼烧”都将降低自身“贪魔体”1秒调息时间(每秒至多触发一次)。",
            "belong_key": "belong_5977"
        },
        "18296": {
            "name": "无量妙境",
            "skills": [
                42566
            ],
            "desc": "“光明相”效果生效获得满灵时，原有的溢出灵魂会被转化为异色灵魂，每转化20点灵魂对当前目标额外追加一段<SUB 42565 0>内功伤害和一次0.2倍破招伤害。",
            "belong_key": "belong_18296"
        },
        "6895": {
            "name": "妙镜惊寂",
            "desc": "施展“净世破魔击”使自身获得2%可突破上限的额外加速率，可叠加5层，持续20秒。",
            "belong_key": "belong_6895"
        },
        "14677": {
            "name": "辟滞扈沙",
            "desc": "自身气血值低于60%，受到攻击伤害超过自身气血最大值20%，则该次伤害降低30%。",
            "belong_key": "belong_14677"
        },
        "25160": {
            "name": "五明乐见",
            "recipes": [
                "recipe_5208_1"
            ],
            "desc": "“光明相”调息时间降低5秒，效果提高至3次。",
            "belong_key": "belong_25160"
        },
        "18298": {
            "name": "忏罪归清",
            "desc": "受到伤害则使自身御劲提高5%，持续8秒。",
            "belong_key": "belong_18298"
        },
        "6760": {
            "name": "纵遇善缘",
            "recipes": [
                "recipe_5822_1"
            ],
            "skills": [
                40255
            ],
            "desc": "“生死劫”调息时间提高至25秒，施展后抵挡下一次受到的伤害，持续2秒。若抵挡的伤害来源为本次“生死劫”的目标，则立即对其造成<SUB 40255 0>阳性内功伤害，并使自身<BUFF 30432 1 desc>，持续30秒。",
            "belong_key": "belong_6760"
        },
        "18634": {
            "name": "秘影诡行",
            "desc": "“幻光步”变为瞬间释放，并可解除自身受控状态(击倒除外)。",
            "belong_key": "belong_18634"
        },
        "21835": {
            "name": "孤月无心",
            "recipes": [
                "recipe_2739_1"
            ],
            "desc": "“光明相”可充能2层，充能时间提高20秒。满月状态下施展“光明相”可将自身内功防御属性转换为外功防御属性，满日状态施展“光明相”可将自身外功防御属性转换为内功防御属性，持续10秒。",
            "belong_key": "belong_21835"
        },
        "6771": {
            "name": "光明心",
            "desc": "施展“光明相”获得50%最大气血值的护盾，持续5秒。若护盾被提前击破，则使“光明相”调息期间自身受到的伤害降低10%；否则根据结束时的剩余护盾量返还“光明相”至多50%剩余调息时间。",
            "belong_key": "belong_6771"
        },
        "25355": {
            "name": "怜世人",
            "buffs": [
                18222
            ],
            "desc": "消耗满日施展“净世破魔击”，使自身15秒内<BUFF 18222 3 desc>，最多叠加3层。",
            "belong_key": "belong_25355"
        },
        "6898": {
            "name": "超凡入圣",
            "attributes": {
                "max_life_gain": 102
            },
            "desc": "基础气血上限提高10%，被疗伤成效提高10%。",
            "belong_key": "belong_6898"
        },
        "14675": {
            "name": "宿角生辉",
            "desc": "“慈悲愿”外功闪避效果降低至15%，持续10秒，效果期间自身威胁值提高30%。",
            "belong_key": "belong_14675"
        },
        "14674": {
            "name": "殇未悔",
            "desc": "“慈悲愿”外功闪避几率提高至60%。",
            "belong_key": "belong_14674"
        },
        "6766": {
            "name": "斩火",
            "desc": "施展“戒火斩”获得40点日灵。",
            "belong_key": "belong_6766"
        },
        "6897": {
            "name": "破死忘生",
            "desc": "外功闪避后使自身回复5%气血最大值，该效果1秒内最多触发一次。",
            "belong_key": "belong_6897"
        },
        "5990": {
            "name": "知我罪我",
            "skills": [
                6734
            ],
            "desc": "“幻光步”落地时，对周围8尺内的6个目标造成<SUB 6734 0>阴性内功伤害，强迫其攻击自身并使其眩晕3秒。",
            "belong_key": "belong_5990"
        },
        "26717": {
            "name": "极本溯源",
            "desc": "“明尊”气劲还将每1点体质提高0.09点内功会心等级。",
            "belong_key": "belong_26717"
        },
        "6763": {
            "name": "除荡旷劫",
            "desc": "消耗满日后，使自身的外功基础防御等级提高18%，持续10秒；消耗满月后，使自身的内功防御等级提高18%，持续10秒。",
            "belong_key": "belong_6763"
        },
        "6719": {
            "name": "贪魔伐罪",
            "recipes": [
                "recipe_4696_1"
            ],
            "skills": [
                6737
            ],
            "desc": "“贪魔体”的减伤效果减少到40%，充能时间降低10秒，效果期间每0.6秒对周围8尺范围的5个目标造成<SUB 6737 1>阴性内功伤害，并使其强制攻击自身。",
            "belong_key": "belong_6719"
        },
        "6753": {
            "name": "圣火燃心",
            "desc": "消耗满日或满月后，恢复自身5%气血值。",
            "belong_key": "belong_6753"
        },
        "6000": {
            "name": "月尽天明",
            "desc": "施展“日月净世”、“大圣明尊法”套路招式造成阴性或阳性伤害时，朝圣言的调息时间降低1秒。",
            "belong_key": "belong_6000"
        },
        "25178": {
            "name": "昭昭",
            "skills": [
                25179
            ],
            "desc": "施展“净世破魔击”命中自身“戒火斩”效果目标将额外造成一次<SUB 25179 0>伤害。",
            "belong_key": "belong_25178"
        },
        "5976": {
            "name": "镇魔极道",
            "recipes": [
                "recipe_1074_2"
            ],
            "skills": [
                4067
            ],
            "desc": "“贪魔体”效果消失时对自身周围8尺范围内的敌对目标造成<SUB 4067 0>阴性内功伤害，并使其2秒内眩晕且强制攻击自身。",
            "belong_key": "belong_5976"
        },
        "6748": {
            "name": "归寂无息",
            "desc": "“慈悲愿”可以对目标6尺范围内最多6个目标生效。",
            "belong_key": "belong_6748"
        },
        "6718": {
            "name": "秽身浴露",
            "desc": "“贪魔体”施展后卸除自身所有混元、阳性、阴性、毒性及持续伤害不利效果，期间每秒回复4%最大气血值，提前结束则获取剩余恢复值。",
            "belong_key": "belong_6718"
        }
    },
    "10268": {
        "5268": {
            "name": "酒中仙",
            "buffs": [
                30400
            ],
            "skills": [
                32898
            ],
            "desc": "大口喝酒，获得20%内力和35点“醉意”，并使下一次“亢龙有悔”额外触发<NounID 71><SUB 32898 1>外功伤害，“醉意”将使自身获得<NounID 9>效果，“醉意”达到100后可施展二段招式“醉逍遥”，使自身进入到30秒的<NounID 6>。<TALENT 41993 1 敏行><TALENT 40646 1 施展“醉逍遥”时，使自身周围6尺内的3个敌对侠士目标4秒内无法施展内功和外功招式><TALENT 32725 1 额外获得10%内力，并使下一个“亢龙有悔”触发的额外伤害提高20%><TALENT 6839 1 施展“酒中仙”时，当前选择的30尺内团队目标将与自身进入12秒“对酌”，双方携带“对酌”并施展伤害招式在3秒内命中同一个敌方目标时，对目标造成伤害并降低其调息速度50%，持续4秒，“对酌”效果每30秒只会触发一次><TALENT 28818 1 “昊破”持续期间施展“降龙掌”套路招式命中目标会造成额外伤害，该伤害无视35%的化劲等级>",
            "belong_key": "belong_5268"
        },
        "5262": {
            "name": "龙跃于渊",
            "recipes": [
                "recipe_1413_1",
                "recipe_1414_1",
                "recipe_1415_1",
                "recipe_1416_1",
                "recipe_1417_1",
                "recipe_1418_1",
                "recipe_1419_1",
                "recipe_4781_1"
            ],
            "dots": {
                "6367": [
                    6853
                ]
            },
            "skills": [
                6355,
                6356,
                6357
            ],
            "desc": "消耗30%内力，使目标锁足2秒并给其添加1层<NounID 11>，若目标存在<NounID 10>效果则获得满层<NounID 11>；冲向目标并对其造成<SKILL_[6355_0;6356_0;6357_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[6355_0;6356_0;6357_0]}>)外功伤害。<TALENT 6811 1 安患><TALENT 6832 1 “越渊”效果持续期间只会对4尺外的目标触发冲刺效果><TALENT 14625 1 “龙跃于渊”将对有自身“灼烧”效果已达到层数上限的目标造成额外伤害><TALENT 6818 1 “灼烧”效果持续时间提高100%，可叠加10层><TALENT 6838 1 “龙跃于渊”调息时间降低1秒，不受招式控制效果的时间提高到5秒，并使下一次具有调息时间的伤害招式施展后返还其30%的调息时间>",
            "belong_key": "belong_5262"
        },
        "10268": {
            "name": "笑尘诀",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 3314,
                "strength_to_physical_attack_power": 1772,
                "strength_to_physical_overcome": 553,
                "max_life_gain": 245,
                "physical_attack_power_base": 6839
            },
            "recipes": [
                "recipe_5844_1",
                "recipe_5661_1",
                "recipe_4872_1"
            ],
            "skills": [
                32908,
                25779
            ],
            "desc": "降龙伏虎谈笑中，清风浊酒伴我行。至刚至猛亦灵动多变，丐帮武学易学难精，招式一气呵成，令敌人应接不暇。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10268"
        },
        "5258": {
            "name": "拨狗朝天",
            "recipes": [
                "recipe_1340_1",
                "recipe_1341_1",
                "recipe_1342_1",
                "recipe_1343_1",
                "recipe_1344_1",
                "recipe_1345_1",
                "recipe_1346_1",
                "recipe_1347_1"
            ],
            "skills": [
                13524
            ],
            "desc": "对目标造成<SUB 13524 0>外功伤害，并获得15%内力。<TALENT 6809 1 “拨狗朝天”“横打双獒”伤害提高10%><TALENT 38878 1 “拨狗朝天”“横打双獒”命中目标会获得1个破招点数。触发破招伤害时会额外追加<SUB 38891 1>外功伤害>",
            "belong_key": "belong_5258"
        },
        "5354": {
            "name": "横打双獒",
            "recipes": [
                "recipe_1355_1",
                "recipe_1356_1",
                "recipe_1357_1",
                "recipe_1358_1",
                "recipe_1359_1",
                "recipe_1360_1",
                "recipe_1361_1",
                "recipe_1362_1"
            ],
            "skills": [
                6377,
                6378
            ],
            "desc": "“拨狗朝天”后方可施展。对目标造成<SKILL_[6377_0;6378_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[6377_0;6378_0]}>)外功伤害，并获得15%内力。<TALENT 6809 1 “拨狗朝天”“横打双獒”伤害提高10%><TALENT 38878 1 “拨狗朝天”“横打双獒”命中目标会获得1个破招点数。触发破招伤害时会额外追加<SUB 38891 1>外功伤害>",
            "belong_key": "belong_5354"
        },
        "5361": {
            "name": "恶狗拦路",
            "recipes": [
                "recipe_1348_1",
                "recipe_1349_1",
                "recipe_1350_1",
                "recipe_1351_1",
                "recipe_1352_1",
                "recipe_1353_1",
                "recipe_1354_1"
            ],
            "skills": [
                13520
            ],
            "desc": "运功1秒后，对前方8尺扇形区域内的目标造成<SKILL_[13520_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[13520_0]}>)外功伤害，并使其<BUFF 6074 1 desc>，持续<BUFF 6074 1 time>。<TALENT 32731 1 施展后目标获得“恶狗拦路”不利效果且未被自身击出“心窍”的目标时，使用“亢龙有悔”招式会将其“心窍”击出体外><TALENT 38654 1 醉步>",
            "belong_key": "belong_5361"
        },
        "5362": {
            "name": "犬牙交错",
            "skills": [
                13523
            ],
            "desc": "需“恶狗拦路”命中目标才能施展。对自身周围6尺内的敌对目标造成<SKILL_[13520_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[13523_0]}>)外功伤害，并恢复自身50%内力。<TALENT 38654 1 醉步>",
            "belong_key": "belong_5362"
        },
        "5260": {
            "name": "天下无狗",
            "recipes": [
                "recipe_1392_1",
                "recipe_1393_1",
                "recipe_1394_1",
                "recipe_1395_1",
                "recipe_1396_1",
                "recipe_1397_1",
                "recipe_1398_1"
            ],
            "skills": [
                13503,
                6382,
                13504,
                6384,
                6385,
                6386,
                13505,
                6388,
                6389,
                6390,
                6391
            ],
            "desc": "需按住按键蓄力，蓄力越久伤害越高。最低对自身周围6尺内的5个目标造成<SUB 5357 0>外功伤害，最高对周围5个目标造成<SUB 5359 0>外功伤害，同时每次击中一个被僵直的目标获得20%内力。<TALENT 6810 1 调息时间提高37秒，完整蓄力后，每段“天下无狗”将消耗10点“醉意”，命中目标后会叠加一层“落水打狗”效果><TALENT 6816 1 满蓄力施展“天下无狗”，伤害提高60%，并使下一个“天下无狗”调息时间降低6秒>",
            "belong_key": "belong_5260"
        },
        "5259": {
            "name": "棒打狗头",
            "skills": [
                6379,
                6380
            ],
            "desc": "恢复30%内力，打断目标运功，冲向目标，使目标定身2秒并对其造成<SUB 5356 0>外功伤害。<TALENT 40646 1 >",
            "belong_key": "belong_5259"
        },
        "5257": {
            "name": "蜀犬吠日",
            "recipes": [
                "recipe_1363_1",
                "recipe_1364_1",
                "recipe_1365_1",
                "recipe_1366_1",
                "recipe_1367_1",
                "recipe_1368_1",
                "recipe_1369_1",
                "recipe_1370_1"
            ],
            "skills": [
                6353,
                6351,
                6352,
                6354
            ],
            "desc": "立刻冲向目标，对目标造成多次共计<SUB 5351 0>外功伤害并回复自身60%内力和5个破招点，基于自身最大生命值的50%击碎其护盾值。<TALENT 6822 1 贞固><TALENT 42045 1 武勇><TALENT 6832 1 “越渊”效果持续期间只会对4尺外的目标触发冲刺效果><TALENT 6815 1 “蜀犬吠日”不再消耗内力，反而恢复60%内力><TALENT 26701 1 “蜀犬吠日”不再需要施展目标，自身向前挥击打狗棒攻击前方的目标并添加“踉跄”效果，施展时自身僵直时间和造成控制时间延长且抵挡受到的伤害，若招式没有命中过目标则返还6秒“蜀犬吠日”调息时间><TALENT 6845 1 “蜀犬吠日”招式伤害提高20%，施展后恢复所有内力>",
            "belong_key": "belong_5257"
        },
        "5367": {
            "name": "蛟龙翻江",
            "skills": [
                6358,
                6359,
                13526
            ],
            "desc": "消耗15%内力，冲向目标造成<SKILL_[6358_0;6359_0;13526_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[6358_0;6359_0;13526_0]}>)外功伤害并添加12秒<NounID 12>效果。<TALENT 15211 1 宽野><TALENT 6812 1 伤害提高10%><TALENT 37339 1 “蛟龙翻江”“双龙取水”“龙游天地”“龙腾五岳”3秒内连续命中目标则每次伤害额外提高10%><TALENT 6836 1 调息时间降低5秒><TALENT 6842 1 息元>",
            "belong_key": "belong_5367"
        },
        "5368": {
            "name": "双龙取水",
            "skills": [
                13527
            ],
            "desc": "消耗15%内力，冲向目标造成<SKILL_[13527_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[13527_0]}>)外功伤害并添加12秒<NounID 12>效果。<TALENT 6842 1 息元><TALENT 15211 1 宽野><TALENT 37339 1 “蛟龙翻江”“双龙取水”“龙游天地”“龙腾五岳”3秒内连续命中目标则每次伤害额外提高10%>",
            "belong_key": "belong_5368"
        },
        "5369": {
            "name": "龙游天地",
            "skills": [
                6362,
                6363,
                13528
            ],
            "desc": "消耗15%内力，冲向目标造成<SKILL_[6362_0;6363_0;13528_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[6362_0;6363_0;13528_0]}>)外功伤害并添加12秒<NounID 12>效果。<TALENT 15211 1 宽野><TALENT 6842 1 息元><TALENT 37339 1 “蛟龙翻江”“双龙取水”“龙游天地”“龙腾五岳”3秒内连续命中目标则每次伤害额外提高10%>",
            "belong_key": "belong_5369"
        },
        "5370": {
            "name": "龙腾五岳",
            "recipes": [
                "recipe_1420_1",
                "recipe_1421_1",
                "recipe_1422_1",
                "recipe_1423_1",
                "recipe_1424_1",
                "recipe_1425_1",
                "recipe_1426_1"
            ],
            "skills": [
                13529
            ],
            "desc": "消耗15%内力，冲向目标造成<SKILL_[13529_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[13529_0]}>)外功伤害并添加12秒<NounID 12>效果。<TALENT 6842 1 息元><TALENT 15211 1 “龙腾五岳”不再给目标添加“翻江”效果，而是使目标剩余“翻江”时间转换为重创，每6秒“翻江”将转化为1层“重创”，最多转化2层><TALENT 14628 1 施展“龙腾五岳”后，下一次亢龙有悔伤害提高40%，5秒后衰减为20%><TALENT 37339 1 “蛟龙翻江”“双龙取水”“龙游天地”“龙腾五岳”3秒内连续命中目标则每次伤害额外提高10%>",
            "belong_key": "belong_5370"
        },
        "5266": {
            "name": "龙战于野",
            "recipes": [
                "recipe_1597_1",
                "recipe_1598_1",
                "recipe_1599_1",
                "recipe_1600_1",
                "recipe_1601_1",
                "recipe_1602_1",
                "recipe_1603_1",
                "recipe_1604_1",
                "recipe_6168_1"
            ],
            "skills": [
                6366,
                6367,
                6368
            ],
            "desc": "消耗20%内力，快速冲向目标，对目标造成<SKILL_[6366_0;6367_0;6368_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[6366_0;6367_0;6368_0]}>)外功伤害，并眩晕3秒。<TALENT 14816 1 施展距离提高五尺，命中目标后，使目标锁足2秒><TALENT 6832 1 “越渊”效果持续期间只会对4尺外的目标触发冲刺效果><TALENT 42045 1 武勇>",
            "belong_key": "belong_5266"
        },
        "5638": {
            "name": "亢龙有悔",
            "recipes": [
                "recipe_1372_1",
                "recipe_1373_1",
                "recipe_1374_1",
                "recipe_1375_1",
                "recipe_1376_1",
                "recipe_1377_1"
            ],
            "skills": [
                6369,
                6370,
                6371,
                6372,
                6373,
                6374
            ],
            "desc": "需要30%以上内力才能施展。终结技，消耗所有内力，击出多掌，将目标打飞，造成<SKILL_[6369_0;6370_0;6371_0;6372_0;6373_0;6374_1] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[6369_0;6370_0;6371_0;6372_0;6373_0;6374_1]}>)外功伤害，获得2个破招点，每满5个破招点触发1次破招伤害。<TALENT 21284 1 洪荒><TALENT 6812 1 “亢龙有悔”的伤害提高10%><TALENT 6823 1 每施展2次“亢龙有悔”，使下一次“亢龙有悔”会心效果提高20%，且施展后回复自身30%内力并重置“龙跃于渊”调息时间><TALENT 6843 1 当多于50%、60%、70%内力时施展“亢龙有悔”，使自身技能伤害分别提高5%、10%、20%，持续8秒><TALENT 6822 1 贞固><TALENT 6814 1 少于50%内力时施展“亢龙有悔”，使自身技能伤害提高15%，持续8秒><EnchantID 10099 施展“亢龙有悔”后随机恢复自身10%至50%内力><TALENT 14633 1 “亢龙有悔”向前方一掌打出飞龙气劲，对其经过路径上的敌对目标造成伤害，并回复50%内力，施展时内力越高，伤害越高且范围越大><TALENT 32731 1 “亢龙有悔”命中拥有“恶狗拦路”不利效果且未被自身击出“心窍”的目标时，会将其“心窍”击出至身后最远12尺位置，“心窍”存在期间目标的所有减伤效果降低20%并每秒受到外功伤害，目标可以靠近并消除“心窍”并受到<SUB 32770 1>伤害，“心窍”存在时间越长，造成的伤害越高，在产生6秒后消除并对目标造成<SUB 32770 6>伤害><TALENT 6824 1 “亢龙有悔”施展时间缩短，所有伤害分三掌打出，且该伤害提高60%><TALENT 30774 1 调息时间增加至8秒，施展消耗20%内力，施展获得“霸体”的同时获得20%最大生命值的护盾，护盾存在时使自身下一招“亢龙有悔”招式伤害不断提高，护盾在霸体效果结束或刷新的4秒后消失>",
            "belong_key": "belong_5638"
        },
        "5263": {
            "name": "时乘六龙",
            "skills": [
                13510
            ],
            "desc": "消耗20%内力，对周围5尺内5个敌对目标造成<SKILL_[13510_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[13510_0]}>)外功伤害。<TALENT 25184 1 接舆>",
            "belong_key": "belong_5263"
        },
        "5365": {
            "name": "狂龙乱舞",
            "recipes": [
                "recipe_1399_1",
                "recipe_1400_1",
                "recipe_1401_1",
                "recipe_1402_1",
                "recipe_1403_1",
                "recipe_1404_1",
                "recipe_1405_1"
            ],
            "skills": [
                6582,
                13512,
                6584,
                6585
            ],
            "desc": "“时乘六龙”施展后方可施展。消耗10%内力，对周围5尺最多5个目标造成<SKILL_[6582_0;13512_0;6584_0;6585_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[6582_0;13512_0;6584_0;6585_0]}>)外功伤害，并使下2跳<NounID 11>立即生效。<TALENT 25194 1 结束落地时会额外造成一次5尺范围对5个目标的外功伤害，“狂龙乱舞”期间命中目标的次数越多，范围伤害越高>",
            "belong_key": "belong_5365"
        },
        "5267": {
            "name": "龙啸九天",
            "recipes": [
                "recipe_1406_1",
                "recipe_1407_1",
                "recipe_1408_1",
                "recipe_1409_1",
                "recipe_1410_1",
                "recipe_1411_1",
                "recipe_1412_1"
            ],
            "skills": [
                5528
            ],
            "desc": "使自身受到的伤害降低60%，持续8秒，并对自身半径6尺范围内最多5个目标，造成<SKILL_[5528_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[5528_0]}>)外功伤害，若处于<NounID 6>则会击飞这些目标。<TALENT 6830 1 “龙啸九天”每命中一个目标，持续时间增加1秒并回复5%气血值，同时“龙啸九天”能够击毁攻击范围内最多5个气场和可见机关>",
            "belong_key": "belong_5267"
        },
        "6939": {
            "name": "天隼击",
            "attributes": {
                "physical_damage_base": 537,
                "physical_damage_rand": 54
            },
            "skills": [
                6939
            ],
            "desc": "测试技能",
            "belong_key": "belong_6939"
        },
        "40264": {
            "name": "断江流",
            "attributes": {
                "physical_damage_base": 35,
                "physical_damage_rand": 5
            },
            "skills": [
                40264
            ],
            "desc": "对自身周围6尺4个目标造成<SKILL PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP}>)外功伤害，并使其获得10秒<NounID 10>效果，若目标为侠士，则额外附带<NounID 51>效果。<TALENT 6813 1 御龙><TALENT 40725 1 每层“荡扬”使敌方侠士目标被会心几率提高3%><TALENT 43059 1 共醉>",
            "belong_key": "belong_40264"
        },
        "6818": {
            "name": "雨龙",
            "dots": {
                "6401": [
                    6867
                ]
            },
            "desc": "“灼烧”效果持续时间提高100%，可叠加10层。",
            "belong_key": "belong_6818"
        },
        "6824": {
            "name": "驯致",
            "buffs": [
                32180
            ],
            "skills": [
                19435,
                8491
            ],
            "desc": "“亢龙有悔”施展时间缩短，所有伤害分三掌打出，且该伤害提高33%，<NounID 6>持续期间每秒额外提高“亢龙有悔”2%伤害，最多提高60%。",
            "belong_key": "belong_6824"
        },
        "14633": {
            "name": "亢野",
            "recipes": [
                "recipe_5933_1"
            ],
            "skills": [
                18913
            ],
            "desc": "“亢龙有悔”调息时间提高至4秒，向前方一掌打出飞龙气劲，对其经过路径上的敌对目标造成伤害，并回复50%内力，施展时内力越高，伤害越高且范围越大。",
            "belong_key": "belong_14633"
        },
        "25184": {
            "name": "接舆",
            "recipes": [
                "recipe_5990_1"
            ],
            "desc": "“时乘六龙”调息时间降低7秒，会使拥有<NounID 10>效果的目标获得5层<NounID 11>不利效果。",
            "belong_key": "belong_25184"
        },
        "6822": {
            "name": "贞固",
            "desc": "进入<NounID 6>后7秒内施展“蜀犬吠日”“亢龙有悔”自身不会进入僵直。",
            "belong_key": "belong_6822"
        },
        "43059": {
            "name": "共醉",
            "recipes": [
                "recipe_6201_1"
            ],
            "desc": "“断江流”调息时间降低17秒，不再附带<NounID 51>效果。",
            "belong_key": "belong_43059"
        },
        "42099": {
            "name": "饮江",
            "desc": "<NounID 51>持续期间目标每次受到会心伤害则目标被会心几率额外提高2%，最多叠加20%。",
            "belong_key": "belong_42099"
        },
        "38878": {
            "name": "追远",
            "skills": [
                38891
            ],
            "desc": "“拨狗朝天”“横打双獒”命中目标会获得1个破招点数。触发破招伤害时会额外追加<SUB 38891 1>外功伤害。",
            "belong_key": "belong_38878"
        },
        "6843": {
            "name": "含弘",
            "recipes": [
                "recipe_1432_1",
                "recipe_1433_1"
            ],
            "buffs": [
                12356
            ],
            "desc": "当多于50%、60%、70%内力时施展“亢龙有悔”，使自身技能伤害分别提高3%、5%、11%，持续12秒。",
            "belong_key": "belong_6843"
        },
        "6814": {
            "name": "复礼",
            "buffs": [
                12356
            ],
            "desc": "少于50%内力时施展“亢龙有悔”，使自身技能伤害提高7%，持续12秒。",
            "belong_key": "belong_6814"
        },
        "42045": {
            "name": "武勇",
            "desc": "施展“蜀犬吠日”立刻重置“龙战于野”调息时间。",
            "belong_key": "belong_42045"
        },
        "6337": {
            "name": "饮莫停",
            "desc": "冲向目标，以烈酒攻击对方，攻击结束后目标倒地5秒，起身后获得8秒<NounID 54>效果。",
            "belong_key": "belong_6337"
        },
        "15211": {
            "name": "宽野",
            "recipes": [
                "recipe_6110_1"
            ],
            "desc": "“双龙取水”“龙游天地”“龙腾五岳”额外使目标获得1层<NounID 75>。",
            "belong_key": "belong_15211"
        },
        "37339": {
            "name": "易损",
            "buffs": [
                30473
            ],
            "desc": "“蛟龙翻江”“双龙取水”“龙游天地”“龙腾五岳”每段招式在3秒内施展则伤害递增26%。",
            "belong_key": "belong_37339"
        },
        "38656": {
            "name": "满盈",
            "desc": "“笑醉狂”可以移动施展，期间移动速度提高100%，完整运功则额外恢复40%气血值和内力值。",
            "belong_key": "belong_38656"
        },
        "6832": {
            "name": "越渊",
            "buffs": [
                5994
            ],
            "desc": "招式对非侠士目标伤害提高12%，自身招式内力消耗降低25%，无视目标50%外功防御，“龙战于野”“龙跃于渊”“蜀犬吠日”只会对4尺外的目标触发冲刺效果，进入<NounID 6>后该效果消失。",
            "belong_key": "belong_6832"
        },
        "15212": {
            "name": "催盏",
            "desc": "<NounID 11>被卸除不会消失，而是转移至被卸除目标30尺内的其他小队成员身上。",
            "belong_key": "belong_15212"
        },
        "43206": {
            "name": "交错",
            "recipes": [
                "recipe_6217_1",
                "recipe_6218_1"
            ],
            "desc": "“拨狗朝天”“横打双獒”会心提高20%，无视目标35%化劲等级。",
            "belong_key": "belong_43206"
        },
        "6830": {
            "name": "知至",
            "desc": "“龙啸九天”减伤效果持续时间增加2秒并回复10%气血值，同时“龙啸九天”能够击毁攻击范围内最多5个气场和可见机关。",
            "belong_key": "belong_6830"
        },
        "6845": {
            "name": "自强",
            "recipes": [
                "recipe_5879_1"
            ],
            "desc": "“蜀犬吠日”招式伤害提高20%，施展后恢复所有内力。",
            "belong_key": "belong_6845"
        },
        "41993": {
            "name": "敏行",
            "desc": "“酒中仙”每次获得的<NounID 8>降低10点，<NounID 6>持续时间提高15秒，<NounID 6>结束后还会获得7秒免疫控制效果（被推被拉除外）。",
            "belong_key": "belong_41993"
        },
        "40646": {
            "name": "复征",
            "desc": "施展“醉逍遥”后6秒内下一个“棒打狗头”使目标4秒内无法施展内功和外功招式并附带<SUB 32898 5>外功伤害。",
            "belong_key": "belong_40646"
        },
        "40331": {
            "name": "潜龙勿用",
            "skills": [
                40335
            ],
            "desc": "需要30%以上内力才能施展。终结技，结束时消耗所有内力，对8尺范围5个目标持续造成<SUB 40335 1>外功伤害，该伤害对非侠士目标提高120%，消耗内力越多，持续时间越久。",
            "belong_key": "belong_40331"
        },
        "37385": {
            "name": "苍龙戾天",
            "skills": [
                37397,
                28819
            ],
            "desc": "解除自身僵直状态，腾空跃起，延迟后向目标位置打出一掌，对半径10尺范围3个敌对目标造成<SUB 37397 2>外功伤害，若当前目标被命中则获得15秒<NounID 53>效果。",
            "belong_key": "belong_37385"
        },
        "25194": {
            "name": "凤歌",
            "skills": [
                40299
            ],
            "desc": "“狂龙乱舞”结束落地时会额外造成一次5尺范围对5个目标的外功伤害，“狂龙乱舞”期间命中目标的次数越多，范围伤害越高。",
            "belong_key": "belong_25194"
        },
        "25197": {
            "name": "祭湘君",
            "skills": [
                25201,
                25202
            ],
            "desc": "在自身位置形成<NounID 73>，每2秒对<NounID 73>内最多5个目标造成<SUB 25201 0>外功伤害，<NounID 73>持续12秒，自身位于<NounID 73>内时将获得<NounID 72>效果。",
            "belong_key": "belong_25197"
        },
        "14927": {
            "name": "御鸿于天",
            "dots": {
                "32041": [
                    42918
                ]
            },
            "skills": [
                42917
            ],
            "desc": "对目标造成<SUB 43085 0>外功伤害，刷新并强化该目标及其周围13尺内5个敌对目标属于自身的<NounID 11>效果，当前目标每存在1层<NounID 11>使自身获得5秒<NounID 82>效果。<TALENT_CORE 6818 1>",
            "belong_key": "belong_14927"
        },
        "28989": {
            "name": "城复于隍",
            "skills": [
                28952
            ],
            "desc": "施展后解除自身施展招式的僵直效果并原地蓄力，片刻后冲向目标对其造成<SKILL_[28952_12;28952_13;28952_14;28952_15] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[28952_12;28952_13;28952_14;28952_15] }>)外功伤害并击退24尺。侠士目标被命中将获得<NounID 74>效果；招式施展期间自身免疫控制。",
            "belong_key": "belong_28989"
        },
        "6811": {
            "name": "安患",
            "desc": "“龙跃于渊”解除自身减速和锁足效果，命中拥有自身4层以上<NounID 11>效果的目标则调息时间返还3秒。",
            "belong_key": "belong_6811"
        },
        "21284": {
            "name": "洪荒",
            "recipes": [
                "recipe_6173_1"
            ],
            "desc": "“亢龙有悔”无视目标15%化劲等级，对4尺外目标施展会附带冲刺效果。",
            "belong_key": "belong_21284"
        },
        "6833": {
            "name": "流形",
            "desc": "每8次连击数使得自身受到伤害降低2%，最多可叠加10层，持续20秒。",
            "belong_key": "belong_6833"
        },
        "6810": {
            "name": "落水打狗",
            "recipes": [
                "recipe_5880_1"
            ],
            "desc": "“天下无狗”调息时间提高37秒，不再恢复内力，完整蓄力后，每段“天下无狗”将消耗20点“醉意”，命中目标后会叠加一层<NounID 56>效果。",
            "belong_key": "belong_6810"
        },
        "6813": {
            "name": "御龙",
            "recipes": [
                "recipe_5829_1"
            ],
            "desc": "“断江流”的距离提高至10尺。",
            "belong_key": "belong_6813"
        },
        "6842": {
            "name": "息元",
            "recipes": [
                "recipe_6202_1",
                "recipe_6203_1",
                "recipe_6204_1",
                "recipe_6205_1"
            ],
            "desc": "“蛟龙翻江”“双龙取水”“龙游天地”“龙腾五岳”内力消耗降低为10%，<NounID 6>下施展自身僵直时间减少30%。",
            "belong_key": "belong_6842"
        },
        "6834": {
            "name": "烟霞",
            "recipes": [
                "recipe_1452_1",
                "recipe_1462_1"
            ],
            "skills": [
                30300
            ],
            "desc": "“烟雨行”施展后使自身移动速度提高30%，持续10秒，期间下两次“打狗棒法”套路下招式命中目标后额外造成<SUB 30300 0>外功伤害。",
            "belong_key": "belong_6834"
        },
        "32725": {
            "name": "酩酊",
            "desc": "施展“酒中仙”额外获得10%内力，并使下一个“亢龙有悔”触发的<NounID 71>伤害提高20%。",
            "belong_key": "belong_32725"
        },
        "26701": {
            "name": "仁德",
            "skills": [
                41057
            ],
            "desc": "“蜀犬吠日”不再需要施展目标，抵挡3秒内受到的伤害，若招式没有命中过目标则返还6秒“蜀犬吠日”调息时间。",
            "belong_key": "belong_26701"
        },
        "32731": {
            "name": "留魄",
            "skills": [
                36255,
                32770
            ],
            "desc": "“亢龙有悔”命中拥有“恶狗拦路”不利效果且未被自身击出“心窍”的目标时，会将其“心窍”击出至身后最远12尺位置，“心窍”存在期间目标的所有减伤效果降低20%并每秒受到外功伤害，目标可以靠近并消除“心窍”并受到<SUB 32770 1>伤害，“心窍”存在时间越长，造成的伤害越高，在产生6秒后消除并对目标造成<SUB 32770 6>伤害。",
            "belong_key": "belong_32731"
        },
        "14626": {
            "name": "无咎",
            "recipes": [
                "recipe_5941_1"
            ],
            "desc": "“笑醉狂”完整运功后卸除所有阴性、阳性、混元性、毒性、点穴、持续伤害不利效果。",
            "belong_key": "belong_14626"
        },
        "26702": {
            "name": "坚冰",
            "skills": [
                26703
            ],
            "desc": "每8次连击数将会有“灵隼”对自身前方6尺360度范围最多5个目标造成<SUB 26703 1>外功伤害。",
            "belong_key": "belong_26702"
        }
    },
    "10389": {
        "10389": {
            "name": "铁骨衣",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 3913,
                "vitality_to_max_life": 2253,
                "vitality_to_physical_attack_power": 41,
                "max_life_gain": 245
            },
            "recipes": [
                "recipe_1883_1",
                "recipe_1884_1",
                "recipe_1910_1",
                "recipe_1911_1",
                "recipe_1912_1",
                "recipe_1913_1",
                "recipe_1914_1",
                "recipe_1915_1",
                "recipe_1916_1",
                "recipe_1917_1",
                "recipe_1918_1"
            ],
            "buffs": [
                17885,
                29938
            ],
            "skills": [
                13039,
                32745,
                25797
            ],
            "desc": "此功运之有如铁甲在身，攻守兼备，近身者周身如芒在刺，亦难伤其分毫。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10389"
        },
        "13055": {
            "name": "绝刀",
            "recipes": [
                "recipe_1846_1",
                "recipe_1847_1",
                "recipe_1848_1",
                "recipe_1849_1",
                "recipe_1850_1"
            ],
            "buffs": [
                9052
            ],
            "skills": [
                13075,
                38889,
                38890
            ],
            "desc": "附带一次破招伤害。最少消耗25点怒气，对目标造成<SUB 13075 0>外功伤害，并附带100%的武器伤害。最多消耗65点怒气，每多消耗10点怒气，伤害提高20%。<TALENT 14838 1 伤害及破招伤害无视目标100%外功防御等级><TALENT 21281 1 达到最大怒气消耗时，招式伤害额外提高40%><TALENT 13086 1 每次施展为当前侠士目标添加一层5%最大气血值的“残楼”治疗吸收盾，吸收盾最多可叠加5层。自身气血值每降低10%，“劫刀”“绝刀”“斩刀”的伤害额外提高7%><TALENT 13087 1 会心几率提高15%，会心效果提高20%，施展“绝刀”使得自身伤害提高5%，持续12秒><TALENT 13088 1 命中目标后，会对目标周围6尺范围内额外5个目标造成外功伤害><TALENT 21282 1 “绝刀”附带8尺冲刺效果，命中自身流血目标，直接造成最大怒气对应的伤害，若目标气血值低于自身，则使目标的基础攻击力下降20%，持续4秒><TALENT 13133 1 施展“盾飞”，“斩刀”调息时间降低5秒，且使“绝刀”伤害增加30%，持续15秒。若施展“斩刀”命中虚弱非侠士目标，则6秒内下一次施展“绝刀”可返还所消耗的怒气><TALENT 37241 1 每次施展“苍雪刀”套路下招式会为自己叠加一层“莫朽”效果：每层化解自身受到的4%最大气血值的伤害，连续施展三次“苍雪刀”套路下招式将使自己额外获得3层“莫朽”效果>",
            "belong_key": "belong_13055"
        },
        "13391": {
            "name": "盾挡",
            "buffs": [
                8499
            ],
            "desc": "消耗自身怒气，自身每1点体质获得0.04点拆招值，持续11秒，最少消耗10点怒气，每额外消耗10点怒气，每点体质转化的拆招值增加0.04点。<TALENT 14846 1 当自身气血值小于35%，施展“盾挡”，不再消耗怒气，直接触发最大效果，该效果最多每15秒触发一次><TALENT 14845 1 持续时间延长3秒><TALENT 13422 1 施展“盾挡”后，自身每2410点基础体质使得自身20尺范围内最多25个团队成员无双提高92点，持续30秒><TALENT 13421 1 施展“盾挡”后获得的拆招值提升效果提高25%>",
            "belong_key": "belong_13391"
        },
        "13054": {
            "name": "斩刀",
            "recipes": [
                "recipe_1838_1",
                "recipe_1839_1",
                "recipe_1840_1",
                "recipe_1841_1",
                "recipe_1842_1",
                "recipe_1843_1",
                "recipe_1845_1"
            ],
            "dots": {
                "8249": [
                    29188
                ]
            },
            "skills": [
                13092
            ],
            "desc": "消耗15点怒气，跳跃至目标位置并将目标击下马并锁足3秒，造成100%的武器伤害外加<SUB 13092 0>外功伤害并附带一次破招伤害。命中有自身虚弱或流血效果的目标，使目标获得流血效果，持续24秒。<TALENT 13089 1 流血效果作用时间间隔缩短1秒，总持续时间保持不变><TALENT 13090 1 命中目标后，使6秒内的下一次“绝刀”返还消耗的怒气><TALENT 13091 1 “斩刀”施展距离延长至20尺，跳跃至目标位置将目标击落下马><TALENT 13357 1 施展“斩刀”强制目标攻击自身，使目标基础攻击降低10%，持续6秒><TALENT 13086 1 每次施展为当前侠士目标添加一层5%最大气血值的“残楼”治疗吸收盾，吸收盾最多可叠加5层。自身气血值每降低10%，“劫刀”“绝刀”“斩刀”的伤害额外提高7%><TALENT 20509 1 施展“斩刀”使自身受到伤害降低20%，持续3秒，且强制目标攻击自身><TALENT 13133 1 施展“盾飞”，“斩刀”调息时间降低5秒，且使“绝刀”伤害增加30%，持续15秒。若施展“斩刀”命中虚弱非侠士目标，则6秒内下一次施展“绝刀”可返还所消耗的怒气><TALENT 37241 1 每次施展“苍雪刀”套路下招式会为自己叠加一层“莫朽”效果：每层化解自身受到的4%最大气血值的伤害，连续施展三次“苍雪刀”套路下招式将使自己额外获得3层“莫朽”效果><TALENT 37239 1 “斩刀”伤害提高20%，锁足效果变为眩晕效果，并追加一段无视目标30%外功防御的外功伤害，若成功眩晕目标，则返还15点怒气和6秒斩刀调息时间><TALENT 13317 1 伤害提高10%，对4尺内目标不再冲刺>",
            "belong_key": "belong_13054"
        },
        "13044": {
            "name": "盾刀",
            "attributes": {
                "physical_damage_base": 130,
                "physical_damage_rand": 15
            },
            "recipes": [
                "recipe_1860_1",
                "recipe_1861_1",
                "recipe_1862_1",
                "recipe_1863_1",
                "recipe_1864_1",
                "recipe_1865_1",
                "recipe_1866_1"
            ],
            "skills": [
                13044,
                13244,
                13060
            ],
            "desc": "回复5点怒气，对目标造成100%的武器伤害外加<SKILL PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP}>)外功伤害，并使目标减速60%，持续8秒。<TALENT 13120 1 第三段攻击命中有自身虚弱或流血效果的目标后可触发第四段攻击，造成较高伤害并额外回复10怒气><TALENT 13121 1 受自身招架率影响有<PARRY 1>%的几率触发，使“盾刀”第三段攻击追加一次伤害><TALENT 13338 1 盾刀造成的威胁值提高30%><TALENT 13321 1 每一段招式伤害逐步递增，施展第三段时将卸除目标混元、阳性、阴性、毒性有益气劲各一个><TALENT 26723 1 每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害>",
            "belong_key": "belong_13044"
        },
        "13046": {
            "name": "盾猛",
            "skills": [
                13099
            ],
            "desc": "回复15点怒气，冲向目标，对目标造成100%的武器伤害外加<SUB 13099 0>外功伤害，将目标击倒3秒。<TALENT 13361 1 额外回复10点怒气><TALENT 13103 1 释放距离降低至4尺，命中有自身虚弱或流血效果的目标，伤害提高150%，会心几率提高10%，会心效果提高10%，不再附带冲刺和击倒效果><TALENT 13414 1 将目标击退8尺并撞击沿途最多5个其他目标，使其眩晕3秒><TALENT 13141 1 施展“盾猛”获得岌危效果：若1秒内承受的伤害量超过自身最大气血值的30%，则立刻为自身回复10%气血最大值，持续12秒><TALENT 13356 1 对4尺内目标不再冲刺，施展“盾猛”后自身每1点体质提高0.02点招架等级、0.05点拆招值，持续6秒><TALENT 25219 1 施展后自身获得额外35点怒气和3点格挡值><TALENT 25203 1 盾墙状态下，可以施展“盾猛”和“盾击”，施展“盾猛”举盾向前快速冲刺15尺。击晕路径上最多5个目标并造成<SUB 25208 1>外功伤害。对终点6尺范围最多5个目标造成100%武器伤害外加<SUB 25205 1>外功伤害并且击倒5秒，随后解除自身盾墙状态><TALENT 26723 1 每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害><TALENT 13317 1 伤害提高10%，对4尺内目标不再冲刺>",
            "belong_key": "belong_13046"
        },
        "13047": {
            "name": "盾击",
            "skills": [
                13106,
                13160,
                13161
            ],
            "desc": "回复10点怒气，对目标造成100%的武器伤害外加<SUB 13106 0>外功伤害，无视目标50%的外功防御等级，降低自身“盾飞”2秒的调息时间。<TALENT 13109 1 伤害提高70%，施展“盾击”对自身6尺120度扇形范围的额外5个目标也造成伤害><TALENT 13111 1 使目标被疗伤成效降低30%，最多可叠加2层，持续12秒，2层时，受到苍云“苍雪刀”套路招式伤害提高10%><TALENT 13113 1 盾击充能时间延长至20秒，每1%的招架率回复自身0.5%的气血最大值><TALENT 26723 1 每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害><TALENT 25210 1 命中气血值百分比低于自身的目标，每相差25%追加一段<SUB 26727 1>外功伤害，并额外回复2点怒气值><TALENT 25203 1 “盾墙”状态下，可以施展“盾猛”和“盾击”，施展“盾猛”举盾向前快速冲刺15尺，击晕路径上的目标并造成外功伤害。对终点6尺范围最多5个目标造成外功伤害并且击倒5秒，随后解除自身盾墙状态><TALENT 36058 1 充能时间降低1秒，层数增加一层，每次施展会触发一次破招，若连续三次成功触发该破招伤害将获得3层“援戈”效果，每次施展苍雪刀套路下招式将附带外功伤害并消耗一层>",
            "belong_key": "belong_13047"
        },
        "13045": {
            "name": "盾压",
            "recipes": [
                "recipe_1852_1",
                "recipe_1853_1",
                "recipe_1854_1",
                "recipe_1855_1",
                "recipe_1856_1",
                "recipe_1857_1",
                "recipe_1858_1",
                "recipe_1859_1"
            ],
            "skills": [
                19409
            ],
            "desc": "回复15点怒气，对目标造成100%的武器伤害外加<SUB 19409 0>外功伤害，并使目标无法施展轻功，持续5秒，该效果最多每15秒触发一次。施展云城盾套路下任何伤害技能都有一定几率立刻重置盾压调息时间，受自身招架率影响“分山劲”心法下触发几率为<PARRY 2>%；“铁骨衣”心法下触发几率为<PARRY 1>% 。“盾墙”状态下技能的施展距离延长至20尺，并可对友方目标施展，使友方目标获得盾护效果，吸收10%气血最大值伤害，“盾墙”期间成功招架后有50%的几率重置本招式调息时间。<TALENT 13097 1 “盾墙”期间招架率提高30%，每点身法额外提高0.5拆招值><TALENT 13098 1 使自身获得雄峦效果，效果期间使自身化解相当于自身拆招值的伤害量，持续8秒><TALENT 13386 1 盾墙状态下，施展“盾压”后可施展，震碎自身周围刀气障碍，并将目标及其周围4尺内3个目标抛至自己身后15尺，并使其眩晕2秒。 盾墙状态下施展盾压会使目标锁足2秒。><TALENT 13361 1 额外回复10点怒气><TALENT 25356 1 对敌对目标施展使得自身“破招”提高30%，此效果持续15秒，最多叠加5层><TALENT 26723 1 每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害>",
            "belong_key": "belong_13045"
        },
        "13052": {
            "name": "劫刀",
            "recipes": [
                "recipe_1830_1",
                "recipe_1831_1",
                "recipe_1832_1",
                "recipe_1833_1",
                "recipe_1834_1",
                "recipe_1835_1",
                "recipe_1836_1"
            ],
            "skills": [
                28479
            ],
            "desc": "消耗10点怒气，对目标造成100%的武器伤害外加<SUB 28479 0>外功伤害。<TALENT 18978 1 “劫刀”施展距离提高2尺，会心几率提高25%，会心效果提高25%><TALENT 37241 1 每次施展“苍雪刀”套路下招式会为自己叠加一层“莫朽”效果：每层化解自身受到的4%最大气血值的伤害，连续施展三次“苍雪刀”套路下招式将使自己额外获得3层“莫朽”效果><TALENT 13086 1 每次施展为当前侠士目标添加一层5%最大气血值的“残楼”治疗吸收盾，吸收盾最多可叠加5层。自身气血值每降低10%，“劫刀”“绝刀”“斩刀”的伤害额外提高7%>",
            "belong_key": "belong_13052"
        },
        "13053": {
            "name": "闪刀",
            "skills": [
                13453
            ],
            "desc": "消耗15点怒气，快速冲向目标，对目标造成100%的武器伤害外加<SUB 13453 0>外功伤害。<TALENT 13152 1 命中有自身虚弱或流血效果的目标后可在接下来的10秒内可施展“隐刀”><TALENT 13153 1 命中目标后可在接下来的4秒内施展两次“血刀”><TALENT 13132 1 命中有自身流血效果目标后使流血剩余跳数每跳伤害提高90%><EnchantID 10147 血刀命中有自身流血效果的目标，触发血崩效果，对目标点造成半径3尺的范围伤害><TALENT 37241 1 每次施展“苍雪刀”套路下招式会为自己叠加一层“莫朽”效果：每层化解自身受到的4%最大气血值的伤害，连续施展三次“苍雪刀”套路下招式将使自己额外获得3层“莫朽”效果><TALENT 37559 1 命中有自身流血效果目标后使流血剩余跳数每跳伤害提高150%>",
            "belong_key": "belong_13053"
        },
        "13050": {
            "name": "盾飞",
            "recipes": [
                "recipe_1953_1",
                "recipe_1954_1",
                "recipe_1955_1",
                "recipe_1956_1",
                "recipe_1957_1",
                "recipe_1958_1"
            ],
            "skills": [
                13463
            ],
            "desc": "自身切换到“擎刀”姿态，使目标虚弱25秒。将盾牌掷出对目标进行攻击，每次攻击对目标造成100%的武器伤害外加<SUB 13463 0>外功伤害，盾牌攻击目标50次或15秒后将被动收回。<TALENT 13318 1 伤害降低20%，可对击中的目标周围10尺的其他敌对目标进行弹射><TALENT 13320 1 命中目标后使其受所有伤害输出降低5%，持续15秒><TALENT 13372 1 “盾飞”会心率、会心效果提高15%，施展“盾飞”降低“盾猛”2秒调息时间><TALENT 13368 1 附带嘲讽效果，强制目标攻击自身3秒，10秒内无法再嘲讽此目标><TALENT 13397 1 命中的第一个目标若正在运功，则使该目标2秒内无法运功><TALENT 13374 1 盾牌首次击中目标时，使目标移动速度降低60%，持续6秒><TALENT 13133 1 施展“盾飞”，“斩刀”调息时间降低5秒，且使“绝刀”伤害增加30%，持续15秒。若施展“斩刀”命中虚弱非侠士目标，则6秒内下一次施展“绝刀”可返还所消耗的怒气><TALENT 22897 1 施展“盾飞”使自身外功破防等级提高15%，“盾飞”伤害提高100%，持续30秒><TALENT 34540 1 >",
            "belong_key": "belong_13050"
        },
        "13048": {
            "name": "盾舞",
            "recipes": [
                "recipe_1902_1",
                "recipe_1903_1",
                "recipe_1904_1",
                "recipe_1905_1",
                "recipe_1906_1",
                "recipe_1907_1",
                "recipe_1908_1",
                "recipe_1909_1"
            ],
            "skills": [
                38973,
                38971
            ],
            "desc": "每0.5秒对半径8尺内的最多6个敌对目标造成100%的武器伤害外加<SUB 38973 0>外功伤害及破招伤害，持续5秒。“擎盾”姿态下施展，每命中一个目标回复1点怒气。“盾墙”姿态下不回复怒气，但可移动施展。<TALENT 14849 1 调息时间增加至30秒，强制目标攻击自身并使自身受到的所有伤害降低30%><TALENT 13360 1 作用目标提高2个，造成的威胁值提高50%><TALENT 13278 1 “盾舞”伤害提高10%，在盾墙姿态下施展时，可触发二段技能，施展“盾舞·强化”击退周围8尺内最多6个目标并造成一次外功伤害>",
            "belong_key": "belong_13048"
        },
        "13424": {
            "name": "撼地",
            "skills": [
                13206
            ],
            "desc": "门派轻功，对目标造成100%的武器伤害外加<SUB 13206 0>点外功伤害。腾空跳向目标区域，对半径5尺范围内最多5个目标造成眩晕，持续3秒。每命中一个目标回复5点怒气。<EnchantID 10144 附带群嘲效果，跳跃至目标点后将周围10尺内的最多5个目标强行拉至自己身旁><TALENT 14839 1 可解除锁足效果，眩晕效果提高1秒，变为2层充能技能，充能时间为18秒><TALENT 41834 1 >",
            "belong_key": "belong_13424"
        },
        "25203": {
            "name": "扶阵",
            "skills": [
                25208,
                25205
            ],
            "desc": "“盾墙”状态下，可以施展“盾猛”和“盾击”，施展“盾猛”举盾向前快速冲刺15尺。击晕路径上最多5个目标并造成<SUB 25208 0>外功伤害。对终点6尺范围最多5个目标造成100%武器伤害外加<SUB 25205 0>外功伤害并且击倒5秒，随后解除自身盾墙状态。",
            "belong_key": "belong_25203"
        },
        "14849": {
            "name": "亮节",
            "recipes": [
                "recipe_3097_1",
                "recipe_3098_1"
            ],
            "desc": "“盾舞”调息时间增加至30秒，强制目标攻击自身并使自身受到的所有伤害降低30%。",
            "belong_key": "belong_14849"
        },
        "15072": {
            "name": "寒啸千军",
            "desc": "消耗20点格挡值，鼓舞友方士气，使自身半径20尺内最多25名友方目标无双率提高5%，持续15秒。",
            "belong_key": "belong_15072"
        },
        "25213": {
            "name": "断马摧城",
            "skills": [
                25215
            ],
            "desc": "回复20点怒气，举盾对自身8尺范围最多5个目标造成一次锤击，造成<NounID 13>外功伤害并使其被击倒3秒。当前每拥有50点怒气使其被击倒时长增加1秒。<TALENT 26723 1 擎盾姿态下自身加速率提高10%，每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害>",
            "belong_key": "belong_25213"
        },
        "26729": {
            "name": "肃列",
            "recipes": [
                "recipe_2470_1"
            ],
            "desc": "“盾墙”调息时间提高25秒，格挡值消耗降低10点，在“盾墙”下持续超过2秒时，使得自身周围20尺25个团队成员获得“盾壁”效果，可以化解等同于其20%最大气血值的伤害，持续10秒。",
            "belong_key": "belong_26729"
        },
        "26897": {
            "name": "鸿烈",
            "recipes": [
                "recipe_2507_1"
            ],
            "skills": [
                26898
            ],
            "desc": "“无惧”调息时间降低5秒，施展“无惧”对周围8尺范围最多6个目标造成<SUB 26898 1>外功伤害，使其强制攻击自身，并使得周围20尺团队成员获得无威胁气劲，持续5秒。",
            "belong_key": "belong_26897"
        },
        "25216": {
            "name": "坚固",
            "desc": "成功招架后自身回复1.5%的气血值，此效果每秒最多触发5次。",
            "belong_key": "belong_25216"
        },
        "14841": {
            "name": "石虎",
            "desc": "受到伤害未重伤状态下自身气血值低于50%则立刻重置“盾壁”调息时间，该效果最多每3分钟触发一次。",
            "belong_key": "belong_14841"
        },
        "13126": {
            "name": "恋战",
            "attributes": {
                "all_damage_addition": 102
            },
            "desc": "自身化劲等级降低40%，招式伤害提高10%。",
            "belong_key": "belong_13126"
        },
        "13171": {
            "name": "战毅",
            "desc": "施展“盾壁”立刻回复自身20%气血最大值，招式效果期间每秒回复自身3%的气血。",
            "belong_key": "belong_13171"
        },
        "13420": {
            "name": "戒备",
            "desc": "自身血量每下降10%，使自身招架率提高3%、拆招值提高4000点。",
            "belong_key": "belong_13420"
        },
        "13134": {
            "name": "寒甲",
            "buffs": [
                8271,
                17772
            ],
            "desc": "成功招架后使自身基础外功攻击力获得提升，持续12秒，提升量相当于自身当前拆招值的7%。",
            "belong_key": "belong_13134"
        },
        "13098": {
            "name": "雄峦",
            "desc": "施展“盾压”使自身获得雄峦效果，效果期间使自身化解相当于自身拆招值的伤害量，持续8秒。",
            "belong_key": "belong_13098"
        },
        "14840": {
            "name": "肃驾",
            "desc": "每消耗11点怒气，回复自身1点格挡值，“分山劲”心法下降低自身“盾立”0.5秒的调息时间。",
            "belong_key": "belong_14840"
        },
        "18723": {
            "name": "返生",
            "desc": "施展“盾壁”使自身立即回复自身20%气血最大值，并回复自身30%格挡值。",
            "belong_key": "belong_18723"
        },
        "13071": {
            "name": "盾反",
            "desc": "“盾壁”效果消失4秒内可施展，期间造成的威胁值提高30%，施展后将盾壁化解伤害的80%施放出来造成半径8尺的群体伤害效果，每额外命中一个目标，“盾壁”调息时间降低7秒，“无惧”调息时间降低1秒，伤害提高20%，最多可命中5个目标。",
            "belong_key": "belong_13071"
        },
        "13421": {
            "name": "千山",
            "buffs": [
                8448
            ],
            "desc": "施展“盾挡”后获得的拆招值提升效果提高25%。",
            "belong_key": "belong_13421"
        },
        "13422": {
            "name": "振奋",
            "desc": "施展“盾挡”后，自身每2820点基础体质使得自身20尺范围内最多25个团队成员无双提高101点，持续30秒。",
            "belong_key": "belong_13422"
        },
        "13418": {
            "name": "捍卫",
            "desc": "“盾墙”效果期间自身半径8尺范围内最多5个友方目标受到的伤害降低40%。",
            "belong_key": "belong_13418"
        },
        "13113": {
            "name": "胜前",
            "recipes": [
                "recipe_1828_1"
            ],
            "desc": "盾击充能时间延长至20秒，每1%的招架率回复自身0.5%的气血最大值。",
            "belong_key": "belong_13113"
        },
        "13363": {
            "name": "坚韧",
            "desc": "格挡值最大值增加100点，“盾墙”持续期间自身气血最大值提高30%。",
            "belong_key": "belong_13363"
        },
        "13364": {
            "name": "肆意",
            "desc": "盾墙效果消失后，使自身团队成员获得无威胁气劲，持续6秒。",
            "belong_key": "belong_13364"
        },
        "39045": {
            "name": "蔑视",
            "buffs": [
                9889
            ],
            "desc": "施展伤害招式命中目标，若自身气血百分比高于目标气血百分比，则使下一招式无视目标50%外功防御等级，且对击倒、被击僵直目标伤害提高30%。",
            "belong_key": "belong_39045"
        },
        "13138": {
            "name": "坚铁",
            "desc": "受到任何技能伤害都使自身招架率提高6%，最多可叠加5层，成功招架后该效果不再叠加，8秒后效果消失。",
            "belong_key": "belong_13138"
        },
        "13132": {
            "name": "割裂",
            "dots": {
                "8249": [
                    13308,
                    20989
                ]
            },
            "desc": "“闪刀”命中有自身流血效果的目标使流血效果的剩余伤害提高90%。",
            "belong_key": "belong_13132"
        },
        "13133": {
            "name": "怒炎",
            "desc": "施展“斩刀”命中虚弱非侠士目标，则6秒内下一次施展“绝刀”可返还所消耗的怒气。",
            "belong_key": "belong_13133"
        },
        "34912": {
            "name": "业火麟光",
            "skills": [
                34674,
                37448
            ],
            "desc": "获得14秒“麟光甲”效果，并返还25秒“盾飞”调息时间，效果期间施展“苍雪刀”套路下招式附带一次破招伤害与“麟光甲”额外伤害，该额外伤害对非侠士目标提高150%。连续使用三次“苍雪刀”套路下招式将获得额外65点怒气，重置所有“苍雪刀”套路下技能调息时间，该效果每次“麟光甲”期间只能触发一次。",
            "belong_key": "belong_34912"
        },
        "13124": {
            "name": "活血",
            "attributes": {
                "vitality_gain": 102
            },
            "desc": "体质和被疗伤效果提高10%。",
            "belong_key": "belong_13124"
        },
        "34540": {
            "name": "雷云",
            "recipes": [
                "recipe_3239_1"
            ],
            "desc": "“盾飞”可对击中的目标周围10尺的其他敌对目标进行弹射，若命中的第一个目标若正在运功，则使该目标2秒内无法运功。",
            "belong_key": "belong_34540"
        },
        "40721": {
            "name": "征北",
            "attributes": {
                "physical_attack_power_gain": -1024,
                "physical_damage_base": 20,
                "physical_damage_rand": 5
            },
            "skills": [
                40721
            ],
            "desc": "对敌人造成<SKILL PhysicsDamage>点(+<SKILLEx {D0+D1} {SkillPhysicsAP},{BasicPhysicsAP -0.1}>)外功伤害，强制目标攻击自身。",
            "belong_key": "belong_40721"
        },
        "13356": {
            "name": "激昂",
            "buffs": [
                8418
            ],
            "desc": "“盾猛”“斩刀”对4尺内目标不再冲刺，施展“盾猛”后自身每1点体质提高0.02点招架等级、0.05点拆招值，持续6秒。",
            "belong_key": "belong_13356"
        },
        "13366": {
            "name": "从容",
            "buffs": [
                8423
            ],
            "desc": "当自身血量高于60%，则外功基础攻击提高10%，无双等级提高15%。",
            "belong_key": "belong_13366"
        },
        "13367": {
            "name": "百炼",
            "recipes": [
                "recipe_5124_1"
            ],
            "desc": "“盾壁”变为2层充能招式，充能时间1分20秒，伤害吸收效果提升至100%。",
            "belong_key": "belong_13367"
        },
        "13321": {
            "name": "卷云",
            "recipes": [
                "recipe_2342_1"
            ],
            "desc": "“盾刀”每一段招式伤害逐步递增，施展第三段时将卸除目标混元、阳性、阴性、毒性有益气劲各一个。",
            "belong_key": "belong_13321"
        },
        "13073": {
            "name": "赤心",
            "desc": "“血怒”效果期间每消耗或回复1点怒气为自身回复0.1%气血最大值。",
            "belong_key": "belong_13073"
        },
        "25356": {
            "name": "严阵",
            "buffs": [
                32407
            ],
            "desc": "对敌对目标施展“盾压”使得自身“破招”提高50%，此效果持续20秒，最多叠加3层。",
            "belong_key": "belong_25356"
        },
        "13320": {
            "name": "盾威",
            "desc": "“盾飞”命中目标使目标所有伤害输出降低5%，持续15秒。施展“盾回”获得的伤害降低效果提高至25%，持续时间增加至18秒。",
            "belong_key": "belong_13320"
        },
        "13089": {
            "name": "炼狱",
            "dots": {
                "8249": [
                    29185,
                    29186,
                    29187
                ]
            },
            "desc": "流血效果作用时间间隔缩短1秒，总持续时间保持不变。",
            "belong_key": "belong_13089"
        },
        "34602": {
            "name": "移山",
            "desc": "施展“无惧”，使自身2秒内受到的伤害降低50%。",
            "belong_key": "belong_34602"
        },
        "13368": {
            "name": "当关",
            "desc": "施展“盾飞”附带嘲讽效果，强制目标攻击自身3秒，10秒内此目标不会再被嘲讽。",
            "belong_key": "belong_13368"
        }
    },
    "10390": {
        "10390": {
            "name": "分山劲",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "pve_addition_base": 358,
                "agility_to_physical_attack_power": 1925,
                "max_life_gain": 245,
                "physical_attack_power_base": 6513,
                "physical_overcome_base": 4696
            },
            "buffs": [
                8474
            ],
            "skills": [
                13039,
                32745,
                25780
            ],
            "desc": "此功运之有如惊雷开山之势，霸道强横，非勇猛无匹者不能习。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10390"
        },
        "13055": {
            "name": "绝刀",
            "recipes": [
                "recipe_1846_1",
                "recipe_1847_1",
                "recipe_1848_1",
                "recipe_1849_1",
                "recipe_1850_1"
            ],
            "buffs": [
                9052
            ],
            "skills": [
                13075,
                38889,
                38890
            ],
            "desc": "附带一次破招伤害。最少消耗25点怒气，对目标造成<SUB 13075 0>外功伤害，并附带100%的武器伤害。最多消耗65点怒气，每多消耗10点怒气，伤害提高20%。<TALENT 14838 1 伤害及破招伤害无视目标100%外功防御等级><TALENT 21281 1 达到最大怒气消耗时，招式伤害额外提高40%><TALENT 13086 1 每次施展为当前侠士目标添加一层5%最大气血值的“残楼”治疗吸收盾，吸收盾最多可叠加5层。自身气血值每降低10%，“劫刀”“绝刀”“斩刀”的伤害额外提高7%><TALENT 13087 1 会心几率提高15%，会心效果提高20%，施展“绝刀”使得自身伤害提高5%，持续12秒><TALENT 13088 1 命中目标后，会对目标周围6尺范围内额外5个目标造成外功伤害><TALENT 21282 1 “绝刀”附带8尺冲刺效果，命中自身流血目标，直接造成最大怒气对应的伤害，若目标气血值低于自身，则使目标的基础攻击力下降20%，持续4秒><TALENT 13133 1 施展“盾飞”，“斩刀”调息时间降低5秒，且使“绝刀”伤害增加30%，持续15秒。若施展“斩刀”命中虚弱非侠士目标，则6秒内下一次施展“绝刀”可返还所消耗的怒气><TALENT 37241 1 每次施展“苍雪刀”套路下招式会为自己叠加一层“莫朽”效果：每层化解自身受到的4%最大气血值的伤害，连续施展三次“苍雪刀”套路下招式将使自己额外获得3层“莫朽”效果>",
            "belong_key": "belong_13055"
        },
        "13040": {
            "name": "血怒",
            "recipes": [
                "recipe_1867_1",
                "recipe_1868_1",
                "recipe_1869_1",
                "recipe_1870_1",
                "recipe_1871_1",
                "recipe_1872_1",
                "recipe_1873_1",
                "recipe_1874_1"
            ],
            "buffs": [
                8244
            ],
            "desc": "回复10点怒气。“分山劲”心法下<BUFF 8244 1 desc>，“铁骨衣”心法下<BUFF 8245 1 desc>，持续10秒；2秒内连续施展“血怒”其效果可叠加。施展后获得“劫化”效果，免疫控制效果（击退或者被拉除外），持续4秒，该效果时间可以累加。<TALENT 38969 1 施展后清空自身“斩刀”调息时间，并获得25点怒气><TALENT 14842 1 “血怒”效果期间自身外功破防等级提高15%><TALENT 14847 1 效果期间若自身气血值低于35%，受到攻击每层“血怒”为自身回复2%气血值，该效果每1秒最多触发一次><TALENT 14848 1 施展后为自身回复10%气血最大值><TALENT 13073 1 血怒效果期间每消耗或回复1点怒气为自身回复0.1%气血最大值><TALENT 13142 1 血怒效果期间自身威胁值提高30%，受疗伤效果提高10%><TALENT 13304 1 消耗5%气血，“血怒”效果提高30%，持续时间增加至25秒><TALENT 13395 1 施展“血怒”后获得的“劫化”效果期间每点身法提高自身2点招架等级，持续时间提升至8秒，调息时间提高至32秒。“血怒”期间施展“劫刀”命中带有自身“流血”效果的侠士目标，则对其造成该持续伤害的两跳伤害><EnchantID 10146 附带“血影”效果，施展苍雪刀、云城盾套路下的招式将对目标进行血影重击><TALENT 21749 1 效果期间自身每点体质提高0.08拆招值。受到攻击则使得血怒时间延长2秒，最多触发3次><TALENT 23929 1 “血怒”状态下，每1点拆招值为自己添加0.06点内功防御等级><TALENT 23929 1 连续施展“血怒”，“劫化”效果持续期间，每点身法将提升自身3点招架等级><TALENT 32618 1 若自身气血值高于20%，“血怒”状态下连续施展三次“苍雪刀”套路下招式命中同一目标，则消耗20%的自身当前气血值，将对目标造成一次无视50%化劲等级的外功伤害并使其被疗伤成效额外降低30%，可与其他减疗效果叠加><TALENT 36205 1 效果无法再叠加，期间自身无双等级提高30%，施展“斩刀”“绝刀”“盾舞”触发的破招伤害提高20%>",
            "belong_key": "belong_13040"
        },
        "13054": {
            "name": "斩刀",
            "recipes": [
                "recipe_1838_1",
                "recipe_1839_1",
                "recipe_1840_1",
                "recipe_1841_1",
                "recipe_1842_1",
                "recipe_1843_1",
                "recipe_1845_1"
            ],
            "dots": {
                "8249": [
                    29188
                ]
            },
            "skills": [
                13092
            ],
            "desc": "消耗15点怒气，跳跃至目标位置并将目标击下马并锁足3秒，造成100%的武器伤害外加<SUB 13092 0>外功伤害并附带一次破招伤害。命中有自身虚弱或流血效果的目标，使目标获得流血效果，持续24秒。<TALENT 13089 1 流血效果作用时间间隔缩短1秒，总持续时间保持不变><TALENT 13090 1 命中目标后，使6秒内的下一次“绝刀”返还消耗的怒气><TALENT 13091 1 “斩刀”施展距离延长至20尺，跳跃至目标位置将目标击落下马><TALENT 13357 1 施展“斩刀”强制目标攻击自身，使目标基础攻击降低10%，持续6秒><TALENT 13086 1 每次施展为当前侠士目标添加一层5%最大气血值的“残楼”治疗吸收盾，吸收盾最多可叠加5层。自身气血值每降低10%，“劫刀”“绝刀”“斩刀”的伤害额外提高7%><TALENT 20509 1 施展“斩刀”使自身受到伤害降低20%，持续3秒，且强制目标攻击自身><TALENT 13133 1 施展“盾飞”，“斩刀”调息时间降低5秒，且使“绝刀”伤害增加30%，持续15秒。若施展“斩刀”命中虚弱非侠士目标，则6秒内下一次施展“绝刀”可返还所消耗的怒气><TALENT 37241 1 每次施展“苍雪刀”套路下招式会为自己叠加一层“莫朽”效果：每层化解自身受到的4%最大气血值的伤害，连续施展三次“苍雪刀”套路下招式将使自己额外获得3层“莫朽”效果><TALENT 37239 1 “斩刀”伤害提高20%，锁足效果变为眩晕效果，并追加一段无视目标30%外功防御的外功伤害，若成功眩晕目标，则返还15点怒气和6秒斩刀调息时间><TALENT 13317 1 伤害提高10%，对4尺内目标不再冲刺>",
            "belong_key": "belong_13054"
        },
        "13044": {
            "name": "盾刀",
            "attributes": {
                "physical_damage_base": 130,
                "physical_damage_rand": 15
            },
            "recipes": [
                "recipe_1860_1",
                "recipe_1861_1",
                "recipe_1862_1",
                "recipe_1863_1",
                "recipe_1864_1",
                "recipe_1865_1",
                "recipe_1866_1"
            ],
            "skills": [
                13044,
                13244,
                13060
            ],
            "desc": "回复5点怒气，对目标造成100%的武器伤害外加<SKILL PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP}>)外功伤害，并使目标减速60%，持续8秒。<TALENT 13120 1 第三段攻击命中有自身虚弱或流血效果的目标后可触发第四段攻击，造成较高伤害并额外回复10怒气><TALENT 13121 1 受自身招架率影响有<PARRY 1>%的几率触发，使“盾刀”第三段攻击追加一次伤害><TALENT 13338 1 盾刀造成的威胁值提高30%><TALENT 13321 1 每一段招式伤害逐步递增，施展第三段时将卸除目标混元、阳性、阴性、毒性有益气劲各一个><TALENT 26723 1 每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害>",
            "belong_key": "belong_13044"
        },
        "13046": {
            "name": "盾猛",
            "skills": [
                13099
            ],
            "desc": "回复15点怒气，冲向目标，对目标造成100%的武器伤害外加<SUB 13099 0>外功伤害，将目标击倒3秒。<TALENT 13361 1 额外回复10点怒气><TALENT 13103 1 释放距离降低至4尺，命中有自身虚弱或流血效果的目标，伤害提高150%，会心几率提高10%，会心效果提高10%，不再附带冲刺和击倒效果><TALENT 13414 1 将目标击退8尺并撞击沿途最多5个其他目标，使其眩晕3秒><TALENT 13141 1 施展“盾猛”获得岌危效果：若1秒内承受的伤害量超过自身最大气血值的30%，则立刻为自身回复10%气血最大值，持续12秒><TALENT 13356 1 对4尺内目标不再冲刺，施展“盾猛”后自身每1点体质提高0.02点招架等级、0.05点拆招值，持续6秒><TALENT 25219 1 施展后自身获得额外35点怒气和3点格挡值><TALENT 25203 1 盾墙状态下，可以施展“盾猛”和“盾击”，施展“盾猛”举盾向前快速冲刺15尺。击晕路径上最多5个目标并造成<SUB 25208 1>外功伤害。对终点6尺范围最多5个目标造成100%武器伤害外加<SUB 25205 1>外功伤害并且击倒5秒，随后解除自身盾墙状态><TALENT 26723 1 每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害><TALENT 13317 1 伤害提高10%，对4尺内目标不再冲刺>",
            "belong_key": "belong_13046"
        },
        "13047": {
            "name": "盾击",
            "skills": [
                13106,
                13160,
                13161
            ],
            "desc": "回复10点怒气，对目标造成100%的武器伤害外加<SUB 13106 0>外功伤害，无视目标50%的外功防御等级，降低自身“盾飞”2秒的调息时间。<TALENT 13109 1 伤害提高70%，施展“盾击”对自身6尺120度扇形范围的额外5个目标也造成伤害><TALENT 13111 1 使目标被疗伤成效降低30%，最多可叠加2层，持续12秒，2层时，受到苍云“苍雪刀”套路招式伤害提高10%><TALENT 13113 1 盾击充能时间延长至20秒，每1%的招架率回复自身0.5%的气血最大值><TALENT 26723 1 每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害><TALENT 25210 1 命中气血值百分比低于自身的目标，每相差25%追加一段<SUB 26727 1>外功伤害，并额外回复2点怒气值><TALENT 25203 1 “盾墙”状态下，可以施展“盾猛”和“盾击”，施展“盾猛”举盾向前快速冲刺15尺，击晕路径上的目标并造成外功伤害。对终点6尺范围最多5个目标造成外功伤害并且击倒5秒，随后解除自身盾墙状态><TALENT 36058 1 充能时间降低1秒，层数增加一层，每次施展会触发一次破招，若连续三次成功触发该破招伤害将获得3层“援戈”效果，每次施展苍雪刀套路下招式将附带外功伤害并消耗一层>",
            "belong_key": "belong_13047"
        },
        "13045": {
            "name": "盾压",
            "recipes": [
                "recipe_1852_1",
                "recipe_1853_1",
                "recipe_1854_1",
                "recipe_1855_1",
                "recipe_1856_1",
                "recipe_1857_1",
                "recipe_1858_1",
                "recipe_1859_1"
            ],
            "skills": [
                19409
            ],
            "desc": "回复15点怒气，对目标造成100%的武器伤害外加<SUB 19409 0>外功伤害，并使目标无法施展轻功，持续5秒，该效果最多每15秒触发一次。施展云城盾套路下任何伤害技能都有一定几率立刻重置盾压调息时间，受自身招架率影响“分山劲”心法下触发几率为<PARRY 2>%；“铁骨衣”心法下触发几率为<PARRY 1>% 。“盾墙”状态下技能的施展距离延长至20尺，并可对友方目标施展，使友方目标获得盾护效果，吸收10%气血最大值伤害，“盾墙”期间成功招架后有50%的几率重置本招式调息时间。<TALENT 13097 1 “盾墙”期间招架率提高30%，每点身法额外提高0.5拆招值><TALENT 13098 1 使自身获得雄峦效果，效果期间使自身化解相当于自身拆招值的伤害量，持续8秒><TALENT 13386 1 盾墙状态下，施展“盾压”后可施展，震碎自身周围刀气障碍，并将目标及其周围4尺内3个目标抛至自己身后15尺，并使其眩晕2秒。 盾墙状态下施展盾压会使目标锁足2秒。><TALENT 13361 1 额外回复10点怒气><TALENT 25356 1 对敌对目标施展使得自身“破招”提高30%，此效果持续15秒，最多叠加5层><TALENT 26723 1 每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害>",
            "belong_key": "belong_13045"
        },
        "13052": {
            "name": "劫刀",
            "recipes": [
                "recipe_1830_1",
                "recipe_1831_1",
                "recipe_1832_1",
                "recipe_1833_1",
                "recipe_1834_1",
                "recipe_1835_1",
                "recipe_1836_1"
            ],
            "skills": [
                28479
            ],
            "desc": "消耗10点怒气，对目标造成100%的武器伤害外加<SUB 28479 0>外功伤害。<TALENT 18978 1 “劫刀”施展距离提高2尺，会心几率提高25%，会心效果提高25%><TALENT 37241 1 每次施展“苍雪刀”套路下招式会为自己叠加一层“莫朽”效果：每层化解自身受到的4%最大气血值的伤害，连续施展三次“苍雪刀”套路下招式将使自己额外获得3层“莫朽”效果><TALENT 13086 1 每次施展为当前侠士目标添加一层5%最大气血值的“残楼”治疗吸收盾，吸收盾最多可叠加5层。自身气血值每降低10%，“劫刀”“绝刀”“斩刀”的伤害额外提高7%>",
            "belong_key": "belong_13052"
        },
        "13053": {
            "name": "闪刀",
            "skills": [
                13453
            ],
            "desc": "消耗15点怒气，快速冲向目标，对目标造成100%的武器伤害外加<SUB 13453 0>外功伤害。<TALENT 13152 1 命中有自身虚弱或流血效果的目标后可在接下来的10秒内可施展“隐刀”><TALENT 13153 1 命中目标后可在接下来的4秒内施展两次“血刀”><TALENT 13132 1 命中有自身流血效果目标后使流血剩余跳数每跳伤害提高90%><EnchantID 10147 血刀命中有自身流血效果的目标，触发血崩效果，对目标点造成半径3尺的范围伤害><TALENT 37241 1 每次施展“苍雪刀”套路下招式会为自己叠加一层“莫朽”效果：每层化解自身受到的4%最大气血值的伤害，连续施展三次“苍雪刀”套路下招式将使自己额外获得3层“莫朽”效果><TALENT 37559 1 命中有自身流血效果目标后使流血剩余跳数每跳伤害提高150%>",
            "belong_key": "belong_13053"
        },
        "13050": {
            "name": "盾飞",
            "recipes": [
                "recipe_1953_1",
                "recipe_1954_1",
                "recipe_1955_1",
                "recipe_1956_1",
                "recipe_1957_1",
                "recipe_1958_1"
            ],
            "skills": [
                13463
            ],
            "desc": "自身切换到“擎刀”姿态，使目标虚弱25秒。将盾牌掷出对目标进行攻击，每次攻击对目标造成100%的武器伤害外加<SUB 13463 0>外功伤害，盾牌攻击目标50次或15秒后将被动收回。<TALENT 13318 1 伤害降低20%，可对击中的目标周围10尺的其他敌对目标进行弹射><TALENT 13320 1 命中目标后使其受所有伤害输出降低5%，持续15秒><TALENT 13372 1 “盾飞”会心率、会心效果提高15%，施展“盾飞”降低“盾猛”2秒调息时间><TALENT 13368 1 附带嘲讽效果，强制目标攻击自身3秒，10秒内无法再嘲讽此目标><TALENT 13397 1 命中的第一个目标若正在运功，则使该目标2秒内无法运功><TALENT 13374 1 盾牌首次击中目标时，使目标移动速度降低60%，持续6秒><TALENT 13133 1 施展“盾飞”，“斩刀”调息时间降低5秒，且使“绝刀”伤害增加30%，持续15秒。若施展“斩刀”命中虚弱非侠士目标，则6秒内下一次施展“绝刀”可返还所消耗的怒气><TALENT 22897 1 施展“盾飞”使自身外功破防等级提高15%，“盾飞”伤害提高100%，持续30秒><TALENT 34540 1 >",
            "belong_key": "belong_13050"
        },
        "13048": {
            "name": "盾舞",
            "recipes": [
                "recipe_1902_1",
                "recipe_1903_1",
                "recipe_1904_1",
                "recipe_1905_1",
                "recipe_1906_1",
                "recipe_1907_1",
                "recipe_1908_1",
                "recipe_1909_1"
            ],
            "skills": [
                38973,
                38971
            ],
            "desc": "每0.5秒对半径8尺内的最多6个敌对目标造成100%的武器伤害外加<SUB 38973 0>外功伤害及破招伤害，持续5秒。“擎盾”姿态下施展，每命中一个目标回复1点怒气。“盾墙”姿态下不回复怒气，但可移动施展。<TALENT 14849 1 调息时间增加至30秒，强制目标攻击自身并使自身受到的所有伤害降低30%><TALENT 13360 1 作用目标提高2个，造成的威胁值提高50%><TALENT 13278 1 “盾舞”伤害提高10%，在盾墙姿态下施展时，可触发二段技能，施展“盾舞·强化”击退周围8尺内最多6个目标并造成一次外功伤害>",
            "belong_key": "belong_13048"
        },
        "13424": {
            "name": "撼地",
            "skills": [
                13206
            ],
            "desc": "门派轻功，对目标造成100%的武器伤害外加<SUB 13206 0>点外功伤害。腾空跳向目标区域，对半径5尺范围内最多5个目标造成眩晕，持续3秒。每命中一个目标回复5点怒气。<EnchantID 10144 附带群嘲效果，跳跃至目标点后将周围10尺内的最多5个目标强行拉至自己身旁><TALENT 14839 1 可解除锁足效果，眩晕效果提高1秒，变为2层充能技能，充能时间为18秒><TALENT 41834 1 >",
            "belong_key": "belong_13424"
        },
        "13090": {
            "name": "绝返",
            "desc": "“斩刀”命中目标后获得持续6秒的“狂绝”效果：若施展“绝刀”未成功击杀目标，则返还下一次施展“绝刀”消耗的怒气。",
            "belong_key": "belong_13090"
        },
        "41740": {
            "name": "崩血",
            "dots": {
                "31385": [
                    41738
                ]
            },
            "skills": [
                41739
            ],
            "desc": "流血最多可存在3层，对流血目标再次添加或消耗流血时造成额外伤害，添加流血时造成一次额外伤害，消耗流血时造成四次额外伤害，“闪刀”或“劫刀”命中三层流血目标时，消耗一层流血。",
            "belong_key": "belong_41740"
        },
        "18354": {
            "name": "鸣金",
            "desc": "格挡值最大值增加100点。",
            "belong_key": "belong_18354"
        },
        "13414": {
            "name": "残裂",
            "desc": "“盾猛”可将目标击退8尺并造成5秒击倒，击退期间撞击沿途最多5个其他目标，被撞击目标眩晕3秒。",
            "belong_key": "belong_13414"
        },
        "37559": {
            "name": "履刃",
            "recipes": [
                "recipe_5977_1",
                "recipe_5978_1"
            ],
            "desc": "“闪刀”、“劫刀”施展距离提高5尺，“闪刀”命中3层流血目标时重置“斩刀”调息时间。<TALENT_CORE 41740 1>",
            "belong_key": "belong_37559"
        },
        "34912": {
            "name": "业火麟光",
            "skills": [
                34674,
                37448
            ],
            "desc": "获得14秒“麟光甲”效果，并返还25秒“盾飞”调息时间，效果期间施展“苍雪刀”套路下招式附带一次破招伤害与“麟光甲”额外伤害，该额外伤害对非侠士目标提高150%。连续使用三次“苍雪刀”套路下招式将获得额外65点怒气，重置所有“苍雪刀”套路下技能调息时间，该效果每次“麟光甲”期间只能触发一次。",
            "belong_key": "belong_34912"
        },
        "38969": {
            "name": "血魄",
            "skills": [
                34674,
                37448
            ],
            "desc": "施展“血怒”，清空自身“斩刀”调息时间，并获得25点怒气。",
            "belong_key": "belong_38969"
        },
        "13418": {
            "name": "捍卫",
            "desc": "“盾墙”效果期间自身半径8尺范围内最多5个友方目标受到的伤害降低40%。",
            "belong_key": "belong_13418"
        },
        "36058": {
            "name": "援戈",
            "recipes": [
                "recipe_5364_1"
            ],
            "skills": [
                36065,
                36482
            ],
            "desc": "“盾击”充能时间降低1秒，层数增加一层，每次施展盾击会触发一次破招，成功触发该破招伤害可获得1层“援戈”效果，最多可获得7层，每次施展苍雪刀套路下招式将附带<SUB 36482 0>外功伤害并消耗一层。",
            "belong_key": "belong_36058"
        },
        "41982": {
            "name": "偃守孤旌",
            "desc": "云城盾解体，附于自身，持续9秒，自动转换为擎刀姿态，进入“<NounID 52>”状态。施展后与“盾墙”共同进入40秒调息时间。",
            "belong_key": "belong_41982"
        },
        "13152": {
            "name": "隐刀",
            "skills": [
                13286
            ],
            "desc": "最少消耗5点怒气，最多消耗15点怒气，消耗逐渐增加，闪刀命中附带自身虚弱或流血效果的目标后10秒内可连续施展，隐刀命中附带自身虚弱或流血效果的目标可对其造成100%的武器伤害外加<SUB 13286 0>外功伤害，并冲刺穿过目标，期间自身免疫伤害和控制效果，持续1秒，施展次数越多，怒气消耗越高。",
            "belong_key": "belong_13152"
        },
        "13153": {
            "name": "血刀",
            "skills": [
                13143,
                13144
            ],
            "desc": "消耗10点怒气，“闪刀”命中目标后方可施展，可对12尺范围内最多5个目标造成100%的武器伤害外加<SUB 13144 0>外功伤害，若当前目标附带自身的流血效果，则对血刀命中的所有目标都将增加一层流血效果。<EnchantID 10147 命中有自身流血效果的目标，触发血崩效果，对半径3尺范围内的最多5个目标造成范围伤害>",
            "belong_key": "belong_13153"
        },
        "13278": {
            "name": "叱威",
            "recipes": [
                "recipe_3234_1"
            ],
            "skills": [
                34541
            ],
            "desc": "“盾舞”伤害提高10%，在盾墙姿态下施展时，可触发二段技能，施展“盾舞·强化”击退周围8尺内最多6个目标并造成一次外功伤害。",
            "belong_key": "belong_13278"
        },
        "14840": {
            "name": "肃驾",
            "desc": "每消耗11点怒气，回复自身1点格挡值，“分山劲”心法下降低自身“盾立”0.5秒的调息时间。",
            "belong_key": "belong_14840"
        },
        "37240": {
            "name": "岁久",
            "desc": "施展“盾壁”使自身立即回复自身10%气血最大值，并回复自身30%格挡值。受到任何伤害攻击导致自身气血值低于40%则立刻重置“盾壁”调息时间，该效果最多每3分钟触发一次。",
            "belong_key": "belong_37240"
        },
        "14838": {
            "name": "刀煞",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "recipes": [
                "recipe_5745_1",
                "recipe_5746_1"
            ],
            "desc": "对击倒、被击僵直目标伤害提高20%。“绝刀”及其破招伤害无视目标100%外功防御等级。",
            "belong_key": "belong_14838"
        },
        "36205": {
            "name": "惊涌",
            "buffs": [
                27161
            ],
            "desc": "“血怒”效果无法再叠加，期间自身无双等级提高30%，施展“斩刀”“绝刀”“盾舞”触发的破招伤害提高20%。",
            "belong_key": "belong_36205"
        },
        "13086": {
            "name": "残楼",
            "desc": "每次施展“劫刀”“斩刀”“绝刀”为当前侠士目标添加一层6%最大气血值的“残楼”治疗吸收盾，吸收盾最多可叠加5层。",
            "belong_key": "belong_13086"
        },
        "13111": {
            "name": "步临",
            "recipes": [
                "recipe_1899_1"
            ],
            "buffs": [
                20491
            ],
            "desc": "“盾击”使目标被疗伤成效降低30%，此效果最多可叠加2层，持续12秒。",
            "belong_key": "belong_13111"
        },
        "13304": {
            "name": "愤恨",
            "desc": "消耗5%气血，“血怒”效果提高50%，持续时间增加至25秒。",
            "belong_key": "belong_13304"
        },
        "21281": {
            "name": "嗜血",
            "recipes": [
                "recipe_6016_1"
            ],
            "buffs": [
                17176
            ],
            "desc": "“绝刀”会心几率提高15%，会心效果提高20%，达到最大怒气消耗时，招式伤害额外提高40%。施展“绝刀”使得自身伤害提高5%，持续12秒。",
            "belong_key": "belong_21281"
        },
        "13073": {
            "name": "赤心",
            "desc": "“血怒”效果期间每消耗或回复1点怒气为自身回复0.1%气血最大值。",
            "belong_key": "belong_13073"
        },
        "37558": {
            "name": "登锋",
            "recipes": [
                "recipe_5562_1"
            ],
            "dots": {
                "31385": [
                    41737
                ]
            },
            "desc": "流血效果伤害提高80%，作用时间间隔缩短1秒，总持续时间保持不变。每次添加流血后，若目标已有三层流血，则自身回复10点怒气。<TALENT_CORE 41740 1>",
            "belong_key": "belong_37558"
        },
        "20984": {
            "name": "激奋",
            "desc": "施展“盾壁”将会触发10尺范围“振奋军阵”，处于“军阵”中的5个友方目标不会受到重伤，受到伤害提高10%，基础攻击力提高20%，“振奋军阵”持续8秒。此效果不会在秘境中生效。",
            "belong_key": "belong_20984"
        },
        "30769": {
            "name": "阵云结晦",
            "skills": [
                30925,
                30926,
                30857
            ],
            "desc": "可施展3段招式，每段招式回复15点怒气，招式无视目标100%外功防御等级，若命中非侠士目标则伤害额外提高200%。\\n一段：对前方6尺矩形范围的最多5个敌对目标造成100%武器伤害外加<SUB 30925 1>外功伤害；\\n二段：对前方8尺扇形范围的最多5个敌对目标造成100%武器伤害外加<SUB 30926 1>外功伤害和破招伤害；\\n三段：冲向20尺内的目标并对其造成100%武器伤害外加<SUB 30857 1>外功伤害和破招伤害。",
            "belong_key": "belong_30769"
        },
        "15196": {
            "name": "扬旌沙场",
            "desc": "对敌对侠士目标施展，强迫目标与自身进行对决，清除双方持续治疗效果、所有不利效果、受控状态，气血恢复至最大值。期间不受其他玩家招式影响，持续14秒，决斗时间结束或一方被击败则提前结束决斗，败者直接重伤，敌方侠士获得特殊技能栏技能“<NounID 58>”。",
            "belong_key": "belong_15196"
        },
        "25213": {
            "name": "断马摧城",
            "buffs": [
                31536
            ],
            "desc": "回复20点怒气，举盾对自身8尺范围最多5个目标造成一次锤击，造成<NounID 13>外功伤害并使其被击倒3秒。当前每拥有50点怒气使其被击倒时长增加1秒。<TALENT 26723 1 擎盾姿态下自身加速率提高10%，每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害>",
            "belong_key": "belong_25213"
        },
        "29066": {
            "name": "矢尽兵穷",
            "desc": "施展后在原地插下旗帜，向12尺范围内的敌方玩家发出战斗邀请，施展时每个拥有自身流血效果的目标会使自身获得“在野”效果，使自身获得不受限的加速值加成7.5%，移动速度提高5%，该效果最多作用4次。3秒后在旗帜半径12尺内生成决斗场，范围内自身以及最多5个敌方玩家被疗伤成效额外降低10%，免疫击退和被拉。受到邀请未在场内和离开决斗场的敌方玩家获得“怯战”效果，造成的伤害降低60%，持续12秒。决斗场最多存在15秒，在苍云离开后消失。",
            "belong_key": "belong_29066"
        },
        "37239": {
            "name": "麾远",
            "skills": [
                37253
            ],
            "desc": "“斩刀”附带的锁足效果变为眩晕效果，并追加一段无视目标30%外功防御的外功伤害，若成功眩晕目标，则返还15点怒气和6秒斩刀调息时间。",
            "belong_key": "belong_37239"
        },
        "32618": {
            "name": "血誓",
            "skills": [
                33097
            ],
            "desc": "若自身气血值高于20%，“血怒”状态下连续施展三次“苍雪刀”套路下招式命中同一目标，则消耗20%的自身当前气血值，将对目标造成一次无视50%化劲等级的外功伤害并使其被疗伤成效额外降低30%，可与其他减疗效果叠加。",
            "belong_key": "belong_32618"
        },
        "13172": {
            "name": "千险",
            "desc": "战斗状态下，自身气血值降低至40%及以下时使自身免疫所有控制效果并使受到的伤害降低10%，持续8秒。该效果每23秒最多触发一次。",
            "belong_key": "belong_13172"
        },
        "25212": {
            "name": "仇非",
            "desc": "自身气血值低于1%时，消耗全部怒气，短时不会重伤，持续6秒，期间自身禁疗，结束时若自身怒气大于等于60点，回复自身50%气血值。此效果最多3分30秒触发一次。",
            "belong_key": "belong_25212"
        },
        "13317": {
            "name": "赴敌",
            "recipes": [
                "recipe_5804_1",
                "recipe_5805_1"
            ],
            "desc": "“盾猛”“斩刀”伤害提高10%，且对4尺内目标不再冲刺。",
            "belong_key": "belong_13317"
        },
        "21282": {
            "name": "吓魂",
            "recipes": [
                "recipe_4935_1"
            ],
            "desc": "“绝刀”附带8尺冲刺效果，命中有自身流血的侠士目标，直接造成最大怒气对应的伤害，若目标气血值低于自身，则使目标的基础攻击力下降20%，持续4秒。",
            "belong_key": "belong_21282"
        },
        "41834": {
            "name": "陷阵",
            "skills": [
                41835,
                41902
            ],
            "desc": "“撼地”造成一段额外伤害，释放后使10秒内下一个“盾击”受到强化，强化“盾击”施展距离增加4尺，释放后在地面砸出波纹向外扩散并对触碰目标造成伤害，该伤害视为“盾击”，最大30尺，最多5个目标。",
            "belong_key": "belong_41834"
        },
        "13374": {
            "name": "难行",
            "recipes": [
                "recipe_1925_1"
            ],
            "desc": "“盾飞”的最大充能次数提升至5层，且目标被盾牌首次击中时移动速度降低60%，持续6秒。",
            "belong_key": "belong_13374"
        },
        "22897": {
            "name": "锋鸣",
            "buffs": [
                14309
            ],
            "desc": "施展“盾飞”使自身外功破防等级提高15%，“盾飞”伤害提高100%，持续30秒。",
            "belong_key": "belong_22897"
        },
        "39664": {
            "name": "烨疆",
            "desc": "重伤恢复后立刻获得50点格挡值。",
            "belong_key": "belong_39664"
        },
        "13395": {
            "name": "劫化生",
            "recipes": [
                "recipe_5123_1"
            ],
            "desc": "施展“血怒”后获得的“劫化”效果期间每点身法提高自身2点招架等级，持续时间提升至8秒，调息时间提高至29秒。",
            "belong_key": "belong_13395"
        },
        "34540": {
            "name": "雷云",
            "recipes": [
                "recipe_3239_1"
            ],
            "desc": "“盾飞”可对击中的目标周围10尺的其他敌对目标进行弹射，若命中的第一个目标若正在运功，则使该目标2秒内无法运功。",
            "belong_key": "belong_34540"
        }
    },
    "10447": {
        "14070": {
            "name": "阳春白雪",
            "buffs": [
                9433
            ],
            "skills": [
                14494,
                30762
            ],
            "desc": "激活阳春白雪曲效果；\\n被动效果：施展“阳春白雪”主动技能，莫问心法下使“宫”“徵”无视目标10%防御值，相知心法下使“宫”“徵”会心几率提高5%；最多累加3次。\\n主动效果：对敌对目标造成<SUB 14494 0>阴性内功伤害，或为友方目标回复<SUB 14344 0>气血值，可在“宫”“徵”运功过程中施展且不会打断运功状态。若目标气血值低于50%，则“阳春白雪”伤害或治疗效果增加10%。<TALENT 22030 1 无尽藏>",
            "belong_key": "belong_14070"
        },
        "10447": {
            "name": "莫问",
            "attributes": {
                "magical_shield_base": 3130,
                "physical_shield_base": 2850,
                "max_life_gain": 245,
                "magical_attack_power_base": 6518,
                "lunar_critical_strike_base": 3962,
                "spirit_to_lunar_attack_power": 2007,
                "spirit_to_lunar_critical_strike": 410,
                "pve_addition_base": 51
            },
            "dots": {
                "23187": [
                    40815
                ]
            },
            "skills": [
                14063,
                32738,
                25781
            ],
            "desc": "引气入声，共声和弦，拨弦成曲，凭曲定风。习此功者可以琴曲音波撩动敌人心脉，陷入幻境难以脱身。",
            "critical_type": "lunar",
            "damage_type": "lunar",
            "belong_key": "belong_10447"
        },
        "14065": {
            "name": "商",
            "recipes": [
                "recipe_2058_1",
                "recipe_2059_1",
                "recipe_2060_1",
                "recipe_2061_1",
                "recipe_2062_1",
                "recipe_2063_1",
                "recipe_2064_1",
                "recipe_2065_1"
            ],
            "dots": {
                "9357": [
                    14287
                ]
            },
            "skills": [
                14311,
                25225
            ],
            "desc": "对目标立刻造成<SUB 14311 1>阴性内功伤害，使目标<BUFF 9357 0 desc>(+<SKILLEx {D0} {TotalLunarAP 0.208}>)，持续<BUFF 9357 0 time>。<TALENT 14870 1 入圣><TALENT 25220 1 冻泉><TALENT 14285 1 疏曲><TALENT 41830 1 鹿鸣><TALENT 14441 1 流韵><TALENT 14313 1 井仪><TALENT 18711 1 别鹤><TALENT 41838 1 妙意>",
            "belong_key": "belong_14065"
        },
        "14067": {
            "name": "徵",
            "recipes": [
                "recipe_2074_1",
                "recipe_2075_1",
                "recipe_2076_1",
                "recipe_2077_1",
                "recipe_2078_1",
                "recipe_2079_1",
                "recipe_2080_1",
                "recipe_2081_1"
            ],
            "dots": {
                "9361": [
                    14291
                ]
            },
            "skills": [
                14227,
                18859,
                40285
            ],
            "desc": "2.81秒内对目标造成3次<SUB 14227 0>阴性内功伤害。<TALENT 14870 1 入圣><TALENT 37287 1 凌冬><TALENT 14336 1 豪情><TALENT 14321 1 长清><TALENT 14282 1 师襄>",
            "belong_key": "belong_14067"
        },
        "14064": {
            "name": "宫",
            "recipes": [
                "recipe_2042_1",
                "recipe_2043_1",
                "recipe_2044_1",
                "recipe_2045_1",
                "recipe_2046_1",
                "recipe_2047_1",
                "recipe_2048_1",
                "recipe_2049_1"
            ],
            "skills": [
                14474,
                18860,
                18656
            ],
            "desc": "对目标造成<SUB 14474 0>阴性内功伤害。<TALENT 25220 1 冻泉><TALENT 14870 1 入圣><TALENT 41796 1 入月><TALENT 14282 1 师襄>",
            "belong_key": "belong_14064"
        },
        "14066": {
            "name": "角",
            "recipes": [
                "recipe_6154_1"
            ],
            "skills": [
                14312,
                40293
            ],
            "desc": "对目标立刻造成<SUB 14312 1>阴性内功伤害，使目标<BUFF 9361 0 desc>(+<SKILLEx {D0} {TotalLunarAP 0.234}>)，持续<BUFF 9361 0 time>。<TALENT 14870 1 入圣><TALENT 25220 1 冻泉><TALENT 14285 1 疏曲><TALENT 41830 1 鹿鸣><TALENT 14441 1 流韵><TALENT 14313 1 井仪><TALENT 18711 1 别鹤><TALENT 41838 1 妙意>",
            "belong_key": "belong_14066"
        },
        "14068": {
            "name": "羽",
            "recipes": [
                "recipe_2089_1",
                "recipe_2090_1",
                "recipe_2091_1",
                "recipe_2092_1",
                "recipe_2093_1",
                "recipe_2094_1",
                "recipe_2095_1",
                "recipe_2096_1"
            ],
            "skills": [
                14100,
                14455,
                18663
            ],
            "desc": "3层充能技能，充能时间受加速率影响，对目标造成<SUB 14100 0>阴性内功伤害，使其下两跳自身“商”“角”持续伤害立刻生效。<TALENT 14870 1 入圣><TALENT 25220 1 冻泉><TALENT 14285 1 疏曲><TALENT 37287 1 凌冬><TALENT 32486 1 微萤><TALENT 14282 1 师襄>",
            "belong_key": "belong_14068"
        },
        "14082": {
            "name": "疏影横斜",
            "skills": [
                15076
            ],
            "desc": "在目标点位置召唤一个<NounID 91>，相知心法下返还5秒充能时间。可施展“移形换影”传送回30尺内影子位置，解除自身受控效果并使自身免疫控制，持续5秒，该效果时间可累加。<TALENT 30531 1 奉知音><TALENT 14874 1 捣衣><TALENT 14873 1 刻梦><TALENT 32487 1 莲魄><TALENT 41837 1 参连>",
            "belong_key": "belong_14082"
        },
        "25220": {
            "name": "冻泉",
            "recipes": [
                "recipe_5215_1",
                "recipe_5216_1",
                "recipe_5979_1"
            ],
            "desc": "“商”“角”增加3跳持续效果。“宫”“变宫”不再需要运功，调息时间改为12秒，命中同时带有自身“商”“角”效果的目标使其眩晕3秒，并返还“羽”6秒充能时间。",
            "belong_key": "belong_25220"
        },
        "14871": {
            "name": "绝弦",
            "buffs": [
                30474
            ],
            "desc": "无法施展“曲”套路招式主动技能；<NounID 60>不再限制时间，期间可施展音域类招式，伤害提高15%，移动速度提高10%，受到的治疗成效提高10%。在秘境中进入<NounID 60>时获得“出鞘”：视为近战输出心法，在战斗中无法施展“清绝影歌·回”。",
            "belong_key": "belong_14871"
        },
        "14870": {
            "name": "入圣",
            "recipes": [
                "recipe_5980_1",
                "recipe_6156_1"
            ],
            "buffs": [
                31444
            ],
            "desc": "“清绝影歌”不再占用基础调息时间，施展“清绝影歌·回”使自身后撤10尺。施展“音”套路招式时获得1层<NounID 61>，“宫”“变宫”不再需要运功，命中后会将<NounID 61>转化为相同层数的<NounID 62>。",
            "belong_key": "belong_14870"
        },
        "41830": {
            "name": "鹿鸣",
            "buffs": [
                31477
            ],
            "skills": [
                41831
            ],
            "desc": "“变宫”会为目标添加16秒“鹿鸣”，若目标已经带有“鹿鸣”则引爆，造成<SUB 41831 1>阴性内功伤害，并使自身会心效果提高20%，持续40秒。",
            "belong_key": "belong_41830"
        },
        "14285": {
            "name": "殊曲",
            "dots": {
                "9360": [
                    14290
                ],
                "9364": [
                    14294
                ]
            },
            "desc": "“商”“角”持续效果作用间隔缩短1秒，总持续时间保持不变，每跳造成的效果递增12%。",
            "belong_key": "belong_14285"
        },
        "18704": {
            "name": "削竹",
            "recipes": [
                "recipe_4881_1",
                "recipe_5915_1"
            ],
            "desc": "“剑·徵”变为2层充能招式，充能时间8秒，无视目标90%内功防御，施展后立即进行一次斩击，并锁足目标2秒。",
            "belong_key": "belong_18704"
        },
        "40313": {
            "name": "醉剑",
            "desc": "“剑·徵”增加2跳，运功期间自身闪避几率提高60%，每次斩击改为对面向10尺矩形范围内至多5个目标造成伤害，并回复自身1.5%气血值。",
            "belong_key": "belong_40313"
        },
        "37287": {
            "name": "凌冬",
            "recipes": [
                "recipe_5496_1",
                "recipe_5583_1",
                "recipe_6213_1"
            ],
            "buffs": [
                9570
            ],
            "desc": "“羽”充能时间延长2秒，命中非侠士目标后获得1层“凌冬”，最多叠加9层，仅在战斗中维持。“徵”“变徵”需要消耗3层“凌冬”方可施展，立刻造成一次破招伤害，无视目标60%内功防御，在3.75秒内对目标造成6次伤害，每次伤害递增40%，递增6次后重置。",
            "belong_key": "belong_37287"
        },
        "14466": {
            "name": "凝眉",
            "recipes": [
                "recipe_2861_1"
            ],
            "buffs": [
                12567
            ],
            "desc": "“青霄飞羽”调息时间降低5秒，期间自身伤害提高20%，施展后立刻击退自身6尺范围内最多5名敌对玩家。",
            "belong_key": "belong_14466"
        },
        "40325": {
            "name": "鸾羽",
            "skills": [
                40334
            ],
            "desc": "“青霄飞羽”替换为“飞鸾动羽”，不再需要运功，冲刺至25尺内目标点位置激起震荡，对8尺内至多5个敌对目标造成<SUB 40334 1>阴性内功伤害，并锁足3秒，在命中受自身“音域”影响的目标时改为眩晕。非<NounID 60>下施展时，使自身进入9秒<NounID 60>。施展后使自身免疫控制、打断、缴械和无法运功效果，受到的伤害降低40%，持续8秒，该效果在退出[持剑姿态]后提前结束。35秒调息时间。",
            "belong_key": "belong_40325"
        },
        "14874": {
            "name": "捣衣",
            "desc": "施展“移形换影”后，在免疫控制效果期间使自身免疫缴械和无法运功效果。",
            "belong_key": "belong_14874"
        },
        "41837": {
            "name": "参连",
            "attributes": {
                "strain_gain": 154
            },
            "buffs": [
                31476
            ],
            "desc": "无双等级提高15%；“疏影横斜”影子存在时自身威胁值降低30%，施展后使自身5秒内无双等级提高10%，该效果时间可累加。",
            "belong_key": "belong_41837"
        },
        "32486": {
            "name": "微萤",
            "desc": "敌方玩家目标被“迴梦逐光”“江逐月天”影响每超过4秒，将被驱散一个持续治疗效果。施展招式“迴梦逐光·回”或“江逐月天”后，5秒内对侠士目标施展“羽”不计入调息时间，且“羽”伤害提高100%。",
            "belong_key": "belong_32486"
        },
        "25224": {
            "name": "停拍",
            "recipes": [
                "recipe_5835_1"
            ],
            "desc": "“剑·羽”伤害提高20%，命中后返还4秒“剑·角”“剑·商”招式调息时间，命中受自身“江逐月天”影响的目标时取音于剑，改为返还“剑·羽”1层充能。",
            "belong_key": "belong_25224"
        },
        "14557": {
            "name": "贯珠",
            "desc": "受到技能伤害超过自身气血最大值10%，则该次伤害降低20%。",
            "belong_key": "belong_14557"
        },
        "41838": {
            "name": "妙意",
            "recipes": [
                "recipe_5983_1"
            ],
            "desc": "“鹿鸣”伤害无视目标90%内功防御，附带一次破招伤害，并为目标添加“商”“角”持续效果。<TALENT_CORE 41830 1>",
            "belong_key": "belong_41838"
        },
        "14163": {
            "name": "相依",
            "skills": [
                43043
            ],
            "desc": "“孤影化双”持续时间延长8秒，施展时奏出一道向外扩散的环形音波，延迟4秒后再次奏出一道，两道音波分别对触碰到的敌对目标造成<SUB 21267 1>，<SUB 21267 2>阴性内功伤害，每道音波最多对25个目标生效，对非侠士目标改为造成提高300%的无质伤害。",
            "belong_key": "belong_14163"
        },
        "30589": {
            "name": "音彻",
            "skills": [
                40330
            ],
            "desc": "“剑·音”套路招式命中受自身“音域”影响的目标时产生震荡，立刻造成一次<SUB 40330 1>阴性内功伤害，并返还“笑傲光阴”1秒调息时间。",
            "belong_key": "belong_30589"
        },
        "41796": {
            "name": "入月",
            "skills": [
                41791
            ],
            "desc": "自身<NounID 61>效果发生转化时，每转化1层，对目标造成一次<SUB 41791 1>阴性内功伤害，并为侠士目标添加1.5%最大气血值的治疗吸收盾，持续5秒。<TALENT_CORE 14870 1>",
            "belong_key": "belong_41796"
        },
        "31157": {
            "name": "修齐",
            "desc": "“孤影化双”施展返回招式时，不受缴械和无法运功效果的影响，影子被召回8秒内仍然会附着玩家，期间分摊玩家受到伤害的50%，并使自身免疫所有控制效果(击退和被拉除外)。",
            "belong_key": "belong_31157"
        },
        "14336": {
            "name": "豪情",
            "recipes": [
                "recipe_2193_1",
                "recipe_2195_1"
            ],
            "buffs": [
                19234
            ],
            "desc": "施展“徵”“变徵”立刻对目标造成一次伤害，命中受自身“音域”作用的目标伤害提高20%。",
            "belong_key": "belong_14336"
        },
        "14441": {
            "name": "流韵",
            "recipes": [
                "recipe_5833_1"
            ],
            "desc": "“剑·角”伤害提高10%，会为命中的目标添加“商”“角”，并卸除其阴性、阳性、混元性、毒性内功气劲各1个。",
            "belong_key": "belong_14441"
        },
        "41797": {
            "name": "照雪",
            "skills": [
                41793
            ],
            "desc": "“剑·音”套路招式命中目标时，若自身存在<NounID 62>，将其中1层转化为<NounID 61>，并造成一次<SUB 41793 1>阴性内功伤害。<TALENT_CORE 14870 1>",
            "belong_key": "belong_41797"
        },
        "41856": {
            "name": "希声",
            "desc": "“清绝影歌”影子和伤害吸收盾延长4秒，战斗中施展时消融自身15尺内1个敌方音域。",
            "belong_key": "belong_41856"
        },
        "30797": {
            "name": "太常律",
            "skills": [
                30833
            ],
            "desc": "被动效果：自身音域范围内最多5名敌对玩家目标受到的治疗成效降低45%。\\n主动效果：2层充能技能，可在移动中运功，每0.75秒对目标8尺内至多5个目标造成<SUB 30833 1>阴性内功伤害，持续2.25秒，命中后为没有属于自身“商”“角”的目标添加“商”“角”。运功不会被打退、打断。该招式视为“音”套路招式。<TALENT_CORE 25220 1><TALENT 25220 1 冻泉><TALENT 14285 1 疏曲><TALENT 14313 1 井仪>",
            "belong_key": "belong_30797"
        },
        "29071": {
            "name": "不愧君",
            "skills": [
                29077
            ],
            "desc": "<NounID 60>下方可施展，凝聚“青鸾剑”对目标造成<SUB 29077 0>无质阴性内功伤害，附带一次破招伤害，并使其受到的治疗效果降低50%，持续12秒。敌方当前生命值高于最大生命值70%时伤害提高100%。该招式视为“剑·音”套路招式。<TALENT 30589 1 音彻><TALENT 41797 1 照雪><TALENT 40743 1 崭芒>",
            "belong_key": "belong_29071"
        },
        "42529": {
            "name": "断水流",
            "skills": [
                41903
            ],
            "desc": "5层充能招式，对10尺内单一目标造成<SUB 41903 1>阴性内功伤害，5秒内连续施展时，施展速度提高，最多提高3次。非<NounID 60>下施展时，施展距离提高5尺，冲向目标并使自身进入9秒<NounID 60>。该招式视为“剑·音”套路招式。<TALENT 30589 1 音彻><TALENT 41797 1 照雪><TALENT 40743 1 崭芒>",
            "belong_key": "belong_42529"
        },
        "34344": {
            "name": "青莲歌",
            "buffs": [
                31543
            ],
            "dots": {
                "31544": [
                    42010
                ],
                "31545": [
                    42009
                ],
                "31546": [
                    42008
                ]
            },
            "skills": [
                42007,
                42008,
                42009,
                42011,
                42303,
                34676
            ],
            "desc": "战斗中方可施展。进入30秒“青莲歌”状态，期间各“音”或“剑·音”套路招式命中非侠士目标时，会根据招式类型召唤太白幻影进行协同攻击，并使自身阴性基础攻击力提高20%；最多触发5次协同攻击，全部触发后，激活二段招式“斩长鲸”。",
            "belong_key": "belong_34344"
        },
        "40743": {
            "name": "崭芒",
            "skills": [
                40811
            ],
            "desc": "施展“清绝影歌”获得9层<NounID 64>，施展“剑·宫”获得1层<NounID 64>，最多叠加9层。",
            "belong_key": "belong_40743"
        },
        "14321": {
            "name": "长清",
            "recipes": [
                "recipe_2902_1",
                "recipe_5985_1"
            ],
            "skills": [
                18373
            ],
            "desc": "“徵”“变徵”会心几率提高10%，可对目标周围8尺内额外4个敌对目标造成伤害。",
            "belong_key": "belong_14321"
        },
        "14282": {
            "name": "师襄",
            "attributes": {
                "magical_critical_power_rate": 103
            },
            "recipes": [
                "recipe_5335_1",
                "recipe_5336_1",
                "recipe_5337_1",
                "recipe_5338_1"
            ],
            "desc": "会心效果提高10%，“音”“剑·音”套路招式运功不会被打退。",
            "belong_key": "belong_14282"
        },
        "14313": {
            "name": "井仪",
            "desc": "持续效果被卸除后，每个持续效果使驱散者2秒内无法运功，最多持续6秒。",
            "belong_key": "belong_14313"
        },
        "18711": {
            "name": "别鹤",
            "desc": "施展“迴梦逐光”将敌对目标拉回记录地点时会将目标定身3秒，并为没有属于自身“商”“角”不利效果的目标添加属于自身的“商”“角”不利效果。",
            "belong_key": "belong_18711"
        },
        "14152": {
            "name": "兼山",
            "desc": "“云生结海”音域生成时立刻平衡音域范围内所有小队成员当前气血值百分比。",
            "belong_key": "belong_14152"
        },
        "14143": {
            "name": "知音",
            "desc": "“笑傲光阴”音域减伤效果可对自身小队成员产生作用。",
            "belong_key": "belong_14143"
        },
        "14146": {
            "name": "忘弦",
            "desc": "“笑傲光阴”音域生成时若自身在音域范围内，则恢复自身20%气血最大值，解除自身受到的阴性、阳性、混元性、毒性、点穴、持续伤害不利效果。",
            "belong_key": "belong_14146"
        },
        "32487": {
            "name": "莲魄",
            "desc": "施展“移形换影”不再传送至影子位置，改为解除自身控制并获得5秒“莲魄”：获得15%可与其他减伤叠加的减伤，免疫控制效果（击退和被拉除外），该效果时间可累加。",
            "belong_key": "belong_32487"
        },
        "14873": {
            "name": "刻梦",
            "recipes": [
                "recipe_6056_1"
            ],
            "desc": "“疏影横斜”充能时间降低10秒，但“移形换影”不再附带免疫控制效果。",
            "belong_key": "belong_14873"
        },
        "29069": {
            "name": "游羽",
            "recipes": [
                "recipe_5334_1",
                "recipe_5487_1"
            ],
            "desc": "“青霄飞羽”运功不会被打退，运功时间降低0.25秒。成功浮空后双击“左平移”或“右平移”，可朝指定方向移动，“青霄飞羽”效果期间仅可移动一次。",
            "belong_key": "belong_29069"
        },
        "14093": {
            "name": "冲秋冥",
            "skills": [
                41871
            ],
            "desc": "对目标造成<SUB 41871 1>阴性内功伤害，打断其运功并击退12尺。",
            "belong_key": "belong_14093"
        }
    },
    "10464": {
        "17057": {
            "name": "闹须弥",
            "dots": {
                "11447": [
                    17058
                ]
            },
            "desc": "竹雾体态下方可施展，消耗10点刀魂，冲向目标并对目标造成持续伤害效果，使目标<BUFF 11447 0 desc>(+<SKILLEx {D0} {TotalPhysicsAP 0.875}>)，持续<BUFF 11447 0 time>。<TALENT 17056 1 流血效果伤害提高70%且自身伤害招式命中目标后有30%的几率刷新流血效果持续时间并造成<SUB 34585 1>外功伤害，同时降低“闹须弥”0.5秒调息时间。><TALENT 16816 1 “闹须弥”释放后获得一次“碎江天”施展机会。“碎江天”命中“闹须弥”目标时额外造成<SUB 38533 1>外功伤害><TALENT 42563 1 >",
            "belong_key": "belong_17057"
        },
        "10464": {
            "name": "北傲诀",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2955,
                "pve_addition_base": 215,
                "strength_to_physical_attack_power": 1802,
                "strength_to_physical_overcome": 420,
                "max_life_gain": 245,
                "physical_attack_power_base": 7034
            },
            "skills": [
                16820,
                16419,
                16822,
                32823,
                25782,
                39106
            ],
            "desc": "罡风起处刀鸣烈，龙出沧海撼雷霆。北傲诀进退由心，偃仰任意。练到深邃之处有气盈于膺，刀势展开时吞吐万里，傲意凌穹。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10464"
        },
        "16028": {
            "name": "龙骧虎步",
            "skills": [
                16097,
                16774,
                16775
            ],
            "desc": "对前方6尺范围内的目标造成<SUB 16097 0>外功伤害。使自身免疫控制，持续5秒，并回复狂意、刀魂、气劲各15点。<TALENT 16693 1 使目标移动速度降低60%，持续10秒><TALENT 17045 1 会心几率提高15%，施展后若不会心则回复狂意、刀魂、气劲各7点，会心后回复狂意、刀魂、气劲提高至15点><TALENT 42564 1 >",
            "belong_key": "belong_16028"
        },
        "16460": {
            "name": "踏宴扬旗",
            "skills": [
                17053
            ],
            "desc": "对目标造成<SUB 17053 0>外功伤害并击倒2秒。<TALENT 16707 1 调息时间减半，击倒效果降低为2秒>",
            "belong_key": "belong_16460"
        },
        "16599": {
            "name": "雷走风切",
            "attributes": {
                "physical_damage_base": 175,
                "physical_damage_rand": 15
            },
            "skills": [
                16599,
                16600,
                16631,
                16632
            ],
            "desc": "<SKILL PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP}>)",
            "belong_key": "belong_16599"
        },
        "16454": {
            "name": "西楚悲歌",
            "skills": [
                17006
            ],
            "desc": "对半径6尺范围内最多5名敌对目标造成100%武器伤害外加<SUB 17006 0>外功伤害并形成刀气障碍，持续4秒，效果期间自身免疫控制且降低招式威胁值，区域内敌对目标获得“悲歌”效果：受到重力影响，上空7尺范围内已处于浮空状态下的目标将会解除浮空状态迅速落地。<TALENT 16958 1 解除自身受控状态并使范围内小队成员受到的伤害降低30%><TALENT 17049 1 施展后重置“上将军印”的调息时间并使下一式“上将军印”伤害提高15%，持续10秒><TALENT 17054 1 主动施展时不再生成刀气障碍，伤害范围扩大至12尺，范围内小队成员基础攻击力提高30%，持续12秒><TALENT 21264 1 “西楚悲歌”的调息时间降低10秒，其内附带“坚壁清野”残留伤害效果，“悲歌”的重力效果增强并使目标无法跳跃><TALENT 25259 1 施展“秀明尘身”套路招式，额外对自身正面6尺60度范围最多5个目标造成<SUB 25260 1>外功伤害>",
            "belong_key": "belong_16454"
        },
        "16601": {
            "name": "项王击鼎",
            "recipes": [
                "recipe_4140_1",
                "recipe_4141_1",
                "recipe_4142_1",
                "recipe_4143_1",
                "recipe_4144_1",
                "recipe_4145_1",
                "recipe_4146_1",
                "recipe_4147_1"
            ],
            "skills": [
                16758,
                16759,
                16760,
                16382
            ],
            "desc": "尘身体态下方可施展，三段攻击，每段消耗5点狂意，对前方6尺范围内最多5个敌对目标造成100%武器伤害外加<SUB 16758 0>外功伤害，三段攻击后触发持续2秒群体伤害，每0.5秒对半径8尺范围内最多5个敌对目标造成100%武器伤害外加<SUB 16382 0>外功伤害，期间免疫控制。<TALENT 16692 1 会心几率提高10%，会心效果提高10%><TALENT 16777 1 消耗的狂意增加5点，三段触发的持续范围伤害每跳伤害递增15%，最多提高120%><TALENT 16748 1 第三段招式命中有自身“闹须弥”的侠士目标时，使其获得气血最大值3%的治疗吸收盾，最多叠加8层，持续10秒><TALENT 16696 1 三段触发的持续范围伤害会心则使“破釜沉舟”调息时间降低1秒><TALENT 25259 1 施展“秀明尘身”套路招式，额外对自身正面6尺60度范围最多5个目标造成<SUB 25260 1>外功伤害><TALENT 26904 1 命中目标数量降低为3个，伤害提高50%且施展后30秒内无视目标50%的外功防御，“项王击鼎”第三段招式持续攻击的频率提升25%><TALENT 38541 1 无视目标20%化劲且前三段范围提升至360°。第一、二、三段公共调息时间与获得的“尘身”时间提升至2.5秒且该“尘身”期间自身不受缴械、沉默影响，造成伤害时使目标僵直，并标记目标使其在10秒内“蹑云逐月”冲刺速度降低80%><TALENT 40189 1 第三段持续攻击后自身获得两层“余声”效果，持续15秒>",
            "belong_key": "belong_16601"
        },
        "16602": {
            "name": "破釜沉舟",
            "recipes": [
                "recipe_4148_1",
                "recipe_4149_1",
                "recipe_4150_1",
                "recipe_4151_1",
                "recipe_4152_1",
                "recipe_4153_1",
                "recipe_4155_1"
            ],
            "skills": [
                20991
            ],
            "desc": "尘身体态下方可施展，消耗10点狂意，对前方6尺范围内最多5个敌对目标造成200%武器伤害外加<SUB 20991 0>外功伤害和一段破招伤害（每0.25秒最多触发一次），可透支施展一次。<TALENT 18625 1 招式范围变成360°，每次施展激活“项王击鼎”前两段；“项王击鼎”第三段持续攻击命中6次时，获得1层“碎江天”><TALENT 25256 1 调息时间降低3秒，施展后摧毁敌对刀气障碍效果，每命中1个刀气障碍则返还4秒“破釜沉舟”调息时间和0.25秒公共调息时间（最多0.5秒）><TALENT 25259 1 施展“秀明尘身”套路招式，额外对自身正面6尺60度范围最多5个目标造成<SUB 25260 1>外功伤害><TALENT 26904 1 命中目标数量降低为3个，伤害提高20%且施展后30秒内无视目标50%的外功防御><TALENT 34677 1 招式有效距离提高2尺。自身血量高于50%时命中侠士目标，则额外消耗自身3%气血值对目标造成等量的真实伤害><TALENT 16737 1 变为2层充能技能，充能时间8秒。命中目标后标记当前目标6秒，最多叠加3层，期间累计造成5次伤害则引爆标记并追加<SUB 36486 1>外功伤害，若目标为非侠士则伤害提高400%><TALENT 21264 1 命中被自身“悲歌”效果作用的目标，会使目标在“西楚悲歌”结束后3秒内持续受到该效果影响>",
            "belong_key": "belong_16602"
        },
        "16627": {
            "name": "上将军印",
            "recipes": [
                "recipe_4154_1",
                "recipe_4371_1",
                "recipe_4372_1",
                "recipe_4373_1",
                "recipe_4374_1",
                "recipe_4375_1",
                "recipe_4376_1"
            ],
            "skills": [
                16804
            ],
            "desc": "尘身体态下方可施展，消耗10点狂意，每0.5秒对前方随机方向10尺内最多5个敌对目标造成矩形范围攻击，造成100%武器伤害外加<SUB 16804 0>外功伤害，招式期间免疫控制。<TALENT 16847 1 调息时间降低7.5秒，消耗的狂意降低5点，每段伤害命中目标则使自身调息时间降低0.5秒，此效果最多作用5次><TALENT 16799 1 连续命中的目标每次受到的伤害提高15%><TALENT 17042 1 伤害提高15%，无视目标20%的外功防御><TALENT 17047 1 能额外劈出2刀伤害><TALENT 25259 1 施展“秀明尘身”套路招式，额外对自身正面6尺60度范围最多5个目标造成<SUB 25260 1>外功伤害><TALENT 30920 1 在“西楚悲歌”范围内施展“上将军印”，每跳会在区域内降下落雷随机攻击区域内的敌对侠士目标造成<SUB 32879 1>外功伤害。每次命中自身刀气障碍时，会使之产生震动对其周围8尺最多3个目标造成<SUB 30923 1>外功伤害><TALENT 32857 1 命中有自身“闹须弥”效果的目标后，会生成灵体在目标身后施展“上将军印·见尘”攻击该目标，对目标造成<SUB 32859 1>伤害。“上将军印·见尘”若累计命中目标3次，则使目标定身2秒><TALENT 25258 1 连续命中5次目标使自身获得\"掠关\"效果：施展“项王击鼎”直接触发第3段攻击效果并进入24秒调息时间，下5次攻击附带<SUB 37458 1>外功伤害和<SUR 0.4032>点破招伤害><TALENT 38535 1 “上将军印”施展后使自身15秒内施展“破釜沉舟”附带<SUB 38537 1>“楚歌”外功伤害，并增加自身造成的“楚歌”伤害，最多增加4次。切换体态后效果消失><TALENT 21858 1 施展“上将军印”使自身15秒伤害增加30%，招式狂意消耗增加10点，施展“破釜沉舟”重置“破釜沉舟”调息时间。离开“秀明尘身”体态后效果消失>",
            "belong_key": "belong_16627"
        },
        "16479": {
            "name": "割据秦宫",
            "skills": [
                16992,
                16994,
                16996
            ],
            "desc": "尘身体态下方可施展，消耗10点狂意，可透支两次，每段触发不同效果；\\n一段：对前方6尺范围内最多5个敌对目标造成100%武器伤害外加<SUB 16992 0>外功伤害并定身3秒。\\n二段：对前方6尺范围内最多5个敌对目标造成100%武器伤害外加<SUB 16994 0>外功伤害并眩晕3秒。\\n三段：对前方6尺范围内最多5个敌对目标造成100%武器伤害外加<SUB 16996 0>外功伤害并击倒3秒。<TALENT 16976 1 招式作用范围提高2尺，控制效果持续时间延长1秒><TALENT 16765 1 调息时间降低3秒，成功命中目标，使5秒内“破釜沉舟”伤害分别提高10%、20%、30%，第三段命中目标时，在自身前方6尺生成“封渊震煞”刀气障碍，持续4秒><TALENT 25259 1 施展“秀明尘身”套路招式，额外对自身正面6尺60度范围最多5个目标造成<SUB 25260 1>外功伤害><TALENT 16722 1 一段招式会使目标定身3秒，每段命中目标使自身体质10秒内提高20%，最多60%>",
            "belong_key": "belong_16479"
        },
        "16304": {
            "name": "碎江天",
            "recipes": [
                "recipe_4156_1",
                "recipe_4157_1",
                "recipe_4158_1",
                "recipe_4159_1",
                "recipe_4160_1",
                "recipe_4161_1",
                "recipe_4162_1",
                "recipe_4163_1"
            ],
            "skills": [
                17092
            ],
            "desc": "竹雾体态下方可施展，消耗5点刀魂，施展2式“擒龙六斩”后方可施展，对目标造成200%武器伤害外加<SUB 17092 0>外功伤害。<TALENT 16716 1 不消耗刀魂，招式积累层数提高到3层><TALENT 16726 1 使目标受到疗伤成效降低50%，持续12秒><TALENT 16734 1 消耗的刀魂增加5点，施展后额外多获得一层“松烟”效果，使自身闪避几率提高100%，持续2秒>",
            "belong_key": "belong_16304"
        },
        "16870": {
            "name": "擒龙六斩",
            "recipes": [
                "recipe_4180_1",
                "recipe_4181_1",
                "recipe_4182_1",
                "recipe_4183_1",
                "recipe_4184_1",
                "recipe_4185_1",
                "recipe_4186_1",
                "recipe_4187_1"
            ],
            "skills": [
                16933,
                16934,
                16935,
                16936,
                16937,
                16938,
                16939,
                16940,
                16941,
                16942,
                16943,
                16944
            ],
            "desc": "竹雾体态下方可施展，共六式，成功施展二式“擒龙六斩”获得一次“碎江天”施展机会，可叠加3层。每次施展消耗5点刀魂并增加8秒调息时间，对目标最低造成<SKILL_[16933_0;16934_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[16933_0;16934_0]}>)外功伤害并附带一段破招伤害，最高造成<SKILL_[16943_0;16944_0] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[16943_0;16944_0]}>)外功伤害并附带一段破招伤害。<TALENT 16954 1 每段使目标下一次技能命中几率降低10%，可叠加6层><TALENT 16930 1 每施展二式“擒龙六斩”积累一次“碎江天”施展机会，可叠加3层><TALENT 20812 1 若累积施展6斩“擒龙六斩”，可施展第七式招式，当前“松烟竹雾”体态进入“爆体”状态，立即重置“殷雷腿”套路下招式，免疫任何控制效果，伤害提高30%，自身加速提高20%，持续15秒><TALENT 16691 1 变为六层透支招式，施展距离变为6尺，施展后返还6秒调息时间且自身不再进入僵直状态，招式不再附带冲刺和控制效果且占用1.5秒公共调息时间><TALENT 42410 1 >",
            "belong_key": "belong_16870"
        },
        "16027": {
            "name": "刀啸风吟",
            "recipes": [
                "recipe_4164_1",
                "recipe_4165_1",
                "recipe_4166_1",
                "recipe_4167_1",
                "recipe_4168_1",
                "recipe_4169_1",
                "recipe_4171_1"
            ],
            "skills": [
                16610,
                16611,
                16612,
                16613,
                16614
            ],
            "desc": "金屏体态下方可施展，消耗5点气劲，对目标最低造成<SUB 16610 0>外功伤害并附带一段破招伤害，对目标最高造成<SUB 16614 0>外功伤害并附带一段破招伤害，目标气血百分比越低，造成的伤害越高。<TALENT 16709 1 会心几率提高10%，会心后回复5点气劲><TALENT 16752 1 “刀啸风吟”施展后使下一个“醉斩白蛇”每跳有30%几率造成<SUB 25238 1>外功伤害，几率可以叠加3层><TALENT 16712 1 会心几率提高10%，会心效果提高10%><TALENT 25633 1 命中目标时，获得2层“逐鹿”；“项王击鼎”三段每消耗3层“逐鹿”，结束攻击后切换至“雪絮金屏”体态时，使下一次施展“刀啸风吟”无需运功且造成的伤害提高15%，持续10秒>",
            "belong_key": "belong_16027"
        },
        "16085": {
            "name": "醉斩白蛇",
            "recipes": [
                "recipe_4172_1",
                "recipe_4173_1",
                "recipe_4174_1",
                "recipe_4175_1",
                "recipe_4176_1",
                "recipe_4177_1",
                "recipe_4178_1",
                "recipe_4179_1"
            ],
            "skills": [
                16615,
                16616,
                16617,
                16618,
                16619
            ],
            "desc": "金屏体态下方可施展，消耗10点气劲，1.75秒内对目标造成4次外功伤害，最低造成<SUB 16615 0>外功伤害，最高造成<SUB 16619 0>外功伤害，目标气血百分比越低，伤害越高。<TALENT 16751 1 完整施展后使自身加速率提高5%，持续18秒><TALENT 16733 1 施展后立刻对目标造成伤害，并提高自身的15%外功基础攻击力，持续16秒，最多持续至32秒><TALENT 16779 1 “醉斩白蛇”增加3跳且完整运功后附带一段破招伤害，调息时间提高14秒，可透支一次，运功时间降低25%且每跳伤害递增25%><TALENT 16781 1 消耗的气劲增加15点，命中目标并使目标无法施展轻功、移动速度降低20%，持续2秒><TALENT 17050 1 每跳伤害会心使“刀啸风吟”伤害提高20%，可叠加3层，持续15秒><TALENT 26735 1 切换至“雪絮金屏”体态，使得自身下两个“醉斩白蛇”伤害提高30%>",
            "belong_key": "belong_16085"
        },
        "16621": {
            "name": "坚壁清野",
            "skills": [
                16787,
                16788,
                16789,
                16790,
                16791,
                16794
            ],
            "desc": "金屏体态下方可施展，消耗10点气劲，在自身前方20尺劈出三道刀气，对触碰到的10个目标最低造成<SUB 16787 0>外功伤害，最高造成<SUB 16791 0>外功伤害，目标气血百分比越低，伤害越高，并残留10秒刀气区域，每秒造成<SUB 16794 0>外功伤害，同时命中多个玩家时伤害递减，最多递减50%。<TALENT 16807 1 调息时间降低10秒，不再附带持续伤害效果，首次伤害提高40%并附带4秒锁足效果><TALENT 16906 1 范围伤害每跳有15%几率触发“坚壁清野”二段技能，施展后立刻对区域内最多10名敌对目标造成大量伤害><TALENT 16912 1 “坚壁清野”刀气残留时间增加5秒，对目标造成5次“坚壁清野”伤害后使目标定身3秒。“雪絮金屏”体态下施展伤害招式命中处于自身“坚壁清野”区域内的敌对目标，招式会心几率提高20%，会心效果提高20%>",
            "belong_key": "belong_16621"
        },
        "28680": {
            "name": "鸣震九霄",
            "skills": [
                40210,
                40188
            ],
            "desc": "被动效果：自身拥有9层<NounID 14>后，每获得1层<NounID 14>，降低“鸣震九霄”调息时间1秒。\\n主动效果：“项王击鼎”三段持续效果期间方可施展，可透支两次，触发不同效果：\\n 一段：将周围10尺内5个敌对目标向自身短暂吸引，若在自身“坚壁清野”区域中施展，本次“项王击鼎”三段持续攻击造成额外伤害。\\n二段：向前冲刺并吸引目标。\\n三段：冲向15尺内选中目标，对自身8尺范围内敌方造成100%武器伤害外加<SUB 40188 0>外功伤害并眩晕2秒。\\n每次施展可获得25%减伤持续8秒，可叠加3层。",
            "belong_key": "belong_28680"
        },
        "21858": {
            "name": "斩狂枭",
            "buffs": [
                29219
            ],
            "skills": [
                38537
            ],
            "desc": "“上将军印”施展后使自身15秒内施展“破釜沉舟”附带“楚歌”外功伤害。切换体态后效果消失。施展“上将军印”时，使自身伤害增加30%，施展“破釜沉舟”无消耗且重置“破釜沉舟”调息时间。施展“上将军印”会额外消耗狂意，每额外消耗10点狂意，持续时间增加1秒。离开“秀明尘身”体态后效果消失，并根据剩余时间返还狂意。",
            "belong_key": "belong_21858"
        },
        "25639": {
            "name": "渊冰",
            "skills": [
                36311
            ],
            "desc": "施展“楚河汉界”后3秒内“刀啸风吟”变为最多蓄力1.5秒的招式，命中目标使目标定身且无法使用轻功3秒。蓄力1至1.25秒时施放，刀气会吸收自身“楚河汉界”并造成最高<SUB 36311 4>外功伤害，自身冲向目标并在目标周围形成半径5尺的圆形刀气障碍，敌方玩家目标无法穿越，持续4秒。",
            "belong_key": "belong_25639"
        },
        "25095": {
            "name": "横断山河",
            "skills": [
                25262
            ],
            "desc": "金屏体态下可以施展，消耗15点气劲，自身免疫控制（击退和被拉除外），持续4秒，冲向目标，造成<SUB 25262 1>外功伤害并击飞目标，使目标无法施展轻功，持续3秒，若目标被击飞则降低自身0.5秒基础调息时间，可以施展二段招式冲刺至目标身边造成<SUB 25262 2>外功伤害，若目标高于8尺还将被击落，自身随即跳跃落地，再对目标造成<SUB 25262 4>外功伤害并在自身前方6尺生成\"封渊震煞\"刀气障碍，持续4秒。",
            "belong_key": "belong_25095"
        },
        "16816": {
            "name": "碎影",
            "skills": [
                38533
            ],
            "desc": "“闹须弥”释放后获得一次“碎江天”施展机会。“碎江天”命中“闹须弥”目标时额外造成<SUB 38533 0>外功伤害。",
            "belong_key": "belong_16816"
        },
        "21753": {
            "name": "空痕",
            "recipes": [
                "recipe_3265_1"
            ],
            "desc": "“临渊蹈河”变为两层透支招式，透支调息时间20秒。施展后立即回复5%气血值，沿刀墙奔跑过程中受到伤害降低由60%提升至80%。",
            "belong_key": "belong_21753"
        },
        "16748": {
            "name": "削霜",
            "desc": "“项王击鼎”第三段招式命中有自身“闹须弥”的侠士目标时，使其获得气血最大值3%的治疗吸收盾，最多叠加8层，持续10秒。",
            "belong_key": "belong_16748"
        },
        "17047": {
            "name": "分疆",
            "recipes": [
                "recipe_5575_1"
            ],
            "desc": "“上将军印”能额外劈出2刀伤害且攻击频率提高33%，招式无视目标15%化劲等级。",
            "belong_key": "belong_17047"
        },
        "16724": {
            "name": "击瑕",
            "desc": "“秀明尘身”套路下招式消耗狂意降低20%，命中锁足、定身、眩晕、倒地目标伤害提高25%。",
            "belong_key": "belong_16724"
        },
        "16726": {
            "name": "吞楚",
            "recipes": [
                "recipe_4230_1"
            ],
            "desc": "“碎江天”使目标受到的疗伤成效降低50%，持续12秒。",
            "belong_key": "belong_16726"
        },
        "16977": {
            "name": "冷川",
            "desc": "体态能量上限提高20点，战斗状态下非当前体态能量回复速度提高300%。",
            "belong_key": "belong_16977"
        },
        "42461": {
            "name": "烽河",
            "skills": [
                42463
            ],
            "desc": "“楚河汉界”不再生成刀气障碍，转而在身前生成一道刀河，持续5秒，每秒对范围内的最多10个敌方目标造成<SUB 42463 1>外功伤害并减速60%。刀河内的目标持续受到<NounID 75>效果，该效果每2秒最多触发一次。",
            "belong_key": "belong_42461"
        },
        "16779": {
            "name": "化蛟",
            "recipes": [
                "recipe_2512_1",
                "recipe_2474_1"
            ],
            "buffs": [
                11221
            ],
            "desc": "“醉斩白蛇”增加3跳且每跳附带一段破招伤害，调息时间提高14秒，可透支一次，运功时间降低25%且触发破招后下一跳伤害递增90%。",
            "belong_key": "belong_16779"
        },
        "17042": {
            "name": "阳关",
            "recipes": [
                "recipe_4298_1"
            ],
            "skills": [
                16803,
                16801,
                16800,
                17043,
                19423,
                19424
            ],
            "desc": "“上将军印”伤害提高30%，无视目标20%的外功防御，被连续命中的目标每次受到的伤害提高15%。",
            "belong_key": "belong_17042"
        },
        "18625": {
            "name": "百战",
            "recipes": [
                "recipe_2608_1"
            ],
            "desc": "“破釜沉舟”招式范围变成360°，施展后激活一段“项王击鼎”，第三段除外；“项王击鼎”第三段招式持续攻击命中6次时，获得1层“碎江天”。",
            "belong_key": "belong_18625"
        },
        "42563": {
            "name": "微尘",
            "recipes": [
                "recipe_6088_1"
            ],
            "desc": "“闹须弥”变成2层充能招式，且不占用基础调息时间。",
            "belong_key": "belong_42563"
        },
        "30920": {
            "name": "震霄",
            "skills": [
                32879,
                30923
            ],
            "desc": "在“西楚悲歌”范围内施展“上将军印”，每跳会在区域内降下落雷随机攻击区域内的敌对侠士目标造成<SUB 32879 0>外功伤害。“上将军印”每次命中自身刀气障碍时，会使之产生震动对其周围8尺最多3个目标造成<SUB 30923 0>外功伤害。",
            "belong_key": "belong_30920"
        },
        "25254": {
            "name": "霜轮",
            "desc": "“松烟竹雾”体态下移速效果额外增加10%，受到的锁足、定身、眩晕控制效果持续时间降低10%且每秒恢复自身0.4%自身气血最大值。",
            "belong_key": "belong_25254"
        },
        "26904": {
            "name": "冥鼓",
            "recipes": [
                "recipe_2510_1",
                "recipe_2511_1"
            ],
            "buffs": [
                29561
            ],
            "desc": "“项王击鼎”“破釜沉舟”伤害提高50%且施展后30秒内无视目标50%的外功防御，“项王击鼎”第三段招式持续攻击的频率提升25%。",
            "belong_key": "belong_26904"
        },
        "21264": {
            "name": "照野",
            "recipes": [
                "recipe_2881_1"
            ],
            "desc": "“西楚悲歌”的调息时间降低10秒，其刀气障碍范围内附带“坚壁清野”残留伤害效果，“悲歌”的重力效果增强并使目标无法跳跃。“破釜沉舟”命中被自身“悲歌”效果作用的目标，会使目标在“西楚悲歌”结束后3秒内持续受到该效果影响。",
            "belong_key": "belong_21264"
        },
        "16733": {
            "name": "斩纷",
            "recipes": [
                "recipe_4231_1"
            ],
            "buffs": [
                19510
            ],
            "desc": "“醉斩白蛇”施展后立刻对目标造成伤害，并提高自身的15%外功基础攻击力，10%无双等级，持续16秒，最多持续至32秒。",
            "belong_key": "belong_16733"
        },
        "32857": {
            "name": "见尘",
            "skills": [
                32859
            ],
            "desc": "“上将军印”命中有自身“闹须弥”效果的目标后，会生成灵体在目标身后施展“上将军印·见尘”攻击该目标，对目标造成<SUB 32859 1>伤害。“上将军印·见尘”若累计命中目标3次，则使目标定身2秒。",
            "belong_key": "belong_32857"
        },
        "38541": {
            "name": "掠关",
            "recipes": [
                "recipe_5626_1",
                "recipe_5627_1",
                "recipe_5628_1",
                "recipe_5629_1",
                "recipe_5631_1",
                "recipe_5632_1",
                "recipe_5736_1"
            ],
            "desc": "“项王击鼎”无视目标15%化劲且前三段范围提升至360°。第一、二、三段公共调息时间提升至2.5秒且期间自身不受缴械、沉默影响，造成伤害时使目标僵直，并标记目标使其无法使用“蹑云逐月”。",
            "belong_key": "belong_38541"
        },
        "42564": {
            "name": "踏风",
            "recipes": [
                "recipe_6118_1",
                "recipe_6089_2"
            ],
            "desc": "“龙骧虎步”免控持续时间增5秒，调息时间增加15秒，施展后回复的狂意、刀魂、气劲提升至60点。",
            "belong_key": "belong_42564"
        },
        "16847": {
            "name": "归酣",
            "recipes": [
                "recipe_4458_1",
                "recipe_4671_1",
                "recipe_3351_1",
                "recipe_5934_1",
                "recipe_5935_1"
            ],
            "desc": "“上将军印”调息时间降低2.5秒，消耗的狂意减少5点，每段伤害命中目标则使自身调息时间降低0.5秒，此效果最多作用5次。“龙骧虎步”调息时间降低3秒。",
            "belong_key": "belong_16847"
        },
        "16777": {
            "name": "沧雪",
            "recipes": [
                "recipe_5903_1"
            ],
            "buffs": [
                11222
            ],
            "desc": "“项王击鼎”消耗的狂意增加5点，三段触发的持续范围伤害每跳伤害递增15%，最多提高120%。",
            "belong_key": "belong_16777"
        },
        "26735": {
            "name": "砺锋",
            "buffs": [
                19499
            ],
            "desc": "切换至“雪絮金屏”体态，使得自身下两个“醉斩白蛇”最终伤害提高56%。",
            "belong_key": "belong_26735"
        },
        "42410": {
            "name": "霜云",
            "buffs": [
                31782
            ],
            "skills": [
                42677
            ],
            "desc": "每次施展“擒龙六斩”都会使下一式“擒龙六斩”伤害递增50%，“擒龙六斩”命中后获得一层“云烟”效果：累计6层后，“擒龙六斩”升级为“<NounID 79>”。",
            "belong_key": "belong_42410"
        },
        "16958": {
            "name": "易水",
            "desc": "“西楚悲歌”施展后解除自身受控状态并使范围内小队成员受到的伤害降低30%。",
            "belong_key": "belong_16958"
        },
        "16739": {
            "name": "秋瑟",
            "desc": "“散流霞”施展后立刻卸除自身阳性、阴性、混元、毒性、点穴、持续伤害不利效果各两个，效果期间施展技能不会解除无法选中状态。",
            "belong_key": "belong_16739"
        },
        "37982": {
            "name": "临江",
            "desc": "“上将军印”变为瞬发招式，召唤灵体对目标造成伤害。",
            "belong_key": "belong_37982"
        },
        "34677": {
            "name": "绝河",
            "recipes": [
                "recipe_3251_1"
            ],
            "desc": "“破釜沉舟”招式有效距离提高2尺。自身血量高于50%时命中侠士目标，则额外消耗自身10%气血值对目标造成等量的<NounID 101>。",
            "belong_key": "belong_34677"
        },
        "16691": {
            "name": "龙息",
            "recipes": [
                "recipe_3283_1"
            ],
            "desc": "“擒龙六斩”变为六层透支招式，施展距离变为6尺，施展后返还8秒调息时间且自身不再进入僵直状态，招式不再附带冲刺和控制效果且占用除“碎江天”外招式1.5秒公共调息时间。",
            "belong_key": "belong_16691"
        },
        "16911": {
            "name": "裁骨",
            "desc": "“楚河汉界”“封渊震煞”刀气障碍会将触碰到的敌方目标击退并眩晕2秒，20秒内不会再次被影响，最多对10个目标生效。",
            "belong_key": "belong_16911"
        },
        "16893": {
            "name": "重烟",
            "desc": "“秀明尘身”体态下自身所有招式调息速度提高30%。",
            "belong_key": "belong_16893"
        },
        "17054": {
            "name": "疏狂",
            "buffs": [
                11456
            ],
            "desc": "主动施展“西楚悲歌”时，不再生成刀气障碍，伤害范围扩大至12尺，自身回复20%最大气血值，范围内自身基础攻击力提高30%，持续12秒。",
            "belong_key": "belong_17054"
        },
        "17056": {
            "name": "绝期",
            "recipes": [
                "recipe_4319_1",
                "recipe_2833_1"
            ],
            "dots": {
                "11447": [
                    17060
                ]
            },
            "skills": [
                34585
            ],
            "desc": "“闹须弥”流血效果伤害提高70%且自身伤害招式命中目标后有30%的几率刷新流血效果持续时间并造成<SUB 34585 1>外功伤害，同时降低“闹须弥”1秒调息时间。",
            "belong_key": "belong_17056"
        },
        "16957": {
            "name": "曳鼎",
            "recipes": [
                "recipe_6226_1"
            ],
            "desc": "“楚河汉界”变为2层充能招式。",
            "belong_key": "belong_16957"
        },
        "16781": {
            "name": "行泽",
            "recipes": [
                "recipe_4263_1"
            ],
            "desc": "“醉斩白蛇”消耗的气劲增加15点，命中目标并使目标无法施展轻功、移动速度降低20%，持续2秒。",
            "belong_key": "belong_16781"
        },
        "33123": {
            "name": "扬刀激尘",
            "skills": [
                33129
            ],
            "desc": "被动效果：“秀明尘身”体态下招式施展范围增加1尺，控制时间增加1秒，处于自身“坚壁清野”区域时，移动速度提高30%。\\n主动效果：该招式视作“秀明尘身”套路下招式，消耗10点狂意，对前方20尺范围最多5个目标造成<SUB 33129 1>外功伤害附带200%武器伤害，使目标无法施展轻功，持续3秒，路径上附带5秒“坚壁清野”伤害残留效果。",
            "belong_key": "belong_33123"
        }
    },
    "10533": {
        "19828": {
            "name": "浮游天地",
            "recipes": [
                "recipe_2475_1",
                "recipe_2476_1",
                "recipe_2477_1",
                "recipe_2478_1",
                "recipe_2479_1",
                "recipe_2480_1",
                "recipe_2481_1",
                "recipe_4813_1",
                "recipe_6162_1"
            ],
            "buffs": [
                30396
            ],
            "skills": [
                20052
            ],
            "desc": "解除自身减速和锁足效果，蓄力快速跃起对6尺范围内的最多6个敌对目标造成200%武器伤害外加1段外功伤害，随后进入撑伞浮空状态并使自身2秒内免疫控制，15秒内基础攻击力提高10%。若自身距离地面高于20尺则不再跃起，非战斗状态下使用返还全额调息时间（每10秒最多触发1次），撑伞浮空持续30秒。施展后重置“碧海缥缈掌”套路招式调息时间。<TALENT 20351 1 变为2层充能招式，充能时间20秒。施展后重置“碧海缥缈掌”套路招式调息时间。><TALENT 20370 1 施展后无视目标50%外功防御，持续10秒><TALENT 20696 1 施展后3秒内，在半径20尺区域内施展“逸尘步虚”不消耗充能次数，此效果不在李渡鬼域、绝境战场等场景生效><TALENT 20756 1 伤害提高20%，挑起范围目标><TALENT 20701 1 在自身“驰风震域”的浪潮中施展“浮游天地”后，会生成“振翅图南”的飓风，持续5秒><TALENT 30912 1 “物化天行”移动至目标位置所需的时间降低，施展“浮游天地”后获得5秒内额外施展一次“物化天行”的机会><TALENT 38668 1 “浮游天地”使自身攻击力提高20%，持续15秒><TALENT 20718 1 “浮游天地”调息时间提高10秒，撑伞状态结束后获得免控，持续7秒。>",
            "belong_key": "belong_19828"
        },
        "10533": {
            "name": "凌海诀",
            "attributes": {
                "pve_addition_base": 389,
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "agility_to_physical_attack_power": 1802,
                "agility_to_physical_critical_strike": 420,
                "max_life_gain": 245,
                "physical_critical_strike_base": 6628,
                "physical_attack_power_base": 6839
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "dots": {
                "19557": [
                    26935
                ]
            },
            "skills": [
                19712,
                32815,
                25783
            ],
            "desc": "涛卷波扬击重浪，雕翔破云驰烈风。凌海诀灵动恣意，迅猛无俦。以驭雕之术纵横重溟、伞击之技傲视群豪。习至绝处，九霄四海，逍遥随心。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10533"
        },
        "19737": {
            "name": "击水三千",
            "recipes": [
                "recipe_4714_1",
                "recipe_4715_1",
                "recipe_4716_1",
                "recipe_4717_1",
                "recipe_4718_1",
                "recipe_4719_1",
                "recipe_4720_1"
            ],
            "skills": [
                19766,
                19767,
                20014
            ],
            "desc": "地面及物化天行过程中可施展，施展后立即结束撑伞浮空状态，三段攻击，一段对自身前方6尺120°扇形范围内的最多6个敌对目标造成100%武器伤害外加<SUB 19766 0>外功伤害；二段对自身前方6尺180°扇形范围内的最多6个敌对目标造成100%武器伤害外加<SUB 19767 0>外功伤害；三段对自身前方8尺矩形范围内的最多6个敌对目标造成100%武器伤害外加<SUB 20014 0>外功伤害。<TALENT 20324 1 伤害提高10%，第三段招式附带1次击退效果><TALENT 38669 1 “击水三千”命中当前目标后会召来海雕飞扑，使其每2秒受到外功伤害，持续12秒，最多延长至20秒><TALENT 25267 1 施展后降低“振翅图南”2秒调息时间><TALENT 41729 1 “击水三千”在振翅图南周围施展时，可延长振翅图南持续时间2秒><TALENT 41731 1 施展“击水三千”第三段将在前方2尺生成水飓风（每12秒最多生成一个），水飓风快速向前移动，每0.5秒对半径6尺内的10个敌对目标造成外功伤害，并挑飞目标>",
            "belong_key": "belong_19737"
        },
        "19818": {
            "name": "木落雁归",
            "recipes": [
                "recipe_4726_1",
                "recipe_4727_1",
                "recipe_4728_1",
                "recipe_4729_1",
                "recipe_4730_1",
                "recipe_4731_1",
                "recipe_4732_1"
            ],
            "skills": [
                19819
            ],
            "desc": "地面及物化天行过程中可施展，施展后立即结束撑伞浮空状态。对目标造成200%武器伤害外加<SUB 19819 0>外功伤害及一段破招伤害，并使目标移动速度降低50%，持续5秒。<TALENT 20336 1 施展距离增加2尺，并且可以无目标施展><TALENT 20345 1 会心提高10%，会心有50%几率重置“澹然若海”调息时间><TALENT 20716 1 伤害提高10%，释放距离改为12尺><TALENT 20333 1 会心提高10%，会心效果提高10%><TALENT 25267 1 施展后降低“振翅图南”2秒调息时间><TALENT 20348 1 >",
            "belong_key": "belong_19818"
        },
        "20245": {
            "name": "定波砥澜",
            "recipes": [
                "recipe_4733_1",
                "recipe_4734_1",
                "recipe_4735_1",
                "recipe_4736_1",
                "recipe_4737_1",
                "recipe_4738_1",
                "recipe_5973_1"
            ],
            "skills": [
                20250
            ],
            "desc": "张开伞进入防御姿态，按下按键防御，减伤40%，并免疫控制和恐惧效果，持续3秒，1秒后可松开按键，获得反击标示持续2秒，2秒内若被攻击则立即对前方8尺范围敌对目标造成100%武器伤害外加<SKILL_[20734_4] PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP_[20734_4]}>)外功伤害，并击倒5秒。<TALENT 25270 1 “定波砥澜”变为3秒蓄力招式，期间减伤40%并免疫控制和恐惧效果。蓄力后释放对8尺范围敌方目标造成最高<SUB 36282 3>外功伤害。期间若被攻击或蓄力1.5至2秒期间释放，反击附带5秒击倒，并附带两层重创效果><TALENT 38691 1 招式期间使8尺内最多5名目标减速，且施展“海运南冥”可无视距离造成最大伤害。结束时对8尺内目标造成伤害，在“振翅图南”或水龙卷中结束时，伤害提高50%>",
            "belong_key": "belong_20245"
        },
        "19827": {
            "name": "翼绝云天",
            "recipes": [
                "recipe_4739_1",
                "recipe_4740_1",
                "recipe_4741_1",
                "recipe_4742_1",
                "recipe_4743_1",
                "recipe_4744_1",
                "recipe_4745_1"
            ],
            "skills": [
                20016
            ],
            "desc": "命令海雕对自身30尺范围内的目标进行攻击造成<SUB 20016 0>外功伤害，每4秒攻击一次，每次命中目标回复自身5%内力最大值。若目标距离超过30尺则锁定目标不攻击，当目标超过60尺停止锁定。<TALENT 20335 1 伤害提高10%，每次攻击回复自身5%内力最大值><TALENT 20340 1 使目标命中几率降低10%><TALENT 20746 1 “翼绝云天”攻击期间，自身破防等级提高20%><TALENT 25272 1 每次施展“翼绝云天”攻击期间，“击水三千”命中被攻击目标会使其获得4秒的“破绽”，自身攻击有“破绽”的目标将造成<SUB 25273 1>外功伤害，“破绽”结束后根据期间被攻击次数叠加最多6层的持续伤害，使目标<BUFF 18386 1 desc>(+<SKILLEx {D0} {TotalPhysicsAP 0.5730}>)，持续12秒>",
            "belong_key": "belong_19827"
        },
        "20259": {
            "name": "振翅图南",
            "recipes": [
                "recipe_4746_1",
                "recipe_4747_1",
                "recipe_4748_1",
                "recipe_4749_1",
                "recipe_4750_1",
                "recipe_4751_1",
                "recipe_4752_1",
                "recipe_4939_1"
            ],
            "skills": [
                31250
            ],
            "desc": "命令海雕在指定位置扇出一道飓风，持续对周围造成12次<SUB 20279 0>外功伤害，持续6秒。<TALENT 20349 1 飓风持续时间增加2秒，自身若处于飓风范围内，每秒回复自身2%气血最大值><TALENT 20353 1 会心提高10%，变为2层充能技能，充能时间30秒，并且飓风会移动至目标位置><TALENT 20697 1 对静止目标伤害提高30%><TALENT 20374 1 施展“振翅图南”形成的飓风持续时间增加2秒，处于自身飓风效果范围内，施展“碧海缥缈掌”套路下招式伤害提高30%><TALENT 20966 1 “振翅图南”立即对目标前方矩形范围造成一次击退效果><TALENT 25267 1 “振翅图南”可充能2层。每次施展“木落雁归”“击水三千”，会降低其2秒调息时间><TALENT 25276 1 形成的飓风范围提高2尺，立即对目标前方矩形范围造成一次击退效果。海雕会在“振翅图南”边缘盘旋，目标被命中时若处于振翅图南边缘，则会被吸引回振翅图南中心位置><TALENT 32594 1 在自身的“振翅图南”飓风中施展“浮游天地”完成浮空后，会额外引来一只海雕协同自身攻击，8秒内自身每次对目标造成伤害都会额外追击一段海雕伤害><TALENT 20701 1 “振翅图南”对非侠士目标的伤害提高150%><TALENT 36846 1 会心几率提高10%，会心效果提高10%，命中目标数量由6个提升至10个><TALENT 38667 1 ><TALENT 32476 1 >",
            "belong_key": "belong_20259"
        },
        "20053": {
            "name": "跃潮斩波",
            "recipes": [
                "recipe_4753_1",
                "recipe_4754_1",
                "recipe_4755_1",
                "recipe_4756_1",
                "recipe_4757_1",
                "recipe_4758_1"
            ],
            "skills": [
                20054
            ],
            "desc": "门派轻功，立即冲向目标释放一道掌法，并造成<SUB 20054 0>外功伤害和破招伤害，若撑伞浮空姿态使用，立即解除撑伞状态。<TALENT 20344 1 伤害提高20%，对目标位置周围6尺范围内最多6个目标造成伤害><TALENT 20757 1 “跃潮斩波”命中目标使目标受到的疗伤成效降低50%，持续8秒><TALENT 21293 1 “跃潮斩波”命中目标后，形成一个“驰风震域”的浪潮并在3秒内标记目标。标记结束时对目标造成一次<SUB 30503 1>外功伤害，若标记结束时目标在自身“驰风震域”内则造成<SUB 30503 2>外功伤害><TALENT 30502 1 “跃潮斩波”会标记目标，持续3秒，标记结束时对目标造成一次<SUB 30503 1>外功伤害，若标记结束时目标在自身“驰风震域”内则造成<SUB 30503 2>外功伤害><TALENT 30504 1 “跃潮斩波”对距离超过8尺的目标施展，造成额外20%伤害>",
            "belong_key": "belong_20053"
        },
        "20715": {
            "name": "海运南冥",
            "recipes": [
                "recipe_4792_1",
                "recipe_4793_1",
                "recipe_4794_1",
                "recipe_4795_1",
                "recipe_4796_1",
                "recipe_4797_1",
                "recipe_4798_1",
                "recipe_4799_1",
                "recipe_4800_1"
            ],
            "skills": [
                20684,
                20685
            ],
            "desc": "对自身8尺范围内最多5个敌对目标造成<SUB 20321 0>外功伤害，若目标处于自身8尺范围以内伤害提升80%，若目标处于自身4尺内伤害提升100%。<TALENT 20346 1 施展距离提高15尺，施展后使自身外功基础攻击提高10%，持续30秒><TALENT 21813 1 招式会心几率提高10%，可在地面施展><TALENT 26745 1 调息时间降低1秒，并使“碧海缥缈掌”套路招式伤害提高10%，最多叠加3层，持续8秒><TALENT 20348 1 不再附带冲刺及控制效果，施展后使自身下一次“木落雁归”伤害增加30%，最多增加至90%><TALENT 20758 1 “物化天行”过程中施展后使自身下一个“跃潮斩波”会心提高10%，会心效果提高10%，效果最多叠加5层><TALENT 38670 1 浮空状态下施展“海运南冥”“溟海御波”“逐波灵游”时，若场上有自身的“驰风震域”，则其会心、会心效果提高15%><TALENT 38868 1 浮空状态下命中目标使自身受到伤害降低20%，并获得5%气血护盾，持续5秒><TALENT 38669 1 “击水三千”命中当前目标后会召来海雕飞扑，使其每2秒受到外功伤害，持续12秒，最多延长至24秒。施展“溟海御波”“海运南冥”命中附带自身持续伤害目标时，使下次持续伤害立即生效。>",
            "belong_key": "belong_20715"
        },
        "20083": {
            "name": "溟海御波",
            "skills": [
                20322
            ],
            "desc": "翻身到目标背后出掌对目标造成<SUB 20322 0>外功伤害，并造成后仰控制效果。若命中空中目标，造成的伤害提高20%，并使目标浮空高度提升3尺。<TALENT 20346 1 施展距离提高15尺，施展后使自身外功基础攻击提高10%，持续30秒><TALENT 20720 1 变为2层充能技，施展过程中受到的伤害额外降低25%><TALENT 21813 1 招式会心几率提高10%，可在地面施展><TALENT 26745 1 调息时间降低1秒，并使“碧海缥缈掌”套路招式伤害提高10%，最多叠加3层，持续8秒><TALENT 20348 1 不再附带冲刺及控制效果，施展后使自身下一次“木落雁归”伤害增加30%，最多增加至90%><TALENT 20758 1 “物化天行”过程中施展后使自身下一个“跃潮斩波”会心提高10%，会心效果提高10%，效果最多叠加5层><TALENT 38670 1 浮空状态下施展“海运南冥”“溟海御波”“逐波灵游”时，若场上有自身的“驰风震域”，则其会心、会心效果提高15%><TALENT 38868 1 浮空状态下命中目标使自身受到伤害降低20%，并获得5%气血护盾，持续5秒><TALENT 38669 1 “击水三千”命中当前目标后会召来海雕飞扑，使其每2秒受到外功伤害，持续12秒，最多延长至24秒。施展“溟海御波”“海运南冥”命中附带自身持续伤害目标时，使下次持续伤害立即生效。>",
            "belong_key": "belong_20083"
        },
        "20084": {
            "name": "逐波灵游",
            "skills": [
                20323
            ],
            "desc": "在目标位置生成浪潮（驰风震域），使半径6尺范围敌对目标移动速度降低40%，持续6秒；并对目标造成<SUB 20323 0>外功伤害并击倒3秒，若目标距离自身5尺外则附带冲刺效果，若目标距离地面超过8尺则重击到地面5秒。<TALENT 20346 1 施展距离提高15尺，施展后使自身外功基础攻击提高10%，持续30秒><TALENT 21813 1 招式会心几率提高10%，可在地面施展><TALENT 20372 1 “驰风震域”持续时间减少4秒，使处于“驰风震域”外的目标，对处于“驰风震域”内的目标无法施展招式><TALENT 20348 1 不再附带冲刺及控制效果，施展后使自身下一次“木落雁归”伤害增加30%，最多增加至90%><TALENT 20758 1 “物化天行”过程中施展后使自身下一个“跃潮斩波”会心提高10%，会心效果提高10%，效果最多叠加5层><TALENT 38868 1 浮空状态下命中目标使自身受到伤害降低20%，并获得7%气血护盾，持续5秒><TALENT 38670 1 浮空状态下施展“海运南冥”“溟海御波”“逐波灵游”时，若场上有自身的“驰风震域”，则其会心、会心效果提高15%><TALENT 26745 1 命中目标使“碧海缥缈掌”套路招式伤害提高10%，最多叠加3层，持续8秒>",
            "belong_key": "belong_20084"
        },
        "32476": {
            "name": "风驰",
            "recipes": [
                "recipe_5991_1"
            ],
            "buffs": [
                31534
            ],
            "skills": [
                32478
            ],
            "desc": "“振翅图南”调息时间降低4秒，若在自身的“驰风震域”中生成“驰风震域”，会引爆已有“驰风震域”并对6尺内最多5个敌方目标造成<SUB 32478 0>外功伤害，并提高“振翅图南”伤害45%，最多提高3次。",
            "belong_key": "belong_32476"
        },
        "32594": {
            "name": "怒翼",
            "skills": [
                32595
            ],
            "desc": "在自身的“振翅图南”飓风中施展“浮游天地”完成浮空后，会额外引来一只海雕协同自身攻击，8秒内自身每次对目标造成伤害都会额外追击<SUB 32595 1>外功伤害。",
            "belong_key": "belong_32594"
        },
        "20837": {
            "name": "澹然若海",
            "skills": [
                20838,
                20840
            ],
            "desc": "对10尺内敌方目标造成<SUB 20838 0>外功伤害，激起水龙卷持续6秒，水龙卷随机跟踪被命中的敌方目标，使其减速70%并被击浮空。自身在水龙卷内施展“碧海飘渺掌”命中目标会使水龙卷造成的伤害提高37%，最多提高2次。",
            "belong_key": "belong_20837"
        },
        "41832": {
            "name": "飞倾列缺",
            "skills": [
                25299
            ],
            "desc": "自身将目标挑飞至离地面10尺以上，且自身不处于“浮游天地”状态时方可施展。返还自身0.5秒基础调息时间，使目标沉默1秒，冲刺到目标旁并在目标区域召唤海雕对周围8尺范围内最多3个目标持续造成5次<SUB 25299 0>外功伤害，自身击落目标则海雕会继续追击目标。",
            "belong_key": "belong_41832"
        },
        "38668": {
            "name": "游仙",
            "buffs": [
                14083
            ],
            "desc": "进入撑伞浮空状态使自身攻击力提高20%，持续15秒。",
            "belong_key": "belong_38668"
        },
        "20363": {
            "name": "遨宇",
            "desc": "施展“逸尘步虚”后增加自身35%减伤，持续5秒。",
            "belong_key": "belong_20363"
        },
        "20350": {
            "name": "游心",
            "buffs": [
                13946
            ],
            "desc": "施展“逸尘步虚”立即回复7%气血值。若成功闪避招式，则使自身“碧海缥缈掌”伤害提高30%并回复4%气血值，最多触发3次。",
            "belong_key": "belong_20350"
        },
        "20700": {
            "name": "征夷",
            "skills": [
                34801
            ],
            "desc": "“逸尘步虚”释放后在自身位置生成持续3秒的“伞影”。若场上存在两把“伞影”且距离小于20尺，则使“伞影”伤害立即生效并对其路径上最多10个目标造成<SUB 34801 1>外功伤害随即将目标拉向空中（使击倒目标浮空则高度提升2尺），伞影浮空使目标无法施展轻功招式1秒。",
            "belong_key": "belong_20700"
        },
        "38670": {
            "name": "鸿轨",
            "buffs": [
                29348
            ],
            "desc": "浮空状态下施展“海运南冥”“溟海御波”“逐波灵游”时，若场上有自身的“驰风震域”，则其会心、会心效果提高20%。",
            "belong_key": "belong_38670"
        },
        "38868": {
            "name": "海佑",
            "desc": "浮空状态下施展“海运南冥”“溟海御波”“逐波灵游”命中后使自身受到伤害降低20%，并获得7%气血护盾，持续5秒。",
            "belong_key": "belong_38868"
        },
        "20729": {
            "name": "奋翼",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "desc": "对击倒状态的目标伤害提高20%。若自身成功击倒目标，则在目标身后最远6尺位置生成“伞影”（每0.25秒最多生成一个）。",
            "belong_key": "belong_20729"
        },
        "20694": {
            "name": "凝气",
            "desc": "施展“逸尘步虚”时清除“木落雁归”调息时间。",
            "belong_key": "belong_20694"
        },
        "21293": {
            "name": "溯徊",
            "skills": [
                30503
            ],
            "desc": "“跃潮斩波”命中目标后，形成一个“驰风震域”的浪潮并在3秒内标记目标。标记结束时对目标造成一次<SUB 30503 1>外功伤害，若标记结束时目标在自身“驰风震域”内则造成<SUB 30503 2>外功伤害。",
            "belong_key": "belong_21293"
        },
        "20759": {
            "name": "横绝",
            "recipes": [
                "recipe_4895_1"
            ],
            "skills": [
                22464
            ],
            "desc": "“驭羽骋风”调息时间降低3秒，可对目标范围施展，快速持雕冲刺至目标位置，至少冲刺8尺，冲刺过程中无法被选中，3秒内可施展二段技能，快速回到冲刺前位置，对路径上敌人造成<SUB 22464 1>外功伤害，并眩晕2秒。",
            "belong_key": "belong_20759"
        },
        "28985": {
            "name": "驾澜",
            "desc": "若自身气血值低于1%，则召唤青冥在自身位置释放“疾电叱羽”保护自身，自身获得20%的最大气血值护盾，持续4秒，并使青冥带领自身脱离险境并解除控制，该效果每120秒最多触发一次。",
            "belong_key": "belong_28985"
        },
        "38691": {
            "name": "浪斥",
            "skills": [
                41752
            ],
            "desc": "“定波砥澜”期间使附近8尺内最多5名目标减速并持续造成<SUB 41752 1>伤害，且施展“海运南冥”可无视距离造成最大伤害。结束时对8尺内目标造成伤害。",
            "belong_key": "belong_38691"
        },
        "32488": {
            "name": "海碧",
            "desc": "处于非浮空状态下“碧海飘渺掌”命中目标3次会使得下一次在“物化天行”过程中“溟海御波”或“海运南冥”首次命中目标返还招式6秒调息时间，并在自身位置生成“驰风震域”。",
            "belong_key": "belong_32488"
        },
        "20753": {
            "name": "崔嵬",
            "desc": "“定波砥澜”不再具有防守反击效果，3秒内减伤增加到80%并免疫控制和恐惧效果，期间每受到一次攻击降低2秒调息时间。",
            "belong_key": "belong_20753"
        },
        "20351": {
            "name": "藏锋",
            "recipes": [
                "recipe_4704_1"
            ],
            "desc": "“浮游天地”变为2层充能招式，充能时间20秒。",
            "belong_key": "belong_20351"
        },
        "20718": {
            "name": "乘龙",
            "recipes": [
                "recipe_5995_1"
            ],
            "desc": "“浮游天地”调息时间提高10秒，撑伞状态结束后获得免疫控制效果（击退和被拉除外），使自身受到的伤害降低10%，持续10秒。",
            "belong_key": "belong_20718"
        },
        "38667": {
            "name": "驰行",
            "buffs": [
                14321
            ],
            "desc": "施展“振翅图南”形成的飓风持续时间增加4秒，在该飓风持续时间内，施展“碧海缥缈掌”套路下招式伤害提高10%。",
            "belong_key": "belong_38667"
        },
        "20641": {
            "name": "空桑舞瑟",
            "skills": [
                20642,
                35363
            ],
            "desc": "命令雕猛扑目标，对其周围4尺内最多5个敌对目标造成<SUB 20642 0>外功伤害，并击倒3秒。若目标距离地面超过8尺则击落到地面3秒并额外造成<SUB 35363 0>外功伤害。",
            "belong_key": "belong_20641"
        },
        "20065": {
            "name": "翔极碧落",
            "attributes": {
                "physical_damage_base": 0,
                "physical_damage_rand": 0
            },
            "skills": [
                19767
            ],
            "desc": "命令海雕猛扑目标，造成<SUB 19767 0>外功伤害，若其正在运功，则将运功打断并使其沉默4.5秒。",
            "belong_key": "belong_20065"
        },
        "25276": {
            "name": "镜壁",
            "recipes": [
                "recipe_5237_1",
                "recipe_5904_1"
            ],
            "desc": "施展“振翅图南”伤害提高50%，形成的飓风范围提高5尺，立即对目标前方矩形范围造成一次击退效果。",
            "belong_key": "belong_25276"
        },
        "20747": {
            "name": "梦悠",
            "buffs": [
                26166,
                13966
            ],
            "desc": "施展招式无视目标30%防御，生成“驰风震域”的时间增加4秒，自身处于“驰风震域”中施展招式额外无视目标20%防御。",
            "belong_key": "belong_20747"
        },
        "20741": {
            "name": "穹庐",
            "desc": "施展“驭羽骋风”返还“浮游天地”20秒调息时间。",
            "belong_key": "belong_20741"
        },
        "20601": {
            "name": "鸿渐于飞",
            "skills": [
                20605,
                20632,
                36417
            ],
            "desc": "获得5秒免控效果，一段冲向目标把目标周围敌对目标挑飞造成100%武器伤害外加<SUB 20605 0>外功伤害，二段击落自身前方目标造成100%武器伤害外加<SUB 20632 0>外功伤害并在目标位置生成4秒的“驰风震域”，三段对前方目标造成100%武器伤害外加<SUB 36417 1>外功伤害，命中倒地状态目标则该次伤害提高50%。",
            "belong_key": "belong_20601"
        },
        "25283": {
            "name": "连涯",
            "recipes": [
                "recipe_5238_1"
            ],
            "desc": "“逸尘步虚”变为3层充能招式，充能时间10秒，施展后使下一个“跃潮斩波”附带3秒击落效果。",
            "belong_key": "belong_25283"
        },
        "41729": {
            "name": "击浪",
            "desc": "“击水三千”在“振翅图南”周围施展时，可延长“振翅图南”持续时间3秒。（仅延长一个“振翅图南”持续时间，最多延长至10秒）",
            "belong_key": "belong_41729"
        },
        "20716": {
            "name": "苍梧",
            "recipes": [
                "recipe_4724_1"
            ],
            "desc": "“木落雁归”伤害提高30%，释放距离增加6尺，命中目标时降低“跃潮斩波”1秒调息时间。",
            "belong_key": "belong_20716"
        },
        "41731": {
            "name": "九溟",
            "skills": [
                41836
            ],
            "desc": "施展“击水三千”时返还0.75秒基础调息时间，第三段将在前方2尺生成一个持续3秒的水飓风并使自身获得5秒<NounID 95>效果（每12秒最多触发一次），水飓风快速向前移动，对路径上的至多10个敌对侠士目标造成<SUB 41836 0>外功伤害，并挑飞目标。<TALENT_CORE 41832 1>",
            "belong_key": "belong_41731"
        },
        "25267": {
            "name": "驾鸾",
            "recipes": [
                "recipe_5230_1"
            ],
            "desc": "“振翅图南”变为2层充能招式，充能时间25秒，每次施展“木落雁归”“击水三千”，会降低其2秒调息时间。",
            "belong_key": "belong_25267"
        },
        "20348": {
            "name": "清源",
            "attributes": {
                "strain_gain": 102
            },
            "buffs": [
                29344
            ],
            "desc": "无双等级提高10%，“碧海缥缈掌”套路下伤害招式不再附带冲刺及控制效果，施展后使自身下一次“木落雁归”伤害增加40%，最多增加至120%。",
            "belong_key": "belong_20348"
        },
        "20720": {
            "name": "遥思",
            "recipes": [
                "recipe_4725_1"
            ],
            "desc": "“溟海御波”变为2层充能技，施展过程中受到的伤害额外降低25%。",
            "belong_key": "belong_20720"
        },
        "28987": {
            "name": "澜升",
            "skills": [
                34728
            ],
            "desc": "有击落效果的招式命中空中目标，造成1段<SUB 34728 1>外功伤害；成功击落空中目标时击倒效果固定为3秒，额外造成1段最低<SUB 34728 2>最高<SUB 34728 5>外功伤害，目标距离地面距离越高造成的伤害越高。",
            "belong_key": "belong_28987"
        },
        "32592": {
            "name": "倾波",
            "skills": [
                32593
            ],
            "desc": "施展使自身移动15尺及以上的招式将引来浪潮环绕自身并延时1.5秒后对自身周围半径8尺内最多5个目标造成<SUB 32593 1>外功伤害，在自身周围有浪潮时无法获得浪潮。",
            "belong_key": "belong_32592"
        },
        "38669": {
            "name": "青冥",
            "dots": {
                "29350": [
                    38675
                ]
            },
            "desc": "“击水三千”命中当前目标后会召来海雕飞扑，使其每2秒受到外功伤害，持续16秒，最多延长至24秒。施展“溟海御波”“海运南冥”命中附带自身持续伤害目标时，使下次持续伤害立即生效。",
            "belong_key": "belong_38669"
        },
        "26745": {
            "name": "澄穆",
            "buffs": [
                19253,
                19254,
                19255
            ],
            "desc": "“碧海缥缈掌”套路招式命中侠士目标使套路下招式伤害提高10%，持续8秒，可叠加3层。",
            "belong_key": "belong_26745"
        },
        "20722": {
            "name": "兰棹",
            "desc": "“疾电叱羽”吸收的伤害提高到自身身法的200倍效果，且每秒卸除范围内队友阴性、混元性、阳性、毒性、点穴不利效果各一个，并回复其3%的最大气血值。",
            "belong_key": "belong_20722"
        },
        "20757": {
            "name": "跃潮",
            "desc": "“跃潮斩波”命中目标使目标受到的疗伤成效降低50%，持续10秒。",
            "belong_key": "belong_20757"
        }
    },
    "10585": {
        "22360": {
            "name": "崔嵬鬼步",
            "buffs": [
                16596
            ],
            "desc": "洞察目标的行动轨迹，以冲刺和位移来追踪目标，尝试使自己与目标保持相对不变的位置关系，最大速度为35，若相对位置改变则返还10秒调息时间（最多一次），获得4秒<NounID 106>，“崔嵬鬼步”期间<NounID 106>免疫击退和被拉效果，外功基础攻击力、会心几率、会心效果提高15%，持续4秒。<TALENT 22591 1 招式的持续时间增加2秒，自身闪避提高60%><TALENT 22561 1 效果期间，每秒回复1%气血值><TALENT 40173 1 “崔嵬鬼步”期间“乱天狼”对血量高于50%的敌人伤害提高30%，施展后获得5秒内可额外施展一次“乱天狼”的机会>",
            "belong_key": "belong_22360"
        },
        "10585": {
            "name": "隐龙诀",
            "attributes": {
                "pve_addition_base": 348,
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "agility_to_physical_attack_power": 1772,
                "agility_to_physical_overcome": 553,
                "max_life_gain": 245,
                "physical_overcome_base": 6389,
                "physical_attack_power_base": 6904
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "dots": {
                "19626": [
                    26980
                ]
            },
            "skills": [
                22126,
                32822,
                25784
            ],
            "desc": "隐雪藏峰从不语，潜龙出渊卫河山。凌雪阁绝密心法，配合链刃，攻守兼备，可取敌首于无声中，瞬息间颠覆战局。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10585"
        },
        "22143": {
            "name": "星垂平野",
            "recipes": [
                "recipe_4983_1",
                "recipe_4984_1",
                "recipe_4985_1",
                "recipe_4986_1",
                "recipe_4987_1",
                "recipe_4988_1",
                "recipe_4989_1",
                "recipe_4990_1",
                "recipe_4991_1"
            ],
            "skills": [
                22170,
                22550,
                22551,
                22298
            ],
            "desc": "三段攻击，对前方6尺180°扇形范围内最多6个敌对目标造成100%武器伤害外加<SUB 22170 0>外功伤害，对被链接的目标造成额外100%武器伤害外加<SUB 22298 0>外功伤害。<TALENT 22557 1 每段伤害递增15%，每段命中链接的目标，减少“血覆黄泉”1秒调息时间><TALENT 22559 1 会心几率提高10%，第三段会造成<SUB 34914 1>外功伤害和2秒眩晕效果><TALENT 22567 1 每段伤害递增15%><TALENT 22563 1 每段伤害递增20%，第三段命中链接的目标，减少“崔嵬鬼步”和“血覆黄泉”调息时间各5秒><TALENT 26760 1 >",
            "belong_key": "belong_22143"
        },
        "22144": {
            "name": "金戈回澜",
            "recipes": [
                "recipe_4992_1",
                "recipe_4993_1",
                "recipe_4994_1",
                "recipe_4995_1",
                "recipe_4996_1",
                "recipe_4997_1"
            ],
            "skills": [
                22621
            ],
            "desc": "对目标造成200%武器伤害外加<SUB 22621 0>外功伤害，链接状态下只能对被链接目标释放，释放距离提高并附带冲刺效果。施展招式后自身回复20%内力值并获得“金戈”效果：化解自身最大气血值10%的伤害，持续6秒。<TALENT 22560 1 对距离超过6尺的目标施展，造成10%额外伤害附带100%武器伤害><TALENT 22562 1 成功命中目标使自身回复10%内力值><TALENT 23480 1 会心几率和会心效果提高25%，若会心则返还3秒调息时间><TALENT 26760 1 >",
            "belong_key": "belong_22144"
        },
        "22150": {
            "name": "骤雨寒江",
            "skills": [
                23965
            ],
            "desc": "对目标造成100%武器伤害外加<SUB 23965 0>外功伤害，并使目标眩晕4秒，对链接的目标造成击倒效果，持续4秒。<TALENT 22558 1 对目标周围6尺范围内额外5个目标造成伤害和控制效果><TALENT 22568 1 成功控制目标使“铁马冰河”调息时间降低7秒><TALENT 22600 1 对目标造成100%武器伤害外加<SUB 22756 4>外功伤害，若目标血量低于50%，则附带额外100%武器伤害外加100%伤害><TALENT 25310 1 在目标脚下生成一朵彼岸花，彼岸花将会每0.5秒对目标造成<SUB 25311 1>外功伤害。5秒后彼岸花绽放，对9尺范围的目标最多6个目标造成最多<SUB 25312 1>外功伤害，目标受到的伤害将会被平摊。若目标的生命值低于50%，则会加速彼岸花汲取目标生命的速度，使绽放时间缩短2.5秒><TALENT 28705 1 若成功控制目标则返还2秒调息时间，并使得下一次“星垂平野”伤害提升50%。如果目标已经处于倒地状态，则会使倒地状态持续时间增加3秒><TALENT 26760 1 >",
            "belong_key": "belong_22150"
        },
        "22327": {
            "name": "寂洪荒",
            "recipes": [
                "recipe_5004_1",
                "recipe_5005_1",
                "recipe_5006_1",
                "recipe_5028_1",
                "recipe_5029_1",
                "recipe_5030_1",
                "recipe_6059_1"
            ],
            "skills": [
                22328,
                22604,
                22329,
                22605
            ],
            "desc": "施展软鞭对目标造成200%武器伤害外加<SUB 22328 0>外功伤害和一段破招伤害。双持武器时，主副手一起攻击额外造成100%武器伤害外加<SUB 22329 0>外功伤害和一段破招伤害。对处于6到12尺的目标造成伤害提高30%。<TALENT 22565 1 不再作用于单一目标，对自身前方12尺的矩形范围内最多6个目标造成伤害><TALENT 22571 1 具有3层充能。连续施展两次“寂洪荒”则使下一次“寂洪荒”额外造成<SUB 34981 1>外功伤害><TALENT 22575 1 伤害提高40%，需要1.5秒运功，命中6到12尺目标时使得目标每3秒受到外功伤害25点(+<SKILLEx {D0} {TotalPhysicsAP 0.743906}>)且每层使目标移动速度降低15%，持续<BUFF 15568 0 time>，可叠加3层><TALENT 22584 1 命中被自身“隐风雷”成功击退的目标，可立刻重置“寂洪荒”调息时间><TALENT 22593 1 成功命中目标后，使自身“隐雷鞭”套路招式伤害提高10%，效果可叠加，最多3层，持续10秒><TALENT 22974 1 因为命中6到12尺目标而获得伤害提高的比例由30%提高至40%><TALENT 40161 1 施展“隐风雷”后，6秒内施展“寂洪荒”不计入调息时间>",
            "belong_key": "belong_22327"
        },
        "22320": {
            "name": "乱天狼",
            "recipes": [
                "recipe_4999_1",
                "recipe_5000_1",
                "recipe_5001_1",
                "recipe_5002_1",
                "recipe_5003_1",
                "recipe_5044_1",
                "recipe_5045_1"
            ],
            "skills": [
                22489,
                22490,
                22553,
                22554
            ],
            "desc": "每0.438秒对自身前方12尺60°扇形范围内最多6个目标造成100%武器伤害外加<SUB 22489 0>外功伤害，持续2.19秒，期间自身不可转向，免疫控制和打断效果，可以施展“日月吴钩”。双持武器时，主副手一起攻击额外造成100%武器伤害外加<SUB 22553 0>外功伤害。对处于6到12尺的目标造成伤害提高30%。<TALENT 22577 1 连续命中3次目标，使自身移动速度提高40%><TALENT 22579 1 命中静止目标伤害提高30%，且降低“寂洪荒”2秒调息时间><TALENT 22974 1 因为命中6到12尺目标而获得伤害提高的比例由30%提高至40%><TALENT 25313 1 单链时施展“乱天狼”返还3秒调息时间，同一目标被单链状态“乱天狼”命中5次额外造成<SUB 25314 1>外功伤害>",
            "belong_key": "belong_22320"
        },
        "22321": {
            "name": "隐风雷",
            "recipes": [
                "recipe_5063_1",
                "recipe_5064_1",
                "recipe_5065_1",
                "recipe_5066_1",
                "recipe_5067_1",
                "recipe_5068_1",
                "recipe_5069_1",
                "recipe_5070_1",
                "recipe_5071_1"
            ],
            "skills": [
                22610,
                22611,
                22552,
                22612
            ],
            "desc": "对自身前方12尺120°扇形范围内最多6个目标造成100%武器伤害外加<SUB 22610 0>外功伤害，且附带小幅度击退效果。双持武器时，主副手一起攻击额外造成100%武器伤害外加<SUB 22552 0>外功伤害。对处于6到12尺的目标造成伤害提高30%。<TALENT 22974 1 因为命中6到12尺目标而获得伤害提高的比例由30%提高至40%><TALENT 23981 1 施展“隐风雷”将蓄力1秒，伤害提高110%，自身免疫控制，持续3秒><TALENT 29166 1 可以将“飞刃回转”击退并使其持续时间增加1秒、移动速度和攻击频率增加100%，最多增加至300%>",
            "belong_key": "belong_22321"
        },
        "22358": {
            "name": "斩无常",
            "recipes": [
                "recipe_5008_1",
                "recipe_5009_1",
                "recipe_5010_1",
                "recipe_5011_1",
                "recipe_5012_1",
                "recipe_5046_1",
                "recipe_5047_1"
            ],
            "skills": [
                22359
            ],
            "desc": "进入双持姿态，原地挥舞鞭刃进行持续旋转，每0.5秒对自身周围6尺内最多6个敌对目标造成100%武器伤害外加<SUB 22359 0>外功伤害，过程中自身受到伤害降低50%，免疫控制且可以格挡远程弹道技能的伤害，持续4秒。<TALENT 22569 1 持续时间降低至2秒，调息时间降低至20秒><TALENT 22576 1 可移动释放，造成的伤害提高20%><TALENT 22580 1 可移动释放，降低伤害和格挡远程弹道技能的效果可以对自身6尺范围内的小队成员生效><TALENT 30849 1 调息时间降低10秒，每跳伤害递增17%，每命中一个目标回复自身3%气血值，最多生效10次。造成5次伤害后，获得8秒内可额外施展一次“隐风雷”的机会，该效果每25秒最多触发一次><TALENT 22592 1 持续时间提高2秒，减伤效果提高至90%且命中目标数量提高至10个，每成功格挡敌方远程弹道技能，降低2秒的调息时间，最多生效5次>",
            "belong_key": "belong_22358"
        },
        "22361": {
            "name": "幽冥窥月",
            "recipes": [
                "recipe_5018_1",
                "recipe_5019_1",
                "recipe_5020_1",
                "recipe_5021_1",
                "recipe_5022_1",
                "recipe_5050_1",
                "recipe_5051_1"
            ],
            "skills": [
                22787
            ],
            "desc": "链接状态时可以施展，若当前目标被自身链接，则将目标身上的链子抽回，否则将自身左手链接的链子抽回，造成100%武器伤害外加<SUB 22787 0>外功伤害，使目标锁足3秒，并且使目标移动速度降低40%，自身移动速度提高40%，持续6秒。<TALENT 22596 1 施展后自身招式无视目标60%外功防御等级并降低50%威胁值，持续10秒>",
            "belong_key": "belong_22361"
        },
        "22460": {
            "name": "铁马冰河",
            "skills": [
                22398
            ],
            "desc": "链接目标时可以施展，将15尺内被链接的目标解除浮空状态，甩到自身另一侧并造成100%武器伤害外加<SUB 22398 0>外功伤害，如果目标已经处于倒地状态，则会使倒地状态持续时间增加2秒，否则将目标击倒，持续2秒，被甩过程中目标无法使用招式。不能在“崔嵬鬼步”期间施展。若成功控制目标使目标受控期间受到的伤害提高5%。<TALENT 22573 1 “铁马冰河”伤害提高20%，调息时间降低5秒，控制时间增加1秒，若成功控制目标使目标受控期间受到的伤害额外提高15%><TALENT 22578 1 成功甩开目标之后，有20%几率重置自身“铁马冰河”调息时间><TALENT 22582 1 若成功控制目标，则使目标获得一层“重创”并会在目标脚下生成与控制时间相同的“血海冰暴”，每0.5秒对4尺范围内最多6个目标造成<SUB 22702 1>伤害><TALENT 22590 1 成功甩开目标后使得自身下一个“乱天狼”伤害提高20%，并使“日月吴钩”调息时间降低10秒><TALENT 22594 1 使目标被甩至区域6尺范围内的最多5个额外敌方单位也一并受到击倒和伤害效果，每额外对一个目标造成伤害，则使下一个乱天狼伤害提升10%><TALENT 22568 1 伤害提高25%，“骤雨寒江”成功控制目标使“铁马冰河”调息时间降低7秒>",
            "belong_key": "belong_22460"
        },
        "38773": {
            "name": "幽都判",
            "attributes": {
                "physical_damage_base": 45,
                "physical_damage_rand": 5
            },
            "skills": [
                38773
            ],
            "desc": "双持和单链状态下可以施展，对目标造成<SKILL PhysicsDamage>(+<SKILLEx {D0} {SkillPhysicsAP}>)点外功伤害并标记，进入无常形态5秒，期间施展铁马冰河重置“铁马冰河”调息时间（最多一次），8秒标记期间，若目标气血首次小于最大生命值的50%则给目标添加50%最大生命值的治疗吸收盾持续8秒。",
            "belong_key": "belong_38773"
        },
        "23971": {
            "name": "无间狱",
            "skills": [
                24165,
                24166
            ],
            "desc": "施展后，立即“修罗”附体10秒，修罗会对12尺180°范围发起4段挥砍并汲取造成伤害的30%恢复自身气血值，最后1次挥砍变为360°且附带击退效果并使链接目标获得6秒受到修罗攻击次数一样层数的“决狱”效果：每层吸收8%最大气血值的治疗量。<TALENT 42419 1 >",
            "belong_key": "belong_23971"
        },
        "25304": {
            "name": "渊秘",
            "recipes": [
                "recipe_2742_1"
            ],
            "desc": "“十方玄机”调息时间降低5秒，持续时间提高2秒，且可以无须目标施展，若不选择目标则随机伪装为30尺内一个侠士目标。成功施展招式后，解除自身控制效果，卸除自身阴性、阳性、混元、毒性、点穴不利气劲各一个。(该效果在秘境地图中不生效。)",
            "belong_key": "belong_25304"
        },
        "29166": {
            "name": "飞刃回转",
            "skills": [
                29751,
                40156
            ],
            "desc": "单链和双持状态可以施展，向敌方挥出旋转的刀气，会自动追踪附近敌对目标，并持续造成<SUB 29751 0>外功伤害，持续6秒。若刀气命中目标，则6秒内对该目标施展招式“血覆黄泉”不计入调息时间，施展“寂洪荒”则额外造成一段<SUB 40156 0>外功伤害。施展“隐风雷”可以将“飞刃回转”击退并使其持续时间增加1秒、移动速度和攻击频率增加100%，最多增加至300%。",
            "belong_key": "belong_29166"
        },
        "22593": {
            "name": "百节",
            "buffs": [
                15927,
                15928,
                15929
            ],
            "desc": "“寂洪荒”成功命中目标后，使自身“隐雷鞭”套路招式伤害提高10%，效果可叠加，最多3层，持续10秒。",
            "belong_key": "belong_22593"
        },
        "22598": {
            "name": "层楹",
            "desc": "对敌方玩家施展“血覆黄泉”，链接持续过程中自身受到伤害的10%转移至目标，持续8秒后从自身转移一个减益效果至目标，每次转移降低4秒“血覆黄泉”调息时间。",
            "belong_key": "belong_22598"
        },
        "22590": {
            "name": "飞琼",
            "buffs": [
                15896
            ],
            "desc": "“铁马冰河”成功甩开目标后使得自身下一个“乱天狼”伤害提高20%，并使“日月吴钩”调息时间降低10秒。",
            "belong_key": "belong_22590"
        },
        "28705": {
            "name": "星返",
            "buffs": [
                20866
            ],
            "desc": "“骤雨寒江”若成功控制目标则返还2秒调息时间，并使得下一次“星垂平野”伤害提升50%。如果目标已经处于倒地状态，则会使倒地状态持续时间增加3秒。",
            "belong_key": "belong_28705"
        },
        "22571": {
            "name": "风骨",
            "recipes": [
                "recipe_4949_1"
            ],
            "skills": [
                34981
            ],
            "desc": "“寂洪荒”具有3层充能。连续施展两次“寂洪荒”则使下一次“寂洪荒”额外造成<SUB 34981 1>外功伤害。",
            "belong_key": "belong_22571"
        },
        "22573": {
            "name": "长恨",
            "recipes": [
                "recipe_3036_1",
                "recipe_5793_1"
            ],
            "desc": "“铁马冰河”伤害提高20%，调息时间降低5秒，控制时间增加1秒，若成功控制目标使目标受控期间受到的伤害额外提高15%。",
            "belong_key": "belong_22573"
        },
        "22973": {
            "name": "兵戈",
            "desc": "施展“血覆黄泉”，下一个“金戈回澜”使目标眩晕3秒，命中正在运功的目标，打断运功。",
            "belong_key": "belong_22973"
        },
        "42419": {
            "name": "望乡",
            "recipes": [
                "recipe_6071_1",
                "recipe_6072_1"
            ],
            "desc": "“无间狱”伤害提高20%，每次命中侠士目标降低“铁马冰河”3秒调息。<TALENT_CORE 23971 1>",
            "belong_key": "belong_42419"
        },
        "26760": {
            "name": "遗恨",
            "skills": [
                25314
            ],
            "desc": "施展“断水刃”套路招式额外造成<SUB 25314 0>点外功伤害，连续命中3次使自身获得10秒“遗恨”效果，期间对侠士目标施展“乱天狼”则附带2秒“崔嵬鬼步”效果。",
            "belong_key": "belong_26760"
        },
        "22568": {
            "name": "沥血",
            "recipes": [
                "recipe_2496_1"
            ],
            "desc": "“铁马冰河”伤害提高10%，“骤雨寒江”成功控制目标使“铁马冰河”调息时间降低7秒。",
            "belong_key": "belong_22568"
        },
        "40161": {
            "name": "蹈厉",
            "desc": "施展“隐风雷”后，6.5秒内施展“寂洪荒”不计入调息时间，该效果20秒最多一次。",
            "belong_key": "belong_40161"
        },
        "40173": {
            "name": "劲拔",
            "desc": "“崔嵬鬼步”期间“乱天狼”对血量高于50%的敌人伤害提高30%，施展后获得5秒内可额外施展一次“乱天狼”的机会。",
            "belong_key": "belong_40173"
        },
        "42416": {
            "name": "森罗",
            "recipes": [
                "recipe_6069_1"
            ],
            "desc": "“血覆黄泉”变为三重充能，进入双链状态时，则返还“血覆黄泉”18秒调息时间。",
            "belong_key": "belong_42416"
        },
        "23309": {
            "name": "北阙",
            "desc": "“血覆黄泉”锁链提前解除后将返还等同于其剩余时长的调息时间。",
            "belong_key": "belong_23309"
        },
        "22592": {
            "name": "周慎",
            "recipes": [
                "recipe_5132_1"
            ],
            "desc": "“斩无常”持续时间提高2秒，减伤效果提高至90%且命中目标数量提高至10个，每成功格挡敌方远程弹道技能，降低2秒的调息时间，最多生效5次。",
            "belong_key": "belong_22592"
        },
        "22574": {
            "name": "嵬崖",
            "recipes": [
                "recipe_5911_1"
            ],
            "desc": "“血覆黄泉”调息时间降低6秒，链接目标后朝链接的目标移动时，移动速度提高50%。",
            "belong_key": "belong_22574"
        },
        "22579": {
            "name": "玄肃",
            "recipes": [
                "recipe_4952_1"
            ],
            "desc": "“乱天狼”命中静止目标伤害提高30%，且降低“寂洪荒”2秒调息时间。",
            "belong_key": "belong_22579"
        },
        "23480": {
            "name": "青璧",
            "recipes": [
                "recipe_5100_1"
            ],
            "desc": "“金戈回澜”降低3秒调息时间，伤害提高20%，会心几率和会心效果提高25%。",
            "belong_key": "belong_23480"
        },
        "22581": {
            "name": "磐石",
            "desc": "当周围30尺敌对玩家人数超过6人时，释放“十方玄机”返还40%的调息时间。",
            "belong_key": "belong_22581"
        },
        "22582": {
            "name": "龙胄",
            "skills": [
                22702
            ],
            "desc": "“铁马冰河”若成功控制目标，则使目标获得一层<NounID 75>并会在目标脚下生成与控制时间相同的“血海冰暴”，每0.5秒对4尺范围内最多6个目标造成<SUB 22702 1>伤害。",
            "belong_key": "belong_22582"
        },
        "22603": {
            "name": "青山共我",
            "skills": [
                22761
            ],
            "desc": "单持或双持姿态可施展，用链刃划开一道横向15尺的“山河渊隙”，持续10秒。每0.5秒使“山河渊隙”周围4尺范围的最多10个目标移动速度降低40%，持续6秒，并造成<SUB 22761 0>外功伤害，敌方受到“山河渊隙”的伤害将被标记，自身伤害技能命中被标记的目标将立即重置调息时间。",
            "belong_key": "belong_22603"
        },
        "29173": {
            "name": "链魂",
            "skills": [
                37389
            ],
            "desc": "双链状态方可施展，在自身位置召唤锁链阵1秒后引爆造对12尺范围链接目标造成<SUB 37389 0>伤害，若链接目标为侠士且共同受到伤害则基础攻击力与基础疗伤成效会互换100%，持续10秒。",
            "belong_key": "belong_29173"
        },
        "22602": {
            "name": "横云意",
            "skills": [
                42924
            ],
            "desc": "链接目标时可以施展，將锁链绷紧，使10尺内被链接的目标持续受到<SUB 42924 1>伤害，且其和自身均无法离开对方超过10尺，锁链解除后效果消失。 控制期间可以施展“日月吴钩”，并可强制拖拽目标以维持链接的10尺距离。同一个目标最多只能和2个玩家建立“横云意”限制关系。横云意若与两个玩家建立关系则重置“无间狱”。<TALENT_CORE 23971 1>",
            "belong_key": "belong_22602"
        },
        "42429": {
            "name": "度鬼门",
            "desc": "被动：十方玄机期间每秒给目标持续施加“拘魂”持续20秒，最多3层。主动：可20尺内目标发动，凌雪化为三道猩红残影对目标进行锁链绞杀造成<SUB 42445 1>点伤害并封轻功3秒，若目标存在“拘魂”则使目标定身3秒，每层“拘魂”使“度鬼门”伤害提高100%。",
            "belong_key": "belong_42429"
        },
        "22575": {
            "name": "渊岳",
            "recipes": [
                "recipe_4950_1"
            ],
            "dots": {
                "15568": [
                    22330
                ]
            },
            "desc": "“寂洪荒”伤害提高40%，需要1.5秒运功，命中6到12尺目标时使得目标每3秒受到外功伤害25点(+<SKILLEx {D0} {TotalPhysicsAP 0.743906}>)且每层使目标移动速度降低15%，持续<BUFF 15568 0 time>，可叠加3层。",
            "belong_key": "belong_22575"
        },
        "25310": {
            "name": "泣血",
            "skills": [
                25311,
                25312
            ],
            "desc": "施展“骤雨寒江”在目标脚下生成一朵彼岸花，彼岸花将会每0.5秒对目标造成<SUB 25311 1>点外功伤害。5秒后彼岸花绽放，对9尺范围的目标最多6个目标造成最多<SUB 25312 1>点外功伤害。",
            "belong_key": "belong_25310"
        },
        "22975": {
            "name": "天堑",
            "buffs": [
                15845
            ],
            "desc": "锁链解除时，自身提升50%武器伤害，持续6秒。",
            "belong_key": "belong_22975"
        },
        "22564": {
            "name": "鸣剑",
            "recipes": [
                "recipe_5566_1"
            ],
            "desc": "“血覆黄泉”释放距离和维持距离均提高3尺，治疗转移效果提高至50%。",
            "belong_key": "belong_22564"
        },
        "22591": {
            "name": "闻鹤",
            "desc": "施展“崔嵬鬼步”，自身闪避提高80%。",
            "belong_key": "belong_22591"
        },
        "40164": {
            "name": "链域囚疆",
            "skills": [
                40287
            ],
            "desc": "在自身位置生成“锁链阵”对周围10尺的敌人造成一次伤害，链接目标5秒并附带一层<NounID 75>，期间距离“锁链阵”超过30尺则消失，5秒之后“锁链”将目标拉至“锁链阵”处使其移动速度降低60%且无法施展轻功，持续4秒，附带一层<NounID 75>。",
            "belong_key": "belong_40164"
        },
        "22587": {
            "name": "忘断",
            "buffs": [
                15893
            ],
            "desc": "施展“日月吴钩”使自身提高15%基础外功攻击力，10%无双等级，持续25秒。",
            "belong_key": "belong_22587"
        },
        "30849": {
            "name": "孤路",
            "recipes": [
                "recipe_3181_1"
            ],
            "buffs": [
                21588
            ],
            "desc": "“斩无常”调息时间降低5秒，每跳伤害递增17%，每命中一个目标回复自身3%气血值，最多生效10次。造成5次伤害后，获得8秒内可额外施展一次“隐风雷”的机会，该效果每25秒最多触发一次。",
            "belong_key": "belong_30849"
        },
        "22580": {
            "name": "殷炽",
            "desc": "“斩无常”可移动释放，且释放时自身移动速度提高15%，降低伤害和格挡远程弹道技能的效果可以对自身6尺范围内的小队成员生效。",
            "belong_key": "belong_22580"
        },
        "22595": {
            "name": "离楼",
            "desc": "对敌方玩家施展“血覆黄泉”，链接持续过程中，每4秒从目标转移一个阴性或阳性或混元性或毒性增益效果至自身，每次转移使自身回复5%最大气血值。同一目标4秒内只能被转移一次。",
            "belong_key": "belong_22595"
        },
        "22596": {
            "name": "徵逐",
            "buffs": [
                15932
            ],
            "desc": "施展“幽冥窥月”后，自身招式无视目标60%外功防御等级并降低50%威胁值，持续13秒。",
            "belong_key": "belong_22596"
        },
        "22586": {
            "name": "折意",
            "desc": "“崔嵬鬼步”不再追踪目标，自身移动速度提高40%。",
            "belong_key": "belong_22586"
        }
    },
    "10615": {
        "10615": {
            "name": "太玄经",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "pve_addition_base": 307,
                "spunk_to_neutral_attack_power": 1976,
                "spunk_to_neutral_critical_strike": 512,
                "max_life_gain": 245,
                "magical_attack_power_base": 7387,
                "neutral_critical_strike_base": 7347
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "skills": [
                25512,
                32886,
                25837,
                33588
            ],
            "desc": "以阴阳五行之义，天文历法之识，解大道而知微，突破自身限制寻回先天之精气神。",
            "critical_type": "neutral",
            "damage_type": "neutral",
            "belong_key": "belong_10615"
        },
        "24369": {
            "name": "三星临",
            "recipes": [
                "recipe_5165_1",
                "recipe_5240_1",
                "recipe_5241_1",
                "recipe_5242_1",
                "recipe_5243_1",
                "recipe_5249_1",
                "recipe_5278_1",
                "recipe_5279_1"
            ],
            "skills": [
                24558,
                24675,
                24676,
                24677
            ],
            "desc": "对目标造成<SUB 24558 0>混元性内功伤害，对其周围6尺内额外2个目标造成<SUB 25242 0>混元性内功伤害，并获得5点星运。<TALENT 24930 1 会心提高10%，会心效果提高10%><TALENT 24925 1 伤害和疗伤成效提高10%><TALENT 42511 1 御前星>",
            "belong_key": "belong_24369"
        },
        "24371": {
            "name": "兵主逆",
            "recipes": [
                "recipe_5244_1",
                "recipe_5245_1",
                "recipe_5246_1",
                "recipe_5247_1",
                "recipe_5248_1",
                "recipe_5280_1"
            ],
            "skills": [
                24811,
                24812,
                24813,
                24814
            ],
            "desc": "2.81秒内对目标造成3次<SUB 24811 0>混元性内功伤害，每次获得5点星运，完整运功则额外造成一次破招伤害。调息时间受加速率影响。<TALENT 25034 1 可以在移动中施展，运功不会被打退，每跳会延长3秒自身卦象时间，最多延长9秒><TALENT 24934 1 伤害和疗伤成效提高10%><TALENT 42511 1 御前星>",
            "belong_key": "belong_24371"
        },
        "24372": {
            "name": "天斗旋",
            "recipes": [
                "recipe_5250_1",
                "recipe_5251_1",
                "recipe_5252_1",
                "recipe_5253_1",
                "recipe_5277_1",
                "recipe_5299_1",
                "recipe_5300_1",
                "recipe_5301_1"
            ],
            "skills": [
                24824,
                24822,
                24823,
                24821
            ],
            "desc": "对目标造成<SUB 24824 0>混元性内功伤害及破招伤害，并获得20点星运。调息时间受加速率影响。<TALENT 25368 1 亘天><TALENT 25382 1 知微><TALENT 42511 1 御前星>",
            "belong_key": "belong_24372"
        },
        "24373": {
            "name": "往者定",
            "skills": [
                30026
            ],
            "desc": "对目标造成<SUB 30026 0>混元性内功伤害，并使目标下马，3秒内使目标移动速度逐渐降低70%/80%/90%，并在3秒后使目标定身，持续4秒。<TALENT 24986 1 “往者定”定身时间提高2秒，对自身“连局”中目标施展时，立刻触发定身效果。战斗中施展“起卦”4次后可在4秒内额外释放一次“往者定”><TALENT 42511 1 御前星>",
            "belong_key": "belong_24373"
        },
        "24431": {
            "name": "祝由·火离",
            "skills": [
                24454
            ],
            "desc": "可以施展给敌方目标，使其每2秒对自身周围4尺内的最多4个目标造成<SUB 24454 0>混元性内功伤害，“祝由·火离”持续26秒。“祝由·火离”最多对自身50尺内目标造成伤害。该卦象存在20秒。<TALENT 25023 1 效果为“神占·火离”时，目标“祝由·火离”持续期间，被自身“天斗旋”、“兵主逆”命中，则立刻触发一次“卦象·火离”伤害><TALENT 25135 1 “祝由·火离”卦象结束后目标有15%几率再次获得“祝由·火离”效果><TALENT 25074 1 “祝由·火离”卦象持续期间，目标受治疗成效降低50%，持续15秒><TALENT 25086 1 处于自身“祝由·火离”状态下的敌对目标，每次受到自身“兵主逆”招式攻击，则“祝由·火离”对其伤害提高14%，若目标处于自身“连局”中，则效果翻倍，最多70%，“祝由·火离”状态结束后每2秒衰减7%。><TALENT 25030 1 不再溅射伤害其他目标，但对当前目标伤害提高50%，且若其被锁足，定身，眩晕，击倒，则造成的伤害提高50%><TALENT 32795 1 施展5秒内，若场上存在“灯魂”，则可以消耗当前剩余持续时间最短的“灯魂”，额外释放一次“祝由”效果，并返还12秒“奇门飞宫”调息时间><TALENT 25071 1 非战斗状态下施展“变卦”不再消耗星运，施展“祝由·火离”命中目标则使自身会心会效提高10%，持续40秒>",
            "belong_key": "belong_24431"
        },
        "24379": {
            "name": "鬼星开穴",
            "recipes": [
                "recipe_5272_1",
                "recipe_5273_1",
                "recipe_5274_1",
                "recipe_5275_1",
                "recipe_5276_1",
                "recipe_5547_1"
            ],
            "skills": [
                42423
            ],
            "desc": "消耗50点星运，立刻引爆场中所有<NounID 92>，对“局”“连局”内各最多4个敌方目标造成<SUB 25233 0>混元性内功伤害，同一目标最多受到一次伤害，当自身占得“火离”“山艮”卦象，则使“连局”内的敌对目标获得对应“祝由·火离”“祝由·山艮”效果，若自身存在“水坎”卦象，则额外使“连局”范围内最多4个友方目标获得“祝由·水坎”效果。<TALENT 25367 1 风遁><TALENT 24994 1 龙回首><TALENT 25088 1 擎羊><TALENT 24949 1 相蚀><TALENT 37456 1 追叙><TALENT 42455 1 鬼宿>",
            "belong_key": "belong_24379"
        },
        "24378": {
            "name": "奇门飞宫",
            "recipes": [
                "recipe_2438_1",
                "recipe_5294_1",
                "recipe_5295_1",
                "recipe_5296_1",
                "recipe_5297_1",
                "recipe_5298_1"
            ],
            "skills": [
                25233
            ],
            "desc": "可在运功中施展，凝聚1个<NounID 92>放置于20尺内目标位置，持续90秒，<NounID 92>离开自身40尺或自身重伤时将被强制收回。<TALENT 25173 1 灵器><TALENT 25149 1 洞彻九宫><TALENT 25026 1 踏斗><TALENT 25072 1 鬼遁><TALENT 25382 1 知微><TALENT 25367 1 风遁><TALENT 25028 1 神遁>",
            "belong_key": "belong_24378"
        },
        "25368": {
            "name": "亘天",
            "recipes": [
                "recipe_5302_1"
            ],
            "skills": [
                34683
            ],
            "desc": "“天斗旋”变为3层8秒充能招式，充能时间受加速率影响，运功时间降低0.5秒，回复星运效果提高50%。对敌对目标额外造成一次<SUB 34683 0>“亘天”伤害，该伤害受到天斗旋秘籍加成。",
            "belong_key": "belong_25368"
        },
        "37456": {
            "name": "追叙",
            "desc": "施展“鬼星开穴”引爆连局后，4秒内施展“变卦”使“鬼星开穴”引爆的“魂灯”位置及状态返回引爆前，刷新持续时间至22秒，并返还80%“鬼星开穴”调息时间。",
            "belong_key": "belong_37456"
        },
        "25026": {
            "name": "踏斗",
            "recipes": [
                "recipe_6073_1"
            ],
            "buffs": [
                30434
            ],
            "desc": "同时只会存在一个“灯魂”，“纵横三才”调息时间延长9秒，移动“灯魂”时会触发<NounID 105>效果。",
            "belong_key": "belong_25026"
        },
        "25148": {
            "name": "华盖",
            "desc": "“天人合一”转换比例提高100%，施展“天人合一”后自身不受打退、打断，不受无法施展内功招式和缴械效果的影响，持续8秒。该效果在施展“鸿蒙天禁”时消失。",
            "belong_key": "belong_25148"
        },
        "25173": {
            "name": "灵器",
            "skills": [
                25174
            ],
            "desc": "施展“三星临”“兵主逆”“天斗旋”命中敌对目标时，自身或目标处于“连局”中则触发“灵器”效果，造成<SUB 25174 0>混元性内功伤害。",
            "belong_key": "belong_25173"
        },
        "25088": {
            "name": "擎羊",
            "recipes": [
                "recipe_5870_1"
            ],
            "desc": "“鬼星开穴”无视目标8%化劲，施展“鬼星开穴”时，自身每存在1个“灯魂”则“鬼星开穴”伤害额外提高23%。",
            "belong_key": "belong_25088"
        },
        "25382": {
            "name": "知微",
            "dots": {
                "31796": [
                    42432
                ]
            },
            "desc": "“奇门飞宫”改为在身后5尺生成灯魂，“灯魂”撞击后，使自身10秒内下一个“天斗旋”无需运功，施展后使敌对目标每2秒受到混元性内功伤害，最多叠加2层，持续30秒；若目标已拥有该效果，则立刻生效1跳。<TALENT_CORE 25026 1>",
            "belong_key": "belong_25382"
        },
        "24965": {
            "name": "司命",
            "desc": "“天人合一”状态后释放的第一个治疗招式会使目标受到的伤害降低60%，持续6秒。受到伤害降低效果期间目标气血值首次低于60%时，降低自身“天人合一”10秒调息时间。",
            "belong_key": "belong_24965"
        },
        "25028": {
            "name": "神遁",
            "desc": "自身在“连局”内免疫控制（击退和被拉除外）；“起卦”不再附带免疫控制效果。<TALENT_CORE 25368 1>",
            "belong_key": "belong_25028"
        },
        "25367": {
            "name": "风遁",
            "desc": "施展“鬼星开穴”重置“奇门飞宫”充能时间；“起卦”免控时间提高6秒。<TALENT_CORE 37456 1>",
            "belong_key": "belong_25367"
        },
        "25137": {
            "name": "堪卜",
            "recipes": [
                "recipe_2631_1"
            ],
            "desc": "“起卦”调息时间降低8秒，“起卦”效果期间移动速度提高20%。",
            "belong_key": "belong_25137"
        },
        "25072": {
            "name": "鬼遁",
            "buffs": [
                18174
            ],
            "desc": "生成“连局”或施展“返闭惊魂”时将使自身混元内功基础攻击提高30%，持续45秒。",
            "belong_key": "belong_25072"
        },
        "25034": {
            "name": "顺祝",
            "recipes": [
                "recipe_5332_1",
                "recipe_6074_1"
            ],
            "desc": "“兵主逆”伤害提高10%，可以在移动中施展，运功不会被打退，每跳会延长3秒自身卦象时间，最多延长9秒。",
            "belong_key": "belong_25034"
        },
        "24951": {
            "name": "连蜷",
            "desc": "“踏星行”闪避几率提高至80%，持续时间提高1秒，回复90点星运值。",
            "belong_key": "belong_24951"
        },
        "42489": {
            "name": "燃灯",
            "recipes": [
                "recipe_6163_1"
            ],
            "desc": "“踏星行”调息时间延长5秒，改为乘骑魂灯向前飞行，施展时击退6尺内至多3个敌对侠士目标6尺，每秒对6尺内至多3个敌对目标添加“祝由·火离”效果，命中带有自身“祝由·火离”效果的目标时，造成一次“祝由·火离”伤害。",
            "belong_key": "belong_42489"
        },
        "42492": {
            "name": "神占",
            "desc": "任何伤害使你的当前气血值低于1%时，解除控制，重置“起卦”调息时间并自动施展，延迟1秒后占得下述卦象中的一个，并获得对应效果，在占得卦象之前自身不会重伤。\\n神占·火离：浴火重生，回复100%气血值。\\n神占·山艮：不动如山，3秒内受到的伤害降低99%。\\n神占·水坎：清源正本，解除自身受到的阴性、阳性、混元性、毒性、点穴、持续伤害不利效果，并在5秒内受到的治疗成效提高100%。\\n该效果每300秒只能触发一次。",
            "belong_key": "belong_42492"
        },
        "25087": {
            "name": "天钺",
            "recipes": [
                "recipe_6192_1"
            ],
            "desc": "“鸿蒙天禁”运功时间降低0.75秒，可在跳跃中施展。可对团队成员使用，并卸除掉“阴性不利效果”“阳性不利效果”“混元不利效果”“毒不利效果”“持续伤害不利效果”各2个。",
            "belong_key": "belong_25087"
        },
        "25011": {
            "name": "神皆寂",
            "attributes": {
                "neutral_damage_base": 30,
                "neutral_damage_rand": 3
            },
            "skills": [
                25011
            ],
            "desc": "打断目标运功，对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元性内功伤害，命中后使其封内1.5秒。该封内效果正常结束时，若目标处于“连局”内，使其封内4.5秒。<TALENT_CORE 25368 1>",
            "belong_key": "belong_25011"
        },
        "32791": {
            "name": "列宿游",
            "attributes": {
                "neutral_damage_base": 28,
                "neutral_damage_rand": 4
            },
            "buffs": [
                31805
            ],
            "skills": [
                32791
            ],
            "desc": "对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元性内功伤害，并使目标幻化4秒（效果视为击倒）；命中后获得“明灯”：会心效果提高20%，持续12秒。",
            "belong_key": "belong_32791"
        },
        "42504": {
            "name": "太白蚀昴",
            "skills": [
                42509
            ],
            "desc": "在3秒内每0.5秒对目标6尺内至多4个敌对目标造成<SUB 42509 1>混元性内功伤害；效果结束时，范围内被命中的目标会被重力压倒2秒，并受到<SUB 42509 2>混元性内功伤害。",
            "belong_key": "belong_42504"
        },
        "25022": {
            "name": "祝祷",
            "buffs": [
                18176
            ],
            "desc": "“星运”不小于20点时，自身伤害和治疗效果提高8%。",
            "belong_key": "belong_25022"
        },
        "42511": {
            "name": "御前星",
            "skills": [
                42520
            ],
            "desc": "施展“九字诀”套路招式时获得1层“星芒”，最多叠加24层，仅在战斗中维持。“鬼星开穴”替换为“御前星”，需持续运功，每拥有1层获得0.25秒运功时间，每0.25秒消耗1层“星芒”，对25尺内敌对目标发射1颗“芒星”造成<SUB 42520 1>混元性内功伤害，可在移动、跳跃中运功，运功不会被打退，命中非侠士目标时伤害提高30%。",
            "belong_key": "belong_42511"
        },
        "24994": {
            "name": "龙回首",
            "recipes": [
                "recipe_2432_1"
            ],
            "desc": "“鬼星开穴”变成2层充能招式，充能时间12秒，施展后返还30点星运值。",
            "belong_key": "belong_24994"
        },
        "25114": {
            "name": "龙马出河",
            "desc": "在20尺内目标点位置，产生8秒“龙马出河”，延迟1秒后将自身传送至“龙马出河”中心位置，若存在“连局”，使其环绕自身重新展开。自身位于“龙马出河”范围内时，伤害提高15%。",
            "belong_key": "belong_25114"
        },
        "42455": {
            "name": "鬼宿",
            "skills": [
                42456
            ],
            "desc": "“鬼星开穴”命中连局内目标后为其添加“鬼宿渡河”：被效果来源者“鬼星开穴”命中时根据层数受到<SUB 42456 1>-<SUB 42456 7>额外伤害，最多叠加7层，持续77秒，重复添加时不会刷新持续时间。",
            "belong_key": "belong_42455"
        },
        "25383": {
            "name": "连极阵",
            "skills": [
                28815
            ],
            "desc": "标记目标，每2秒消耗5点星运值，使“灯魂”<NounID 105>标记目标，随后回到自身位置，该<NounID 105>不附带控制效果，伤害降低50%；持续期间所有招式施展距离提高5尺，施展“三星临”返还0.5秒基础调息时间，“灯魂”不会因为超出距离而消失。星运值不足时或施展二段招式可解除标记。<TALENT_CORE 25026 1>",
            "belong_key": "belong_25383"
        },
        "25176": {
            "name": "杀星在尾",
            "skills": [
                25150
            ],
            "desc": "每秒对自身8尺内随机位置召唤流星雨，流星雨会坠落至该位置对4尺范围内最多5个目标造成<SUB 25150 0>混元性内功伤害，若当前目标处于“连局”之中则流星雨集中坠落至目标位置，流星雨持续4秒，命中锁足、定身、眩晕的目标延长1秒流星雨持续时间。效果期间可以施展1次二段招式：消耗30点星运值，延长流星雨持续时间6秒，若存在连局，则延长“灯魂”存在时间20秒。",
            "belong_key": "belong_25176"
        },
        "37505": {
            "name": "镇星入舆",
            "buffs": [
                31907
            ],
            "desc": "战斗中方可施展。强化1个“灯魂”与自身链接，30秒内首次施展“三星临”“兵主逆”“天斗旋”时，运功期间自身免疫打退、打断、缴械和无法运功效果，链接在自身的“灯魂”也会施展同样的招式攻击敌方。\\n可对非侠士目标施展二段招式：若存在“连局”则“连局”环绕目标重新生成，并使自身30秒内伤害提高15%。若目标存在自身“祝由·火离”效果则使该效果延长10秒。<TALENT 25072 1 施展招式产生“连局”生成时将使自身混元内功基础攻击提高30%，持续45秒>",
            "belong_key": "belong_37505"
        },
        "25074": {
            "name": "休囚",
            "desc": "“祝由·火离”卦象持续期间，目标受治疗成效降低50%，持续15秒。",
            "belong_key": "belong_25074"
        },
        "25061": {
            "name": "延年",
            "desc": "“斗转星移”可对团队成员施展。“斗转星移”与目标交换位置后，自身将获得化解气血最大值30%的护盾，持续6秒。",
            "belong_key": "belong_25061"
        },
        "24986": {
            "name": "星合",
            "desc": "“往者定”定身时间提高2秒，对自身“连局”中目标施展时，立刻触发定身效果。施展“斗转星移”后可在4秒内额外释放一次“往者定”。",
            "belong_key": "belong_24986"
        },
        "25378": {
            "name": "连断",
            "recipes": [
                "recipe_5200_1"
            ],
            "desc": "“变卦”变为2层充能招式，调息时间提高12秒，可重置自身卦象祝由效果，施展“鬼星开穴”后6秒内下一个“变卦”星运消耗降低20点。",
            "belong_key": "belong_25378"
        },
        "25085": {
            "name": "荧入白",
            "buffs": [
                18021
            ],
            "desc": "卦象持续期间自身无双等级提高20%，无视目标50%内功防御等级，威胁值降低50%。",
            "belong_key": "belong_25085"
        },
        "25030": {
            "name": "焚如",
            "recipes": [
                "recipe_5825_1"
            ],
            "skills": [
                25031
            ],
            "desc": "“祝由·火离”不再溅射伤害其他目标，但对当前目标伤害提高50%，且若其被锁足，定身，眩晕，击倒，则造成的伤害提高50%。",
            "belong_key": "belong_25030"
        },
        "25379": {
            "name": "征凶",
            "desc": "“变卦”时，“水坎”卦象必定占得“火离”卦象，“火离”卦象必定占得“山艮”卦象，“山艮”卦象必定占得“火离”卦象。",
            "belong_key": "belong_25379"
        },
        "24949": {
            "name": "相蚀",
            "desc": "“鬼星开穴”命中“连局”内的敌对目标后标记其6秒，标记期间再次命中时清除标记，并卸除其混元、阴性、阳性、毒性有益气劲各一个。",
            "belong_key": "belong_24949"
        },
        "24983": {
            "name": "重山",
            "recipes": [
                "recipe_5179_1",
                "recipe_5180_1",
                "recipe_5181_1"
            ],
            "desc": "卦象“山艮”持续期间，“九字诀”套路伤害招式额外伤害提高至20%。",
            "belong_key": "belong_24983"
        },
        "32794": {
            "name": "坍缩",
            "desc": "“鸿蒙天禁”改变为可移动施展的蓄力技能，对自身周围最多三个敌方目标生效。初始生效范围为6尺，每蓄力0.5秒增加2尺生效范围，最多可蓄力1.5秒。",
            "belong_key": "belong_32794"
        },
        "25066": {
            "name": "神元",
            "attributes": {
                "spunk_gain": 102,
                "vitality_gain": 102
            },
            "desc": "体质和元气提高10%。",
            "belong_key": "belong_25066"
        },
        "42926": {
            "name": "天医",
            "desc": "“巨门北落”持续时间延长1秒，期间自身受到的治疗成效提高25%。",
            "belong_key": "belong_42926"
        }
    },
    "10627": {
        "27652": {
            "name": "苍棘缚地",
            "buffs": [
                21168
            ],
            "skills": [
                27657
            ],
            "desc": "在目标区域种植一株“苍棘缚地”，蛰伏3秒后长成，每2秒会朝目标发射荆棘刺击，对该方向20尺矩形区域的目标造成<SUB 27657 0>毒性内功伤害，持续8秒。“苍棘缚地”免疫控制，可以被攻击。在寒性下施展时“苍棘缚地”受到伤害降低5%，在温性下施展时“苍棘缚地”造成伤害提高5%。<TALENT 28361 1 长成后，自身每发生一次中和，使其持续时间增加2秒，并使其回复20%气血值，至多触发4次。自身施展“含锋破月”、“飞叶满襟”、“银光照雪”时，“苍棘缚地”也会在自身周围360°对应范围造成伤害，该次伤害不会与自身“含锋破月”、“飞叶满襟”、“银光照雪”命中同一目标><TALENT 28373 1 蛰伏时间延长至6秒，最大气血值提高100%，处于生长状态下的第一次攻击将嘲讽目标，并标记三个目标，施展二段招式可将目标拉至“苍棘缚地”处，每次攻击附带高额仇恨><TALENT 29498 1 “苍棘缚地”持续时间延长4秒，受到的伤害降低70%，造成的伤害提高70%><TALENT 38632 1 “苍棘缚地”攻击时，额外造成一次<SUB 38636 1>毒性伤害并恢复自身1.5%内力值><TALENT 38631 1 “苍棘缚地”初始持续时间增加4秒。每次命中目标使其获得一层“逆乱”>",
            "belong_key": "belong_27652"
        },
        "27554": {
            "name": "钩吻断肠",
            "recipes": [
                "recipe_2643_1",
                "recipe_2644_1",
                "recipe_2645_1",
                "recipe_2646_1",
                "recipe_2647_1",
                "recipe_2648_1",
                "recipe_2649_1"
            ],
            "dots": {
                "20052": [
                    27560
                ]
            },
            "skills": [
                27555
            ],
            "desc": "对目标造成<SUB 27555 0>毒性内功伤害并附带一层“逆乱”效果，使其<BUFF 20052 0 desc>，持续<BUFF 20052 0 time>，可以叠加8层，并使得自身获得1点温性。“逆乱”效果每次被驱散或者转移时，只会被作用一层。<TALENT 28343 1 “逆乱”效果每层使得自身每跳回复0.1%内力值><TALENT 28411 1 “逆乱”效果持续期间每层使得目标降低0.5%的御劲和1%的化劲等级，相同效果不可共存><TALENT 28413 1 “钩吻断肠”使得自身16秒内基础攻击力提高15%，期间自身“商陆缀寒”可以移动施展且运功时间降低0.25秒><TALENT 28432 1 “逆乱”增加1跳><TALENT 28437 1 8层“逆乱”效果完整结束后，使得目标受到<SUB 28438 1>毒性内功伤害，若目标为侠士则气血最大值降低5%，持续40秒，最多叠加5层><TALENT 40194 1 >",
            "belong_key": "belong_27554"
        },
        "10627": {
            "name": "无方",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2347,
                "pve_addition_base": 317,
                "spirit_to_poison_attack_power": 1976,
                "spirit_to_poison_overcome": 512,
                "max_life_gain": 245,
                "magical_attack_power_base": 6663,
                "poison_overcome_base": 5527
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "skills": [
                27451,
                32841,
                29698,
                29695
            ],
            "desc": "此功以无方为名，亦代指北天药宗至高典籍《无方制物经》，旨在娴熟使用药理制物，配方运毒。称得上是驱草为刃，毒药双生，足竞百兵之锋。",
            "critical_type": "poison",
            "damage_type": "poison",
            "belong_key": "belong_10627"
        },
        "27551": {
            "name": "商陆缀寒",
            "recipes": [
                "recipe_2636_1",
                "recipe_2637_1",
                "recipe_2638_1",
                "recipe_2639_1",
                "recipe_2640_1",
                "recipe_2641_1",
                "recipe_2642_1"
            ],
            "skills": [
                27552
            ],
            "desc": "运功1.5秒，对目标造成<SUB 27552 0>毒性内功伤害，并使得自身获得1点寒性。<TALENT 27530 1 伤害提高10%><TALENT 28410 1 命中属于自身“逆乱”层数低于4层的目标将为其添加一层“逆乱”效果。若当前自身状态无药性，则施展“商陆缀寒”额外回复2点寒性><TALENT 28420 1 运功时间降低0.5秒，成功施展后使得自身基础调息时间降低0.5秒><TALENT 28443 1 施展“商陆缀寒”降低自身“紫叶沉疴”“苍棘缚地”1秒调息时间><TALENT 40194 1 >",
            "belong_key": "belong_27551"
        },
        "27556": {
            "name": "川乌射罔",
            "recipes": [
                "recipe_2650_1",
                "recipe_2651_1",
                "recipe_2652_1",
                "recipe_2653_1",
                "recipe_2654_1",
                "recipe_2655_1",
                "recipe_2656_1"
            ],
            "skills": [
                27557
            ],
            "desc": "2.25秒内对目标造成4次<SUB 27557 0>毒性内功伤害，每次使得自身获得1点温性，期间自身可以滞空。完整运功后附带一层“逆乱”效果。同时造成一次破招伤害。<TALENT 28338 1 命中“逆乱”效果，对目标周围6尺范围额外3个目标造成毒性内功伤害，目标“逆乱”效果层数越高，溅射的伤害越高><TALENT 28344 1 会心几率提高10%，变为2层充能招式><TALENT 28356 1 调息时间提高8秒，第一跳、第二跳伤害提高15%且也为目标附带一层“逆乱”效果><TALENT 28364 1 伤害提高10%，运功不会被打退，完整命中目标后使得其无法施展轻功和跳跃，持续2秒><TALENT 28426 1 “千枝绽蕊”效果持续期间自身破防等级提高25%，无双等级提高25%，期间“川乌射罔”命中非侠士目标回复10%最大内力值，完整运功“川乌射罔”对非侠士目标额外附带一段毒性内功伤害><TALENT 40211 1 “川乌射罔”运功时自身“苍棘缚地”也会对目标发射种子，造成毒性内功伤害>",
            "belong_key": "belong_27556"
        },
        "27578": {
            "name": "沾衣未妨",
            "skills": [
                27579
            ],
            "desc": "在目标区域生成一片10尺的毒雾并逐渐由边缘开始消散，每0.75秒消散一次并对(10/9/8/7/6)尺范围最多5个目标造成<SUB 27579 0>伤害，并使得自身获得1点寒性，持续3.75秒。目标受到2次以上“沾衣未妨”伤害将被定身2秒。自身植物被毒雾命中将立即生长。<TALENT 28365 1 伤害提高10%，命中人数提高2个，每跳使得目标有50%几率获得“逆乱”效果。若目标身上属于自身的“逆乱”层数低于4层则几率提高到100%><TALENT 28367 1 命中附带自身的4层及以上“逆乱”效果的目标将立即造成定身效果><TALENT 28415 1 命中自身“苍棘缚地”后，使其攻击次数不变但攻击频率提高37.5%，造成伤害提高15%，期间每次“无方中和”会使“苍棘缚地”额外吐出一阵毒雾对周围8尺区域造成一次伤害和0.5秒的定身效果><TALENT 34690 1 第2、4跳时会生成5个“菵露”，敌对目标踩到花后花朵消失造成伤害，使目标获得3层逆乱，并使自身获得一点温性><TALENT 37354 1 在自身“沾衣未妨”中施展“银光照雪”时会以扇形扩散一片毒雾，造成一次“沾衣未妨”伤害，使目标获得3层“逆乱”>",
            "belong_key": "belong_27578"
        },
        "27582": {
            "name": "且待时休",
            "recipes": [
                "recipe_2657_1",
                "recipe_2658_1",
                "recipe_2659_1",
                "recipe_2660_1",
                "recipe_2661_1",
                "recipe_2662_1",
                "recipe_2663_1"
            ],
            "skills": [
                27584
            ],
            "desc": "对自身15尺范围的最多5个附带自身4层及以上“逆乱”效果的目标标记“且待时休”，自身持续运功4秒，每秒对“且待时休”标记目标造成<SUB 27584 0>毒性内功伤害，并使其无法施展内外功招式1秒。若目标离开自身15尺范围将挣脱“且待时休”的作用。运功期间自身免疫控制(击退和被拉除外)，可以滞空。<TALENT 28375 1 施展“且待时休”自身获得最大气血值10%的护盾，护盾存在期间自身免疫无法运功、缴械、打断效果，免疫击退、被拉效果，持续4秒><TALENT 28406 1 施展“且待时休”，自身“苍棘缚地”也会在原地施展“且待时休”，对周围15尺的4层以上“逆乱”的目标造成沉默和伤害效果。自身停止运功时，“苍棘缚地”也会停止释放“且待时休”><TALENT 28423 1 调息时间降低5秒，期间使得自身“苍棘缚地”会心几率提高20%，会心效果提高20%><TALENT 28436 1 还会使作用目标无法施展轻功，运功每过1秒，“且待时休”伤害增加15%><TALENT 34796 1 运功期间每跳为目标添加“紫叶沉疴”的种子，最多吸收3%的最大气血值的治疗量><TALENT 38625 1 “且待时休”每跳命中使目标化劲等级降低2%，最多叠加8层，持续8秒，不与同类效果共存><TALENT 38642 1 “且待时休”施展后可对被“且待时休”影响的角色释放二段招式“息芷”，拉拽当前目标并造成伤害。“且待时休”每命中一个目标，使其伤害增加25%>",
            "belong_key": "belong_27582"
        },
        "29670": {
            "name": "无方中和",
            "skills": [
                28081
            ],
            "desc": "“无方”心法下，施展武学招式在经脉中残留的每点“寒性”和“温性”将会互相抵消并产生一次“无方中和”效果，对目标造成<SUB 28081 0>毒性内功伤害并额外附带一层“逆乱”持续伤害效果。<TALENT 28458 1 自身在寒性状态下触发“无方中和”效果，“无方中和”效果伤害提高30%，使得目标移动速度降低20%，持续5秒，最多叠加4层。并会为其添加“紫叶沉疴”的种子，最多吸收3%的最大气血值的治疗量><TALENT 28432 1 “无方中和”作用在自身4层“逆乱”的目标上则额外附带<SUB 29674 1>毒性内功伤害>",
            "belong_key": "belong_29670"
        },
        "28345": {
            "name": "银光照雪",
            "recipes": [
                "recipe_2692_1",
                "recipe_2693_1",
                "recipe_2694_1",
                "recipe_2695_1",
                "recipe_2696_1",
                "recipe_2697_1",
                "recipe_2698_1",
                "recipe_2966_1",
                "recipe_3264_1"
            ],
            "skills": [
                28346
            ],
            "desc": "对10尺内目标可施展，若目标为友方目标则使其恢复<SUB 27531 0>气血值，若目标是敌方目标则对其造成<SUB 27529 0>毒性内功伤害，该伤害也受到自身治疗量加成。<TALENT 28349 1 伤害和治疗效果提高20%，对自身6尺270度扇形范围最多5个友方目标生效，自身气血值每降低25%，伤害和治疗效果提高5%><TALENT 28397 1 命中附带自身8层“逆乱”效果的目标，使其下2跳“逆乱”效果立即生效><TALENT 28460 1 调息时间降低4秒，施展“银光照雪”时造成的治疗效果也受到自身毒性内功攻击加成><TALENT 28605 1 对队友施展时，使得自身为目标承受50%的伤害，持续5秒><TALENT 28651 1 会心几率提高10%，会心效果提高10%，对友方目标施展时，立即吞噬其“赤芍寒香”剩余治疗量><TALENT 28748 1 “银光照雪”会消除目标属于自身40%的“自苦”层数。若施展时自身离目标越近则治疗量越高并且消除的“自苦”层数越多，最多消除目标属于自身70%的“自苦”层数，并根据自身消除的“自苦”层数，对目标追加一段额外治疗><TALENT 34691 1 “银光照雪”命中目标后，将目标护盾值与目标气血上限比例的50%转化为同比例减伤，持续6秒。目标为队友时，转换的减伤效果提高。转化的减伤效果不超过80%><TALENT 38660 1 “银光照雪”在自身位置种下药草，延迟1.5秒后爆炸，对8尺内最多5个友方目标造成治疗。温性施展时，额外恢复目标5%气血；寒性施展时，范围内敌对侠士攻击力降低15%><TALENT 39661 1 “银光照雪”施展后将自身药性等量转换为另一种药性，转化过程不发生中和><TALENT 40192 1 “银光照雪”命中敌对目标后，判定目标当前护盾值与目标气血上限的比例，将其25%转化为同比例减伤，持续6秒><TALENT 40170 1 “银光照雪”伤害和治疗效果提高30%，施展后使自身移动速度提高30%，持续6秒>",
            "belong_key": "belong_28345"
        },
        "27536": {
            "name": "惊鸿掠水",
            "skills": [
                27539
            ],
            "desc": "冲刺至敌方目标身边，对目标造成<SUB 27539 0>毒性内功伤害，使其定身2秒，自身可以在10秒内施展二段招式“回风微澜”。<TALENT 28370 1 施展“惊鸿掠水”自身免疫控制效果，持续3秒，并使得下一个“含锋破月”“银光照雪”“飞叶满襟”会心几率提高10%，会心效果提高10%。施展“惊鸿掠水”命中15尺以外目标时，免疫控制效果提高至4秒><TALENT 28376 1 调息时间降低3秒，且不再占用基础调息时间，若命中运功目标，则打断目标运功，并回复自身15%内力值。><TALENT 28421 1 调息时间降低2秒，施展“惊鸿掠水”自身免疫控制效果，持续3秒><TALENT 28627 1 对目标区域6尺范围的最多6个敌对目标都造成一次定身效果和伤害效果，定身时间提高2秒。该伤害还会受到自身治疗量加成。获得3秒内额外施展一次“银光照雪”的机会><TALENT 28743 1 施展“惊鸿掠水”，重置自身“银光照雪”调息时间，并使下两个“银光照雪”会心几率提高30%，招式施展距离增加2尺><TALENT 28443 1 施展“惊鸿掠水”降低自身“紫叶沉疴”“苍棘缚地”1秒调息时间><TALENT 40121 1 “惊鸿掠水”施展后在目标位置种植蒲公英，在1秒后绽开，对周围15尺的最多3个敌对目标造成一次受到自身治疗量加成的伤害。每有一点药性，使命中的目标获得3%气血最大值的治疗吸收盾>",
            "belong_key": "belong_27536"
        },
        "27635": {
            "name": "含锋破月",
            "skills": [
                29505
            ],
            "desc": "对6尺120度最多5个目标用柳叶刀造成<SUB 29505 0>毒性内功伤害和僵直效果，命中附带自身“逆乱”效果的侠士目标，还将使其“逆乱”效果下两跳立即生效。并可施展二段招式“飞叶满襟”。<TALENT 29503 1 “含锋破月”、“飞叶满襟”造成伤害提高40%，命中“逆乱”效果的目标，每层再提高6%的伤害><TALENT 39661 1 >",
            "belong_key": "belong_27635"
        },
        "27637": {
            "name": "飞叶满襟",
            "skills": [
                29506
            ],
            "desc": "进一步对自身180度10尺最多5个目标造成<SUB 29506 0>毒性内功伤害和僵直效果，并使侠士目标“逆乱”效果下2跳立即生效。<TALENT 29503 1 “含锋破月”、“飞叶满襟”造成伤害提高40%，命中“逆乱”效果的目标，每层再提高6%的伤害> <TALENT 28461 1 “飞叶满襟”命中8层逆乱的侠士目标将使目标获得“荡襟”效果持续4秒，效果结束时使目标身上的所有[紫叶沉疴种子]生长并爆炸，每颗种子对目标造成<SUB 42444 1>毒性内功伤害。>",
            "belong_key": "belong_27637"
        },
        "27897": {
            "name": "绿野蔓生",
            "skills": [
                28430
            ],
            "desc": "解除自身控制，使用藤蔓种子，环绕自身形成藤蔓装甲，持续5秒，使得距离自身6尺内的敌对目标攻击自身时将被击退并对其造成<SUB 28430 1>毒性内功伤害，敌方无法通过对自身冲刺接近6尺(对区域的冲刺则不受影响)。藤蔓装甲持续期间和结束后2秒免疫控制(击退和被拉除外)。<TALENT 28716 1 处于自身“绿野蔓生”状态期间，自身6尺范围内最多3个团队成员不会重伤><TALENT 34692 1 施展后20秒内可施展二段技能，使自身获得“扶危”效果：下次施展“当归四逆”运功时间和治疗次数减半，“龙葵自苦”吸收50%血量受收到的伤害持续3秒，“青川濯莲”持续时间减半。以此法施展的招式，施展后返还70%调息时间，并消耗“扶危”效果><TALENT 34689 1 施展后20秒内可施展二段技能，使自身获得“持厄”效果：下次施展“川乌射罔”运功时间和伤害次数减半，“沾衣未妨”持续2.25秒造成3跳伤害，“苍棘缚地”持续时间减半。以此法施展的招式，施展后返还70%调息时间，并消耗“持厄”效果>",
            "belong_key": "belong_27897"
        },
        "28443": {
            "name": "甘遂",
            "desc": "施展“商陆缀寒”“惊鸿掠水”降低自身“紫叶沉疴”“苍棘缚地”1秒调息时间。",
            "belong_key": "belong_28443"
        },
        "28458": {
            "name": "炮阳",
            "desc": "自身在寒性状态下触发“无方中和”效果，使得目标移动速度降低20%，持续5秒，最多叠加4层。并会为其添加<NounID 68>,该效果每0.25秒最多生效1次",
            "belong_key": "belong_28458"
        },
        "28415": {
            "name": "荆障",
            "buffs": [
                21856
            ],
            "skills": [
                36068
            ],
            "desc": "“沾衣未妨”命中自身“苍棘缚地”后，使其攻击次数不变但攻击频率提高37.5%，造成伤害提高15%，造成的每次“无方中和”会使“苍棘缚地”额外吐出一阵毒雾对周围8尺范围造成<SUB 36068 0>伤害和0.5秒的定身效果。",
            "belong_key": "belong_28415"
        },
        "28461": {
            "name": "荡襟",
            "skills": [
                42444
            ],
            "desc": "“飞叶满襟”命中4层以上逆乱的侠士目标将使目标获得“荡襟”效果持续4秒，效果结束时使目标身上的所有<NounID 68>生长并爆炸，造成<SUB 42444 2>毒性内功伤害，目标身上每存在一颗<NounID 68>对目标额外造成<SUB 42444 1>毒性内功伤害。",
            "belong_key": "belong_28461"
        },
        "28344": {
            "name": "鸩羽",
            "recipes": [
                "recipe_2549_1"
            ],
            "desc": "“川乌射罔”会心几率提高10%，变为2层8秒充能招式。",
            "belong_key": "belong_28344"
        },
        "28376": {
            "name": "断泽",
            "recipes": [
                "recipe_2560_1",
                "recipe_5458_1",
                "recipe_5478_1"
            ],
            "desc": "“惊鸿掠水”调息时间降低3秒，且不再占用基础调息时间，若命中运功目标，则打断目标运功，并回复自身15%内力值。",
            "belong_key": "belong_28376"
        },
        "28375": {
            "name": "藏丛",
            "desc": "施展“且待时休”自身获得最大气血值10%的护盾，护盾存在期间自身免疫无法运功、缴械、打断效果，免疫击退、被拉效果，持续4秒。",
            "belong_key": "belong_28375"
        },
        "30507": {
            "name": "渌波",
            "recipes": [
                "recipe_5392_1"
            ],
            "desc": "“紫叶沉疴”不占用基础调息时间，“凌波飞叶令”套路伤害招式命中目标时都会为其添加<NounID 68>。",
            "belong_key": "belong_30507"
        },
        "40194": {
            "name": "六微",
            "skills": [
                40208
            ],
            "desc": "5点温性施展“商陆缀寒”无需运功且额外获得2点寒性，5点寒性施展“钩吻断肠”额外获得2点温性。以此方式对非侠士目标触发中和时额外造成毒性内功伤害。",
            "belong_key": "belong_40194"
        },
        "28406": {
            "name": "遍休",
            "skills": [
                28409
            ],
            "desc": "施展“且待时休”，自身“苍棘缚地”也会在原地施展“且待时休”，对周围15尺的4层以上“逆乱”的目标造成沉默和伤害效果。自身停止运功时，“苍棘缚地”也会停止释放“且待时休”。",
            "belong_key": "belong_28406"
        },
        "29503": {
            "name": "茎蹊",
            "recipes": [
                "recipe_2889_1",
                "recipe_2890_1"
            ],
            "buffs": [
                21610
            ],
            "desc": "“含锋破月”、“飞叶满襟”造成伤害提高40%，命中“逆乱”效果的目标，每层再提高6%的伤害。",
            "belong_key": "belong_29503"
        },
        "28405": {
            "name": "蔓蕊",
            "desc": "“千枝绽蕊”期间每累积受到相当于自身最大气血值20%的伤害，降低自身“绿野蔓生”“逐云寒蕊”1秒调息时间，该效果在切换至“千枝伏藏”后即清空计数。",
            "belong_key": "belong_28405"
        },
        "28419": {
            "name": "凄骨",
            "buffs": [
                30352
            ],
            "desc": "“千枝绽蕊”期间，自身造成伤害无视目标70%防御等级。",
            "belong_key": "belong_28419"
        },
        "32882": {
            "name": "肃羽",
            "desc": "“惊鸿掠水”变为目标点范围技，施展后自身5秒内下一个“苍棘缚地”无需运功。",
            "belong_key": "belong_32882"
        },
        "28485": {
            "name": "划云",
            "desc": "“含锋破月”“飞叶满襟”选中目标才可以施展，施展距离提高至16尺并附带冲刺效果，施展“含锋破月”自身免疫控制2.5秒（击退和拉除外）。",
            "belong_key": "belong_28485"
        },
        "28370": {
            "name": "逐鸿",
            "desc": "施展“惊鸿掠水”自身免疫控制效果，持续3秒，命中15尺以外目标时，免疫控制效果提高至4秒。",
            "belong_key": "belong_28370"
        },
        "38965": {
            "name": "紫伏",
            "recipes": [
                "recipe_5773_1"
            ],
            "skills": [
                28434
            ],
            "desc": "“紫叶沉疴”调息时间降低4秒且附带1点温性，不再使目标获得<NounID 68>，而是使自身获得“紫伏”效果持续16秒，期间自身每次触发中和效果都会对目标8尺区域的3个目标造成<SUB 28434 1>毒性内功伤害。",
            "belong_key": "belong_38965"
        },
        "38633": {
            "name": "沉绵",
            "skills": [
                38638
            ],
            "desc": "<NounID 68>吸收治疗量提高至4%，<NounID 68>存在期间，目标每次施展伤害招式都会对其自身造成<SUB 38638 1>伤害。每秒最多触发一次。",
            "belong_key": "belong_38633"
        },
        "28432": {
            "name": "疾根",
            "skills": [
                29674
            ],
            "desc": "“逆乱”增加1跳，“无方中和”作用在自身4层“逆乱”的目标上则额外附带<SUB 29674 1>毒性内功伤害。",
            "belong_key": "belong_28432"
        },
        "42500": {
            "name": "织翠",
            "skills": [
                28737
            ],
            "desc": "“千枝绽蕊”期间自身受到伤害的125%将会被储存起来，若储存值超过自身最大气血值的25%，则15秒内下一次对敌方目标施展“银光照雪”时会附带这段额外伤害（至多叠加4层）。",
            "belong_key": "belong_42500"
        },
        "36067": {
            "name": "香繁饮露",
            "desc": "两层充能招式，充能时间32秒。施展后，使自身获得10秒“香繁饮露”效果：移动速度提高25%，并使下次施展“且待时休”运功时间和伤害次数减半，“沾衣未妨”持续2.25秒造成3跳伤害，“川乌射罔”1.69秒内造成3跳伤害。以此法施展的招式，会获得原招式两倍的药性，并且施展后返还70%调息时间，并消耗“香繁饮露”效果。",
            "belong_key": "belong_36067"
        },
        "30016": {
            "name": "南草",
            "desc": "使得自身在空中向后飘荡一段距离，飘荡期间无法施展招式但每0.25秒回复1.5%最大气血值。招式处于调息期间时，自身移动速度提高35%。",
            "belong_key": "belong_30016"
        },
        "28436": {
            "name": "滞眠",
            "buffs": [
                20707
            ],
            "desc": "“且待时休”还会使作用目标无法施展轻功，运功每过1秒，“且待时休”伤害增加15%。",
            "belong_key": "belong_28436"
        },
        "30734": {
            "name": "折枝拂露",
            "skills": [
                30735,
                32922
            ],
            "desc": "视为“凌波飞叶令”套路招式，对周身8尺范围最多5个目标造成<SUB 30735 1>毒性内功伤害和僵直效果并添加1层“逆乱”，使“银光照雪”调息时间降低6秒。寒性状态下施展“折枝拂露”，在自身周围生成一个“沾衣未妨”，温性状态下施展“折枝拂露”，可以额外施展二段招式<NounID 69>。",
            "belong_key": "belong_30734"
        },
        "28426": {
            "name": "养荣",
            "buffs": [
                20699
            ],
            "skills": [
                36508
            ],
            "desc": "“千枝绽蕊”效果持续期间自身破防等级提高25%，无双等级提高25%，期间“川乌射罔”可在地面移动施展，命中非侠士目标回复10%最大内力值，完整运功“川乌射罔”对非侠士目标额外附带<SUB 36508 0>毒性内功伤害。",
            "belong_key": "belong_28426"
        },
        "28583": {
            "name": "并蒂夺株",
            "desc": "使得侠士目标获得不可卸除的“并蒂夺株·寒”，技能调息速度降低30%，持续12秒。同时在自身脚下生成一朵毒花，每秒对8尺区域内的敌对侠士目标添加“并蒂夺株·温”，使其造成伤害的25%的效果转化为对其自己的伤害。携带“并蒂夺株·寒”的目标获得“并蒂夺株·温”时两种毒会发生抵消，不受到“并蒂夺株·温”效果并使得“并蒂夺株·寒”持续时间降低4秒。",
            "belong_key": "belong_28583"
        },
        "38642": {
            "name": "息芷",
            "recipes": [
                "recipe_2571_1"
            ],
            "skills": [
                38641
            ],
            "desc": "“且待时休”调息时间减少5秒，施展后可对被“且待时休”影响的角色释放二段招式“息芷”，拉拽当前目标并造成<SUB 38641 0>毒性内功伤害。“且待时休”每命中一个目标，使其伤害增加25%。",
            "belong_key": "belong_38642"
        },
        "28533": {
            "name": "青圃着尘",
            "skills": [
                29441
            ],
            "desc": "被动效果：“凌波飞叶令”套路招式调息时间受到加速影响，每次施展获得2片“飞叶”效果。\\n主动效果：拥有12片“飞叶”可以施展，引导“飞叶”对目标及其周围10尺范围最多4个目标进行持续攻击。每片“飞叶”对范围内随机一个目标造成<SUB 29441 1>毒性内功伤害，当“飞叶”命中10尺外的目标时造成伤害提高至<SUB 29441 2>。“飞叶”连续命中同一目标时其后续伤害效果会衰减50%。",
            "belong_key": "belong_28533"
        },
        "29498": {
            "name": "灵荆",
            "desc": "“苍棘缚地”持续时间延长4秒，受到的伤害降低70%，造成的伤害提高70%，命中目标时使目标获得“逆乱”。",
            "belong_key": "belong_29498"
        },
        "28413": {
            "name": "相使",
            "buffs": [
                20680
            ],
            "desc": "“钩吻断肠”使得自身18秒内基础攻击力提高15%，期间自身“商陆缀寒”可以移动施展且运功时间降低0.25秒。",
            "belong_key": "belong_28413"
        },
        "28420": {
            "name": "熟地",
            "recipes": [
                "recipe_2570_1"
            ],
            "desc": "“商陆缀寒”运功时间降低0.5秒，成功施展后使得自身基础调息时间降低0.5秒。",
            "belong_key": "belong_28420"
        },
        "28439": {
            "name": "渐苞",
            "skills": [
                29720
            ],
            "desc": "<NounID 68>成长时，会将目标身上的“逆乱”一半的层数扩散给10尺范围的其他最多5个目标，并对目标及扩散波及的目标附带额外<SUB 29720 1>毒性内功伤害。",
            "belong_key": "belong_28439"
        },
        "28365": {
            "name": "岚因",
            "recipes": [
                "recipe_2555_1",
                "recipe_2856_1"
            ],
            "desc": "“沾衣未妨”伤害提高10%，命中人数提高2个，每跳使得目标有50%几率获得“逆乱”效果。若目标身上属于自身的“逆乱”层数低于4层则几率提高到100%。",
            "belong_key": "belong_28365"
        },
        "34796": {
            "name": "蓬茸",
            "desc": "“且待时休”运功期间每跳为目标添加<NounID 68>。",
            "belong_key": "belong_34796"
        },
        "28731": {
            "name": "燕徊",
            "desc": "“凌然天风”期间自身免疫无法运功、缴械、打断效果，每跳跃一次回复1%内力值。",
            "belong_key": "belong_28731"
        },
        "39661": {
            "name": "逆势",
            "recipes": [
                "recipe_5905_1"
            ],
            "desc": "“银光照雪”调息时间降低4秒，施展后将自身药性等量转换为另一种药性，转化过程不发生中和。",
            "belong_key": "belong_39661"
        },
        "28367": {
            "name": "令芷",
            "desc": "“沾衣未妨”命中附带自身的4层及以上“逆乱”效果的目标将立即造成2秒定身效果。",
            "belong_key": "belong_28367"
        },
        "40192": {
            "name": "沃雪",
            "recipes": [
                "recipe_2562_1"
            ],
            "desc": "“银光照雪”调息时间增加4秒，命中敌对目标后，判定目标当前护盾值与目标气血上限的比例，将其30%转化为同比例减伤，持续6秒。",
            "belong_key": "belong_40192"
        },
        "28343": {
            "name": "淮茵",
            "desc": "“逆乱”效果每层使得自身每跳回复0.05%内力值。",
            "belong_key": "belong_28343"
        },
        "37354": {
            "name": "逐岚",
            "skills": [
                37353
            ],
            "desc": "在自身“沾衣未妨”中施展“银光照雪”时会以扇形扩散一片毒雾，使目标获得3层“逆乱”并造成一次“沾衣未妨”伤害。",
            "belong_key": "belong_37354"
        }
    },
    "10756": {
        "35695": {
            "name": "引风唤灵",
            "recipes": [
                "recipe_5395_1",
                "recipe_5454_1",
                "recipe_5455_1",
                "recipe_5456_1",
                "recipe_5464_1"
            ],
            "buffs": [
                26857
            ],
            "skills": [
                36111,
                36056,
                36057,
                36112,
                36113,
                36114
            ],
            "desc": "按照“召唤序列”中的顺序依次召唤偕行动物，攻击范围为25尺，若在战斗中可获得“唤灵印”。召唤出的偕行动物附带一层“承契”效果，使其造成伤害提升4%，仇恨值降低8%。回复30%内力值。<TALENT 35746 1 “强击型”为即将召唤的三个“偕行动物”之一时，“偕行动物”攻击都会使目标获得一层减疗效果><TALENT 35747 1 施展“引风唤灵”时，自身获得6秒15%最大气血值护盾，若被打破则回复5%内力><TALENT 35734 1 召唤“飞行型”偕行动物后，10秒内自身周围10尺内三名敌方玩家，对自身以及自身小队成员隐身效果失效><TALENT 35744 1 “偕行动物”造成伤害时使目标获得两层“贯穿”><TALENT 35733 1 施展“引风唤灵”时，自身获得一层“承契”。召唤兽和自身在“承契”期间基础攻击力提高10%，无视目标20%外功防御><TALENT 35739 1 对目标造成“贯穿”效果后，使目标在“贯穿”期间造成伤害的8%转化为对其自身伤害><TALENT 35725 1 主动施展“引风唤灵”召唤的“偕行动物”对目标造成伤害时回复15%内力>",
            "belong_key": "belong_35695"
        },
        "10756": {
            "name": "山海心诀",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "agility_to_physical_attack_power": 1731,
                "agility_to_physical_critical_strike": 696,
                "max_life_gain": 245,
                "physical_critical_strike_base": 9025,
                "physical_attack_power_base": 6187,
                "pve_addition_base": 246
            },
            "recipes": [
                "recipe_1711_1",
                "recipe_716_2",
                "recipe_717_2"
            ],
            "dots": {
                "26856": [
                    35771
                ]
            },
            "skills": [
                35894,
                36177,
                36157,
                36579,
                36580
            ],
            "desc": "万灵山庄善使弓箭，精通射术，信奉万物有灵，人族应与万生万灵相互守望，习武的意义在于守护，守护自己、守护同伴、守护家园。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10756"
        },
        "35659": {
            "name": "劲风簇",
            "recipes": [
                "recipe_5394_1",
                "recipe_5407_1",
                "recipe_5408_1",
                "recipe_5409_1",
                "recipe_5427_1",
                "recipe_5428_1",
                "recipe_5429_1"
            ],
            "skills": [
                35866
            ],
            "desc": "消耗1枚箭矢。对目标立刻造成<SUB 35866 0>外功伤害，造成100%武器伤害。并使自身基础调息时间降低0.5秒。<TALENT 35714 1 “劲风簇”会心几率提高10%，会心效果提高10%><TALENT 35728 1 “空弦惊雁”后下一次“劲风簇”若命中运功目标则击退目标，若成功击退则使目标获得5秒“沃焦”效果：招式施展距离变为0尺，无法看到其他目标>",
            "belong_key": "belong_35659"
        },
        "35660": {
            "name": "霖集簇",
            "recipes": [
                "recipe_5410_1",
                "recipe_5411_1",
                "recipe_5412_1",
                "recipe_5413_1",
                "recipe_5430_1",
                "recipe_5431_1",
                "recipe_5432_1",
                "recipe_5433_1",
                "recipe_5443_1"
            ],
            "skills": [
                36004
            ],
            "desc": "消耗4枚箭矢。对面前扇形范围至多4个目标造成<SUB 36004 0>伤害，造成100%武器伤害。使目标8秒内获得“霖集”效果。该招式无法对建筑物造成伤害。<TALENT 35738 1 “霖集簇”命中“贯穿”目标时，记录最高的层数，“霖集簇”的强化招式“流矢雨集”使命中目标获得对应层数的“贯穿”><TALENT 35723 1 “霖集簇”调息时间减少5秒，“流矢雨集”使目标额外获得两层“标鹄”><TALENT 38865 1 “霖集簇”对没有“标鹄”“贯穿”的目标造成伤害时，使目标获得4层“贯穿”，4层“标鹄”><TALENT 40239 1 “霖集簇”、“流矢雨集”命中后会标记目标至多6层持续15秒的“狩印”，“乘黄”和“偕行动物”造成伤害时会引爆一层“狩猎标记”并且造成一次额外伤害>",
            "belong_key": "belong_35660"
        },
        "35661": {
            "name": "饮羽簇",
            "recipes": [
                "recipe_5406_1",
                "recipe_5414_1",
                "recipe_5415_1",
                "recipe_5416_1",
                "recipe_5417_1",
                "recipe_5418_1",
                "recipe_5419_1",
                "recipe_5434_1"
            ],
            "skills": [
                39092
            ],
            "desc": "运功2秒后，对目标范围7尺至多5个目标造成一次<SUB 39092 0>外功伤害，造成200%武器伤害。消耗1枚箭矢。<TALENT 35731 1 “饮羽簇”命中4层以上“贯穿”目标时，使没有“重创”的目标获得一层“重创”效果><TALENT 35751 1 “饮羽簇”无视目标65%外功防御，施展“金乌见坠”后下次施展“饮羽簇”无需运功，持续10秒>",
            "belong_key": "belong_35661"
        },
        "35685": {
            "name": "归平野",
            "skills": [
                36022,
                36023
            ],
            "desc": "立刻对目标造成一次伤害，一段时间内可操作自身释放一次强化的平射。",
            "belong_key": "belong_35685"
        },
        "35686": {
            "name": "汇山岚",
            "skills": [
                36024
            ],
            "desc": "眩晕8尺范围的5个目标4秒，并造成伤害，一段时间内可操作自身释放“没石饮羽”。<TALENT 35730 1 “汇山岚”不再造成眩晕而是恐惧，施展“汇山岚”后玩家的追击范围会增大2尺><TALENT 35762 1  释放“聚长川”、“汇山岚”会使下一次“归平野”伤害提高100%>",
            "belong_key": "belong_35686"
        },
        "35761": {
            "name": "朱厌",
            "recipes": [
                "recipe_5379_1"
            ],
            "desc": "“弛律召野”调息时间增加20秒，一次召唤三只“偕行动物”。",
            "belong_key": "belong_35761"
        },
        "35762": {
            "name": "祝灵",
            "recipes": [
                "recipe_5376_1"
            ],
            "buffs": [
                27116
            ],
            "desc": "“汇山岚”变为15秒两层充能招式。释放“聚长川”、“汇山岚”会使下一次“归平野”伤害提高50%。",
            "belong_key": "belong_35762"
        },
        "40240": {
            "name": "聚势摧霆",
            "skills": [
                40347
            ],
            "desc": "蓄力每0.375秒使释放时候增加一支箭矢，松开后立刻回复10%内力值并释放全部蓄力箭矢迅速攻击目标，造成伤害并使目标获得标鹄，对非侠士目标造成伤害提高300%，最多蓄力3秒。蓄力期间每跳会消耗箭袋的一支箭，增强释放时的额外伤害并使目标获得一层“贯穿”。<TALENT 42467 1 >",
            "belong_key": "belong_40240"
        },
        "42468": {
            "name": "佑主",
            "attributes": {
                "max_life_gain": -307
            },
            "desc": "自身最大气血值降低30%,施展“游雾乘云”、“澄神醒梦”时，获得 <NounID 98>。",
            "belong_key": "belong_42468"
        },
        "42486": {
            "name": "行危",
            "desc": "施展“澄神醒梦”3秒内施展“应天授命”返还“应天授命”10秒调息时间。",
            "belong_key": "belong_42486"
        },
        "35748": {
            "name": "兴游",
            "recipes": [
                "recipe_5500_1"
            ],
            "desc": "施展“汇灵合契”需求的“唤灵印”减少一个。“引风唤灵”调息时间增加4.5秒。",
            "belong_key": "belong_35748"
        },
        "38866": {
            "name": "通灵",
            "desc": "“汇灵合契”消耗唤灵印超过施展要求数时，每超过一个则“汇灵合契”状态持续时间增加6秒，并延长自身6秒承契。",
            "belong_key": "belong_38866"
        },
        "35757": {
            "name": "贯侯",
            "recipes": [
                "recipe_5422_1"
            ],
            "desc": "“标鹄”引爆时额外使目标获得一层“标鹄”，引爆伤害对非侠士目标提高33%。",
            "belong_key": "belong_35757"
        },
        "35721": {
            "name": "襄尺",
            "desc": "“承契”层数为5层且剩余时间大于等于8秒时，若再次获得“承契”效果则降低“金乌见坠”3秒调息时间。",
            "belong_key": "belong_35721"
        },
        "35724": {
            "name": "弋矰",
            "desc": "“上弦星流术”套路招式命中背对自身目标时，使目标获得2秒“弋矰”：无法施展轻功效果。",
            "belong_key": "belong_35724"
        },
        "35727": {
            "name": "蓄锐",
            "desc": "战斗中若4秒内未释放伤害招式则获得“承契”效果，回复10%内力值。",
            "belong_key": "belong_35727"
        },
        "38664": {
            "name": "虚彀",
            "desc": "附带“空弦惊雁”效果的箭矢命中未被定身、眩晕、击倒的目标时，直接使目标获得3秒定身效果。",
            "belong_key": "belong_38664"
        },
        "35719": {
            "name": "孰湖",
            "desc": "“偕行动物”出现时额外获得一层“承契”。",
            "belong_key": "belong_35719"
        },
        "35722": {
            "name": "冉遗",
            "desc": "施展“应天授命”卸除一个持续伤害不利效果，期间受治疗效果提高20%。",
            "belong_key": "belong_35722"
        },
        "42467": {
            "name": "连珠",
            "recipes": [
                "recipe_6085_1"
            ],
            "buffs": [
                31940
            ],
            "desc": "“聚势摧霆”不再充能，调息时间降低3秒，成功施展后使自身获得1层“承契”，命中目标后使目标添加“连珠”持续18秒，最多两层，每层“连珠”期间受到自身的“标鹄”提高20%。<TALENT_CORE 40240 1>",
            "belong_key": "belong_42467"
        },
        "35726": {
            "name": "射革",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "desc": "对锁足、定身、眩晕、击倒目标造成伤害提高15%。",
            "belong_key": "belong_35726"
        },
        "35743": {
            "name": "时祯",
            "desc": "“汇灵合契”状态结束后，自身获得2秒“澄神醒梦”和“应天授命”效果。",
            "belong_key": "belong_35743"
        },
        "35736": {
            "name": "桑柘",
            "desc": "“贯穿”增加一跳，“标鹄”引爆时额外增加一层“贯穿”。",
            "belong_key": "belong_35736"
        },
        "35759": {
            "name": "审固",
            "desc": "使6层以上目标获得“贯穿”时，不再刷新持续时间，而是延长4秒“贯穿”的持续时间，对目标同一次“贯穿”状态最多可触发2次。",
            "belong_key": "belong_35759"
        },
        "42470": {
            "name": "信诺",
            "desc": "“乘黄之威”护盾值提高50%。<TALENT_CORE 42468 1>",
            "belong_key": "belong_42470"
        },
        "35733": {
            "name": "诸怀",
            "buffs": [
                27099
            ],
            "desc": "施展“引风唤灵”时，自身获得一层“承契”。召唤兽和自身在“承契”期间基础攻击力提高10%，无视目标20%外功防御。",
            "belong_key": "belong_35733"
        },
        "36449": {
            "name": "片羽",
            "desc": "“风尽浮生”一段冲刺过程中，重置“白羽流星”并激活“没石饮羽”。",
            "belong_key": "belong_36449"
        },
        "35730": {
            "name": "祓厄",
            "recipes": [
                "recipe_6234_1"
            ],
            "desc": "“汇山岚”作用目标数降低2个，不再造成眩晕而是3秒恐惧，施展“汇山岚”后玩家的追击范围会增大2尺。",
            "belong_key": "belong_35730"
        },
        "35763": {
            "name": "星烨",
            "buffs": [
                26952
            ],
            "desc": "“游雾乘云”需要2枚“唤灵印”方可施展，施展后清空全部“唤灵印”并重置调息时间，使当前全部箭矢获得“空弦惊雁”效果。期间“劲风簇”造成伤害提高150%。",
            "belong_key": "belong_35763"
        },
        "35765": {
            "name": "白虹贯日",
            "skills": [
                36173
            ],
            "desc": "蓄力2秒射出40尺的超远一箭，蓄力期间免疫控制效果，使被攻击的目标获得“贯穿”效果，初始为一层，每蓄力0.5秒增加一层“贯穿”效果，最多四层。",
            "belong_key": "belong_35765"
        },
        "35751": {
            "name": "佩弦",
            "recipes": [
                "recipe_5748_1"
            ],
            "desc": "“饮羽簇”无视目标65%外功防御，施展“金乌见坠”后下次施展“饮羽簇”无需运功，持续10秒。",
            "belong_key": "belong_35751"
        },
        "42469": {
            "name": "灼心",
            "desc": "“乘黄之威”存在期间，上弦星流术全部升级为对应的“白羽流星”强化招式。<TALENT_CORE 42468 1>",
            "belong_key": "belong_42469"
        },
        "35760": {
            "name": "祛邪",
            "desc": "释放“汇灵合契”时，补充箭袋至八枚，使当前全部箭矢获得“金乌见坠”、“空弦惊雁”。",
            "belong_key": "belong_35760"
        },
        "35729": {
            "name": "鹿蜀",
            "desc": "“偕行动物”离场时，自身获得“偕行动物”的“承契”。",
            "belong_key": "belong_35729"
        },
        "40238": {
            "name": "偕极",
            "recipes": [
                "recipe_6084_1"
            ],
            "desc": "“归平野”伤害提高20%，“汇灵合契”期间“归平野”冲刺次数无上限，“白羽流星”无调息时间。",
            "belong_key": "belong_40238"
        },
        "35731": {
            "name": "反曲",
            "desc": "“饮羽簇”命中4层以上“贯穿”目标时，使没有<NounID 75>的目标获得一层<NounID 75>效果。",
            "belong_key": "belong_35731"
        },
        "35732": {
            "name": "腾驾",
            "recipes": [
                "recipe_5378_1"
            ],
            "desc": "“游雾乘云”状态下施展“腾云”不再立刻解除骑乘，“腾云”变为两重充能招式。",
            "belong_key": "belong_35732"
        },
        "35728": {
            "name": "沃焦",
            "desc": "“空弦惊雁”后20秒内下一次“劲风簇”若命中运功目标则使目标获得5秒“沃焦”效果：招式施展距离变为0尺，无法看到其他目标。(该招式视为沉默效果)",
            "belong_key": "belong_35728"
        },
        "35742": {
            "name": "领胡",
            "recipes": [
                "recipe_5397_1"
            ],
            "buffs": [
                27133
            ],
            "desc": "“弛律召野”调息时间降低10秒，“偕行动物”造成伤害提高30%。",
            "belong_key": "belong_35742"
        },
        "35756": {
            "name": "命俦",
            "desc": "“弛律召野”将会额外召唤强击型“偕行动物”助战持续15秒。协同动物会每3秒出现一次并打击“弛律召野”的释放目标，直到释放一次白羽流星，协同动物便会转换打击目标为白羽流星的目标。",
            "belong_key": "belong_35756"
        },
        "35745": {
            "name": "卢令",
            "attributes": {
                "agility_gain": 102,
                "strain_gain": 102
            },
            "desc": "身法提高10%，无双等级提高10%，内力回复提高20%。",
            "belong_key": "belong_35745"
        },
        "35737": {
            "name": "于狩",
            "skills": [
                40717
            ],
            "desc": "施展“没石饮羽”时获得一层“承契”。施展“没石饮羽”时若箭袋内箭矢数量为3-5，则引爆命中的非侠士造成1次额外伤害。",
            "belong_key": "belong_35737"
        },
        "40239": {
            "name": "狩印",
            "skills": [
                40329
            ],
            "desc": "“霖集簇”、“流矢雨集”命中后会标记目标至多6层持续15秒的“狩印”，“乘黄”和“偕行动物”造成伤害时会引爆一层“狩猎标记”并且造成一次额外伤害。",
            "belong_key": "belong_40239"
        },
        "42471": {
            "name": "随袭",
            "buffs": [
                32136
            ],
            "desc": "“乘黄之威”期间自身会心会效提高5%，触发“标鹄”后若目标为侠士且气血值低于10%则“乘黄”对其发动一次造成目标10%最大气血值的<NounID 101>。<TALENT_CORE 42468 1>",
            "belong_key": "belong_42471"
        },
        "35740": {
            "name": "同渡",
            "desc": "“汇灵合契”期间，受治疗效果增加15%。对你释放治疗招式的治疗心法获得5秒“同渡”效果：招式施展距离增加20%，移动速度提高20%。",
            "belong_key": "belong_35740"
        }
    },
    "10698": {
        "10698": {
            "name": "孤锋诀",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2850,
                "pve_addition_base": 154,
                "strength_to_physical_attack_power": 1843,
                "strength_to_physical_critical_strike": 287,
                "max_life_gain": 245,
                "physical_attack_power_base": 6318,
                "physical_critical_strike_base": 8546
            },
            "buffs": [
                24752
            ],
            "skills": [
                32974,
                32975,
                33239
            ],
            "desc": "骤风疾雨鞘中鸣，孤锋断浪遏流云，刀宗绝学孤锋诀杀伐凌厉，首重实战，配合独特的身法与擒拿之术，攻守一体，一击破敌。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_10698"
        },
        "32419": {
            "name": "灭影追风",
            "recipes": [
                "recipe_6169_1"
            ],
            "buffs": [
                24168
            ],
            "desc": "主动效果：使自身外功破防等级提高10%，会心及会心效果提高10%，化劲等级降低6%，产生的威胁值降低70%，持续12秒。\\n\\n被动效果：给有自身“破绽”的目标添加“灭影”效果。\\n\\n灭影：有自身破绽的目标对自身伤害降低，每1层破绽降低6%，最多24%。<TALENT 32492 1 不再降低化劲，期间施展“行云势”只会触发第三段效果，若命中侠士目标则立刻恢复自身5%气血最大值><TALENT 33027 1 施展后立刻进入“双手持武器”状态，且2秒内下一次施展“孤锋破浪”不会回到“单持武器”状态><TALENT 32587 1 结束时若自身未重伤，则会将受到的伤害转换为伤害吸收盾，持续6秒><TALENT 32499 1 施展同时清除自身“观风寻隙”间隔时间><TALENT 32497 1 >",
            "belong_key": "belong_32419"
        },
        "32144": {
            "name": "横云断浪",
            "recipes": [
                "recipe_3055_1",
                "recipe_3056_1",
                "recipe_3057_1",
                "recipe_3058_1",
                "recipe_3217_1",
                "recipe_3218_1"
            ],
            "dots": {
                "24132": [
                    32369,
                    32370,
                    32371,
                    32372
                ]
            },
            "skills": [
                32234
            ],
            "desc": "对目标造成300%的武器伤害外加<SUB 32234 0>外功伤害将其眩晕3秒，命中拥有自身“破绽”的目标，每层“破绽”则会给目标添加1层持续6秒的“流血”效果，“流血”效果最多叠加4层。<TALENT 32610 1 命中目标获得生命值15%的伤害吸收盾，持续5秒。若目标有伤害吸收盾，获得的盾量翻倍><TALENT 32511 1 调息时间降低3秒，附带“流血”效果持续时间提高12秒><TALENT 32513 1 每层流血伤害额外提高10%。若有该“流血”的敌对目标在该效果持续期间释放过伤害招式，则会在“流血”结束时叠加与其当前“破绽”相等层数的“流血”效果>",
            "belong_key": "belong_32144"
        },
        "32132": {
            "name": "行云势",
            "recipes": [
                "recipe_2992_1",
                "recipe_3040_1",
                "recipe_3041_1",
                "recipe_3042_1",
                "recipe_3111_1",
                "recipe_3112_1",
                "recipe_3144_1"
            ],
            "skills": [
                32149,
                32150,
                32151
            ],
            "desc": "可连续施展，触发三段伤害，每段均使自身获得5点“锐意”\\n第一段：对目标造成100%的武器伤害外加<SUB 32149 0>外功伤害。\\n第二段：对目标造成150%的武器伤害外加<SUB 32150 0>外功伤害。\\n第三段：对目标造成200%的武器伤害外加<SUB 32151 0>外功伤害。<TALENT 32609 1 命中目标额外获得2点“锐意”><TALENT 32449 1 伤害提高10%><TALENT 32450 1 会心提高10%，会心效果提高10%><TALENT 42060 1 ><TALENT 32492 1 >",
            "belong_key": "belong_32132"
        },
        "32133": {
            "name": "停云势",
            "recipes": [
                "recipe_3043_1",
                "recipe_3044_1",
                "recipe_3045_1",
                "recipe_3046_1",
                "recipe_3108_1",
                "recipe_3113_1",
                "recipe_3114_1"
            ],
            "skills": [
                32153
            ],
            "desc": "对目标造成200%的武器伤害外加<SUB 32153 0>外功伤害将其定身3秒，并使自身获得10点“锐意”。<TALENT 32609 1 命中目标额外获得10点“锐意”><TALENT 32579 1 命中目标则使其受到的治疗及获得的护盾效果降低50%，持续6秒><TALENT 34688 1 命中目标后刷新目标身上属于自身的“横云断浪”流血效果>",
            "belong_key": "belong_32133"
        },
        "32134": {
            "name": "决云势",
            "recipes": [
                "recipe_3135_1",
                "recipe_3136_1",
                "recipe_3137_1",
                "recipe_3138_1",
                "recipe_3139_1",
                "recipe_3140_1"
            ],
            "skills": [
                32154
            ],
            "desc": "充能3层，冲向目标，对目标造成<SUB 32154 0>外功伤害，并获得20点锐意，命中有“破绽”的目标时，根据“破绽”层数降低“决云势”4秒调息时间，最多降低8秒，击破“弱点”时调息时间降低4秒。该招式可以在“驰风八步”后撤过程中施展。<TALENT 32455 1 命中目标后根据其持有的自身“破绽”层数使其无法施展轻功，最多4秒><TALENT 36035 1 命中后自身获得5秒“潋风”气劲，期间主动施展“流云势法”套路伤害招式命中目标会额外获得20点锐意，并额外触发<SUB 36118 1>外功伤害><TALENT 32464 1 对有自身“破绽”的目标施展，使自身移动速度提高30%，持续4秒>",
            "belong_key": "belong_32134"
        },
        "32135": {
            "name": "断云势",
            "recipes": [
                "recipe_3047_1",
                "recipe_3048_1",
                "recipe_3049_1",
                "recipe_3050_1",
                "recipe_3109_1",
                "recipe_3115_1",
                "recipe_3212_1"
            ],
            "skills": [
                32167,
                32348
            ],
            "desc": "需要100点“锐意”方可施展，自身改变为“双持武器”状态，对前方4尺范围内1个敌对目标造成200%的武器伤害外加<SUB 32167 0>外功伤害，若目标血量高于70%则额外造成<SUB 32348 0>外功伤害。<TALENT 32457 1 目标每拥有一层破绽，“断云势”对其伤害提高12%>",
            "belong_key": "belong_32135"
        },
        "32175": {
            "name": "望云势",
            "recipes": [
                "recipe_3103_1",
                "recipe_3104_1",
                "recipe_3116_1",
                "recipe_3117_1",
                "recipe_3118_1",
                "recipe_3119_1",
                "recipe_5948_1"
            ],
            "skills": [
                32178
            ],
            "desc": "标记目标6秒，受到标记目标攻击时将立刻反击（需目标处于面向中且6尺范围内），造成200%的武器伤害外加<SUB 32178 3>外功伤害，反击每1秒最多触发一次。<TALENT 32581 1 “凝云势·破锋”打出高额伤害则给目标添加一层破绽><TALENT 32452 1 “望云势”反击触发时间降低0.75秒，反击时不再需要目标，且会对6尺内3个敌对目标造成伤害><TALENT 32452 1 >",
            "belong_key": "belong_32175"
        },
        "32141": {
            "name": "驰风八步",
            "skills": [
                32357
            ],
            "desc": "向前冲刺25尺，并对路径上的3个敌对目标造成<SUB 32358 0>外功伤害。<TALENT 32613 1 变为充能招式，施展后自身御劲提高100%，持续4秒>",
            "belong_key": "belong_32141"
        },
        "31862": {
            "name": "观风寻隙",
            "skills": [
                32510,
                40358,
                40828
            ],
            "desc": "当前选择的目标若距离自身40尺以内，且自身和目标都处于战斗状态，刀宗会观察到目标弱点，伤害招式（门派轻功除外）击中弱点则对其造成<SUB 40358 1>外功伤害和一段破招伤害，并添加“破绽”。\\n\\n弱点：刀宗每10秒可察觉到随机分布在目标左右两侧的1个弱点，持续20秒。\\n\\n破绽：持续60秒，持续时间到只会移除一层，伤害招式命中具有自身“破绽”的目标，每层使其有25%几率受到额外<SUB 32510 1>外功伤害，“破绽”最多叠加4层。<TALENT 32500 1 “破绽”最大可叠加至6层><TALENT 32509 1 “破绽”叠加的层数越多，目标受到的额外伤害越高><TALENT 32459 1 每次击破“弱点”，对应目标化劲等级降低5%，自身化劲等级提高5%，可叠加2层，持续15秒><TALENT 32580 1 “双手持刀”时，察觉到目标弱点可使自身伤害提高3%，最多9%，持续15秒><TALENT 32497 1 击破弱点后使自身伤害提高15%，持续3秒><TALENT 32458 1 现在每次会发现目标两个弱点><TALENT 32608 1 击破侠士目标弱点后额外获得30点锐意><TALENT 32611 1 每次击破“弱点”，降低“洗兵雨”1秒调息时间，“触石雨”2秒调息时间><TALENT 42035 1 >",
            "belong_key": "belong_31862"
        },
        "32601": {
            "name": "沧浪三叠",
            "recipes": [
                "recipe_3051_1",
                "recipe_3052_1",
                "recipe_3053_1",
                "recipe_3054_1",
                "recipe_3127_1",
                "recipe_3128_1"
            ],
            "skills": [
                32602,
                32603,
                32604
            ],
            "desc": "可连续施展，触发三段伤害。\\n第一段：对目标及其周围6尺内的5个敌对目标造成200%的武器伤害外加<SUB 32602 0>外功伤害。\\n第二段：对目标及其周围6尺内的5个敌对目标造成250%的武器伤害外加<SUB 32603 0>外功伤害。\\n第三段：对目标及其周围6尺内的5个敌对目标造成300%的武器伤害外加<SUB 32604 0>外功伤害。<TALENT 32490 1 每段会心递增10%，会心效果递增10%><TALENT 32508 1 每次命中非侠士目标会给其添加1层“长溯”效果，“孤锋破浪”命中有“长溯”的目标，每层“长溯”将额外造成一次“孤锋破浪”伤害，“长溯”持续30秒，最多叠加3层><TALENT 32502 1 >",
            "belong_key": "belong_32601"
        },
        "32145": {
            "name": "孤锋破浪",
            "recipes": [
                "recipe_3059_1",
                "recipe_3060_1",
                "recipe_3061_1",
                "recipe_3062_1"
            ],
            "skills": [
                32235,
                32236,
                32237,
                32238,
                32239,
                33146
            ],
            "desc": "对周围6尺4个敌对目标造成300%的武器伤害外加<SUB 32235 0>外功伤害且无视目标侠士10%减伤效果，还将造成一次破招伤害，命中拥有自身“破绽”的目标，每层“破绽”额外无视目标3%减伤效果，施展后立刻切换至“流云势法”套路。<TALENT 32586 1 施展“孤锋破浪”后将在前方4尺残留6秒斩击刀气，刀气快速向前移动，每0.5秒对半径8尺内的15个敌对目标造成<SUB 32591 1>外功伤害，并添加12秒持续伤害效果，累计攻击20个目标，则刀气被引爆，对半径10尺内10个目标造成<SUB 32591 2>外功伤害，若目标为侠士，则使其下8秒内受到的范围型招式伤害提高35%，刀气每重伤一名敌人，自身则获得35点锐意，该刀气只会存在一道><TALENT 32512 1 施展后会在原地残留刀气，2秒后会引爆刀气对6尺范围内最多5个目标造成<SUB 34695 1>外功伤害。命中侠士目标后，使其体质降低10%><TALENT 32500 1 命中有自身6层“破绽”的目标时，额外造成1次无视化劲的外攻伤害><TALENT 33027 1 >",
            "belong_key": "belong_32145"
        },
        "32146": {
            "name": "留客雨",
            "recipes": [
                "recipe_3063_1",
                "recipe_3064_1",
                "recipe_3065_1",
                "recipe_3066_1",
                "recipe_3141_1",
                "recipe_3142_1",
                "recipe_3143_1",
                "recipe_3184_1"
            ],
            "skills": [
                32246
            ],
            "desc": "对目标造成100%的武器伤害外加<SUB 32246 0>外功伤害，并降目标40%移动速度，同时降低自身1秒“流云势法”套路基础调息时间。<TALENT 32451 1 命中有自身破绽的目标，有40%几率造成4秒锁足效果，每层破绽使概率增加10%><TALENT 32456 1 施展“留客雨”后下一个“停云势”或“行云势”招式伤害提高15%><TALENT 34688 1 命中目标后刷新目标身上属于自身的“横云断浪”流血效果>",
            "belong_key": "belong_32146"
        },
        "32148": {
            "name": "触石雨",
            "recipes": [
                "recipe_3129_1",
                "recipe_3130_1",
                "recipe_3132_1",
                "recipe_3133_1",
                "recipe_3134_1"
            ],
            "skills": [
                32766
            ],
            "desc": "尝试冲向目标，对目标造成<SUB 32766 1>外功伤害并使其2秒内无法施展轻功，若目标未被击倒且没有免控效果则将其抱摔击倒5秒；若冲刺结束没有命中目标，且目标距离自身15尺内，则会再对该目标进行一次冲刺。该招式可在“驰风八步”后撤过程中施展。<TALENT 32495 1 命中已经被击倒的目标伤害提高60%，并击倒周围6尺内的3个目标><TALENT 32611 1 >",
            "belong_key": "belong_32148"
        },
        "32458": {
            "name": "簇尘",
            "desc": "“观风寻隙”现在每次会发现目标两个弱点。",
            "belong_key": "belong_32458"
        },
        "32498": {
            "name": "碣石",
            "desc": "“游风飘踪”效果期间受到的伤害降低15%，施展时对有自身破绽目标造成5秒击倒。",
            "belong_key": "belong_32498"
        },
        "42035": {
            "name": "贯霆",
            "skills": [
                42036
            ],
            "desc": "伤害招式击破侠士“弱点”时，击破伤害提高200%。",
            "belong_key": "belong_42035"
        },
        "32500": {
            "name": "承磊",
            "skills": [
                32891,
                32892,
                40645
            ],
            "desc": "“破绽”最大可叠加至6层。“孤锋破浪”命中有自身6层“破绽”的目标时，额外造成1次无视目标80%化劲的外功伤害。",
            "belong_key": "belong_32500"
        },
        "32580": {
            "name": "戗风",
            "recipes": [
                "recipe_5584_1",
                "recipe_5585_1",
                "recipe_5586_1"
            ],
            "buffs": [
                30304
            ],
            "desc": "“破浪三式”套路招式伤害提高10%，击破目标弱点可使自身伤害提高5%，最多10%，持续15秒。",
            "belong_key": "belong_32580"
        },
        "33027": {
            "name": "威声",
            "buffs": [
                24554
            ],
            "desc": "“孤锋破浪”命中侠士目标后，使其体质降低10%。施展“灭影追风”2秒内下一次施展“孤锋破浪”不会回到“单持武器”状态。",
            "belong_key": "belong_33027"
        },
        "32492": {
            "name": "电逝",
            "buffs": [
                24553
            ],
            "desc": "“灭影追风”不再降低化劲，期间施展“行云势”只会触发第三段效果，若命中侠士目标则立刻恢复自身5%气血最大值。",
            "belong_key": "belong_32492"
        },
        "32588": {
            "name": "颂阵",
            "recipes": [
                "recipe_3219_1"
            ],
            "buffs": [
                24236
            ],
            "desc": "“洗兵雨”施展距离提高2尺。可以拾取目标被自身击落的武器，捡起对方武器后，对方受到的缴械时间增加2秒，自身6秒内攻击力提高60%。",
            "belong_key": "belong_32588"
        },
        "32502": {
            "name": "滔天",
            "skills": [
                32359,
                32360,
                32361
            ],
            "desc": "“沧浪三叠”变为单体招式，伤害降低9%，对拥有自身“破绽”的目标施展时将立刻打出三段效果，但将消耗目标一层破绽。",
            "belong_key": "belong_32502"
        },
        "32582": {
            "name": "摧朽",
            "desc": "施展“定风凝云”时缓慢将25尺内当前观察的目标吸引至自己身边。",
            "belong_key": "belong_32582"
        },
        "32512": {
            "name": "界破",
            "skills": [
                34695
            ],
            "desc": "施展“孤锋破浪”会在原地残留刀气，2秒后会引爆刀气对6尺范围内最多5个目标造成<SUB 34695 1>外功伤害。",
            "belong_key": "belong_32512"
        },
        "32457": {
            "name": "镇机",
            "buffs": [
                24180
            ],
            "desc": "目标每拥有一层破绽，“断云势”对其伤害提高20%。",
            "belong_key": "belong_32457"
        },
        "34722": {
            "name": "鸣锋",
            "skills": [
                34724
            ],
            "desc": "自身“破浪三式”套路招式命中有自身“横云断浪”流血效果的目标会造成<SUB 34724 1>外功伤害，每层流血效果使该伤害提高13%。",
            "belong_key": "belong_34722"
        },
        "32497": {
            "name": "击懈",
            "desc": "“灭影追风”期间，击破目标弱点时，缩短“观风寻隙”察觉弱点间隔时间50%。",
            "belong_key": "belong_32497"
        },
        "42233": {
            "name": "遏流",
            "recipes": [
                "recipe_6032_1"
            ],
            "desc": "“定风凝云”调息时间降低10秒，效果持续4秒。效果结束时，使自身受到的伤害降低50%，持续3秒。",
            "belong_key": "belong_42233"
        },
        "32587": {
            "name": "识意",
            "desc": "“灭影追风”持续时间降低3秒，结束时若自身未重伤，则会将受到的伤害转换为伤害吸收盾，持续6秒。",
            "belong_key": "belong_32587"
        },
        "32508": {
            "name": "长溯",
            "desc": "“沧浪三叠”每次命中非侠士目标会给其添加1层“长溯”效果，“孤锋破浪”命中有“长溯”的目标，每层“长溯”将额外造成一次“孤锋破浪”伤害，“长溯”持续30秒，最多叠加3层。",
            "belong_key": "belong_32508"
        },
        "32610": {
            "name": "势钧",
            "desc": "“横云断浪”命中目标获得生命值15%的伤害吸收盾，持续5秒。若目标有伤害吸收盾，获得的盾量翻倍。",
            "belong_key": "belong_32610"
        },
        "32608": {
            "name": "周流",
            "desc": "击破侠士目标“弱点”后额外获得30点“锐意”。",
            "belong_key": "belong_32608"
        },
        "32609": {
            "name": "驭耀",
            "desc": "“行云势”无视目标30%化劲并额外获得6点“锐意”。",
            "belong_key": "belong_32609"
        },
        "32493": {
            "name": "流岚",
            "buffs": [
                24209
            ],
            "desc": "5秒内连续击破两个弱点，使自身无视目标25%内外防御，持续60秒。",
            "belong_key": "belong_32493"
        },
        "32509": {
            "name": "斩颓",
            "desc": "“破绽”叠加的层数越多，目标受到的额外伤害越高。",
            "belong_key": "belong_32509"
        },
        "32611": {
            "name": "泯息",
            "desc": "每次击破“弱点”，降低“洗兵雨”2秒调息时间，“触石雨”1秒调息时间。",
            "belong_key": "belong_32611"
        },
        "32613": {
            "name": "亘绝",
            "recipes": [
                "recipe_3035_1"
            ],
            "desc": "“驰风八步”变为充能招式，施展后自身御劲提高100%，持续4秒。",
            "belong_key": "belong_32613"
        },
        "36035": {
            "name": "潋风",
            "skills": [
                36118
            ],
            "desc": "施展“决云势”自身获得5秒“潋风”气劲，期间主动施展“流云势法”套路伤害招式命中目标会额外获得20点锐意，并额外触发<SUB 36118 1>外功伤害。",
            "belong_key": "belong_36035"
        },
        "32586": {
            "name": "截辕",
            "dots": {
                "24650": [
                    33133
                ]
            },
            "skills": [
                32591
            ],
            "desc": "施展“孤锋破浪”后将在前方4尺残留6秒斩击刀气，刀气快速向前移动，每0.5秒对半径8尺内的15个敌对目标造成<SUB 32591 1>外功伤害，并添加12秒持续伤害效果，累计攻击20个目标，则刀气被引爆，对半径10尺内10个目标造成<SUB 32591 2>外功伤害，若目标为侠士，则使其下8秒内受到的范围型招式伤害提高15%，刀气每重伤一名敌人，自身则获得35点锐意，该刀气只会存在一道。",
            "belong_key": "belong_32586"
        },
        "32665": {
            "name": "泽风同承",
            "skills": [
                42235
            ],
            "desc": "链接2个有自身破绽且最近的侠士目标，链接期间攻击其中一个目标，另一个目标也将受到70%伤害传递，链接生效范围为25尺，持续6秒。效果时间结束时，对链接的两个目标分别造成基于目标破绽层数的多段伤害，最多4段。",
            "belong_key": "belong_32665"
        },
        "32614": {
            "name": "怒锋倾涛",
            "skills": [
                32616,
                33163
            ],
            "desc": "冲向目标并对其造成200%的武器伤害外加<SUB 32616 0>外功伤害，若目标为侠士且存在自身“破绽”则每个“破绽”追加已损失生命值6%<NounID 101>。每有3层“破绽”层数，对目标添加1层<NounID 75>。",
            "belong_key": "belong_32614"
        },
        "32499": {
            "name": "观衅",
            "desc": "施展“灭影追风”同时清除自身“观风寻隙”间隔时间。",
            "belong_key": "belong_32499"
        },
        "32452": {
            "name": "聚疏",
            "recipes": [
                "recipe_6200_1"
            ],
            "skills": [
                38645
            ],
            "desc": "“望云势”调息时间降低5秒，反击时不再需要目标，伤害提高50%，且会对8尺内3个敌对目标造成伤害。",
            "belong_key": "belong_32452"
        },
        "32495": {
            "name": "伏瀑",
            "desc": "“触石雨”命中已经被击倒的目标伤害提高60%，并击倒周围6尺内的3个目标。",
            "belong_key": "belong_32495"
        },
        "32459": {
            "name": "雾灭",
            "desc": "每次击破“弱点”，对应目标化劲等级降低5%，自身化劲等级提高5%，可叠加2层，持续15秒。",
            "belong_key": "belong_32459"
        },
        "32578": {
            "name": "强膂",
            "attributes": {
                "strength_gain": 102,
                "strain_gain": 102
            },
            "desc": "无双等级、力道、移动速度提高10%。",
            "belong_key": "belong_32578"
        },
        "42060": {
            "name": "飞云",
            "desc": "施展“行云势”第三段时，自身移速提高60%，持续3秒。",
            "belong_key": "belong_42060"
        },
        "32491": {
            "name": "急潮",
            "recipes": [
                "recipe_3025_1",
                "recipe_3106_1",
                "recipe_3107_1"
            ],
            "desc": "“破浪三式”套路招式作用范围提高2尺，切换“双持武器”状态时自身受到的伤害降低30%，持续3秒。",
            "belong_key": "belong_32491"
        },
        "32579": {
            "name": "辞霈",
            "desc": "“停云势”命中目标则使其受到的治疗及获得的护盾效果降低50%，持续8秒。",
            "belong_key": "belong_32579"
        },
        "32511": {
            "name": "涣衍",
            "recipes": [
                "recipe_3032_1"
            ],
            "desc": "“横云断浪”调息时间降低6秒，附带“流血”效果持续时间提高12秒。击破非侠士目标“弱点”时，若其持有的自身“破绽”层数低于3层，则额外添加1层“破绽”。",
            "belong_key": "belong_32511"
        },
        "32577": {
            "name": "殊际",
            "desc": "目标被自身定身、眩晕、击倒期间受到的伤害提高20%。",
            "belong_key": "belong_32577"
        },
        "32494": {
            "name": "靖步",
            "recipes": [
                "recipe_3034_1"
            ],
            "desc": "“定风凝云”持续期间受到的伤害降低80%且不受被推、被拉影响，每秒回复自身3%气血最大值，提前结束则获取剩余恢复值。",
            "belong_key": "belong_32494"
        },
        "32465": {
            "name": "遏云势",
            "attributes": {
                "physical_damage_base": 35,
                "physical_damage_rand": 5
            },
            "skills": [
                32465
            ],
            "desc": "打断目标运功并造成<SKILL PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP}>)外功伤害，若目标正在运功，自身获得20点锐意并使目标不受治疗影响，持续5秒。",
            "belong_key": "belong_32465"
        }
    },
    "10786": {
        "10786": {
            "name": "周天功",
            "attributes": {
                "magical_shield_base": 2347,
                "physical_shield_base": 2850,
                "neutral_critical_strike_base": 5527,
                "spunk_to_neutral_attack_power": 1997,
                "spunk_to_neutral_critical_strike": 461,
                "max_life_gain": 245,
                "magical_attack_power_base": 6518,
                "pve_addition_base": 584
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "buffs": [
                29604
            ],
            "skills": [
                38034,
                38093,
                39081
            ],
            "desc": "一门通过聚气丹田，从而打通人体经脉的气功修行之法。下分大、小周天，其中大多数段氏弟子修行的小周天主要以任督二脉为主，配以指法，则可凌空化气，号为一阳。配以扇法，则可御风为媒，劈刃飞光。",
            "critical_type": "neutral",
            "damage_type": "neutral",
            "belong_key": "belong_10786"
        },
        "38006": {
            "name": "断脉",
            "recipes": [
                "recipe_5576_1",
                "recipe_5681_1",
                "recipe_5682_1",
                "recipe_5683_1",
                "recipe_5684_1",
                "recipe_5685_1",
                "recipe_5686_1",
                "recipe_5687_1"
            ],
            "skills": [
                38084
            ],
            "desc": "对目标造成<SUB 38084 0>混元内功伤害，使自身获得15点任脉能量。<TALENT 38502 1 “断脉”命中无自身“绝脉”效果的目标时，额外回复15点任脉><TALENT 38506 1 “雪重”期间施展“断脉”造成一次额外伤害><TALENT 38487 1 命中至少5层“绝脉”的目标时也会引爆5层“绝脉”，引爆后降低目标3%加速率，可叠加3层，持续10秒>",
            "belong_key": "belong_38006"
        },
        "38007": {
            "name": "截阳",
            "recipes": [
                "recipe_5688_1",
                "recipe_5689_1",
                "recipe_5690_1",
                "recipe_5691_1",
                "recipe_5692_1",
                "recipe_5693_1",
                "recipe_5694_1",
                "recipe_5695_1"
            ],
            "skills": [
                38090
            ],
            "desc": "对目标造成<SUB 38090 0>混元内功伤害，使自身获得20点督脉能量，对目标添加3层无法卸除持续20秒的“绝脉”效果：招式调息速度降低1%。<TALENT 38485 1 若命中正在运功的目标，打断目标运功><TALENT 38486 1 自身“雾海”中的目标被“截阳”命中将定身2秒><TALENT 38509 1 “绝脉”可叠加的层数增加5层，引爆10层及以上时造成一次额外伤害>",
            "belong_key": "belong_38007"
        },
        "38008": {
            "name": "破穴",
            "recipes": [
                "recipe_5696_1",
                "recipe_5697_1",
                "recipe_5698_1",
                "recipe_5699_1",
                "recipe_5700_1",
                "recipe_5701_1",
                "recipe_5702_1",
                "recipe_5703_1"
            ],
            "skills": [
                38083
            ],
            "desc": "对目标造成<SUB 38083 0>混元内功伤害，并击退目标随后定身目标1.5秒，未进入“经脉循行”状态时，使自身任督二脉能量各增加15点。“经脉循行”状态下消耗自身一半任脉能量和督脉能量。每消耗20点任脉能量，击退时长提高6.25%，每消耗10点督脉能量，额外定身0.75秒。<TALENT 38494 1 “破穴”命中带有自身10层以上绝脉目标时，消耗8层绝脉使目标禁疗3秒><TALENT 38489 1 命中后目标10秒无法展开阵眼><TALENT 38490 1 施展“破穴”造成破招伤害后，内功基础攻击力提高20%，无双率提高15%，持续23秒。><TALENT 38467 1 破穴爆绝脉加引窍伤害>",
            "belong_key": "belong_38008"
        },
        "38009": {
            "name": "引窍",
            "recipes": [
                "recipe_5704_1",
                "recipe_5705_1",
                "recipe_5706_1",
                "recipe_5707_1",
                "recipe_5708_1",
                "recipe_5709_1"
            ],
            "skills": [
                38438,
                38085
            ],
            "desc": "对目标造成<SUB 38438 0>混元内功伤害，随后引爆2层“绝脉”，每引爆1层“绝脉”造成<SUB 38085 0>混元内功伤害。\\n施展时会消耗自身一半任脉能量和督脉能量。每消耗1点任脉能量，造成伤害提高4%；每消耗5点督脉能量，额外引爆1层“绝脉”。<TALENT 38468 1 涌泉><TALENT 38484 1 悬枢><TALENT 38503 1 百会><TALENT 38467 1 破穴爆绝脉加引窍伤害>",
            "belong_key": "belong_38009"
        },
        "37779": {
            "name": "骤风令",
            "skills": [
                37804
            ],
            "desc": "在目标位置召唤6尺范围的“骤风”，并且使自身基础调息降低0.5秒，生成后会跟踪目标敌人移动，每0.75秒造成1次<SUB 37804 1>伤害。“骤风”每次造成伤害时，范围内若有“雾海萦空”雾气，则使目标获得一层“雾渺”效果。<TALENT 38501 1 “骤风”对静止目标伤害增加35%，施展“骤风令”后2秒内可施展一次额外不占基础调息的“劈风令”><TALENT 38471 1 “骤风”范围变为8尺，对至多10个目标造成伤害><TALENT 38469 1 “骤风”扩散“雾渺”效果的速度翻倍>",
            "belong_key": "belong_37779"
        },
        "37780": {
            "name": "劈风令",
            "recipes": [
                "recipe_5714_1",
                "recipe_5715_1",
                "recipe_5716_1",
                "recipe_5717_1",
                "recipe_5762_1",
                "recipe_5763_1"
            ],
            "skills": [
                37816,
                38452
            ],
            "desc": "对目标造成<SUB 37816 0>混元内功伤害，并造成一次破招伤害，若目标4尺内有属于自身的“骤风”，则“骤风”也立刻造成一次6尺范围<SUB 38452 0>混元内功伤害。<TALENT 38488 1 引发的骤风共振伤害使目标封轻功3秒><TALENT 38507 1 对目标范围造成一次额外伤害><TALENT 38475 1 引发的骤风共振伤害提高20%，对非侠士目标造成一次额外伤害，每次施展“劈风令”返还5%“抟风令”剩余调息时间><TALENT 38480 1 变为3层充能招式><TALENT 40242 1 弹道速度降低，伤害降低30%，会在目标周围6尺内弹射至多3次><TALENT 40243 1 施展两次“劈风令”后，“劈风令”被替换为强化招式“劈风令·息劫”：对目标6尺范围内的至多6个目标施展“劈风令”><TALENT 40244 1 “劈风令”命中后会使目标获得6秒最多6层的“敕空”效果。“抟风令”会从敌方身上拉扯出“敕空”，对目标造成一次额外伤害>",
            "belong_key": "belong_37780"
        },
        "37781": {
            "name": "抟风令",
            "recipes": [
                "recipe_5710_1",
                "recipe_5711_1",
                "recipe_5712_1",
                "recipe_5713_1",
                "recipe_5761_1"
            ],
            "skills": [
                38447,
                38453
            ],
            "desc": "持续运功1.5秒并立即在目标位置生成半径15尺的狂风，将范围内自身“骤风”及至多6名敌对目标拉扯至中心位置。命中敌对目标后对其造成<SUB 38447 0>混元内功伤害并在拉扯结束后根据拉扯距离将其吹飞3-5秒（吹飞效果视为击倒），命中自身“骤风”后将其强化为“横驱风靡”，对12尺内最多10个敌人持续造成伤害，持续8秒。运功期间不可移动，免疫伤害、控制、打断效果，完整运功后对风眼6尺内的目标造成一次<SUB 38453 0>“抟风令·爆”伤害。<TALENT 38513 1 “抟风令”形成的狂风会吸收属于自身的“雾海”，若成功吸收则不再使目标范围的目标被吹飞而是获得5秒“迷云”><TALENT 38475 1 每次施展“劈风令”返还5%“抟风令”剩余调息时间><TALENT 38474 1 调息时间降低10秒，伤害提高100%><TALENT 38507 1 施展“抟风令”后可以刷新“劈风令”调息时间><TALENT 40244 1 敕空>",
            "belong_key": "belong_37781"
        },
        "37808": {
            "name": "雾刃飞光",
            "skills": [
                38016,
                38075,
                38076,
                38077
            ],
            "desc": "四段招式。每段在目标身边生成一道“雾刃飞光”，对其造成<SUB 38016 0>混元内功伤害，并添加<NounID 77>效果。<TALENT 38510 1 对在自身“雾海”中的目标施展“雾刃飞光”后，降低“雾暗迷云”调息时间3秒><TALENT 38470 1 每次施展“雾刃飞光”时，返还1秒“骤风令”调息时间><TALENT 38479 1 第四段额外对自身周围6尺范围造成一次伤害，并对有自身“雾渺”的目标造成沉默效果，每层“雾渺”使目标获得0.75秒沉默><TALENT 38478 1 使目标额外获得1层“雾渺”效果，但不再使5层及以上目标获得“雾渺”><TALENT 38505 1 造成伤害每次递增40%>",
            "belong_key": "belong_37808"
        },
        "38479": {
            "name": "静霂",
            "desc": "属于自身的<NounID 77>效果持续时间提高2秒，“招式施展距离降低”强度降低至三成，满层后无法再刷新持续时长，叠加至满层后使目标沉默5秒。",
            "belong_key": "belong_38479"
        },
        "38513": {
            "name": "徙溟",
            "desc": "“抟风令”会吸收范围内的“雾海”，若成功吸收则不再吹飞目标，而是使生成的“横驱风靡”持续附带“迷云”，该效果会根据所吸收雾海的剩余时长作用一定次数后消失。",
            "belong_key": "belong_38513"
        },
        "38503": {
            "name": "百会",
            "desc": "引爆“绝脉”时，每引爆一层“绝脉”使目标获得5%减疗效果，持续12秒。",
            "belong_key": "belong_38503"
        },
        "38500": {
            "name": "玉枕",
            "buffs": [
                29243,
                30487
            ],
            "desc": "“经脉循行”期间招式无视目标40%防御等级，且若为消耗能量招式则每消耗1点能量额外无视目标0.5%防御等级。",
            "belong_key": "belong_38500"
        },
        "38497": {
            "name": "流梨",
            "desc": "“雪满”期间可施展二段招式，使自身6秒内免疫封内、缴械和重创，期间<NounID 59>额外免疫击退、被拉。“雪满”效果结束前未施展则自动尝试施展。",
            "belong_key": "belong_38497"
        },
        "38466": {
            "name": "疏雪",
            "desc": "“雪满”转化为<NounID 59>时会标记控制来源6秒，期间对其他目标施展“破穴”时会额外对标记的目标生效一次。",
            "belong_key": "belong_38466"
        },
        "38499": {
            "name": "郁潆",
            "desc": "自身“雾海萦空”范围内的敌对玩家目标每秒获得3秒“郁潆”效果：基础攻击力和治疗量降低10%，至多5层。",
            "belong_key": "belong_38499"
        },
        "38481": {
            "name": "神封",
            "desc": "消耗任脉和督脉能量之和不低于30点时，回复6点任脉，6点督脉。",
            "belong_key": "belong_38481"
        },
        "38493": {
            "name": "零露",
            "desc": "“雪满”转化<NounID 59>的比例提升至1:1。",
            "belong_key": "belong_38493"
        },
        "38465": {
            "name": "雪霁风吟",
            "desc": "解除自身控制，并使自身获得6秒<NounID 59>。",
            "belong_key": "belong_38465"
        },
        "38549": {
            "name": "朔风扬尘",
            "skills": [
                38554
            ],
            "desc": "跃起并获得7层“朔风扬尘”效果，技能替换为二段招式扬尘，扬尘公共调息时间0.6秒，“朔风扬尘”持续时间内可以连续施展，延迟0.5秒后向目标位置造成<SUB 38554 0>矩形范围伤害，并回复5点任脉5点督脉能量，被扬尘重复命中则受到的伤害将逐步递增。每次释放还会获得可叠加层数的“扬尘”效果：“经脉循行”期间任脉和督脉能量回复增加1点，每次施展“一阳指”套路招式时消耗1层。",
            "belong_key": "belong_38549"
        },
        "38475": {
            "name": "纷飙",
            "recipes": [
                "recipe_5620_1"
            ],
            "skills": [
                39340
            ],
            "desc": "“劈风令”引发的骤风共振伤害提高20%，对非侠士目标造成一次<SUB 39340 0>额外伤害，每次施展时返还5%“抟风令”剩余调息时间。",
            "belong_key": "belong_38475"
        },
        "38495": {
            "name": "出岫",
            "recipes": [
                "recipe_5635_1"
            ],
            "desc": "“风流云散”调息时间降低10秒，变为2层充能招式，施展后只能获得1层“云散”。",
            "belong_key": "belong_38495"
        },
        "38467": {
            "name": "封枢",
            "buffs": [
                29205
            ],
            "desc": "“破穴”每消耗10点能量引爆目标1层“绝脉”，每引爆1层返还消耗的10%能量，并使目标受控期间受到自身下一次“引窍”伤害提高5%。\\n成功引爆“绝脉”的“破穴”若成功击退目标，则其触发的“云散”闪现会优先选择距目标更近的位置。",
            "belong_key": "belong_38467"
        },
        "40242": {
            "name": "风萦",
            "recipes": [
                "recipe_5845_1"
            ],
            "desc": "“劈风令”弹道速度降低50%，伤害降低30%，会在目标周围8尺内的目标之间弹射至多3次。",
            "belong_key": "belong_40242"
        },
        "38490": {
            "name": "神门",
            "buffs": [
                29254
            ],
            "desc": "“破穴”额外附带一次破招伤害，以此方式触发破招使自身内功基础攻击提高20%，无双等级提高15%，持续23秒。",
            "belong_key": "belong_38490"
        },
        "38473": {
            "name": "停岚",
            "desc": "自身“雾海”存在期间可施展二段招式：将雾向对侧吹散，使雾海方向区域内至多10名敌方侠士根据雾海的剩余时长获得3-5层“雾渺”。",
            "belong_key": "belong_38473"
        },
        "38472": {
            "name": "骤涌",
            "skills": [
                38548
            ],
            "desc": "自身“横驱风靡”内目标数未达上限时，敌方目标进入或离开区域会受到一次<SUB 38548 1>混元内功伤害。",
            "belong_key": "belong_38472"
        },
        "40244": {
            "name": "敕空",
            "skills": [
                40340
            ],
            "desc": "“劈风令”命中后标记目标8秒。“抟风令”拉扯被标记的目标会扯出一道风刃，短暂延迟后劈向目标，造成<SUB 40340 1>混元内功伤害，该伤害视作“劈风令”。",
            "belong_key": "belong_40244"
        },
        "38501": {
            "name": "茫缈",
            "recipes": [
                "recipe_5640_1"
            ],
            "desc": "“骤风”对静止目标伤害增加35%，施展“骤风令”后2秒内可额外施展一次不占基础调息的“劈风令”。",
            "belong_key": "belong_38501"
        },
        "38509": {
            "name": "灵台",
            "skills": [
                38888
            ],
            "desc": "“绝脉”可叠加的层数增加5层，引爆10层及以上时造成一次<SUB 38888 0>额外伤害。",
            "belong_key": "belong_38509"
        },
        "38504": {
            "name": "既晓",
            "desc": "施展“风流云散”卸除自身除阳性不利效果、阴性不利效果、混元不利效果、毒性不利效果一次，回复2%最大气血值，非战斗状态下施展调息时间降低10秒。",
            "belong_key": "belong_38504"
        },
        "38091": {
            "name": "遏尘",
            "skills": [
                38538
            ],
            "desc": "“风流云散”冲刺结束后对前方6尺进行一次斩击，对至多6个目标造成<SUB 38538 1>混元内功伤害并使其定身2秒。",
            "belong_key": "belong_38091"
        },
        "38507": {
            "name": "摧烟",
            "skills": [
                38557
            ],
            "desc": "“劈风令”对目标范围造成一次<SUB 38557 0>额外伤害，且可以被“抟风令”重置调息。",
            "belong_key": "belong_38507"
        },
        "38515": {
            "name": "胧雾观花",
            "skills": [
                38590
            ],
            "desc": "进行一次闪现并在原地留下一个雾气分身，短暂延迟后对目标造成<SUB 38590 1>混元内功伤害并为其添加1层“雾渺”。",
            "belong_key": "belong_38515"
        },
        "38477": {
            "name": "风徊絮转",
            "attributes": {
                "neutral_damage_base": 25,
                "neutral_damage_rand": 15
            },
            "skills": [
                38477,
                38886
            ],
            "desc": "立即对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元内功伤害并使其获得6秒“风徊絮转”。“风徊絮转”会在其受到自身击退或拉扯时消耗并附带额外效果：击退后使其3秒内无法施展轻功且自身下一次“引窍”无需消耗能量直接造成最大效果，拉扯后对其6尺内至多6个目标造成<SUB 38886 1>混元内功伤害并返还自身20%“抟风令”剩余调息时间。",
            "belong_key": "belong_38477"
        },
        "38981": {
            "name": "飞鸿破野",
            "skills": [
                38982,
                38983
            ],
            "desc": "获得一层“云散”效果，闪现至目标位置并在短暂延迟后造成4段4尺范围<SUB 38982 1>“飞鸿”伤害，之后对6尺至多6个目标造成<SUB 38983 1>“破野”伤害。“飞鸿”、“破野”附带僵直效果，每段招式命中侠士目标后使自身获得10点任督二脉能量。",
            "belong_key": "belong_38981"
        },
        "38511": {
            "name": "一阳来复",
            "desc": "获得50点任脉能量和50点督脉能量，重置“引窍”调息时间。施展“破穴”或“引窍”时返还本招式5秒调息时间。",
            "belong_key": "belong_38511"
        },
        "38488": {
            "name": "止蔌",
            "desc": "“劈风令”引发的骤风共振命中目标后使其3秒内无法施展轻功招式。",
            "belong_key": "belong_38488"
        },
        "38484": {
            "name": "悬枢",
            "recipes": [
                "recipe_5641_1"
            ],
            "desc": "“引窍”变为2层充能招式，造成伤害前额外附带2层“绝脉”。",
            "belong_key": "belong_38484"
        },
        "40241": {
            "name": "定元",
            "attributes": {
                "move_state_damage_addition": 0
            },
            "desc": "对定身、击倒、被拉状态的目标造成伤害提高7%。",
            "belong_key": "belong_40241"
        },
        "38476": {
            "name": "山雨重楼",
            "desc": "命中运功目标则打断其运功，并使目标进入4秒“迷云”状态。",
            "belong_key": "belong_38476"
        },
        "38478": {
            "name": "轻岚",
            "skills": [
                38531
            ],
            "desc": "“雾刃飞光”额外对前方6尺内120度扇形区域内至多5个目标造成<SUB 38531 1>混元内功伤害并使其获得1层“雾渺”，施展期间“云散”闪现会优先选择距目标更近的位置。",
            "belong_key": "belong_38478"
        },
        "38471": {
            "name": "疾掠",
            "desc": "“骤风”范围提升至8尺，目标数提升至10个。",
            "belong_key": "belong_38471"
        },
        "38474": {
            "name": "清激",
            "recipes": [
                "recipe_5619_1"
            ],
            "desc": "“抟风令”调息时间降低10秒，伤害提高100%。",
            "belong_key": "belong_38474"
        },
        "38469": {
            "name": "浥尘",
            "desc": "“骤风”扩散“雾渺”效果的速度翻倍。",
            "belong_key": "belong_38469"
        },
        "38470": {
            "name": "启霁",
            "desc": "每次施展“雾刃飞光”时，返还1秒“骤风令”调息时间。",
            "belong_key": "belong_38470"
        },
        "38480": {
            "name": "见飓",
            "recipes": [
                "recipe_5621_1",
                "recipe_5959_1"
            ],
            "desc": "“劈风令”变为3层充能招式。",
            "belong_key": "belong_38480"
        },
        "38505": {
            "name": "滃从",
            "buffs": [
                30667
            ],
            "desc": "“雾刃飞光”每段伤害递增提高至40%，完整施展后使自身<BUFF 30667 1 desc>，持续<BUFF 30667 1 time>。",
            "belong_key": "belong_38505"
        },
        "38482": {
            "name": "玄气",
            "desc": "引爆“绝脉”标记时可额外引爆至多3层。",
            "belong_key": "belong_38482"
        }
    },
    "10821": {
        "41437": {
            "name": "连环慢",
            "buffs": [
                31755
            ],
            "desc": "伶影不在场或离自身30尺外时激活。可将伶影放至目标位置，使其6尺范围内目标减速50%，持续3秒。随后激活二段招式<NounID 100>。自身与伶影距离30尺外时将收回伶影。<TALENT 42136 1 >",
            "belong_key": "belong_41437"
        },
        "41116": {
            "name": "落笼簿",
            "recipes": [
                "recipe_6101_1",
                "recipe_6148_1",
                "recipe_6149_1"
            ],
            "buffs": [
                31624
            ],
            "desc": "施展本招式操控伶影，最多10秒。操控时，伶影施展招式伤害系数提高120%，本体免疫控制并获得40%的减伤。\\n期间<NounID 102>距离提高至30尺，“勾线”每跳会转向目标。\\n结束操控时若伶影正在运功“四边静”“生地狱”，则伤害加成会保留至招式施展完毕。<TALENT 42113 1 ><TALENT 42114 1 ><TALENT 42118 1 ><TALENT 42149 1 ><TALENT 42127 1 ><TALENT 42140 1 ><TALENT 42129 1 ><TALENT 42144 1 >",
            "belong_key": "belong_41116"
        },
        "41985": {
            "name": "缠绞",
            "buffs": [
                31520
            ],
            "desc": "消耗心络的“织心谣”套路招式命中时，会给目标添加“缠绞”不利效果，持续12秒，最多5层。每层“缠绞”使伶影对其造成的伤害提高5%。",
            "belong_key": "belong_41985"
        },
        "41451": {
            "name": "障幕虚影",
            "recipes": [
                "recipe_6001_1",
                "recipe_6119_1",
                "recipe_6120_1",
                "recipe_6121_1",
                "recipe_6122_1"
            ],
            "buffs": [
                31673
            ],
            "skills": [
                42576
            ],
            "desc": "使自身（以当前操控的角色为准）附近8尺最多5个敌对目标陷入持续10秒的“虚影幻境”，使其每秒受到伶影幻象攻击造成<SUB 42576 1>阴性内功伤害，且期间受自身“傀儡调”及“织心谣”套路招式伤害提高20%。\\n侠士目标还会额外受到<NounID 78>不利效果。<TALENT 42147 1 >",
            "belong_key": "belong_41451"
        },
        "10821": {
            "name": "幽罗引",
            "attributes": {
                "magical_shield_base": 2347,
                "physical_shield_base": 2850,
                "magical_attack_power_base": 7459,
                "spirit_to_lunar_attack_power": 1974,
                "spirit_to_lunar_critical_strike": 512,
                "lunar_critical_strike_base": 2412,
                "max_life_gain": 245,
                "pve_addition_base": 348
            },
            "dots": {
                "32145": [
                    43082
                ]
            },
            "skills": [
                43087,
                43086,
                43081
            ],
            "desc": "无相楼秘传心法，化气凝丝，绕指无形。无相楼弟子以内力为引，凝气成丝，藏于掌中方寸，刚则化刃疾攻，柔可织罗缚敌；协以牵丝伶影同战，丝牵影动，形影变换，杀机暗藏。",
            "critical_type": "lunar",
            "damage_type": "lunar",
            "belong_key": "belong_10821"
        },
        "41439": {
            "name": "千里急",
            "recipes": [
                "recipe_6143_1",
                "recipe_6144_1",
                "recipe_6145_1",
                "recipe_6146_1",
                "recipe_6147_1"
            ],
            "skills": [
                41471,
                41472,
                41473
            ],
            "desc": "操控伶影时方可施展。\\n伶影攻击前方6尺120°范围内最多5个目标造成<SUB 41471 1>阴性内功伤害，施展后会激活下一段。\\n自身施展织心谣套路招式时，若伶影在目标6尺范围内，则联动伶影向目标方位施展“千里急”攻击。<TALENT 42122 1 ><TALENT 42137 1 >",
            "belong_key": "belong_41439"
        },
        "41442": {
            "name": "生地狱",
            "recipes": [
                "recipe_6138_1",
                "recipe_6139_1",
                "recipe_6140_1",
                "recipe_6141_1",
                "recipe_6142_1"
            ],
            "skills": [
                42021
            ],
            "desc": "操控伶影时方可施展。\\n立即消除伶影前方12尺与后方8尺矩形范围最多5个目标身上所有“缠绞”效果，在1秒内连续穿刺造成3次<SUB 42021 1>阴性内功伤害。每消除1层“缠绞”，招式伤害提高15%，最多提高120%。<TALENT 42122 1 ><TALENT 42141 1 ><TALENT 42145 1 >",
            "belong_key": "belong_41442"
        },
        "41443": {
            "name": "四边静",
            "skills": [
                42084
            ],
            "desc": "操控伶影时方可施展。\\n运功1.5秒，可移动施展，对8尺范围最多5个目标造成<SUB 42084 1>阴性内功伤害，使其3秒内无法使用轻功。\\n命中2层以上“缠绞”的目标，还将消除2层“缠绞”，附带5秒的锁足效果。<TALENT 42142 1 >",
            "belong_key": "belong_41443"
        },
        "41342": {
            "name": "挑丝",
            "recipes": [
                "recipe_6134_1",
                "recipe_6135_1",
                "recipe_6136_1",
                "recipe_6137_1"
            ],
            "skills": [
                41465
            ],
            "desc": "未操控伶影时方可施展。\\n恢复15点心络。向目标位置发射丝线刺穿目标，对目标方向20尺矩形范围的目标造成<SUB 41465 1>阴性内功伤害，最多5个。<TALENT 42125 1 >",
            "belong_key": "belong_41342"
        },
        "41444": {
            "name": "绊线",
            "recipes": [
                "recipe_6128_1",
                "recipe_6129_1",
                "recipe_6130_1",
                "recipe_6131_1",
                "recipe_6132_1",
                "recipe_6133_1"
            ],
            "skills": [
                42265
            ],
            "desc": "未操控伶影时方可施展。\\n消耗10点心络。对目标造成<SUB 42265 1>伤害。<TALENT 42119 1 ><TALENT 42128 1 ><TALENT 42135 1 >",
            "belong_key": "belong_41444"
        },
        "41858": {
            "name": "勾线",
            "skills": [
                41486,
                41994
            ],
            "desc": "未操控伶影时方可施展。\\n充能2层招式。消耗20点心络，持续运功2秒，期间每0.5秒对目标造成<SUB 41486 1>阴性内功伤害，命中时伤害逐渐递增。\\n每额外消耗10点心络，该次运功延长1.5秒，最多额外消耗20点心络。\\n招式引导过程中不可被打断、打退。<TALENT 42124 1 ><TALENT 42131 1 ><TALENT 42146 1 >",
            "belong_key": "belong_41858"
        },
        "41986": {
            "name": "寄线",
            "skills": [
                42098,
                42559
            ],
            "desc": "“织心谣”套路招式消耗的心络每有10点，对目标位置布下1根“寄线”（最多5根）。“寄线”在1.5秒后激活，对触碰到丝线的敌方位置6尺范围造成<SUB 42098 1>阴性内功伤害与破招伤害并消失。<TALENT 42115 1 ><TALENT 42112 1 ><TALENT 42130 1 >",
            "belong_key": "belong_41986"
        },
        "42123": {
            "name": "悬微",
            "buffs": [
                31590
            ],
            "desc": "“夹线”将束缚目标（效果视为击倒）。“提线”触发所需“缠绞”层数变为3层，控制的目标受到自身的“寄线”伤害提高300%。",
            "belong_key": "belong_42123"
        },
        "42113": {
            "name": "叠拍",
            "recipes": [
                "recipe_6006_1"
            ],
            "desc": "“落笼簿”调息时间降低至10秒，持续时间降低至4秒。施展后重置“傀儡调”套路招式基础调息时间。",
            "belong_key": "belong_42113"
        },
        "42114": {
            "name": "联套",
            "recipes": [
                "recipe_6007_1"
            ],
            "buffs": [
                31882
            ],
            "desc": "“落笼簿”调息时间增加至50秒，操控时间提升至20秒。期间每次施展“千里急”“生地狱”“四边静”都会使“傀儡调”招式伤害提高9%，最多叠加8层；结束操控时消失。",
            "belong_key": "belong_42114"
        },
        "42115": {
            "name": "绞网",
            "desc": "“织心谣”套路招式消耗心络时不再生成“寄线”，而是对生成位置直接造成“寄线”范围伤害。“寄线”造成的伤害提高100%。",
            "belong_key": "belong_42115"
        },
        "42116": {
            "name": "天织",
            "recipes": [
                "recipe_6039_1"
            ],
            "desc": "“勾线”无需选择目标，会向正前方20尺矩形范围造成伤害，伤害提高30%。",
            "belong_key": "belong_42116"
        },
        "42117": {
            "name": "曳绪",
            "recipes": [
                "recipe_6099_1"
            ],
            "desc": "勾线不再充能，调息时间降低至5秒，伤害降低35%，施展时不再消耗心络，施展后每0.5s会消耗5点心络对20尺内单体目标造成伤害（当前目标优先），最多20秒。当心络不足5点时结束。",
            "belong_key": "belong_42117"
        },
        "42118": {
            "name": "歇拍",
            "desc": "落笼簿期间，自身免疫封内、打断、缴械、沉默；结束控制后，该效果在2秒后消失。",
            "belong_key": "belong_42118"
        },
        "42119": {
            "name": "钤束",
            "buffs": [
                31699
            ],
            "desc": "“绊线”命中后使自身基础攻击力提高15%，无双提高30%，持续18秒。",
            "belong_key": "belong_42119"
        },
        "42120": {
            "name": "绎心",
            "skills": [
                42260
            ],
            "desc": "“提线”控制期间，目标受到治疗效果降低60%，每秒会使目标受到<SUB 42260 1>阴性内功伤害，并恢复自身10%最大气血值。",
            "belong_key": "belong_42120"
        },
        "42266": {
            "name": "太平歌",
            "desc": "可在运功中施展，在6秒内每秒恢复10点心络。",
            "belong_key": "belong_42266"
        },
        "42149": {
            "name": "缭乱",
            "buffs": [
                32050,
                32051
            ],
            "desc": "“落笼簿”期间自身“傀儡调”套路招式伤害提高20%，持续5秒；结束“落笼簿”后自身“织心谣”套路招式伤害提高10%，持续5秒。<TALENT_CORE 42113 1>",
            "belong_key": "belong_42149"
        },
        "42122": {
            "name": "寄意",
            "recipes": [
                "recipe_6087_1",
                "recipe_6188_1"
            ],
            "desc": "“千里急”“生地狱”会心提高15%，会心效果提高15%。施展后降低“勾线”1秒调息时间。",
            "belong_key": "belong_42122"
        },
        "42132": {
            "name": "任风波",
            "desc": "游丝枕月免控时间增加3秒。二段招式可施展时间延长至20秒，改为向后飘荡一段距离落地，伶影将立即出现在自身原位置并施展一次无需运功的“四边静”。",
            "belong_key": "belong_42132"
        },
        "42112": {
            "name": "迟桎",
            "desc": "“寄线”激活后，被自身“提线”目标触碰时才会触发并禁疗目标2秒。其他目标触碰时不会触发，但获得“迟桎”效果：吸收3%最大气血值的治疗，最多叠加5层，每秒最多获得1次。",
            "belong_key": "belong_42112"
        },
        "42124": {
            "name": "摄魄",
            "desc": "受到“勾线”伤害的目标受到治疗效果降低50%，持续3秒。",
            "belong_key": "belong_42124"
        },
        "42125": {
            "name": "黄粱",
            "desc": "“挑丝”施展后可以使“障幕虚影”调息时间降低3秒。",
            "belong_key": "belong_42125"
        },
        "42268": {
            "name": "驻云飞",
            "desc": "未操控伶影时方可施展。\\n命中正在运功的目标时打断其运功，使其被“夹线”控制。若成功控制则激活“提线”，若未成功控制目标则重置自身“夹线”调息时间。",
            "belong_key": "belong_42268"
        },
        "42127": {
            "name": "七撩",
            "buffs": [
                31870
            ],
            "desc": "“落笼簿”期间“千里急”可直接激活第二段，“连环慢”“千里急”命中目标时会使其获得“七撩”效果：受到“千里急”伤害提高60%，持续5秒。<TALENT_CORE 42114 1>",
            "belong_key": "belong_42127"
        },
        "42128": {
            "name": "拘意",
            "dots": {
                "31705": [
                    42275
                ]
            },
            "desc": "“绊线”伤害提高20%，命中时使目标每3秒受到一次伤害，持续18秒。",
            "belong_key": "belong_42128"
        },
        "42131": {
            "name": "系念",
            "desc": "施展“勾线”使自身与伶影的移动速度提高30%。自身受到伤害降低10%，持续25秒。",
            "belong_key": "belong_42131"
        },
        "42415": {
            "name": "应天长",
            "dots": {
                "31945": [
                    42702
                ]
            },
            "skills": [
                42417
            ],
            "desc": "未操控伶影时方可施展。\\n充能3层，恢复20心络，对目标造成<SUB 42417 1>阴性内功伤害。若目标在伶影6尺范围内则触发一段“千里急”并使该次“千里急”附带5秒的持续伤害。",
            "belong_key": "belong_42415"
        },
        "42130": {
            "name": "金缕",
            "skills": [
                42381
            ],
            "desc": "“寄线”会在目标位置附近生成丝线，被触碰引爆时，对触碰者额外造成<SUB 42381 1>阴性内功伤害。",
            "belong_key": "belong_42130"
        },
        "41446": {
            "name": "锁南枝",
            "skills": [
                42335,
                42936
            ],
            "desc": "未操控伶影时方可施展。\\n消耗50点心络。编织一个15尺的“缠丝阵”，持续10秒。缠丝阵会持续吸收15尺范围内的所有自身丝线，并对范围内5个侠士目标造成<SUB 42335 1>阴性内功伤害“笼绊”，每吸收1根丝线，伤害提高100%。\\n在范围内的5个非静止侠士目标每0.5秒受到<SUB 42336 1>阴性内功伤害“止足”，对自身“提线”目标伤害增加100%。",
            "belong_key": "belong_41446"
        },
        "42147": {
            "name": "镜同",
            "buffs": [
                31889
            ],
            "desc": "伶影施展“千里急”“生地狱”“四边静”时，会对受自身“障幕”效果影响的目标身后召唤一个巨大伶影分身释放相同的招式，但伤害只有原本的40%（同一个目标被镜同重复命中时，后续伤害衰减）。“虚影”不再持续产生伶影。",
            "belong_key": "belong_42147"
        },
        "42140": {
            "name": "栾旦",
            "desc": "每累计消耗40点心络，使下一次“落笼簿”“落笼簿·合”施展后恢复10%最大气血值。",
            "belong_key": "belong_42140"
        },
        "41452": {
            "name": "傀梦令",
            "skills": [
                42033,
                42247
            ],
            "desc": "将伶影拉回身旁与之共舞，持续对15尺范围最多5个目标造成<SUB 42033 1>阴性内功伤害，并在即将结束时造成<SUB 42247 1>阴性内功伤害。“伶舞”期间，强制切回主人视角且无法施展伶影招式，自身免疫任何伤害。",
            "belong_key": "belong_41452"
        },
        "42148": {
            "name": "绮结",
            "desc": "受到自身锁足、定身及“提线”控制的目标，被控制期间受到伤害提高15%。",
            "belong_key": "belong_42148"
        },
        "42137": {
            "name": "鼓关",
            "skills": [
                42384
            ],
            "desc": "“千里急”增加第四段，可对自身20尺范围内目标施展，伶影短暂消失并冲向目标，对其造成<SUB 42384 1>阴性内功伤害。",
            "belong_key": "belong_42137"
        },
        "42136": {
            "name": "双音",
            "recipes": [
                "recipe_6055_1"
            ],
            "desc": "连环慢二段招式额外充能1层。",
            "belong_key": "belong_42136"
        },
        "42126": {
            "name": "三合",
            "desc": "“提线”命中时，使目标1.5秒无法施展内功招式。",
            "belong_key": "belong_42126"
        },
        "42129": {
            "name": "慢煞",
            "desc": "“落笼簿”期间，本体每次受到攻击时都会恢复5%已损生命值。“落笼簿”结束时，获得10%最大气血值的护盾。",
            "belong_key": "belong_42129"
        },
        "42139": {
            "name": "偃卫",
            "desc": "替形幻生调息时间增加15秒，可对队友施展。触发替形幻生时，若伶影被攻击，则使攻击者的攻击力降低100%，持续6秒。",
            "belong_key": "belong_42139"
        },
        "42135": {
            "name": "协幽",
            "recipes": [
                "recipe_6187_1"
            ],
            "desc": "“绊线”增加4秒调息时间，命中敌对侠士时若心络不少于10点，则消耗10点心络额外造成一次伤害。",
            "belong_key": "belong_42135"
        },
        "42141": {
            "name": "移宫",
            "desc": "“生地狱”会将15尺范围内带有自身“缠绞”效果的目标拉至自身面前，最多5个目标。",
            "belong_key": "belong_42141"
        },
        "42142": {
            "name": "犯调",
            "desc": "四边静造成的锁足效果将强化为定身。",
            "belong_key": "belong_42142"
        },
        "42143": {
            "name": "寡合",
            "buffs": [
                31765
            ],
            "desc": "未操控伶影时，自身及伶影造成的伤害无视目标60%内功防御。",
            "belong_key": "belong_42143"
        },
        "42144": {
            "name": "散板",
            "desc": "“落笼簿”施展后降低“勾线”“连环慢”7秒调息时间。",
            "belong_key": "belong_42144"
        },
        "42145": {
            "name": "迭影",
            "buffs": [
                31767
            ],
            "desc": "“生地狱”可在非操控状态施展。施展后使自身5秒内“绊线”恢复10点心络，伤害提高50%且返还0.5秒基础调息时间。",
            "belong_key": "belong_42145"
        },
        "42146": {
            "name": "谐调",
            "skills": [
                42976
            ],
            "desc": "“勾线”完整运功时，根据施展时消耗的心络，对非侠士目标造成一次额外伤害。",
            "belong_key": "belong_42146"
        },
        "42332": {
            "name": "相思引",
            "desc": "未操控伶影时，用丝线将敌对侠士向伶影方向拉扯一段距离。\\n操控伶影时，用丝线将自身拉到伶影位置并返还15秒调息时间。",
            "belong_key": "belong_42332"
        }
    },
    "100398": {
        "100077": {
            "name": "四象轮回·悟",
            "attributes": {
                "neutral_damage_base": 1
            },
            "recipes": [
                "recipe_16669_1",
                "recipe_16670_1"
            ],
            "buffs": [
                70721
            ],
            "skills": [
                100077
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_100077"
        },
        "101571": {
            "name": "七星拱瑞·悟",
            "attributes": {
                "neutral_damage_base": 1
            },
            "recipes": [
                "recipe_16683_1",
                "recipe_16684_1"
            ],
            "buffs": [
                70345
            ],
            "skills": [
                101571,
                101667
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_101571"
        },
        "101573": {
            "name": "紫气逢真·悟",
            "recipes": [
                "recipe_16685_1",
                "recipe_16686_1"
            ],
            "buffs": [
                70345,
                70729,
                70161
            ],
            "desc": "获得增益。",
            "belong_key": "belong_101573"
        },
        "100398": {
            "name": "紫霞功·悟",
            "attributes": {
                "magical_shield_base": 2347,
                "physical_shield_base": 2850,
                "spirit_to_neutral_attack_power": 1946,
                "spirit_to_neutral_critical_strike": 625,
                "max_life_gain": 245,
                "magical_attack_power_base": 6518,
                "neutral_critical_strike_base": 5527,
                "all_shield_ignore": 614,
                "pve_addition_base": 789
            },
            "skills": [
                18121,
                101613,
                101614,
                101615,
                101616,
                101617
            ],
            "desc": "运功之时绵若云霞，更有紫气护体，故名紫霞。",
            "critical_type": "neutral",
            "damage_type": "neutral",
            "belong_key": "belong_100398"
        },
        "100076": {
            "name": "太极无极·悟",
            "recipes": [
                "recipe_16667_1",
                "recipe_16668_1"
            ],
            "skills": [
                101962,
                101963
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_100076"
        },
        "100079": {
            "name": "两仪化形·悟",
            "attributes": {
                "neutral_damage_base": 1
            },
            "recipes": [
                "recipe_16671_1",
                "recipe_16672_1"
            ],
            "skills": [
                100079,
                101567
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_100079"
        },
        "100081": {
            "name": "六合独尊·悟",
            "recipes": [
                "recipe_16675_1",
                "recipe_16676_1"
            ],
            "skills": [
                100475
            ],
            "desc": "持续对目标区域内的敌方造成伤害。",
            "belong_key": "belong_100081"
        },
        "100087": {
            "name": "五方行尽·悟",
            "recipes": [
                "recipe_16679_1",
                "recipe_16680_1"
            ],
            "skills": [
                101665
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_100087"
        },
        "101568": {
            "name": "生太极·悟",
            "attributes": {
                "neutral_damage_base": 1
            },
            "recipes": [
                "recipe_16673_1",
                "recipe_16674_1"
            ],
            "skills": [
                101568
            ],
            "desc": "产生一个半径5尺的{气场}【生太极】存在8秒。",
            "belong_key": "belong_101568"
        },
        "101569": {
            "name": "坐忘通玄·悟",
            "recipes": [
                "recipe_16681_1",
                "recipe_16682_1"
            ],
            "skills": [
                101598
            ],
            "desc": "受到伤害降低，并回复自身气血。",
            "belong_key": "belong_101569"
        },
        "101570": {
            "name": "破苍穹·悟",
            "attributes": {
                "neutral_damage_base": 1
            },
            "recipes": [
                "recipe_16677_1",
                "recipe_16678_1"
            ],
            "skills": [
                101570
            ],
            "desc": "产生一个半径5尺的{气场}【破苍穹】存在8秒，自身在【破苍穹】范围内每2秒获得1把{飞剑}。",
            "belong_key": "belong_101570"
        },
        "100556": {
            "name": "道冲·悟",
            "desc": "自身每次{锁足}、{定身}敌方后，使自身获得5把飞剑。",
            "belong_key": "belong_100556"
        },
        "100557": {
            "name": "持盈·悟",
            "buffs": [
                70161
            ],
            "desc": "开始运功后自身伤害提高15%，持续3秒。",
            "belong_key": "belong_100557"
        },
        "100558": {
            "name": "不恃·悟",
            "desc": "{飞剑}伤害提高50%。",
            "belong_key": "belong_100558"
        },
        "100559": {
            "name": "无争·悟",
            "desc": "施展消耗自身飞剑的招式时，使敌人{轻功沉默}2秒。",
            "belong_key": "belong_100559"
        },
        "100560": {
            "name": "上善·悟",
            "buffs": [
                71445
            ],
            "desc": "每次获得{飞剑}可使自身伤害提高2%，持续10秒，最多叠加5层。",
            "belong_key": "belong_100560"
        },
        "100561": {
            "name": "和光·悟",
            "desc": "每次获得{飞剑}可降低1秒【气场招式】的调息时间，且回复自身1%最大气血值。",
            "belong_key": "belong_100561"
        },
        "100080": {
            "name": "气破鸿蒙·悟",
            "buffs": [
                70764
            ],
            "skills": [
                101973
            ],
            "desc": "对敌方造成伤害，消耗所有{飞剑}，每1把可提高本招式伤害7%，施展后使自身伤害提高。",
            "belong_key": "belong_100080"
        },
        "100082": {
            "name": "镇山河·悟",
            "desc": "在目标区域产生一个半径7尺的{气场}【镇山河】存在6秒，并{驱散}范围内友方3个【减益】。",
            "belong_key": "belong_100082"
        }
    },
    "100994": {
        "100994": {
            "name": "北傲诀·悟",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2955,
                "pve_addition_base": 676,
                "all_shield_ignore": 614,
                "strength_to_physical_attack_power": 1802,
                "strength_to_physical_overcome": 420,
                "max_life_gain": 245,
                "physical_attack_power_base": 7034
            },
            "buffs": [
                70161
            ],
            "skills": [
                16820,
                16419,
                16822
            ],
            "desc": "罡风起处刀鸣烈，龙出沧海撼雷霆。北傲诀进退由心，偃仰任意。练到深邃之处有气盈于膺，刀势展开时吞吐万里，傲意凌穹。",
            "critical_type": "physical",
            "damage_type": "physical",
            "belong_key": "belong_100994"
        },
        "100999": {
            "name": "项王击鼎·悟",
            "attributes": {
                "physical_damage_base": 1
            },
            "recipes": [
                "recipe_16964_1",
                "recipe_16965_1"
            ],
            "buffs": [
                71047
            ],
            "skills": [
                100999,
                101000,
                101001,
                101050
            ],
            "desc": "对前方造成伤害。\\n施展【叁式】消耗全部{逐鹿·悟}，每消耗1层使触发的范围伤害持续时间延长1秒，期间免疫控制。",
            "belong_key": "belong_100999"
        },
        "101002": {
            "name": "刀啸风吟·悟",
            "attributes": {
                "physical_damage_base": 1
            },
            "recipes": [
                "recipe_16966_1",
                "recipe_16967_1"
            ],
            "buffs": [
                70433
            ],
            "skills": [
                101002
            ],
            "desc": "运功对前方造成伤害。",
            "belong_key": "belong_101002"
        },
        "101005": {
            "name": "醉斩白蛇·悟",
            "recipes": [
                "recipe_16972_1",
                "recipe_16973_1"
            ],
            "buffs": [
                70161,
                70360
            ],
            "skills": [
                101080
            ],
            "desc": "持续拔刀挥出刀气，每0.5秒对前方造成外功伤害。",
            "belong_key": "belong_101005"
        },
        "101009": {
            "name": "坚壁清野·悟",
            "recipes": [
                "recipe_16980_1",
                "recipe_16981_1"
            ],
            "buffs": [
                71507
            ],
            "skills": [
                101200,
                101198
            ],
            "desc": "对前方造成伤害并残留10秒{刀气区域}。",
            "belong_key": "belong_101009"
        },
        "101004": {
            "name": "闹须弥·悟",
            "recipes": [
                "recipe_16970_1",
                "recipe_16971_1"
            ],
            "dots": {
                "70364": [
                    101068
                ]
            },
            "skills": [
                101068
            ],
            "desc": "冲向目标区域造成伤害，同时附带{流血}，持续16秒。",
            "belong_key": "belong_101004"
        },
        "101003": {
            "name": "破釜沉舟·悟",
            "attributes": {
                "physical_damage_base": 1
            },
            "recipes": [
                "recipe_16968_1",
                "recipe_16969_1"
            ],
            "skills": [
                101003
            ],
            "desc": "对前方目标造成伤害。\\n·可透支施展1次",
            "belong_key": "belong_101003"
        },
        "101006": {
            "name": "逐鹿中州·悟",
            "attributes": {
                "physical_damage_base": 1
            },
            "recipes": [
                "recipe_16974_1",
                "recipe_16975_1"
            ],
            "skills": [
                101006
            ],
            "desc": "对前方造成伤害，命中运功的目标则打断其运功，若其为侠士目标，则使其受到的伤害提高。",
            "belong_key": "belong_101006"
        },
        "101007": {
            "name": "割据秦宫·悟",
            "recipes": [
                "recipe_16976_1",
                "recipe_16977_1"
            ],
            "skills": [
                101108,
                101109,
                101110
            ],
            "desc": "对前方造成伤害，可{透支}两次并视{透支}程度造成额外效果。\\n·未{透支}使目标{锁足}3秒。\\n·{透支}一次时{眩晕}目标3秒\\n·{透支}两次时使目标{内功沉默}1秒，  {击倒}目标3秒。",
            "belong_key": "belong_101007"
        },
        "101008": {
            "name": "擒龙六斩·悟",
            "recipes": [
                "recipe_16978_1",
                "recipe_16979_1"
            ],
            "skills": [
                101118,
                101119,
                101120,
                101121,
                101122,
                101123
            ],
            "desc": "冲向选择区域，对范围内目标造成伤害并使其僵直。",
            "belong_key": "belong_101008"
        },
        "101296": {
            "name": "征踏·悟",
            "desc": "{长刀招式}伤害提高15%，且对{锁足}、{眩晕}、{击倒}目标伤害提高20%。",
            "belong_key": "belong_101296"
        },
        "101297": {
            "name": "敛锋·悟",
            "desc": "{鞘刀招式}命中的目标气血值低于50%，造成的伤害提高30%。",
            "belong_key": "belong_101297"
        },
        "101298": {
            "name": "无拘·悟",
            "buffs": [
                71549
            ],
            "desc": "施展{双刀招式}后，回复10%最大气血值，自身移速提高20%，自身伤害提高10%，持续5秒。",
            "belong_key": "belong_101298"
        },
        "101299": {
            "name": "裁魂·悟",
            "buffs": [
                70454
            ],
            "desc": "{鞘刀招式}命中【坚壁清野·悟】的刀气残留区域内目标时伤害提高35%。",
            "belong_key": "belong_101299"
        },
        "101300": {
            "name": "霸王·悟",
            "buffs": [
                70161
            ],
            "desc": "施展{长刀招式}后获得1层{逐鹿·悟}，持续20秒。",
            "belong_key": "belong_101300"
        },
        "101301": {
            "name": "龙威·悟",
            "buffs": [
                71496
            ],
            "desc": "生成刀气阻碍时，使自身下次施展{鞘刀招式}造成的伤害提高50%，持续6秒。",
            "belong_key": "belong_101301"
        },
        "101015": {
            "name": "上将军印·悟",
            "buffs": [
                70162
            ],
            "skills": [
                101256,
                101257,
                101258,
                101259,
                101260
            ],
            "desc": "对前方造成5次逐渐递增的伤害，施展后使自身会心率提高。",
            "belong_key": "belong_101015"
        },
        "102448": {
            "name": "四面楚歌·悟",
            "skills": [
                102450
            ],
            "desc": "自身无法选中，免疫所有负面效果，原地以内力凝聚刀影，以刀气领域笼罩敌人，将当前目标锁足并使其无法施展轻功，刀影会将当前目标击飞，并不断对区域内所有目标造成僵直控制（最多3个目标），刀影不断加速冲刺进行5次打击，最后由空中终结，造成3秒击倒。",
            "belong_key": "belong_102448"
        }
    },
    "101355": {
        "101357": {
            "name": "钩吻断肠·悟",
            "attributes": {
                "poison_damage_base": 1
            },
            "recipes": [
                "recipe_17036_1",
                "recipe_17037_1"
            ],
            "buffs": [
                71213,
                71516
            ],
            "skills": [
                101357,
                101358
            ],
            "desc": "对敌方造成伤害，命中目标自身获得1点温性。",
            "belong_key": "belong_101357"
        },
        "101364": {
            "name": "回风微澜·悟",
            "recipes": [
                "recipe_17046_1",
                "recipe_17047_1"
            ],
            "buffs": [
                70161
            ],
            "skills": [
                102374
            ],
            "desc": "{腾空跃起}，跳跃期间免疫控制，进入持续4秒的{凌然天风}状态，受到伤害降低30%。3秒内施展【傍身招式】命中目标可获得1次跳跃机会。",
            "belong_key": "belong_101364"
        },
        "101355": {
            "name": "无方·悟",
            "attributes": {
                "magical_shield_base": 2850,
                "physical_shield_base": 2347,
                "spirit_to_poison_attack_power": 1976,
                "spirit_to_poison_overcome": 512,
                "max_life_gain": 245,
                "magical_attack_power_base": 6663,
                "poison_overcome_base": 5527,
                "pve_addition_base": 604,
                "all_shield_ignore": 614
            },
            "dots": {
                "71171": [
                    101417,
                    102374
                ]
            },
            "skills": [
                27451,
                101417
            ],
            "desc": "此功以无方为名，亦代指北天药宗至高典籍《无方制物经》，旨在娴熟使用药理制物。",
            "critical_type": "poison",
            "damage_type": "poison",
            "belong_key": "belong_101355"
        },
        "101359": {
            "name": "飞叶满襟·悟",
            "attributes": {
                "poison_damage_base": 1
            },
            "recipes": [
                "recipe_17038_1",
                "recipe_17039_1"
            ],
            "skills": [
                101359,
                101360
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_101359"
        },
        "101361": {
            "name": "川乌射罔·悟",
            "recipes": [
                "recipe_17040_1",
                "recipe_17041_1"
            ],
            "skills": [
                102157
            ],
            "desc": "连续对敌方造成伤害，持续2.5秒。每次命中目标自身获得1点温性。",
            "belong_key": "belong_101361"
        },
        "101362": {
            "name": "沾衣未妨·悟",
            "recipes": [
                "recipe_17042_1",
                "recipe_17043_1"
            ],
            "skills": [
                102158
            ],
            "desc": "生成雾气，每秒对范围内敌方造成伤害并获得1点寒性，持续4秒。",
            "belong_key": "belong_101362"
        },
        "101363": {
            "name": "且待时休·悟",
            "recipes": [
                "recipe_17044_1",
                "recipe_17045_1"
            ],
            "skills": [
                102159
            ],
            "desc": "连续对敌方造成伤害，持续3秒，若目标已{中毒}则{内功沉默}{外功沉默}{轻功沉默}，持续3秒。",
            "belong_key": "belong_101363"
        },
        "101365": {
            "name": "紫叶沉疴·悟",
            "attributes": {
                "poison_damage_base": 1
            },
            "recipes": [
                "recipe_17048_1",
                "recipe_17049_1"
            ],
            "skills": [
                101365
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_101365"
        },
        "101366": {
            "name": "绿野蔓生·悟",
            "recipes": [
                "recipe_17050_1",
                "recipe_17051_1"
            ],
            "skills": [
                102172
            ],
            "desc": "生成藤蔓环绕自身，6尺范围内敌方攻击自身将被击退且受到伤害，持续5秒。",
            "belong_key": "belong_101366"
        },
        "101367": {
            "name": "青圃着尘·悟",
            "recipes": [
                "recipe_17052_1",
                "recipe_17053_1"
            ],
            "skills": [
                102163
            ],
            "desc": "连续对敌方造成伤害，持续3秒。每次命中目标自身获得1点寒性。",
            "belong_key": "belong_101367"
        },
        "101368": {
            "name": "并蒂夺株·悟",
            "recipes": [
                "recipe_17054_1",
                "recipe_17055_1"
            ],
            "skills": [
                102164
            ],
            "desc": "生成花朵，每秒对范围内敌方造成伤害并获得1点温性，持续4秒。",
            "belong_key": "belong_101368"
        },
        "101419": {
            "name": "鬼门·悟",
            "desc": "{中毒}的目标气血低于50%时受到自身造成的伤害提高30%。",
            "belong_key": "belong_101419"
        },
        "101420": {
            "name": "罔医·悟",
            "buffs": [
                71516
            ],
            "desc": "飞叶满襟·悟命中目标使自身基础攻击力提高15%，持续10秒，{凌然天风}状态下，飞叶满襟·悟的范围增加10尺。",
            "belong_key": "belong_101420"
        },
        "101421": {
            "name": "祛疾·悟",
            "desc": "每次触发{无方中和}后，驱散目标身上的1个增益气劲。",
            "belong_key": "belong_101421"
        },
        "101422": {
            "name": "神莹·悟",
            "buffs": [
                70161
            ],
            "desc": "每次触发{无方中和}后，降低1秒{滞空技}的调息时间且使自身伤害提高5%持续6秒。",
            "belong_key": "belong_101422"
        },
        "101423": {
            "name": "济世·悟",
            "buffs": [
                71620
            ],
            "desc": "每次运功后，自身无双等级提高25%，持续12秒。",
            "belong_key": "belong_101423"
        },
        "101424": {
            "name": "寿延·悟",
            "desc": "腾空跃起时自身回复10%最大气血值，{凌然天风}状态下自身免疫控制。",
            "belong_key": "belong_101424"
        },
        "101370": {
            "name": "苍棘缚地·悟",
            "buffs": [
                71258
            ],
            "skills": [
                101425
            ],
            "desc": "在目标区域生长植物【苍棘】对范围内的敌方目标造成毒性内功伤害，【苍棘】自身每秒流失10%血量，最多存在15秒。",
            "belong_key": "belong_101370"
        },
        "101371": {
            "name": "逐云寒蕊·悟",
            "desc": "在自身10尺范围内生长植物【寒蕊】范围内友方进入{隐匿}状态并每秒恢复2%气血值，【寒蕊】自身每秒流失10%血量，最多存在13秒。",
            "belong_key": "belong_101371"
        }
    },
    "102278": {
        "102280": {
            "name": "一阳指·悟",
            "attributes": {
                "neutral_damage_base": 1
            },
            "recipes": [
                "recipe_17488_1",
                "recipe_17489_1"
            ],
            "buffs": [
                71388
            ],
            "skills": [
                102280
            ],
            "desc": "对敌方造成伤害，若任脉能量较少则回复20点任脉能量，否则回复20点督脉能量。",
            "belong_key": "belong_102280"
        },
        "102281": {
            "name": "空蒙扇·悟",
            "recipes": [
                "recipe_17490_1",
                "recipe_17491_1"
            ],
            "buffs": [
                71609
            ],
            "skills": [
                102303
            ],
            "desc": "对敌方造成伤害，并使其受到自身{扇招式}伤害提高30%，持续12秒。",
            "belong_key": "belong_102281"
        },
        "102282": {
            "name": "引窍·悟",
            "attributes": {
                "neutral_damage_base": 1
            },
            "recipes": [
                "recipe_17492_1",
                "recipe_17493_1"
            ],
            "buffs": [
                70729
            ],
            "skills": [
                102282
            ],
            "desc": "对敌方造成伤害。{经脉畅行}下会消耗50点任督二脉能量，使招式伤害提高100%且无需运功，并获得4秒{游风}。",
            "belong_key": "belong_102282"
        },
        "102285": {
            "name": "截阳·悟",
            "recipes": [
                "recipe_17498_1",
                "recipe_17499_1"
            ],
            "buffs": [
                70161,
                70167
            ],
            "skills": [
                102309
            ],
            "desc": "打断目标运功并造成伤害，自身获得40点督脉能量。",
            "belong_key": "belong_102285"
        },
        "102286": {
            "name": "断脉·悟",
            "recipes": [
                "recipe_17500_1",
                "recipe_17501_1"
            ],
            "buffs": [
                71395
            ],
            "skills": [
                102311,
                102318
            ],
            "desc": "对目标造成2次伤害，自身获得30点任脉能量。",
            "belong_key": "belong_102286"
        },
        "102290": {
            "name": "一阳化生·悟",
            "skills": [
                102312
            ],
            "desc": "持续在目标区域造成伤害。招式伤害和招式会心率会随着命中次数递进，每次命中目标使自身获得10点任督二脉能量。",
            "belong_key": "belong_102290"
        },
        "102278": {
            "name": "周天功·悟",
            "attributes": {
                "magical_shield_base": 2347,
                "physical_shield_base": 2850,
                "neutral_critical_strike_base": 5527,
                "spunk_to_neutral_attack_power": 1997,
                "spunk_to_neutral_critical_strike": 461,
                "max_life_gain": 245,
                "magical_attack_power_base": 6518,
                "all_shield_ignore": 614,
                "pve_addition_base": 870
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "skills": [
                38034
            ],
            "desc": "一门通过聚气丹田，从而打通人体经脉的气功修行之法。下分大、小周天，其中大多数段氏弟子修行的小周天主要以任督二脉为主，配以指法，则可凌空化气，号为一阳。配以扇法，则可御风为媒，劈刃飞光。",
            "critical_type": "neutral",
            "damage_type": "neutral",
            "belong_key": "belong_102278"
        },
        "102283": {
            "name": "锁神·悟",
            "recipes": [
                "recipe_17494_1",
                "recipe_17495_1"
            ],
            "skills": [
                102305,
                102313
            ],
            "desc": "持续运功，连续对敌方造成伤害。每次命中目标时，若任脉能量较少则回复10点任脉能量，否则回复10点督脉能量。",
            "belong_key": "belong_102283"
        },
        "102284": {
            "name": "破穴·悟",
            "recipes": [
                "recipe_17496_1",
                "recipe_17497_1"
            ],
            "skills": [
                102306
            ],
            "desc": "对敌方造成伤害并使其{定身}，持续3秒。{经脉畅行}下会消耗50点任督二脉能量，使定身时长提高2秒，并获得4秒{游风}。",
            "belong_key": "belong_102284"
        },
        "102287": {
            "name": "骤风令·悟",
            "recipes": [
                "recipe_17502_1",
                "recipe_17503_1"
            ],
            "skills": [
                102310
            ],
            "desc": "扇起骤风，朝选中方向席卷而去，对沿途敌方造成伤害，并将其击飞。",
            "belong_key": "belong_102287"
        },
        "102293": {
            "name": "驭风·悟",
            "desc": "每次施展【对阵招式】，降低【风流云散·悟】2秒调息时间。",
            "belong_key": "belong_102293"
        },
        "102294": {
            "name": "逆脉·悟",
            "attributes": {
                "neutral_critical_strike_rate": 1500
            },
            "desc": "自身会心率提高15%，施展{指法招式}可降低【风流云散·悟】1秒调息时间。",
            "belong_key": "belong_102294"
        },
        "102295": {
            "name": "佑风·悟",
            "buffs": [
                71401
            ],
            "desc": "消耗任督二脉能量使自身{扇招式}伤害提高10%，持续20秒，可叠加3层。",
            "belong_key": "belong_102295"
        },
        "102296": {
            "name": "风扬·悟",
            "buffs": [
                71611
            ],
            "desc": "消耗任督二脉能量的招式处于“经脉畅行”下施展时，无视目标40%内功防御并返还全额调息时间。",
            "belong_key": "belong_102296"
        },
        "102297": {
            "name": "入静·悟",
            "attributes": {
                "neutral_critical_power_rate": 100
            },
            "desc": "施展对阵招式获得或消耗任督二脉能量时，降低{扇招式}调息时间1.5秒。",
            "belong_key": "belong_102297"
        },
        "102298": {
            "name": "奇脉·悟",
            "buffs": [
                71612
            ],
            "desc": "开始运功时，受到的伤害降低20%，持续3秒，完成运功时，造成的伤害提高20%，持续12秒。",
            "belong_key": "belong_102298"
        },
        "102291": {
            "name": "抟风令·悟",
            "skills": [
                102316
            ],
            "desc": "每秒将敌方拉拽至中心并使其{轻功沉默}1.5秒。运功完成后击飞区域中心半径5尺内敌方并对其造成伤害。",
            "belong_key": "belong_102291"
        }
    },
    "102393": {
        "102393": {
            "name": "幽罗引·悟",
            "attributes": {
                "magical_shield_base": 2347,
                "physical_shield_base": 2850,
                "pve_addition_base": 911,
                "all_shield_ignore": 614,
                "spirit_to_lunar_attack_power": 1974,
                "spirit_to_lunar_critical_strike": 512,
                "lunar_critical_strike_base": 2412,
                "magical_attack_power_base": 7459,
                "max_life_gain": 245
            },
            "recipes": [
                "recipe_1711_1"
            ],
            "buffs": [
                71590
            ],
            "skills": [
                43087
            ],
            "desc": "无相楼秘传心法，化气凝丝，绕指无形。",
            "critical_type": "lunar",
            "damage_type": "lunar",
            "belong_key": "belong_102393"
        },
        "102402": {
            "name": "勾线·悟",
            "recipes": [
                "recipe_17535_1",
                "recipe_17536_1"
            ],
            "buffs": [
                71559
            ],
            "skills": [
                102438
            ],
            "desc": "每0.5秒对目标路径造成伤害，持续3秒。该招式施展期间，使用{伶影招式}时不会打断。每跳使目标获得1层{缠绞}。",
            "belong_key": "belong_102402"
        },
        "102403": {
            "name": "连环慢·悟",
            "attributes": {
                "lunar_damage_base": 1
            },
            "recipes": [
                "recipe_17537_1",
                "recipe_17538_1"
            ],
            "buffs": [
                71616
            ],
            "skills": [
                102403
            ],
            "desc": "充能2层，操控伶影冲向目标发起攻击，对目标范围4尺目标造成伤害并定身2秒。",
            "belong_key": "belong_102403"
        },
        "102404": {
            "name": "生地狱·悟",
            "recipes": [
                "recipe_17533_1",
                "recipe_17534_1"
            ],
            "buffs": [
                70161
            ],
            "skills": [
                102413
            ],
            "desc": "立即消除伶影前方矩形范围目标身上最多6层{缠绞}效果，对范围内目标连续穿刺3次造成伤害。每消除1层{缠绞}，伤害提高15%。",
            "belong_key": "belong_102404"
        },
        "102412": {
            "name": "夹线·悟",
            "attributes": {
                "lunar_damage_base": 1
            },
            "recipes": [
                "recipe_17541_1",
                "recipe_17542_1"
            ],
            "buffs": [
                71561
            ],
            "skills": [
                102412
            ],
            "desc": "对敌方造成伤害。使目标定身5秒。",
            "belong_key": "belong_102412"
        },
        "102401": {
            "name": "挑丝·悟",
            "attributes": {
                "lunar_damage_base": 1
            },
            "recipes": [
                "recipe_17527_1",
                "recipe_17528_1"
            ],
            "skills": [
                102401
            ],
            "desc": "向目标位置发射丝线刺穿目标，对目标的路径上最多5个目标造成伤害，使目标获得2层{缠绞}。",
            "belong_key": "belong_102401"
        },
        "102400": {
            "name": "四边静·悟",
            "recipes": [
                "recipe_17529_1",
                "recipe_17530_1"
            ],
            "skills": [
                102409,
                102443
            ],
            "desc": "伶影对8尺范围内的目标造成伤害，并消耗目标身上至多6层{缠绞}，根据消耗层数造成眩晕（每层眩晕0.5秒）。",
            "belong_key": "belong_102400"
        },
        "102411": {
            "name": "驻云飞·悟",
            "attributes": {
                "lunar_damage_base": 1
            },
            "recipes": [
                "recipe_17543_1",
                "recipe_17544_1"
            ],
            "skills": [
                102411,
                102422
            ],
            "desc": "对目标造成伤害，并操控伶影冲向目标，打断目标运功。",
            "belong_key": "belong_102411"
        },
        "102414": {
            "name": "绊线·悟",
            "attributes": {
                "lunar_damage_base": 1
            },
            "recipes": [
                "recipe_17539_1",
                "recipe_17540_1"
            ],
            "skills": [
                102415
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_102414"
        },
        "102428": {
            "name": "双音·悟",
            "buffs": [
                71585
            ],
            "desc": "傍身招式施展后，使自身下一个{伶影招式}造成伤害提高30%。",
            "belong_key": "belong_102428"
        },
        "102429": {
            "name": "偃卫·悟",
            "desc": "在伶影20尺范围内，自身受到伤害降低15%。",
            "belong_key": "belong_102429"
        },
        "102430": {
            "name": "谐调·悟",
            "recipes": [
                "recipe_17551_1",
                "recipe_17554_1",
                "recipe_17555_1"
            ],
            "buffs": [
                71587
            ],
            "desc": "{伶影招式}造成伤害提高15%。施展后使自身伤害提高10%，持续20秒。",
            "belong_key": "belong_102430"
        },
        "102431": {
            "name": "歇拍·悟",
            "desc": "“绝技”持续期间自身不受{外功沉默}{内功沉默}{轻功沉默}效果影响。",
            "belong_key": "belong_102431"
        },
        "102432": {
            "name": "协幽·悟",
            "skills": [
                102444
            ],
            "desc": "傍身招式施展时若伶影在当前目标6尺内，则会触发一次伶影合击，造成内功伤害及破招伤害。每3.5秒至多触发一次，该触发间隔受到自身加速影响。",
            "belong_key": "belong_102432"
        },
        "102433": {
            "name": "移宫·悟",
            "desc": "“千丝落絮”施展时若伶影在场则不再飘荡，而是改为与自身伶影交换位置并返还15秒调息时间，随后在5秒内免控。",
            "belong_key": "belong_102433"
        },
        "102421": {
            "name": "障幕虚影·悟",
            "buffs": [
                71577
            ],
            "skills": [
                102435,
                102436
            ],
            "desc": "使目标范围6尺的目标陷入{障幕虚影}持续11秒，使其获得6层{缠绞}。期间自身傍身招式替换为{千里急·悟}，每次自身施展{伶影招式}时，使下一次“千里急·悟”造成的伤害提高200%。",
            "belong_key": "belong_102421"
        },
        "102434": {
            "name": "锁南枝·悟",
            "skills": [
                102439,
                102441
            ],
            "desc": "生成一个15尺的“锁南枝”，持续5秒。在范围内减速50%，每0.5秒受到1次伤害。并激活{锁南枝·贰式}。",
            "belong_key": "belong_102434"
        }
    },
    "0": {
        "10438": {
            "name": "世界奇遇",
            "buffs": [
                10100
            ],
            "belong_key": "belong_10438"
        },
        "10179": {
            "name": "帮会",
            "buffs": [
                18428,
                2563
            ],
            "belong_key": "belong_10179"
        },
        "10067": {
            "name": "烹饪",
            "buffs": [
                29274,
                29276,
                29284,
                29285
            ],
            "belong_key": "belong_10067"
        },
        "10071": {
            "name": "医术",
            "buffs": [
                29288,
                29289
            ],
            "belong_key": "belong_10071"
        },
        "23768": {
            "name": "家园交互",
            "buffs": [
                27784,
                27785,
                27786,
                27787,
                27788,
                27792,
                17349,
                17352,
                17355,
                17358,
                17361,
                17365
            ],
            "belong_key": "belong_23768"
        },
        "545": {
            "name": "婆罗门",
            "buffs": [
                673
            ],
            "desc": "使周围队友<BUFF 673 0 desc>，持续<BUFF 673 0 time>。<TALENT 5892 1 效果提高100%><TALENT 2723 2 效果提高50%><TALENT 23457 1 可触发“剑舞”状态，能对周围10尺内的10个目标每秒造成<SUB 506 27>点阴性内功伤害，首跳伤害为目标添加一层“急曲”不利效果。若“琼霄”伤害命中的目标有3层急曲，则造成一次额外伤害。该效果每20秒至多触发一次；该状态持续20秒，无法在水中维持且移动后消失><TALENT 41884 1 “婆罗门”调息时间增加至50秒，施展“婆罗门”后对自身20尺内最多10个带有自身“上元点鬟”效果的团队成员造成治疗并刷新“上元点鬟”效果。每次施展“上元点鬟”主动招式返还1秒调息时间>",
            "belong_key": "belong_545"
        },
        "567": {
            "name": "左旋右转",
            "recipes": [
                "recipe_211_1",
                "recipe_212_1",
                "recipe_213_1",
                "recipe_214_1",
                "recipe_215_1",
                "recipe_216_1",
                "recipe_217_1"
            ],
            "buffs": [
                20938
            ],
            "desc": "需“名动四方”触发的剑舞状态，持续运功4.69秒为自身17尺内所有团队成员回复5次气血值<SUB 6251 0>，每次效果作用时自身每215点基础根骨使团队成员无双等级提高126点，持续24秒，该气劲时间可叠加，最高叠加100层，最多120秒。若周围20尺友方目标数量少于等于10人，则造成的治疗效果提升120%。释放时使团队成员受到的伤害降低15%，持续5秒。<TALENT 5883 1 为“雨霖铃”的目标额外回复气血值>",
            "belong_key": "belong_567"
        },
        "30850": {
            "name": "泠风解怀",
            "buffs": [
                23573
            ],
            "desc": "需要“名动四方”触发的剑舞状态，链接自身与友方目标，使目标气血值回复<SUB 30851 1>，链接持续6秒，若双方距离超过25尺则提前结束链接状态。链接期间持续回复目标<SUB 30853 1>气血值，使目标与自身伤害提高15%、治疗成效提高15%，每0.5秒减少自身“风袖低昂”调息时间0.25秒与目标“梦冧”气劲持续时间0.25秒。",
            "belong_key": "belong_30850"
        },
        "404": {
            "name": "撼如雷",
            "buffs": [
                362
            ],
            "desc": "使周围队友<BUFF 362 0 desc>，持续<BUFF 362 0 time>，使自身获得“激雷”效果，“激雷”效果持续期间外功会心提高30%，持续6秒。<TALENT 5678 1 效果持续期间自身无视目标70%外功防御，效果持续时间提高200%><TALENT 14800 1 调息时间降低5秒，施展后强制半径10尺内最多5个目标攻击自身，持续4秒><TALENT 6806 1 施展后小队成员的外功破防值提高20%，外功基础攻击力提高20%，持续6秒><TALENT 2600 2 效果提高50%><TALENT 37338 1 施展后获得12秒“背水一战”效果。背水一战：每2秒对自身造成最大气血值2%的伤害，同时对自身6尺内2名敌对侠士目标额外造成<SUB 37350 1>外功伤害，持续12秒，若命中目标，则下次伤害增加20%，最多提高100%><TALENT 42310 1 >",
            "belong_key": "belong_404"
        },
        "6806": {
            "name": "激雷",
            "buffs": [
                6363
            ],
            "desc": "施展“撼如雷”后小队成员的外功破防值提高25%，外功基础攻击力提高30%，持续6秒。",
            "belong_key": "belong_6806"
        },
        "401": {
            "name": "破风",
            "buffs": [
                661
            ],
            "desc": "击破目标护甲，使其<BUFF 661 0 desc>，<BUFF 3442 0 desc>(+<SKILLEx {D0} {TotalPhysicsAP 0.2583}>)，持续<BUFF 661 0 time>。<TALENT 5652 1 “龙牙”命中后刷新目标身上的“破风”效果><TALENT 6523 1 伤害提高15%，可使目标6尺范围内额外3个目标受到“破风”效果影响><TALENT 6522 1 对目标周围6尺的2个目标作用><EnchantID 10089 铁牢心法下，施展\"破风\"，使目标获得的“破风”外功不利效果可叠加3层。><EnchantID 10087 傲雪心法下，“破风”流血持续伤害效果每跳使“灭”的调息时间降低1秒，同一时间只有一个流血效果生效。>",
            "belong_key": "belong_401"
        },
        "18872": {
            "name": "劲风",
            "buffs": [
                12717
            ],
            "desc": "“龙吟”附带的“破风”效果提高33%，并使目标造成的伤害降低10%。",
            "belong_key": "belong_18872"
        },
        "2603": {
            "name": "乘龙箭",
            "buffs": [
                3465
            ],
            "desc": "运功0.5秒，打断目标运功，对目标造成<SUB 13778 0>外功伤害，并使其<BUFF 3465 0 desc>，持续<BUFF 3465 0 time>，自身将获得一点“战意”，命中超过地面8尺以上的目标会将其击落倒地2秒，马上方可施展。<TALENT 28564 1 运功命中10尺外的目标时，重置自身“断魂刺”和“破坚阵”的招式调息时间,每次骑御状态下只可触发一次><TALENT 18557 1 “乘龙箭”命中有自身“破军”效果的目标，在目标位置生成一个半径6尺持续4秒的“飞鸣镝”区域，区域内最多5个敌对目标每秒会受到<SUB 32979 1>外功伤害。在区域内施展“撼如雷”则会引爆该区域对其中5个敌对目标造成<SUB 32980 1>外功伤害并使目标获得1层“重创”效果>",
            "belong_key": "belong_2603"
        },
        "15115": {
            "name": "号令三军",
            "buffs": [
                23107
            ],
            "desc": "一鼓，自身每2820点基础体质使团队成员无双等级提高715点，最多100层，持续30秒；二鼓，团队成员的无双提高层数衰减一半，持续30秒；三鼓，团队成员受到的所有伤害提高10%，持续至战斗结束，该招式每场战斗只能施展一次。<TALENT 42574 1 >",
            "belong_key": "belong_15115"
        },
        "246": {
            "name": "立地成佛",
            "buffs": [
                566
            ],
            "desc": "需禅那点，对目标造成大量威胁和阳性内功伤害，最少一点禅那使周围5尺内最多5个目标<BUFF 564 0 desc>，最多三点禅那使周围5尺内最多5个目标<BUFF 566 0 desc>，持续<BUFF 566 0 time>。",
            "belong_key": "belong_246"
        },
        "5939": {
            "name": "禅语",
            "buffs": [
                6214
            ],
            "desc": "“大狮子吼”施展后，自身每2820点基础体质使团队成员气血上限提高2226点，无双等级提高126点，最多100层，持续25秒。",
            "belong_key": "belong_5939"
        },
        "31208": {
            "name": "秋肃",
            "buffs": [
                29294
            ],
            "desc": "受到自身治疗的队友可获得“秋肃”效果，每层使其无双提高126点，自身每215点基础根骨可叠加1层，最多100层，持续60秒。",
            "belong_key": "belong_31208"
        },
        "32381": {
            "name": "落子无悔",
            "buffs": [
                24350
            ],
            "desc": "在自身范围引爆所有棋子，造成一次治疗效果。每引爆一个棋子，对15尺范围内团队成员添加一秒的“落子无悔”持续治疗效果，最多添加3秒。若场上黑子多于白子，将使受到治疗的成员额外受到“落墨”效果，使受到的伤害降低20%，持续7秒，不可与其他减伤效果叠加。若白子多于黑子，则将使受到治疗的成员受到“皎素”效果，提高5%的会心效果，持续10秒。",
            "belong_key": "belong_32381"
        },
        "362": {
            "name": "碎星辰",
            "buffs": [
                378
            ],
            "desc": "产生一个10尺的气场，范围内自身外功会心率提高5%，外功会心效果提高10%，威胁值降低20%，小队成员外功会心效果提高10%，持续24秒，若距离气场13尺内施展“人剑合一”则会产生“云中剑·碎星辰”在自身5尺内环绕8秒，对范围内4个目标造成<SUB 21979 2>外功伤害。<TALENT 6472 1 拥有增益气场气劲时，自身混元内功和外功基础攻击提高10%，处于该气场中时也会获得“玄应之气”（和“生太极”获取“玄应之气”效果不会同时触发）><TALENT 14829 1 持续时间增加12秒，对自身的效果提高100%><TALENT 2691 1 效果提高25%><TALENT 2691 2 效果提高50%><TALENT 18799 1 只对自己生效，处于“碎星辰”期间自身无视目标60%外功防御，“三环套月”伤害提高30%。“碎星辰”变为无调息时间><TALENT 6914 1 气场存在时间延长15秒><EnchantID 10074 太虚剑意下施展气场，气场每3秒对范围内所有目标造成中等外功伤害效果><TALENT 6747 1 “人剑合一”引爆“碎星辰”使自身基础攻击提高5%，持续8秒，可以叠加3层>",
            "belong_key": "belong_362"
        },
        "359": {
            "name": "破苍穹",
            "recipes": [
                "recipe_46_1",
                "recipe_47_1",
                "recipe_48_1",
                "recipe_49_1",
                "recipe_50_1",
                "recipe_51_1",
                "recipe_52_1",
                "recipe_53_1",
                "recipe_54_1"
            ],
            "buffs": [
                375
            ],
            "desc": "产生一个10尺的气场，范围内自身内功会心率提高5%，内功会心效果提高10%，威胁值降低20%，小队成员内功会心效果提高10%，持续24秒。<TALENT 23614 1 变为无调息时间，只对自己生效，处于“破苍穹”期间自身无视目标60%内功防御><TALENT 14834 1 气场持续时间增加12秒，对自身的增益效果提高100%，在该气场范围内施展“紫气东来”则“紫气东来”持续时间提高4秒><TALENT 6747 1 “人剑合一”引爆“破苍穹”使自己加速率提高3%，持续8秒，可以叠加3层>",
            "belong_key": "belong_359"
        },
        "29093": {
            "name": "剑锋百锻",
            "buffs": [
                29354
            ],
            "desc": "运功3秒，运功期间免疫一切负面效果，使自身以及10尺内2个小队成员获得“百锻”持续60秒，“百锻”期间破防值提高，若已有该效果，则它将获得强化，最多2次，“百锻”期间，对侠士造成伤害或重伤都会延长时间最多延长至5分钟。",
            "belong_key": "belong_29093"
        },
        "2234": {
            "name": "仙王蛊鼎",
            "buffs": [
                24742
            ],
            "desc": "在地面放置一个仙王蛊鼎，15尺内的队友在气血值低于50%时会回复25%气血值，使团队成员受到的伤害降低15%，持续5秒。自身每215点基础根骨使周围15尺内所有团队成员的无双等级提高455点，最高叠加100层，该效果仅在战斗状态下维持，仙王蛊鼎消失后结束，该效果在115秒内只能获得一次。你所属的小队或团队成员可以点击它，每人每15秒只能使用一次，最多可被使用20次。使用后恢复20%内力值。仙王蛊鼎在30秒之后消失。",
            "belong_key": "belong_2234"
        },
        "3980": {
            "name": "戒火斩",
            "attributes": {
                "solar_damage_base": 272,
                "solar_damage_rand": 28
            },
            "recipes": [
                "recipe_1613_1",
                "recipe_1614_1",
                "recipe_1615_1",
                "recipe_1616_1",
                "recipe_1617_1",
                "recipe_1618_1",
                "recipe_1619_1",
                "recipe_1620_1"
            ],
            "buffs": [
                4058
            ],
            "desc": "对目标造成<SKILL SolarDamage>点(+<SKILLEx {D0} {SkillSolarAP}>)阳性内功伤害，并使其<BUFF 4058 1 desc>，持续<BUFF 4058 1 time>。该招式附带额外威胁值。<TALENT 6766 1 施展后获得20点日灵、月魂><EnchantID 10096 戒火斩使目标的易伤效果由2%提高到5%>",
            "belong_key": "belong_3980"
        },
        "3985": {
            "name": "朝圣言",
            "recipes": [
                "recipe_5818_1",
                "recipe_5819_1"
            ],
            "buffs": [
                4246
            ],
            "desc": "持续运功固定8秒，期间自身受到的伤害降低60%，免疫来自侠士目标的打断和移动限制。运功期间自身每2820点基础体质使12尺内团队成员获得1层“朝圣”：无双等级提高556点，最多100层。<TALENT 14680 1 施展时会消耗掉所有日灵、月魂，每2点日灵、月魂将降低1秒“朝圣言”调息时间><TALENT 6000 1 “日月净世”、“大圣明尊法”套路招式造成阴性或阳性伤害时，朝圣言的调息时间降低1秒><TALENT 14678 1 效果期间不再为团队成员回复气血值，但是自身每2410点基础体质使团队成员无双等级提高759点，最多100层，且附带无威胁气劲><TALENT 14679 1 效果期间团队成员不再获得无双等级提升效果，但是受到的所有伤害降低30%><TALENT 6749 1 每闪避一次目标攻击调息时间降低6秒，该效果3秒内最多触发一次>",
            "belong_key": "belong_3985"
        },
        "14678": {
            "name": "圣浴明心",
            "buffs": [
                4246
            ],
            "desc": "完整运功“朝圣言”使自身“朝圣”效果延长5分钟，但层数衰减至十分之一；“朝圣”每层提供的无双等级提高至835点。",
            "belong_key": "belong_14678"
        },
        "13050": {
            "name": "盾飞",
            "recipes": [
                "recipe_1953_1",
                "recipe_1954_1",
                "recipe_1955_1",
                "recipe_1956_1",
                "recipe_1957_1",
                "recipe_1958_1"
            ],
            "buffs": [
                8248
            ],
            "desc": "自身切换到“擎刀”姿态，使目标虚弱25秒。将盾牌掷出对目标进行攻击，每次攻击对目标造成100%的武器伤害外加<SUB 13463 0>外功伤害，盾牌攻击目标50次或15秒后将被动收回。<TALENT 13318 1 伤害降低20%，可对击中的目标周围10尺的其他敌对目标进行弹射><TALENT 13320 1 命中目标后使其受所有伤害输出降低5%，持续15秒><TALENT 13372 1 “盾飞”会心率、会心效果提高15%，施展“盾飞”降低“盾猛”2秒调息时间><TALENT 13368 1 附带嘲讽效果，强制目标攻击自身3秒，10秒内无法再嘲讽此目标><TALENT 13397 1 命中的第一个目标若正在运功，则使该目标2秒内无法运功><TALENT 13374 1 盾牌首次击中目标时，使目标移动速度降低60%，持续6秒><TALENT 13133 1 施展“盾飞”，“斩刀”调息时间降低5秒，且使“绝刀”伤害增加30%，持续15秒。若施展“斩刀”命中虚弱非侠士目标，则6秒内下一次施展“绝刀”可返还所消耗的怒气><TALENT 22897 1 施展“盾飞”使自身外功破防等级提高15%，“盾飞”伤害提高100%，持续30秒><TALENT 34540 1 >",
            "belong_key": "belong_13050"
        },
        "13422": {
            "name": "振奋",
            "buffs": [
                8504
            ],
            "desc": "施展“盾挡”后，自身每2820点基础体质使得自身20尺范围内最多25个团队成员无双提高101点，持续30秒。",
            "belong_key": "belong_13422"
        },
        "15072": {
            "name": "寒啸千军",
            "buffs": [
                10031
            ],
            "desc": "消耗20点格挡值，鼓舞友方士气，使自身半径20尺内最多25名友方目标无双率提高5%，持续15秒。",
            "belong_key": "belong_15072"
        },
        "18819": {
            "name": "庄周梦",
            "buffs": [
                23543
            ],
            "desc": "为目标添加治疗持续效果时，自身每215点基础根骨使目标无双等级提高126点，最高叠加100层，持续40秒。",
            "belong_key": "belong_18819"
        },
        "28678": {
            "name": "飘黄",
            "recipes": [
                "recipe_5602_1"
            ],
            "buffs": [
                20854
            ],
            "skills": [
                29532
            ],
            "desc": "“逐云寒蕊”不再产生隐匿效果，调息时间降低24秒，自身每215点根骨使得“逐云寒蕊”15尺范围的输出心法团队成员获得一层<NounID 22>效果，最多100层，持续30秒。该效果在50秒内只能享受一次。",
            "belong_key": "belong_28678"
        },
        "100460": {
            "name": "左旋右转·悟",
            "recipes": [
                "recipe_16530_1",
                "recipe_16531_1"
            ],
            "buffs": [
                70684
            ],
            "desc": "需持续运功，每秒回复范围内友方的气血值，并使范围内团队成员获得{罗裳·悟}。",
            "belong_key": "belong_100460"
        },
        "100424": {
            "name": "龙吟·悟",
            "attributes": {
                "physical_damage_base": 1
            },
            "recipes": [
                "recipe_16633_1",
                "recipe_16634_1"
            ],
            "buffs": [
                70021
            ],
            "desc": "对敌方造成伤害，同时附带{流血}，持续14秒，可叠加2层。",
            "belong_key": "belong_100424"
        },
        "100431": {
            "name": "号令三军·悟",
            "buffs": [
                70160
            ],
            "desc": "使战斗中团队成员获得{号令·悟}，持续30秒。施展后招式替换为【无往不利·悟】，持续至脱离战斗。",
            "belong_key": "belong_100431"
        },
        "102319": {
            "name": "无往不利·悟",
            "buffs": [
                70167
            ],
            "desc": "运功3秒使团队成员获得增益，持续60秒。",
            "belong_key": "belong_102319"
        },
        "101766": {
            "name": "立地成佛·悟",
            "attributes": {
                "solar_damage_base": 1
            },
            "recipes": [
                "recipe_17176_1",
                "recipe_17177_1"
            ],
            "buffs": [
                71070
            ],
            "desc": "对敌方造成伤害。",
            "belong_key": "belong_101766"
        },
        "101759": {
            "name": "大狮子吼·悟",
            "attributes": {
                "solar_damage_base": 1
            },
            "recipes": [
                "recipe_17168_1",
                "recipe_17169_1"
            ],
            "buffs": [
                71417
            ],
            "desc": "对敌方造成伤害，命中后生成一个{禅灵}。",
            "belong_key": "belong_101759"
        },
        "100120": {
            "name": "彼针·悟",
            "recipes": [
                "recipe_16665_1",
                "recipe_16666_1"
            ],
            "buffs": [
                71435
            ],
            "desc": "为友方恢复气血值。",
            "belong_key": "belong_100120"
        },
        "100687": {
            "name": "女娲补天·悟",
            "recipes": [
                "recipe_16801_1",
                "recipe_16802_1"
            ],
            "buffs": [
                71436
            ],
            "desc": "受到的{锁足}{定身}{眩晕}{击倒}控制效果持续时间降低20%，持续8秒。",
            "belong_key": "belong_100687"
        },
        "100935": {
            "name": "圣焰令·悟",
            "buffs": [
                71433
            ],
            "desc": "在目标点6尺区域燃起圣焰，6秒内每秒对敌对目标造成阳性内功伤害。20尺内团队成员获得60秒{净琉璃·悟}，自身处于圣焰中受到的伤害降低80%。",
            "belong_key": "belong_100935"
        },
        "100874": {
            "name": "朝圣言·悟",
            "buffs": [
                71433
            ],
            "desc": "持续运功使范围敌方强制攻击自身。期间自身受到的伤害降低60%，20尺内团队成员持续获得{朝圣·悟}。",
            "belong_key": "belong_100874"
        },
        "101339": {
            "name": "盾挡·悟",
            "recipes": [
                "recipe_17277_1",
                "recipe_17278_1"
            ],
            "buffs": [
                70489
            ],
            "desc": "自身招架率提高25%，拆招值提高40%，持续11秒，造成的威胁值提高30%，持续8秒。",
            "belong_key": "belong_101339"
        },
        "101344": {
            "name": "寒啸千军·悟",
            "buffs": [
                70501
            ],
            "desc": "鼓舞友方士气，使团队成员无双率提高。",
            "belong_key": "belong_101344"
        },
        "101144": {
            "name": "角·悟",
            "recipes": [
                "recipe_16952_1",
                "recipe_16953_1"
            ],
            "buffs": [
                71437
            ],
            "desc": "为友方恢复气血值并添加{角}，持续16秒。",
            "belong_key": "belong_101144"
        },
        "101401": {
            "name": "灵素·悟",
            "buffs": [
                71439
            ],
            "desc": "汲从百草，承典济芳。此乃药宗一脉相传之术，蕴合《神农本草经》之要义；以百草为根，佐以药寒性、温性之效；驱种植株，愈病诊疾，仁心圣手。",
            "belong_key": "belong_101401"
        },
        "101413": {
            "name": "青川濯莲·悟",
            "buffs": [
                71438
            ],
            "desc": "在目标区域生长植物【濯莲】为10尺范围内的友方目标恢复气血值，【濯莲】自身每秒流失10%血量，最多存在15秒。",
            "belong_key": "belong_101413"
        },
        "745": {
            "name": "天鼓雷音阵",
            "buffs": [
                919,
                920,
                940
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_745"
        },
        "347": {
            "name": "九宫八卦阵",
            "buffs": [
                938,
                943,
                949
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_347"
        },
        "778": {
            "name": "北斗七星阵",
            "buffs": [
                947,
                950,
                953
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_778"
        },
        "230": {
            "name": "七绝逍遥阵",
            "buffs": [
                934,
                937
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_230"
        },
        "754": {
            "name": "卫公折冲阵",
            "buffs": [
                930,
                935,
                936,
                940
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_754"
        },
        "781": {
            "name": "九音惊弦阵",
            "buffs": [
                952,
                954,
                955,
                956
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_781"
        },
        "1866": {
            "name": "依山观澜阵",
            "buffs": [
                1924,
                1925,
                1926
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_1866"
        },
        "2487": {
            "name": "万蛊噬心阵",
            "buffs": [
                2512,
                2513,
                2514,
                2510
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_2487"
        },
        "3216": {
            "name": "流星赶月阵",
            "buffs": [
                3306,
                3308,
                3309
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_3216"
        },
        "3217": {
            "name": "千机百变阵",
            "buffs": [
                3307,
                3310
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_3217"
        },
        "4674": {
            "name": "炎威破魔阵",
            "buffs": [
                4579,
                4584,
                4586
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_4674"
        },
        "5311": {
            "name": "降龙伏虎阵",
            "buffs": [
                6342,
                6343,
                6345,
                6362
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_5311"
        },
        "13275": {
            "name": "锋凌横绝阵",
            "buffs": [
                8402,
                8484,
                8403,
                8404
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_13275"
        },
        "16151": {
            "name": "霜岚洗锋阵",
            "buffs": [
                9485,
                9486,
                9492,
                9489
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_16151"
        },
        "14181": {
            "name": "万籁金弦阵",
            "buffs": [
                10954,
                11158,
                11159
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_14181"
        },
        "20702": {
            "name": "墟海引归阵",
            "buffs": [
                14074,
                14092,
                14095
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_20702"
        },
        "22798": {
            "name": "龙皇雪风阵",
            "buffs": [
                15957,
                15960,
                15961,
                15963
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_22798"
        },
        "25517": {
            "name": "九星游年阵",
            "buffs": [
                18335,
                18336,
                18337
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_25517"
        },
        "28919": {
            "name": "乱暮浊茵阵",
            "buffs": [
                21035
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_28919"
        },
        "33057": {
            "name": "横云破锋阵",
            "buffs": [
                24578,
                24581
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_33057"
        },
        "36318": {
            "name": "苍梧引灵阵",
            "buffs": [
                27236,
                27238
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_36318"
        },
        "38566": {
            "name": "含章挺秀阵",
            "buffs": [
                29481,
                29482
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_38566"
        },
        "41984": {
            "name": "连丝织意阵",
            "buffs": [
                31962,
                31968,
                31969
            ],
            "desc": "需至少一名队友在身边，结阵。",
            "belong_key": "belong_41984"
        },
        "102268": {
            "name": "移动端_江湖无界阵",
            "buffs": [
                71338
            ],
            "belong_key": "belong_102268"
        },
        "42767": {
            "name": "精简护手腰带加速DOT触发",
            "skills": [
                42837
            ],
            "belong_key": "belong_42767"
        },
        "40788": {
            "name": "精简护手特效伤害",
            "skills": [
                40789
            ],
            "belong_key": "belong_40788"
        },
        "42895": {
            "name": "防御护手特效加护盾",
            "buffs": [
                32019
            ],
            "skills": [
                42898
            ],
            "belong_key": "belong_42895"
        },
        "41062": {
            "name": "防御护手特效伤害",
            "skills": [
                41069
            ],
            "belong_key": "belong_41062"
        },
        "38939": {
            "name": "黄字鞋子加会心",
            "buffs": [
                29524
            ],
            "belong_key": "belong_38939"
        },
        "38944": {
            "name": "黄字鞋子加破防",
            "buffs": [
                29526
            ],
            "belong_key": "belong_38944"
        },
        "40793": {
            "name": "精简下装提高无双_正常版",
            "buffs": [
                30748
            ],
            "belong_key": "belong_40793"
        },
        "40794": {
            "name": "精简下装适应之力_高级版",
            "buffs": [
                30749,
                30770
            ],
            "belong_key": "belong_40794"
        },
        "41064": {
            "name": "防御下装特效叠层伤害",
            "buffs": [
                30948
            ],
            "skills": [
                41073
            ],
            "belong_key": "belong_41064"
        },
        "40791": {
            "name": "精简腰带提高属性_高级版",
            "buffs": [
                30743
            ],
            "belong_key": "belong_40791"
        },
        "40790": {
            "name": "精简腰带提高属性_正常版",
            "buffs": [
                30742
            ],
            "belong_key": "belong_40790"
        },
        "41063": {
            "name": "防御腰带特效加破招",
            "buffs": [
                30946
            ],
            "belong_key": "belong_41063"
        },
        "38934": {
            "name": "黄字帽子适应之力",
            "buffs": [
                29519
            ],
            "belong_key": "belong_38934"
        },
        "38949": {
            "name": "黄字腰坠加会效",
            "buffs": [
                29537
            ],
            "belong_key": "belong_38949"
        },
        "38948": {
            "name": "黄字腰坠加破防",
            "buffs": [
                29536
            ],
            "belong_key": "belong_38948"
        },
        "41065": {
            "name": "防御戒指特效加血",
            "buffs": [
                30950
            ],
            "belong_key": "belong_41065"
        },
        "40804": {
            "name": "精简戒指3加破招",
            "buffs": [
                30757
            ],
            "belong_key": "belong_40804"
        },
        "40802": {
            "name": "精简戒指1加破防",
            "buffs": [
                30755
            ],
            "belong_key": "belong_40802"
        },
        "40803": {
            "name": "精简戒指2加会心",
            "buffs": [
                30756
            ],
            "belong_key": "belong_40803"
        },
        "38946": {
            "name": "黄字项链破防加攻击",
            "buffs": [
                29529
            ],
            "belong_key": "belong_38946"
        },
        "38945": {
            "name": "黄字项链会心加会效",
            "buffs": [
                29528
            ],
            "belong_key": "belong_38945"
        },
        "38950": {
            "name": "黄字暗器",
            "skills": [
                38966
            ],
            "belong_key": "belong_38950"
        },
        "39088": {
            "name": "130级CW风",
            "buffs": [
                29608
            ],
            "belong_key": "belong_39088"
        },
        "22035": {
            "name": "霸刀特殊武器_变身启动",
            "skills": [
                21933
            ],
            "belong_key": "belong_22035"
        },
        "4877": {
            "name": "水(2级)",
            "buffs": [
                4761
            ],
            "belong_key": "belong_4877"
        },
        "38578": {
            "name": "130级dps风",
            "buffs": [
                29268
            ],
            "belong_key": "belong_38578"
        },
        "38786": {
            "name": "130级防御特效腰坠",
            "skills": [
                38787
            ],
            "belong_key": "belong_38786"
        },
        "22169": {
            "name": "输出附魔伤害波动",
            "buffs": [
                15455
            ],
            "belong_key": "belong_22169"
        },
        "38984": {
            "name": "130dps护手固定伤害",
            "skills": [
                37562
            ],
            "belong_key": "belong_38984"
        },
        "38985": {
            "name": "130dps鞋固定伤害",
            "skills": [
                37561
            ],
            "belong_key": "belong_38985"
        },
        "22151": {
            "name": "输出附魔通用减疗提伤害",
            "attributes": {
                "magical_attack_power_base": 110,
                "all_attack_power_base": 951
            },
            "skills": [
                22151
            ],
            "belong_key": "belong_22151"
        },
        "10106": {
            "name": "内功",
            "buffs": [
                15436
            ],
            "belong_key": "belong_10106"
        },
        "22129": {
            "name": "昆吾·清晖",
            "desc": "测试技能",
            "belong_key": "belong_22129"
        },
        "33249": {
            "name": "T护手概率提高自身伤害",
            "buffs": [
                24767
            ],
            "belong_key": "belong_33249"
        },
        "22128": {
            "name": "愈",
            "desc": "测试技能",
            "belong_key": "belong_22128"
        },
        "22122": {
            "name": "新附魔T添加基础攻击",
            "belong_key": "belong_22122"
        },
        "40512": {
            "name": "新t大附魔_鞋子加内外防",
            "belong_key": "belong_40512"
        }
    }
}