export default {
  装备基础属性: {
    基础攻击: 68993,
    破防等级: 50769,
    无双等级: 84618,
    会心等级: 102448,
    会心效果等级: 30036,
    全能等级: 0,
    武器伤害_最小值: 8212,
    武器伤害_最大值: 13687,
    破招值: 5856,
    力道: 7483,
    元气: 44,
    身法: 44,
    根骨: 44,
    体质: 184036,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 17315,
    装分: 705977,
  },
  装备镶嵌附魔属性: {
    基础攻击: 8144,
    破防等级: 12334,
    无双等级: 5038,
    会心等级: 15692,
    会心效果等级: 3366,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 1122,
    力道: 2214,
    元气: 44,
    身法: 44,
    根骨: 44,
    体质: 45,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 7703,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106793,
      装备部位: '帽子',
      附魔: '攻击+761',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106825,
      装备部位: '衣服',
      附魔: '无双+836',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atSurplusValueBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 108666,
      装备部位: '腰带',
      附魔: '无双+836',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106958,
      装备部位: '护腕',
      附魔: '破防+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 106989,
      装备部位: '下装',
      附魔: '破防+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 107113,
      装备部位: '鞋子',
      附魔: '加速+2801',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 44471,
      装备部位: '项链',
      附魔: '力道+628',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 8,
      id: 47826,
      装备部位: '腰坠',
      附魔: '会心+4902',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 44364,
      装备部位: '戒指',
      附魔: '力道+628',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 44364,
      装备部位: '戒指',
      附魔: '力道+628',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42803,
      装备部位: '暗器',
      附魔: '加速+4902',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrengthBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 42737,
      装备部位: '武器',
      附魔: '攻击+761',
    },
  ],
  五彩石: '彩·见切·斩铁·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    常驻套装会心会效: 1,
    套装技能: 0,
    特效_42767: 2,
    特效_40788: 2,
    特效_40794: 4,
    试炼鞋子会心: 6,
    试炼项链会心: 6,
    试炼腰坠会效: 6,
    特效_40803: 2,
    试炼暗器特效: 6,
    水特效武器: 2,
  },
}
