import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '簇尘',
        奇穴图片: 'https://icon.jx3box.com/icon/17736.png',
        id: '32458',
        奇穴描述: '“观风寻隙”现在每次会发现目标两个弱点。',
      },
      {
        奇穴名称: '碣石',
        奇穴图片: 'https://icon.jx3box.com/icon/17747.png',
        id: '32498',
        奇穴描述: '“游风飘踪”效果期间受到的伤害降低15%，施展时对有自身破绽目标造成5秒击倒。',
      },
      {
        奇穴名称: '承磊',
        奇穴图片: 'https://icon.jx3box.com/icon/18231.png',
        id: '32500',
        奇穴描述:
          '“破绽”最大可叠加至6层。“孤锋破浪”命中有自身6层“破绽”的目标时，额外造成1次无视目标80%化劲的外功伤害。',
      },
      {
        奇穴名称: '贯霆',
        奇穴图片: 'https://icon.jx3box.com/icon/24954.png',
        id: '42035',
        奇穴描述: '伤害招式击破侠士“弱点”时，击破伤害提高175%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '电逝',
        奇穴图片: 'https://icon.jx3box.com/icon/18243.png',
        id: '32492',
        奇穴描述:
          '“灭影追风”不再降低化劲，期间施展“行云势”只会触发第三段效果，若命中侠士目标则立刻恢复自身5%气血最大值。',
      },
      {
        奇穴名称: '戗风',
        奇穴图片: 'https://icon.jx3box.com/icon/17755.png',
        id: '32580',
        奇穴描述:
          '“破浪三式”套路招式伤害提高10%，击破目标弱点可使自身伤害提高5%，最多10%，持续15秒。',
      },
      {
        奇穴名称: '颂阵',
        奇穴图片: 'https://icon.jx3box.com/icon/17766.png',
        id: '32588',
        奇穴描述:
          '“洗兵雨”施展距离提高2尺。可以拾取目标被自身击落的武器，捡起对方武器后，对方受到的缴械时间增加2秒，自身6秒内攻击力提高60%。',
      },
      {
        奇穴名称: '威声',
        奇穴图片: 'https://icon.jx3box.com/icon/17762.png',
        id: '33027',
        奇穴描述:
          '“孤锋破浪”命中侠士目标后，使其体质降低10%。施展“灭影追风”2秒内下一次施展“孤锋破浪”不会回到“单持武器”状态。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '镇机',
        奇穴图片: 'https://icon.jx3box.com/icon/17735.png',
        id: '32457',
        奇穴描述: '目标每拥有一层破绽，“断云势”对其伤害提高20%。',
      },
      {
        奇穴名称: '滔天',
        奇穴图片: 'https://icon.jx3box.com/icon/17750.png',
        id: '32502',
        奇穴描述:
          '“沧浪三叠”变为单体招式，伤害降低9%，对拥有自身“破绽”的目标施展时将立刻打出三段效果，但将消耗目标一层破绽。',
      },
      {
        奇穴名称: '界破',
        奇穴图片: 'https://icon.jx3box.com/icon/17757.png',
        id: '32512',
        奇穴描述:
          '施展“孤锋破浪”会在原地残留刀气，2秒后会引爆刀气对6尺范围内最多5个目标造成<SUB 34695 1>外功伤害。',
      },
      {
        奇穴名称: '摧朽',
        奇穴图片: 'https://icon.jx3box.com/icon/18232.png',
        id: '32582',
        奇穴描述: '施展“定风凝云”时缓慢将25尺内当前观察的目标吸引至自己身边。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '击懈',
        奇穴图片: 'https://icon.jx3box.com/icon/17746.png',
        id: '32497',
        奇穴描述: '“灭影追风”期间，击破目标弱点时，缩短“观风寻隙”察觉弱点间隔时间50%。',
      },
      {
        奇穴名称: '识意',
        奇穴图片: 'https://icon.jx3box.com/icon/17765.png',
        id: '32587',
        奇穴描述:
          '“灭影追风”持续时间降低3秒，结束时若自身未重伤，则会将受到的伤害转换为伤害吸收盾，持续6秒。',
      },
      {
        奇穴名称: '鸣锋',
        奇穴图片: 'https://icon.jx3box.com/icon/18246.png',
        id: '34722',
        奇穴描述:
          '自身“破浪三式”套路招式命中有自身“横云断浪”流血效果的目标会造成<SUB 34724 1>外功伤害，每层流血效果使该伤害提高13%。',
      },
      {
        奇穴名称: '遏流',
        奇穴图片: 'https://icon.jx3box.com/icon/24953.png',
        id: '42233',
        奇穴描述:
          '“定风凝云”调息时间降低10秒，效果持续4秒。效果结束时，使自身受到的伤害降低50%，持续3秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '长溯',
        奇穴图片: 'https://icon.jx3box.com/icon/18247.png',
        id: '32508',
        奇穴描述:
          '“沧浪三叠”每次命中非侠士目标会给其添加1层“长溯”效果，“孤锋破浪”命中有“长溯”的目标，每层“长溯”将额外造成一次“孤锋破浪”伤害，“长溯”持续30秒，最多叠加3层。',
      },
      {
        奇穴名称: '周流',
        奇穴图片: 'https://icon.jx3box.com/icon/18237.png',
        id: '32608',
        奇穴描述: '击破侠士目标“弱点”后额外获得30点“锐意”。',
      },
      {
        奇穴名称: '驭耀',
        奇穴图片: 'https://icon.jx3box.com/icon/18236.png',
        id: '32609',
        奇穴描述: '“行云势”无视目标20%化劲并额外获得6点“锐意”。',
      },
      {
        奇穴名称: '势钧',
        奇穴图片: 'https://icon.jx3box.com/icon/18241.png',
        id: '32610',
        奇穴描述:
          '“横云断浪”命中目标获得生命值15%的伤害吸收盾，持续5秒。若目标有伤害吸收盾，获得的盾量翻倍。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '流岚',
        奇穴图片: 'https://icon.jx3box.com/icon/17742.png',
        id: '32493',
        奇穴描述: '5秒内连续击破两个弱点，使自身无视目标25%内外防御，持续60秒。',
      },
      {
        奇穴名称: '斩颓',
        奇穴图片: 'https://icon.jx3box.com/icon/17754.png',
        id: '32509',
        奇穴描述: '“破绽”叠加的层数越多，目标受到的额外伤害越高。',
      },
      {
        奇穴名称: '泯息',
        奇穴图片: 'https://icon.jx3box.com/icon/18238.png',
        id: '32611',
        奇穴描述: '每次击破“弱点”，降低“洗兵雨”2秒调息时间，“触石雨”1秒调息时间。',
      },
      {
        奇穴名称: '亘绝',
        奇穴图片: 'https://icon.jx3box.com/icon/18234.png',
        id: '32613',
        奇穴描述: '“驰风八步”变为充能招式，施展后自身御劲提高100%，持续4秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '截辕',
        奇穴图片: 'https://icon.jx3box.com/icon/17759.png',
        id: '32586',
        奇穴描述:
          '“孤锋破浪”会斩出一道刀气：\\n·快速向前移动，对8尺内的敌对目标造成<SUB 32591 1>外功伤害，并为其添加12秒持续伤害效果；\\n·累计造成20次伤害后引爆，对10尺内至多10个目标造成<SUB 32591 2>外功伤害，并使其8秒内受到的范围型招式伤害提高15%；\\n·重伤敌人时使自身获得35点锐意。\\n刀气同时只会存在1道，且每8秒至多生成2道。',
      },
      {
        奇穴名称: '怒锋倾涛',
        奇穴图片: 'https://icon.jx3box.com/icon/17768.png',
        id: '32614',
        奇穴描述:
          '冲向目标并对其造成200%的武器伤害外加<SUB 32616 0>外功伤害，若目标为侠士且存在自身“破绽”则每个“破绽”追加已损失生命值6%<NounID 101>。每有3层“破绽”层数，对目标添加1层<NounID 75>。',
      },
      {
        奇穴名称: '泽风同承',
        奇穴图片: 'https://icon.jx3box.com/icon/17767.png',
        id: '32665',
        奇穴描述:
          '链接2个有自身破绽且最近的侠士目标，链接期间攻击其中一个目标，另一个目标也将受到70%伤害传递，链接生效范围为25尺，持续6秒。效果时间结束时，对链接的两个目标分别造成基于目标破绽层数的多段伤害，最多4段。',
      },
      {
        奇穴名称: '潋风',
        奇穴图片: 'https://icon.jx3box.com/icon/20071.png',
        id: '36035',
        奇穴描述:
          '施展“决云势”自身获得5秒“潋风”气劲，期间主动施展“流云势法”套路伤害招式命中目标会额外获得20点锐意，并额外触发<SUB 36118 1>外功伤害。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '聚疏',
        奇穴图片: 'https://icon.jx3box.com/icon/17731.png',
        id: '32452',
        奇穴描述:
          '“望云势”调息时间降低5秒，反击时不再需要目标，伤害提高50%，且会对8尺内3个敌对目标造成伤害。',
      },
      {
        奇穴名称: '雾灭',
        奇穴图片: 'https://icon.jx3box.com/icon/17737.png',
        id: '32459',
        奇穴描述:
          '每次击破“弱点”，对应目标化劲等级降低5%，自身化劲等级提高5%，可叠加2层，持续15秒。',
      },
      {
        奇穴名称: '遏云势',
        奇穴图片: 'https://icon.jx3box.com/icon/17741.png',
        id: '32465',
        奇穴描述:
          '打断目标运功并造成<SKILL PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP}>)外功伤害，若目标正在运功，自身获得20点锐意并使目标不受治疗影响，持续5秒。',
      },
      {
        奇穴名称: '急潮',
        奇穴图片: 'https://icon.jx3box.com/icon/17748.png',
        id: '32491',
        奇穴描述:
          '“破浪三式”套路招式作用范围提高2尺，切换“双持武器”状态时自身受到的伤害降低30%，持续3秒。',
      },
      {
        奇穴名称: '靖步',
        奇穴图片: 'https://icon.jx3box.com/icon/17743.png',
        id: '32494',
        奇穴描述:
          '“定风凝云”持续期间受到的伤害降低80%且不受被推、被拉影响，每秒回复自身3%气血最大值，提前结束则获取剩余恢复值。',
      },
      {
        奇穴名称: '伏瀑',
        奇穴图片: 'https://icon.jx3box.com/icon/17760.png',
        id: '32495',
        奇穴描述: '“触石雨”命中已经被击倒的目标伤害提高60%，并击倒周围6尺内的3个目标。',
      },
      {
        奇穴名称: '观衅',
        奇穴图片: 'https://icon.jx3box.com/icon/17751.png',
        id: '32499',
        奇穴描述: '施展“灭影追风”同时清除自身“观风寻隙”间隔时间。',
      },
      {
        奇穴名称: '涣衍',
        奇穴图片: 'https://icon.jx3box.com/icon/17756.png',
        id: '32511',
        奇穴描述:
          '“横云断浪”调息时间降低6秒，附带“流血”效果持续时间提高12秒。击破非侠士目标“弱点”时，若其持有的自身“破绽”层数低于3层，则额外添加1层“破绽”。',
      },
      {
        奇穴名称: '殊际',
        奇穴图片: 'https://icon.jx3box.com/icon/18242.png',
        id: '32577',
        奇穴描述: '目标被自身定身、眩晕、击倒期间受到的伤害提高20%。',
      },
      {
        奇穴名称: '强膂',
        奇穴图片: 'https://icon.jx3box.com/icon/18240.png',
        id: '32578',
        奇穴描述: '无双等级、力道、移动速度提高10%。',
      },
      {
        奇穴名称: '辞霈',
        奇穴图片: 'https://icon.jx3box.com/icon/17761.png',
        id: '32579',
        奇穴描述: '“停云势”命中目标则使其受到的治疗及获得的护盾效果降低50%，持续8秒。',
      },
      {
        奇穴名称: '飞云',
        奇穴图片: 'https://icon.jx3box.com/icon/24955.png',
        id: '42060',
        奇穴描述: '施展“行云势”第三段时，自身移速提高60%，持续3秒。',
      },
    ],
  },
]

export default 奇穴数据
