import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '洄涛',
        奇穴图片: 'https://icon.jx3box.com/icon/27093.png',
        id: '44528',
        奇穴描述:
          '为目标添加<NounID 160>时，若其层数已达上限，则将其转化为自身“洄涛”效果，至多24层。施展《破浪三式》套路招式命中当前目标时，会尝试消耗1层“洄涛”为其添加1层“破绽”。',
      },
      {
        奇穴名称: '碣石',
        奇穴图片: 'https://icon.jx3box.com/icon/17747.png',
        id: '32498',
        奇穴描述: '“游风飘踪”效果期间受到的伤害降低15%，施展时对有自身破绽目标造成5秒击倒。',
      },
      {
        奇穴名称: '贯霆',
        奇穴图片: 'https://icon.jx3box.com/icon/24954.png',
        id: '42035',
        奇穴描述: '伤害招式击破侠士“弱点”时，击破伤害提高175%。',
      },
      {
        奇穴名称: '承磊',
        奇穴图片: 'https://icon.jx3box.com/icon/18231.png',
        id: '32500',
        奇穴描述:
          '“破绽”最大可叠加至6层。“孤锋破浪”命中有自身6层“破绽”的目标时，额外造成1次无视目标80%化劲的外功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '流溯',
        奇穴图片: 'https://icon.jx3box.com/icon/18247.png',
        id: '32508',
        奇穴描述:
          '由单持武器切换至双持武器后获得3层“截流”，期间“沧浪三叠”每次命中非侠士目标会为其添加可叠加的“长溯”效果。“截流”会在每次施展“沧浪三叠”后移除1层。\\n长溯：被效果来源下一次“孤锋破浪”命中时额外受到一次“孤锋破浪”伤害。',
      },
      {
        奇穴名称: '威声',
        奇穴图片: 'https://icon.jx3box.com/icon/17762.png',
        id: '33027',
        奇穴描述:
          '施展“灭影追风”2秒内下一次施展“孤锋破浪”不会回到“单持武器”状态并会在原地残留刀气，2秒后引爆对6尺范围内最多5个目标造成<SUB 34695 1>外功伤害。',
      },
      {
        奇穴名称: '电逝',
        奇穴图片: 'https://icon.jx3box.com/icon/18243.png',
        id: '32492',
        奇穴描述:
          '“灭影追风”不再降低化劲，期间施展“行云势”只会触发第三段效果，若命中侠士目标则立刻恢复自身5%气血最大值。',
      },
      {
        奇穴名称: '颂阵',
        奇穴图片: 'https://icon.jx3box.com/icon/17766.png',
        id: '32588',
        奇穴描述:
          '“洗兵雨”施展距离提高2尺。可以拾取目标被自身击落的武器，捡起对方武器后，对方受到的缴械时间增加2秒，自身6秒内攻击力提高60%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '涣衍',
        奇穴图片: 'https://icon.jx3box.com/icon/17756.png',
        id: '44529',
        奇穴描述:
          '<TALENT_CORE 44528 1>击破目标<NounID 159>时，若其持有自身<NounID 160>层数低于3层，则会额外添加1层“破绽”。',
      },
      {
        奇穴名称: '观衅',
        奇穴图片: 'https://icon.jx3box.com/icon/17751.png',
        id: '32497',
        奇穴描述:
          '施展“灭影追风”清除“观风寻隙”观察弱点的调息时间，效果期间击破侠士目标弱点时返还30%观察弱点的剩余调息时间。',
      },
      {
        奇穴名称: '遏流',
        奇穴图片: 'https://icon.jx3box.com/icon/24953.png',
        id: '42233',
        奇穴描述:
          '“定风凝云”调息时间降低10秒，效果持续4秒。效果结束时，使自身受到的伤害降低50%，持续3秒。',
      },
      {
        奇穴名称: '识意',
        奇穴图片: 'https://icon.jx3box.com/icon/17765.png',
        id: '32587',
        奇穴描述:
          '“灭影追风”持续时间降低3秒，结束时若自身未重伤，则会将受到的伤害转换为伤害吸收盾，持续6秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '择行',
        奇穴图片: 'https://icon.jx3box.com/icon/27092.png',
        id: '44530',
        奇穴描述:
          '锐意上限提高至300点，“决云势”不再获得锐意，“停云势”、“行云势”获得的锐意提高200%。',
      },
      {
        奇穴名称: '势钧',
        奇穴图片: 'https://icon.jx3box.com/icon/18241.png',
        id: '32610',
        奇穴描述:
          '“横云断浪”命中目标获得生命值15%的伤害吸收盾，持续5秒。若目标有伤害吸收盾，获得的盾量翻倍。',
      },
      {
        奇穴名称: '周流',
        奇穴图片: 'https://icon.jx3box.com/icon/18237.png',
        id: '32608',
        奇穴描述: '击破侠士目标弱点后额外获得30点锐意。',
      },
      {
        奇穴名称: '驭耀',
        奇穴图片: 'https://icon.jx3box.com/icon/18236.png',
        id: '32609',
        奇穴描述: '“行云势”无视目标20%化劲并额外获得6点锐意。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '潋风',
        奇穴图片: 'https://icon.jx3box.com/icon/19159.png',
        id: '44531',
        奇穴描述:
          '“停云势”调息时间提高4秒，变为2层充能招式，施展后<BUFF 33181 1 time>内：前3次<BUFF 33181 1 desc>，后续<BUFF 33181 2 desc>。',
      },
      {
        奇穴名称: '循隙',
        奇穴图片: 'https://icon.jx3box.com/icon/27098.png',
        id: '44532',
        奇穴描述: '“横云断浪”附带的“流血”效果期间自身“孤锋破浪”无视目标25%化劲等级。',
      },
      {
        奇穴名称: '曳引',
        奇穴图片: 'https://icon.jx3box.com/icon/27094.png',
        id: '44533',
        奇穴描述: '“驰风八步”二段施展后经过短暂延迟会将路径上的目标拉向自身，并使其定身2秒。',
      },
      {
        奇穴名称: '亘绝',
        奇穴图片: 'https://icon.jx3box.com/icon/18234.png',
        id: '32613',
        奇穴描述: '“驰风八步”变为充能招式，施展后自身御劲提高100%，持续4秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '裂海横天',
        奇穴图片: 'https://icon.jx3box.com/icon/27097.png',
        id: '44534',
        奇穴描述:
          '<TALENT_CORE 44528 1>在“沧逸”和“倾怒”之间切换。\\n沧逸：<BUFF 33184 1 desc>。\\n倾怒：<BUFF 33184 2 desc>。',
      },
      {
        奇穴名称: '截辕',
        奇穴图片: 'https://icon.jx3box.com/icon/17759.png',
        id: '32586',
        奇穴描述:
          '“孤锋破浪”会斩出一道刀气：\\n·快速向前移动，对8尺内的敌对目标造成<SUB 32591 1>外功伤害，并为其添加12秒持续伤害效果；\\n·累计造成20次伤害后引爆，对10尺内至多10个目标造成<SUB 32591 2>外功伤害，并使其8秒内受到的范围型招式伤害提高15%；\\n·重伤敌人时使自身获得35点锐意。\\n刀气同时只会存在1道，且每8秒至多生成2道。',
      },
      {
        奇穴名称: '泽风同承',
        奇穴图片: 'https://icon.jx3box.com/icon/17767.png',
        id: '32665',
        奇穴描述:
          '链接目标侠士与其20尺内自身<NounID 160>层数最多的友方侠士，6秒后或两人距离超过25尺时结束。被链接目标的每层破绽都会使其受到伤害的12%传递给另一人，并在链接结束时转化为1层“同风”，若链接自然结束则转化层数翻倍。\\n同风：被效果来源伤害招式命中时每层造成<SUB 42235 1>外功伤害，随后消失。',
      },
      {
        奇穴名称: '怒锋倾涛',
        奇穴图片: 'https://icon.jx3box.com/icon/17768.png',
        id: '32614',
        奇穴描述:
          '冲向目标并对其造成200%的武器伤害外加<SUB 32616 0>外功伤害，若目标为侠士且存在自身“破绽”则每个“破绽”追加已损失生命值6%<NounID 101>。每有3层“破绽”层数，对目标添加1层<NounID 75>。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '流岚',
        奇穴图片: 'https://icon.jx3box.com/icon/17742.png',
        id: '32493',
        奇穴描述: '击破目标<NounID 159>使自身60秒内施展招式无视目标60%防御等级。',
      },
      {
        奇穴名称: '风识',
        奇穴图片: 'https://icon.jx3box.com/icon/27099.png',
        id: '44535',
        奇穴描述:
          '<TALENT_CORE 44528 1>“定风凝云”期间仅可缓慢行走。期间首次站定1秒后，会立即看破30尺内至多3名侠士目标为其添加1层<NounID 160>，并立即发现当前侠士目标1个<NounID 159>。',
      },
      {
        奇穴名称: '斩颓',
        奇穴图片: 'https://icon.jx3box.com/icon/17754.png',
        id: '32509',
        奇穴描述: '伤害招式命中“破绽”层数多于2层的目标，额外造成一段基于多出层数的外功伤害。',
      },
      {
        奇穴名称: '雾灭',
        奇穴图片: 'https://icon.jx3box.com/icon/17737.png',
        id: '32459',
        奇穴描述:
          '每次击破“弱点”，对应目标化劲等级降低5%，自身化劲等级提高5%，可叠加2层，持续15秒。',
      },
      {
        奇穴名称: '强膂',
        奇穴图片: 'https://icon.jx3box.com/icon/18240.png',
        id: '32578',
        奇穴描述: '力道和移动速度提高10%，无双等级提高20%。',
      },
      {
        奇穴名称: '飞云',
        奇穴图片: 'https://icon.jx3box.com/icon/24955.png',
        id: '42060',
        奇穴描述: '施展“行云势”第三段时，自身移速提高60%，持续3秒。',
      },
      {
        奇穴名称: '急潮',
        奇穴图片: 'https://icon.jx3box.com/icon/17748.png',
        id: '32491',
        奇穴描述:
          '“破浪三式”套路招式作用范围提高2尺，切换“双持武器”状态时自身受到的伤害降低30%，持续3秒。',
      },
      {
        奇穴名称: '辞霈',
        奇穴图片: 'https://icon.jx3box.com/icon/17761.png',
        id: '32579',
        奇穴描述: '“停云势”命中目标则使其受到的治疗及获得的护盾效果降低50%，持续8秒。',
      },
      {
        奇穴名称: '滔天',
        奇穴图片: 'https://icon.jx3box.com/icon/17750.png',
        id: '44536',
        奇穴描述:
          '<TALENT_CORE 44528 1>“灭影追风”施展时立即获得2层“洄涛”，期间“孤锋破浪”命中目标额外附带<SUB 44538 1>外功伤害，且若目标拥有自身满层“破绽”则将其全部转化为自身“洄涛”。',
      },
      {
        奇穴名称: '殊际',
        奇穴图片: 'https://icon.jx3box.com/icon/18242.png',
        id: '32577',
        奇穴描述: '目标被自身定身、眩晕、击倒期间受到的伤害提高20%。',
      },
      {
        奇穴名称: '靖步',
        奇穴图片: 'https://icon.jx3box.com/icon/17743.png',
        id: '32494',
        奇穴描述:
          '“定风凝云”持续期间受到的伤害降低80%且不受被推、被拉影响，每秒回复自身3%气血最大值，提前结束则获取剩余恢复值。',
      },
      {
        奇穴名称: '遏云势',
        奇穴图片: 'https://icon.jx3box.com/icon/17741.png',
        id: '32465',
        奇穴描述:
          '打断目标运功并造成<SKILL PhysicsDamage>点(+<SKILLEx {D0} {SkillPhysicsAP}>)外功伤害，若目标正在运功，自身获得20点锐意并使目标不受治疗影响，持续5秒。',
      },
    ],
  },
]

export default 奇穴数据
