import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'
import 有CD技能通用类 from '@/功能模块/基础设置/公用设置/循环模拟/心法循环模拟/通用/通用技能/通用类/有CD技能通用类'
import { 每秒郭氏帧 } from '@/数据/常量'

class 天绝地灭 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '天绝地灭')

  constructor(模拟循环: any) {
    super(模拟循环)
  }

  释放() {
    // 检查神机值是否足够
    const 当前神机值 = this.模拟循环?.角色状态信息?.神机值 || 100
    const 消耗神机值 = 天绝地灭.技能数据!.消耗神机值 ?? 0
    if (当前神机值 < 消耗神机值) {
      return {
        可以释放: false,
        异常信息: {信息:`神机值不足，当前神机值：${当前神机值}，所需神机值：${消耗神机值}`}
      }
    }
    this.模拟循环.添加待生效事件队列([{
      事件名称: '天绝延迟触发',
      事件时间: this.模拟循环.当前时间 + 每秒郭氏帧 * 1.5,
    }])
    this.模拟循环.神机值变化(天绝地灭.技能数据!)
    return { 可以释放: true }
  }

  命中() {
    this?.模拟循环?.技能类实例集合?.DOT_天绝地灭?.获得天绝()
  }


  保存释放记录(名称: string) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['心无旁骛', '扬威', '神机好穷内攻增伤', '神机好穷陷阱增伤','秋风散影','催寒','气魄','弩心','天风汲雨']),
    }
  }
}

export default 天绝地灭

export const 天绝地灭类型 = typeof 天绝地灭
