import { 每秒郭氏帧 } from '@/数据/常量'
import { 技能运行数据类型 } from '../type'
import 技能统一类 from './技能统一类'

class 有CD技能通用类 extends 技能统一类 {
  技能运行数据: 技能运行数据类型 = {
    待充能时间点: [],
    当前层数: 0,
  }

  constructor(模拟循环) {
    super(模拟循环)
  }

  初始化技能运行数据() {
    this.技能运行数据.待充能时间点 = []
  }

  更新技能运行数据(新数据) {
    this.技能运行数据 = {
      ...this.技能运行数据,
      ...新数据,
    }
  }

  触发残香() {
    if (this.模拟循环.当前自身buff列表.残香?.当前层数) {
      this.减少调息时间(每秒郭氏帧 * 6)
      this.触发伤害行为('残香', 1)
      this.模拟循环.卸除buff?.({ 名称: '残香', 对象: '自身', 卸除层数: 1 })
    }
  }

  圣蝎献祭处理() {
    if (this.模拟循环.当前自身buff列表.圣蝎献祭?.当前层数) {
      const BUFF剩余时间 = (
        (this.模拟循环.当前自身buff列表.圣蝎献祭?.刷新时间 ?? 0) +
        (this.模拟循环.当前自身buff列表.圣蝎献祭?.最大持续时间 ?? 0) -
        this.模拟循环.当前时间
      ) || 0
      const 期望减CD时间 = Math.floor(BUFF剩余时间 * 307 / 1024)
      this.减少调息时间(期望减CD时间)
    }
  }

  重置调息时间() {
    this.更新技能运行数据({ 待充能时间点: [] })
  }

  减少调息时间(减少帧数) {
    const 待充能时间点 = this.技能运行数据.待充能时间点
    if (待充能时间点?.length) {
      const 新待充能时间点 = 待充能时间点
        .map((item) => {
          return item - 减少帧数
        })
        ?.filter((item) => {
          return item > this.模拟循环.当前时间
        })
      this.更新技能运行数据({ 待充能时间点: 新待充能时间点 })
    }
  }
}

export default 有CD技能通用类
