import 循环模拟技能基础数据 from '../../../../constant/skill'
import { 每秒郭氏帧 } from '@/数据/常量'
import 特效统一类 from '../特效统一类'
import { 待生效事件, 额外信息类型 } from '../../../type'
import { ERROR_ACTION } from '../../../utils'

class 起符 extends 特效统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '起符')
  static 读条时间 = 每秒郭氏帧 * 2.5
  本次召唤物: '麒麟' | '凤凰' | undefined
  // 临时变量存储起符快照的buff列表
  constructor(模拟循环) {
    super(模拟循环)
    起符.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '起符')
  }

  释放前初始化(额外信息: 额外信息类型 = {}) {
    this.本次召唤物 = 额外信息?.召唤物
  }

  获取读条时间() {
    if (!this.本次召唤物) {
      const 可起符召唤物 = (['麒麟', '凤凰'] as const).filter((召唤物) => {
        const 起符名称 = 召唤物 === '麒麟' ? '起符' : '凤凰起符'
        return (
          this.模拟循环.当前自身buff列表[召唤物]?.当前层数 &&
          !this.模拟循环.当前自身buff列表[起符名称]?.当前层数 &&
          !this.模拟循环.角色状态信息[`${召唤物}已施符`]
        )
      })
      if (可起符召唤物.length === 1) {
        this.本次召唤物 = 可起符召唤物[0]
      }
    }
    this.保存释放记录('起符')

    return 起符.读条时间
  }

  释放() {
    if (!this.本次召唤物) {
      return {
        可以释放: false,
        异常信息: { 信息: '起符需要指定对应的召唤物' },
      }
    }
    const 起符名称 = this.本次召唤物 === '麒麟' ? '起符' : '凤凰起符'
    if (
      !this.模拟循环.当前自身buff列表[this.本次召唤物]?.当前层数 ||
      this.模拟循环.当前自身buff列表[起符名称]?.当前层数 ||
      this.模拟循环.角色状态信息[`${this.本次召唤物}已施符`]
    ) {
      return {
        可以释放: false,
        异常信息: ERROR_ACTION.BUFF错误,
      }
    } else {
      return { 可以释放: true }
    }
  }

  读条(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    待生效事件队列.push({
      事件名称: '技能读条',
      事件时间: 读条开始时间 + 起符.读条时间,
      事件备注: {
        技能名称: '起符',
        召唤物: this.本次召唤物,
      },
    })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  // 读条命中，起符本身不造成伤害，仅完成读条
  读条命中({ 召唤物 }: { 召唤物: '麒麟' | '凤凰' }) {
    if (!this.模拟循环.当前自身buff列表[召唤物]?.当前层数) {
      return
    }
    if (起符.技能数据) {
      this.模拟循环?.技能释放后更新运行数据?.(起符.技能数据, this)
    }
    this.模拟循环.添加buff({
      名称: 召唤物 === '麒麟' ? '起符' : '凤凰起符',
      对象: '自身',
    })
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: this.本次召唤物 ? `${名称}（${this.本次召唤物}）` : 名称,
      重要buff列表: this.获取当前重要buff列表([
        '荧入白',
        '祝祷',
        '鬼遁',
        '镇星',
        '明灯',
        '龙马出河',
        '镇星',
      ]),
    }
  }
}

export default 起符

export const 起符类型 = typeof 起符
