import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'

class 横扫六合 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '横扫六合')

  constructor(模拟循环) {
    super(模拟循环)
    横扫六合.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '横扫六合')
    this.初始化技能运行数据()
  }

  命中() {
    this.触发伤害行为('横扫六合', 1)
    this.触发伤害行为('横扫六合·武伤', 1)
    this.保存释放记录('横扫六合')
    this.模拟循环.技能类实例集合?.横扫六合DOT?.获得和刷新横扫六合DOT()
    // 假设DOT吃不到金刚日轮
    this.模拟循环.添加buff?.({ 名称: '金刚日轮', 对象: '自身', 新增层数: 1 })
    if (this.模拟循环.校验奇穴是否存在('无诤')) {
      this.模拟循环.添加buff({ 名称: '无诤', 对象: '自身' })
      this.模拟循环.技能类实例集合?.守缺式?.刷新自身CD()
      let 已读条时间 = 0
      const 当前时间 = this.模拟循环.当前时间
      const 待生效事件队列: 待生效事件[] = []
      for (let i = 0; i < 9; i++) {
        待生效事件队列.push({
          事件名称: '六合棍意结算',
          事件时间: 当前时间 + 已读条时间 + 每秒郭氏帧 * 1,
          事件备注: {
            技能次数: i + 1,
          },
        })
        已读条时间 = 已读条时间 + 每秒郭氏帧 * 1
      }
      this.模拟循环.添加待生效事件队列(待生效事件队列)
      this.模拟循环.GCD组['小飞棍'] = 6
      this.模拟循环.GCD组['公共'] = 每秒郭氏帧 * 9
    }
    if (this.模拟循环.校验奇穴是否存在('我闻')) {
      this.减少调息时间(每秒郭氏帧 * 1)
    }
    this.回复禅那('横扫六合', 1)

    // 测试横扫触发两次
    this.概率触发拿云()
    this.概率触发拿云()
  }

  六合棍意结算() {
    this.触发伤害行为('六合棍意', 1)
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['擒龙', '风特效_快照', '金刚日轮']),
    }
  }
}

export default 横扫六合

export const 横扫六合类型 = typeof 横扫六合
