import { 按数字生成数组 } from '@/工具函数/help'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 每秒郭氏帧 } from '@/数据/常量'

class 攻击 extends 有CD技能通用类 {
  constructor(模拟循环) {
    super(模拟循环)
  }

  添加攻击事件(初始时间 = 0) {
    const 待生效事件 = 按数字生成数组(1000).map((次数) => {
      return {
        事件名称: `蛇_攻击`,
        事件时间: 初始时间 + 每秒郭氏帧 * 4 * 次数,
      }
    })
    this.模拟循环.添加待生效事件队列(待生效事件)
  }
  添加幻击事件(初始时间 = 0) {
    const 待生效事件 = 按数字生成数组(1000).map((次数) => {
      return {
        事件名称: `蛇_幻击`,
        事件时间: 初始时间 + 每秒郭氏帧 * 12 * 次数,
      }
    })
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  攻击结算() {
    if (this.模拟循环.当前自身buff列表?.['灵蛇存在']?.当前层数) {
      this.触发伤害行为('攻击', 1)
    }
  }

  幻击结算() {
    if (this.模拟循环.当前自身buff列表?.['灵蛇存在']?.当前层数) {
      this.触发伤害行为('幻击', 1)
    }
  }
}

export default 攻击

export const 攻击类型 = typeof 攻击
