import { 属性类型 } from '@/@types/属性'
import { 装备部位枚举 } from '@/@types/枚举'
import { 附魔原始数据, 附魔数据类型 } from '@/@types/附魔'

const 原始数据: 附魔原始数据[] = [
  { 数值: 420, 分数: 3368, 颜色: '紫' },
  { 数值: 359, 分数: 2877, 颜色: '紫', 赛季: '上赛季' },
  { 数值: 210, 分数: 1681, 颜色: '蓝' },
  { 数值: 180, 分数: 1436, 颜色: '蓝', 赛季: '上赛季' },
]

export const 获取主属性附魔数据 = (主属性?): 附魔数据类型[] => {
  return 原始数据.map((item) => {
    return {
      附魔名称: `${主属性}+${item?.数值}`,
      附魔支持部位: [装备部位枚举.护腕, 装备部位枚举.下装, 装备部位枚举.戒指, 装备部位枚举.暗器],
      增益集合: [{ 属性: 属性类型?.[主属性], 值: item?.数值 }],
      附魔装分: item?.分数,
      附魔颜色: item?.颜色,
    }
  })
}
