import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import 通用增益 from './通用增益/通用增益'
import 门派套装增益 from './通用增益/门派套装增益'
import 大橙武技能增益 from './通用增益/大橙武技能增益'
import 小橙武技能增益 from './通用增益/小橙武技能增益'

const 亢龙有悔增益: 技能增益列表类型[] = [
  ...通用增益,
  ...门派套装增益,
  ...大橙武技能增益,
  ...小橙武技能增益,
  {
    // scripts\skill\丐帮\驯致亢龙额外易伤.luad
    增益名称: '驯致',
    增益所在位置: '奇穴',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.易伤增伤, 值: Math.ceil(614.4) / 1024 }],
  },
  {
    BuffId: 25779,
    增益名称: '暴龙震江', // CW亢龙
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.系数增伤, 值: 1.44 }],
  },
  {
    BuffId: 29341,
    增益名称: '贞固',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.系数增伤, 值: 0.7 }],
  },
  {
    增益名称: '5%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 51 / 1024 }],
  },
  {
    增益名称: '4%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 41 / 1024 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
  // {
  //   增益名称: '4%会心',
  //   增益所在位置: '技能',
  //   增益启用: true,
  //   增益类型: '全局启用',
  //   增益集合: [{ 属性: 属性类型.外功会心百分比, 值: 0.04 }],
  // },
  {
    增益名称: '7%会心',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.外功会心百分比, 值: 0.07 }],
  },
]

export default 亢龙有悔增益
