import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '绝返',
        奇穴图片: 'https://icon.jx3box.com/icon/6295.png',
        id: '13090',
        奇穴描述:
          '“斩刀”命中目标后获得持续6秒的“狂绝”效果：若施展“绝刀”未成功击杀目标，则返还下一次施展“绝刀”消耗的怒气。',
      },
      {
        奇穴名称: '崩血',
        奇穴图片: 'https://icon.jx3box.com/icon/24941.png',
        id: '41740',
        奇穴描述:
          '流血最多可存在3层，对流血目标再次添加或消耗流血时造成额外伤害，添加流血时造成一次额外伤害，消耗流血时造成四次额外伤害，“闪刀”或“劫刀”命中三层流血目标时，消耗一层流血。',
      },
      {
        奇穴名称: '鸣金',
        奇穴图片: 'https://icon.jx3box.com/icon/6315.png',
        id: '18354',
        奇穴描述: '格挡值最大值增加100点。重伤恢复后立刻获得50点格挡值。',
      },
      {
        奇穴名称: '阵云结晦',
        奇穴图片: 'https://icon.jx3box.com/icon/17157.png',
        id: '30769',
        奇穴描述:
          '被动效果：“格挡值”替换为<NounID 231>。<NounID 231>上限为40点，非战斗状态下每秒恢复10点，每消耗5点“怒气”将获得1点<NounID 231>。\\n\\n主动效果：3段招式，消耗40点<NounID 231>对目标分别造成<SUB 30925 1>→<SUB 30926 1>→<SUB 30857 1><NounID 13>外功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '履刃',
        奇穴图片: 'https://icon.jx3box.com/icon/22370.png',
        id: '37559',
        奇穴描述:
          '“闪刀”、“劫刀”施展距离提高5尺，“闪刀”命中3层流血目标时重置“斩刀”调息时间。<TALENT_CORE 41740 1>',
      },
      {
        奇穴名称: '绝霜',
        奇穴图片: 'https://icon.jx3box.com/icon/11328.png',
        id: '46014',
        奇穴描述: '“盾刀”施展距离提高2尺，伤害提高112%；“盾压”施展距离提高2尺，伤害提高109%。',
      },
      {
        奇穴名称: '血魄',
        奇穴图片: 'https://icon.jx3box.com/icon/6341.png',
        id: '38969',
        奇穴描述: '施展“血怒”，清空自身“斩刀”调息时间，并获得25点怒气。',
      },
      {
        奇穴名称: '捍卫',
        奇穴图片: 'https://icon.jx3box.com/icon/6300.png',
        id: '13418',
        奇穴描述:
          '“盾墙”效果期间自身半径8尺范围内最多5个小队友方目标受到的伤害降低40%，“盾墙”效果期间施展“盾舞”可激活二段招式“捍卫”，击退周围8尺内最多6人并造成一次<SUB 21431 0>伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '惊涌',
        奇穴图片: 'https://icon.jx3box.com/icon/11866.png',
        id: '36205',
        奇穴描述:
          '自身无双等级提高20%；“血怒”不可叠加，连续施展可累加其效果时间，“血怒”持续期间施展“斩刀”对非侠士目标伤害提高100%，施展“绝刀”对非侠士目标伤害提高71%。',
      },
      {
        奇穴名称: '偃守孤旌',
        奇穴图片: 'https://icon.jx3box.com/icon/24944.png',
        id: '41982',
        奇穴描述:
          '云城盾解体，附于自身，持续9秒，自动转换为擎刀姿态，进入<NounID 52>状态。施展后与“盾墙”共同进入40秒调息时间。',
      },
      {
        奇穴名称: '隐刀',
        奇穴图片: 'https://icon.jx3box.com/icon/6355.png',
        id: '13152',
        奇穴描述:
          '最少消耗5点怒气，最多消耗15点怒气，消耗逐渐增加，闪刀命中附带自身虚弱或流血效果的目标后10秒内可连续施展，隐刀命中附带自身虚弱或流血效果的目标可对其造成100%的武器伤害外加<SUB 13286 0>外功伤害，并冲刺穿过目标，期间自身免疫伤害和控制效果，持续1秒，施展次数越多，怒气消耗越高。',
      },
      {
        奇穴名称: '血刀',
        奇穴图片: 'https://icon.jx3box.com/icon/6440.png',
        id: '13153',
        奇穴描述:
          '消耗10点怒气，“闪刀”命中目标后方可施展，可对12尺范围内最多5个目标造成100%的武器伤害外加<SUB 13144 0>外功伤害，若当前目标附带自身的流血效果，则对血刀命中的所有目标都将增加一层流血效果。<EnchantID 10147 命中有自身流血效果的目标，触发血崩效果，对半径3尺范围内的最多5个目标造成范围伤害>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '朔荒',
        奇穴图片: 'https://icon.jx3box.com/icon/6435.png',
        id: '46682',
        奇穴描述:
          '<NounID 231>上限提高至120点，施展时若<NounID 231>达到80点，“阵云结晦”则改为消耗80点，使本次造成的伤害额外提高75%，对非侠士目标伤害提高至195%。<TALENT_CORE 30769 1>',
      },
      {
        奇穴名称: '残楼',
        奇穴图片: 'https://icon.jx3box.com/icon/6289.png',
        id: '13086',
        奇穴描述:
          '每次施展“劫刀”“斩刀”“绝刀”为当前侠士目标添加一层8%最大气血值的“残楼”治疗吸收盾，吸收盾最多可叠加5层。',
      },
      {
        奇穴名称: '步临',
        奇穴图片: 'https://icon.jx3box.com/icon/6284.png',
        id: '13111',
        奇穴描述: '“盾击”施展距离提高2尺，使目标被疗伤成效降低33%，此效果最多可叠加2层，持续12秒。',
      },
      {
        奇穴名称: '碾尘',
        奇穴图片: 'https://icon.jx3box.com/icon/27081.png',
        id: '13304',
        奇穴描述: '“盾猛”击倒时间提高至5秒，成功击倒目标后，自身外攻会心几率提高25%，持续8秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '嗜血',
        奇穴图片: 'https://icon.jx3box.com/icon/6431.png',
        id: '21281',
        奇穴描述:
          '“绝刀”会心几率提高15%，会心效果提高20%，施展后使得自身伤害提高5%，持续12秒；每额外消耗10点“怒气”获得的伤害增幅由20%提高至30%。',
      },
      {
        奇穴名称: '赤心',
        奇穴图片: 'https://icon.jx3box.com/icon/6305.png',
        id: '13073',
        奇穴描述:
          '“血怒”效果期间每秒恢复自身1.5%最大气血值，每消耗或回复1点怒气为自身回复0.1%气血最大值。',
      },
      {
        奇穴名称: '登锋',
        奇穴图片: 'https://icon.jx3box.com/icon/22369.png',
        id: '37558',
        奇穴描述:
          '流血效果伤害提高80%，作用时间间隔缩短1秒，总持续时间保持不变。每次添加流血后，若目标已有三层流血，则自身回复15点怒气。<TALENT_CORE 41740 1>',
      },
      {
        奇穴名称: '激奋',
        奇穴图片: 'https://icon.jx3box.com/icon/6322.png',
        id: '20984',
        奇穴描述:
          '施展“盾壁”将会触发10尺范围“振奋军阵”，处于“军阵”中的5个友方目标不会受到重伤，基础攻击力提高20%，“振奋军阵”持续8秒。此效果不会在秘境中生效。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '迸甲',
        奇穴图片: 'https://icon.jx3box.com/icon/21954.png',
        id: '46020',
        奇穴描述: '“血怒”调息时间降低3秒，施展后获得40点<NounID 231>。<TALENT_CORE 30769 1>',
      },
      {
        奇穴名称: '扬旌沙场',
        奇穴图片: 'https://icon.jx3box.com/icon/7505.png',
        id: '15196',
        奇穴描述:
          '对敌对侠士目标施展，强迫目标与自身进行对决，清除双方持续治疗效果、所有不利效果、受控状态，气血恢复至最大值。期间不受其他玩家招式影响，持续14秒，决斗时间结束或一方被击败则提前结束决斗，败者直接重伤，敌方侠士获得特殊技能栏技能“<NounID 58>”。',
      },
      {
        奇穴名称: '断马摧城',
        奇穴图片: 'https://icon.jx3box.com/icon/14087.png',
        id: '25213',
        奇穴描述:
          '回复20点怒气，举盾对自身8尺范围最多5个目标造成一次锤击，造成<SUB 25215 0><NounID 13>外功伤害并使其被击倒5秒，“分山劲”心法下该伤害提高100%。<TALENT 26723 1 擎盾姿态下自身加速率提高10%，每连续施展三次 “云城盾”套路招式技能攻击同一目标，造成<SUB 26724 1>外功伤害>',
      },
      {
        奇穴名称: '矢尽兵穷',
        奇穴图片: 'https://icon.jx3box.com/icon/16191.png',
        id: '29066',
        奇穴描述:
          '在原地插下旗帜，形成一个持续15秒、半径13尺的“角斗场”。“角斗场”内的敌人无法施展轻功，受到的“流血”伤害提高470%。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '麾远',
        奇穴图片: 'https://icon.jx3box.com/icon/21953.png',
        id: '37239',
        奇穴描述:
          '“斩刀”追加一段无视目标30%外功防御的外功伤害，若成功眩晕目标，则返还15点怒气和6秒斩刀调息时间。',
      },
      {
        奇穴名称: '残裂',
        奇穴图片: 'https://icon.jx3box.com/icon/6434.png',
        id: '13414',
        奇穴描述: '“盾猛”可将目标击退8尺，调息时间降低3秒，命中敌人时额外回复20点怒气。',
      },
      {
        奇穴名称: '仇非',
        奇穴图片: 'https://icon.jx3box.com/icon/14086.png',
        id: '25212',
        奇穴描述:
          '自身气血值低于1%时，消耗全部怒气，短时不会重伤，持续6秒，期间自身禁疗，结束时若自身怒气大于等于60点，回复自身50%气血值。此效果最多3分30秒触发一次。',
      },
      {
        奇穴名称: '岁久',
        奇穴图片: 'https://icon.jx3box.com/icon/21955.png',
        id: '37240',
        奇穴描述:
          '施展“盾壁”使自身立即回复自身10%气血最大值，并回复自身30%格挡值。受到任何伤害攻击导致自身气血值低于40%则立刻重置“盾壁”调息时间，该效果最多每3分钟触发一次。',
      },
      {
        奇穴名称: '斗塞',
        奇穴图片: 'https://icon.jx3box.com/icon/11870.png',
        id: '45804',
        奇穴描述:
          '“盾猛”无视目标100%外功防御；“盾压”命中目标获得2层<NounID 207>，“盾刀”命中目标获得1层<NounID 207>，积攒的<NounID 207>可强化下一次“盾猛”。',
      },
      {
        奇穴名称: '吓魂',
        奇穴图片: 'https://icon.jx3box.com/icon/6429.png',
        id: '21282',
        奇穴描述:
          '“绝刀”附带8尺冲刺效果，命中有自身流血的侠士目标，直接造成最大怒气对应的伤害，若目标气血值低于自身，则使目标的基础攻击力下降20%，持续4秒。',
      },
      {
        奇穴名称: '陷阵',
        奇穴图片: 'https://icon.jx3box.com/icon/24943.png',
        id: '41834',
        奇穴描述:
          '“盾击”命中目标后形成地震波向外扩散并对触碰目标造成两次伤害，该伤害视为“盾击”，最大30尺，最多5个目标。地震波每15秒最多触发1次。',
      },
      {
        奇穴名称: '刀煞',
        奇穴图片: 'https://icon.jx3box.com/icon/11867.png',
        id: '14838',
        奇穴描述: '对眩晕、击倒、被击僵直目标伤害提高35%。',
      },
      {
        奇穴名称: '锋鸣',
        奇穴图片: 'https://icon.jx3box.com/icon/6326.png',
        id: '22897',
        奇穴描述: '“盾飞”调息时间降低8秒，施展后使自身外攻基础攻击力提高15%，持续30秒。',
      },
      {
        奇穴名称: '盾生锋',
        奇穴图片: 'https://icon.jx3box.com/icon/14085.png',
        id: '46079',
        奇穴描述:
          '“云城盾”套路招式不再重置“盾压”调息时间，施展“盾压”时使自身周围30尺内的小队目标获得<NounID 212>效果，若友方<NounID 212>被击破，则自身获得<NounID 213>效果，<NounID 213>效果将强化自身下一次“斩刀”。',
      },
      {
        奇穴名称: '雷云',
        奇穴图片: 'https://icon.jx3box.com/icon/6287.png',
        id: '34540',
        奇穴描述:
          '“盾飞”可对击中的目标周围10尺的其他敌对目标进行弹射，若命中的第一个目标若正在运功，则使该目标2秒内无法运功。',
      },
    ],
  },
]

export default 奇穴数据
