import 循环模拟技能基础数据 from '../../../../constant/skill'
import { 每秒郭氏帧 } from '@/数据/常量'
import 特效统一类 from '../特效统一类'
import { 待生效事件 } from '../../../type'

class 召唤麒麟 extends 特效统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '召唤麒麟')
  static 读条时间 = 每秒郭氏帧 * 5.5
  // 临时变量存储召唤麒麟快照的buff列表
  constructor(模拟循环) {
    super(模拟循环)
    召唤麒麟.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '召唤麒麟')
  }

  获取读条时间() {
    this.保存释放记录('召唤麒麟')

    return 召唤麒麟.读条时间
  }

  读条(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    待生效事件队列.push({
      事件名称: '技能读条',
      事件时间: 读条开始时间 + 召唤麒麟.读条时间,
      事件备注: {
        技能名称: '召唤麒麟',
      },
    })
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  // 读条命中，召唤麒麟本身不造成伤害，仅完成读条
  读条命中() {
    if (召唤麒麟.技能数据) {
      this.模拟循环?.技能释放后更新运行数据?.(召唤麒麟.技能数据, this)
    }
    // 召唤麒麟为独立读条技能，与化卦坠符分开，不自动触发化卦坠符
    // 存储当前buff列表快照
    this.模拟循环.召唤麒麟快照buff列表 = this.获取当前快照buff()

    this.模拟循环.添加buff({ 名称: '麒麟', 对象: '自身' })
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表([
        '荧入白',
        '祝祷',
        '鬼遁',
        '镇星',
        '明灯',
        '龙马出河',
      ]),
    }
  }
}

export default 召唤麒麟

export const 召唤麒麟类型 = typeof 召唤麒麟
