// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 盾回 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '盾回')
  static 回复怒气 = 0

  constructor(模拟循环) {
    super(模拟循环)

    this.初始化技能运行数据()
  }
  释放() {
    // 偃守孤旌切换至擎刀时无法使用非苍雪刀技能
    const 偃守孤旌禁用非苍雪刀技能 = this.模拟循环.当前自身buff列表?.['战绝']?.当前层数
    if (偃守孤旌禁用非苍雪刀技能) {
      return { 可以释放: false, 异常信息: '偃守孤旌切换至擎刀时无法使用非苍雪刀技能' }
    }

    this.模拟循环.切换角色体态?.('擎盾', '盾回')
    // 延迟0.125秒切换至擎盾
    const 盾回切体态 = (this.模拟循环.当前时间 || 0) + 2
    this.模拟循环.添加待生效事件队列?.([
      {
        事件时间: 盾回切体态,
        事件名称: '盾回切体态',
        事件备注: { 技能名称: '盾回' },
      },
    ])
  }
  盾回切体态() {
    this.模拟循环.卸除buff?.({ 名称: '盾飞', 对象: '自身', 卸除层数: 1 })
    this.模拟循环.删除待生效事件队列?.('强制盾回')
    this.模拟循环.删除待生效事件队列?.('盾飞持续伤害')
  }

  释放后() {
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武']),
    }
  }
}

export default 盾回
export const 盾回类型 = typeof 盾回
