import type { 技能基础数据模型 } from '@/@types/技能'

import { 获取破招实际系数 } from '../../统一数据/系数计算'

import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'

import 通用增益 from './技能增益/通用增益/通用增益'
import 千机变增益 from './技能增益/千机变'
import 千机变无特殊子弹增益 from './技能增益/千机变无特殊子弹'

import 天绝地灭增益 from './技能增益/天绝地灭'
import 暴雨梨花针增益 from './技能增益/暴雨梨花针'
import 暗藏杀机增益 from './技能增益/暗藏杀机'
import 罡风镖法增益 from './技能增益/罡风镖法'
import 蚀肌弹增益 from './技能增益/蚀肌弹'
import 千秋万劫增益 from './技能增益/千秋万劫'
import 毒刹增益 from './技能增益/毒刹'
import 天风汲雨增益 from './技能增益/天风汲雨'
import 天女散花增益 from './技能增益/天女散花'
// import 千机连环增益 from "./技能增益/千机连环";
import 狂雨穿心增益 from './技能增益/狂雨穿心'

const 技能基础数据: 技能基础数据模型[] = [
  //==========================DOT=========================//
  {
    技能ID: '3221_3126', // 3221_3126
    技能名称: '化血(DOT)',
    统计名称: '化血(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 8,
    基础伤害_基础值: 90,
    技能等级数据: {
      // 原始
      1: { 技能伤害系数: 478.64817000000005 },
      // 千秋万劫
      2: { 技能伤害系数: 478.64817000000005 * 2 },
      // 尽刑彻毒
      3: {
        技能伤害系数: 478.64817000000005 * 3,
        DOT生效间隔: 16,
        DOT跳数: 24,
      },
      // 千秋万劫+尽刑彻毒
      4: {
        技能伤害系数: 478.64817000000005 * 6,
        DOT生效间隔: 16,
        DOT跳数: 24,
      },
    },
    技能增益列表: 通用增益,
  },
  {
    技能ID: '3221_3126_2', // 3221_3126
    技能名称: '化血(DOT)·引爆',
    统计名称: '化血(DOT)',
    DOT生效间隔: 48,
    DOT跳数: 8,
    基础伤害_基础值: 90,
    技能伤害系数: 478.64817000000005,
    技能增益列表: 通用增益,
  },
  //==========================DOT=========================//

  //==========================技能=========================//
  {
    技能ID: '32885',
    技能名称: '破',
    统计名称: '破',
    技能伤害系数: 获取破招实际系数(-78260),
    技能增益列表: 通用增益,
  },
  {
    技能ID: '3121',
    技能名称: '罡风镖法',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 罡风镖法增益,
  },
  {
    技能ID: '25774',
    技能名称: '蚀肌弹·神兵',
    统计名称: '蚀肌弹·神兵',
    技能伤害系数: 0.20833333333333331 * 12 * 16, //40
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '3480',
    技能名称: '暴雨梨花针·额外',
    统计名称: '暴雨梨花针',
    秘籍依赖技能: '暴雨梨花针',
    技能伤害系数: 337, // 337
    基础伤害_基础值: 621,
    基础伤害_浮动值: 65,
    技能增益列表: 暴雨梨花针增益,
  },
  {
    技能ID: '3223',
    技能名称: '孔雀翎',
    技能伤害系数: 0.6770833333333333 * 12 * 16, //130
    基础伤害_基础值: 347,
    基础伤害_浮动值: 36,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '3228',
    技能名称: '暴雨梨花针',
    统计名称: '暴雨梨花针',
    秘籍依赖技能: '暴雨梨花针',
    技能伤害系数: 0.49479166666666663 * 12 * 16, //95
    基础伤害_基础值: 523,
    基础伤害_浮动值: 52,
    技能增益列表: 暴雨梨花针增益,
  },
  {
    技能ID: '3105',
    技能名称: '蚀肌弹',
    统计名称: '蚀肌弹',
    秘籍依赖技能: '蚀肌弹',
    技能伤害系数: 361.97264235132025 + 28 - 4,
    基础伤害_基础值: 180,
    基础伤害_浮动值: 20,
    武器伤害系数: 1,
    技能增益列表: 蚀肌弹增益,
  },
  {
    技能ID: '18776',
    技能名称: '蚀肌弹·飞天',
    秘籍依赖技能: '蚀肌弹',
    技能伤害系数: 230.1161108400001 + 28 - 4,
    基础伤害_基础值: 180,
    基础伤害_浮动值: 20,
    武器伤害系数: 1,
    技能增益列表: 蚀肌弹增益,
  },
  {
    技能ID: '3393',
    技能名称: '天女散花',
    // 技能伤害系数: 172.5,
    技能伤害系数: 0.8958333333333333 * 12 * 16, //172
    基础伤害_基础值: 124,
    基础伤害_浮动值: 13,
    技能增益列表: 天女散花增益,
  },
  {
    技能ID: '36502',
    技能名称: '天绝地灭',
    秘籍依赖技能: '天绝地灭',
    技能伤害系数: 70.4,
    基础伤害_基础值: 104,
    基础伤害_浮动值: 52,
    技能增益列表: 天绝地灭增益,
  },
  {
    技能ID: '3313',
    技能名称: '暗藏杀机',
    统计名称: '图穷匕见',
    秘籍依赖技能: '暗藏杀机',
    技能伤害系数: 698.0014470000002,
    基础伤害_浮动值: 210,
    技能增益列表: 暗藏杀机增益,
  },
  {
    技能ID: '3401',
    技能名称: '连弩·一',
    统计名称: '连弩',
    // 技能伤害系数: 333.44561250000004,
    技能伤害系数: 1.59375 * 12 * 16, //306
    基础伤害_基础值: 48,
    基础伤害_浮动值: 6,
    技能增益列表: 千机变增益,
  },
  {
    技能ID: '3404',
    技能名称: '连弩·二',
    统计名称: '连弩',
    // 技能伤害系数: 587.431845,
    技能伤害系数: 2.8125 * 12 * 16, //540
    基础伤害_基础值: 50,
    基础伤害_浮动值: 10,
    技能增益列表: 千机变增益,
  },
  {
    技能ID: '3819',
    技能名称: '重弩·一',
    统计名称: '重弩',
    // 技能伤害系数: 554.53566168,
    技能伤害系数: 2.161458333333333 * 12 * 16, //415
    基础伤害_基础值: 53,
    基础伤害_浮动值: 6,
    技能增益列表: 千机变增益,
  },
  {
    技能ID: '3824',
    技能名称: '重弩·二',
    统计名称: '重弩',
    // 技能伤害系数: 994.4046272159999,
    技能伤害系数: 3.880208333333333 * 12 * 16, //745
    基础伤害_基础值: 79,
    基础伤害_浮动值: 6,
    技能增益列表: 千机变增益,
  },
  {
    技能ID: '3367',
    技能名称: '毒刹',
    统计名称: '毒刹',
    // 技能伤害系数: 135.13500000000002,
    技能伤害系数: 135,
    基础伤害_基础值: 57,
    基础伤害_浮动值: 7,
    技能增益列表: 毒刹增益,
  },
  {
    技能ID: '42483',
    技能名称: '困孤悬饵',
    技能伤害系数: 1.6927083333333333 * 12 * 16, //325
    基础伤害_基础值: 23,
    基础伤害_浮动值: 3,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '26900',
    技能名称: '雨骤',
    技能伤害系数: 451,
    基础伤害_基础值: 37,
    基础伤害_浮动值: 5,
    技能增益列表: 千机变无特殊子弹增益,
  },
  {
    技能ID: '26901',
    技能名称: '云奔',
    // 技能伤害系数: 1174.1918720599265,
    技能伤害系数: 950,
    基础伤害_基础值: 53,
    基础伤害_浮动值: 6,
    技能增益列表: 千机变无特殊子弹增益,
  },
  {
    技能ID: '3304',
    技能名称: '化血迷心',
    统计名称: '化血迷心',
    基础伤害_基础值: 25,
    基础伤害_浮动值: 5,
    技能伤害系数: 338,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '18677',
    技能名称: '千秋万劫',
    // 技能伤害系数: 1136.8382454000002,
    技能伤害系数: 5.916666666666666 * 12 * 16, //1136
    基础伤害_基础值: 40,
    基础伤害_浮动值: 40,
    技能增益列表: 千秋万劫增益,
  },
  {
    技能ID: '28441',
    技能名称: '千秋万劫·飞天',
    // 技能伤害系数: 1136.8382454000002,
    技能伤害系数: 5.916666666666666 * 12 * 16, //1136
    基础伤害_基础值: 40,
    基础伤害_浮动值: 40,
    技能增益列表: 千秋万劫增益,
  },
  {
    // 黑洞 TODO: 待改成真实值
    技能ID: '42664',
    技能名称: '封喉 / 星离雨散',
    技能等级数据: {
      1: {
        统计名称: '封喉',
        技能伤害系数: 768,
        基础伤害_基础值: 84,
        基础伤害_浮动值: 10,
      },
      2: {
        统计名称: '星离雨散',
        //主目标,其他目标没封喉不*2
        技能伤害系数: 768 * 2,
        基础伤害_基础值: 112,
        基础伤害_浮动值: 14,
      },
    },
    技能增益列表: 通用增益,
  },
  {
    技能ID: '42484',
    技能名称: '天风汲雨',
    秘籍依赖技能: '天绝地灭',
    // 技能伤害系数: 327.36000000000007,
    技能伤害系数: 184,
    基础伤害_基础值: 18,
    基础伤害_浮动值: 9,
    技能增益列表: 天风汲雨增益,
  },
  {
    // 黑洞 TODO: 待改成真实值
    技能ID: '44512',
    技能名称: '狂雨穿心',
    统计名称: '狂雨穿心',
    技能伤害系数: 534,
    基础伤害_基础值: 50,
    基础伤害_浮动值: 25,
    技能增益列表: 狂雨穿心增益,
  },
  //==========================技能=========================//

  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
}

export { 技能增益 }
