import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '翼轸·悟',
        奇穴图片: '',
        id: '101473',
        奇穴描述:
          '持有卦象期间：\\n放置【灯魂】可使范围内敌方{锁足}，持续2秒；\\n自身成功使敌方{锁足}{眩晕}时，造成的伤害提高30%，持续5秒。',
      },
      {
        奇穴名称: '辰星·悟',
        奇穴图片: '',
        id: '101474',
        奇穴描述:
          '自身或目标处于{局}或{连局}中时，【傍身招式】和【兵主逆·悟】命中时额外造成66%攻击力的混元性内功伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '星汉 ·悟',
        奇穴图片: '',
        id: '101475',
        奇穴描述: '持有卦象或场上有自身【灯魂】时，造成的伤害提高10%，受到的伤害降低10%。',
      },
      {
        奇穴名称: '堙灭·悟',
        奇穴图片: '',
        id: '101476',
        奇穴描述:
          '【兵主逆·悟】变为2层充能招式，每跳使自身移动速度提高5%，伤害提高5%，持续15秒，最多叠加3层。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '七宿·悟',
        奇穴图片: '',
        id: '101477',
        奇穴描述:
          '处于{局}或{连局}之中的目标受到自身{祝由·火离·悟}或【杀星在尾·悟】伤害时，{减疗}50%，持续3秒。',
      },
      {
        奇穴名称: '灵灯·悟',
        奇穴图片: '',
        id: '101478',
        奇穴描述:
          '施展【绝技招式】使自身造成的会心率和会心效果提高10%，持续35秒，施展【傍身招式】可延长1秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '鬼星开穴·悟',
        奇穴图片: '',
        id: '101454',
        奇穴描述:
          '立即引爆场上所有【灯魂】，对{局}和{连局}内敌方造成伤害并{眩晕}。\\n根据施展时自身持有的卦象产生额外效果：\\n【水坎·悟】：对被命中目标施加20%【治疗吸收盾】，持续8秒；\\n【山艮·悟】：对被命中目标施加{轻功沉默}，持续4秒；\\n【火离·悟】：若目标持有自身{祝由·火离·悟}，则立即造成3次伤害。',
      },
      {
        奇穴名称: '列宿游·悟',
        奇穴图片: '',
        id: '101455',
        奇穴描述:
          '对敌方造成伤害，自身获得{明灯·悟}，持续60秒。再次获得{明灯·悟}时，使本招式调息时间降低5秒。',
      },
    ],
  },
  {
    奇穴列表: [],
  },
  {
    奇穴列表: [],
  },
  {
    是否为混池: true,
    奇穴列表: [],
  },
]

export default 奇穴数据
