// 本文件已经PVE无作用
// import 技能统一类 from '../../通用类/技能统一类'
// import { 待生效事件 } from '../../type'

// class 驰风震域 extends 技能统一类 {
//   constructor(模拟循环) {
//     super(模拟循环)
//   }

//   获得驰风震域() {
//     const 驰风震域数据: any = this.模拟循环.Buff和Dot数据?.['驰风震域']
//     const 驰风震域频率 = 驰风震域数据?.伤害频率 || 4
//     const 事件次数 = 驰风震域数据?.最大作用次数 || 24
//     // 跃本身伤害吃不到梦悠
//     if (this.模拟循环.校验奇穴是否存在('梦悠')) {
//       this.模拟循环.添加buff?.({ 名称: '梦悠', 对象: '自身' })
//     }

//     this.风驰校验()

//     this.模拟循环.添加buff?.({ 名称: '驰风震域', 对象: '目标' })

//     this.添加驰风震域检测队列(事件次数, 驰风震域频率)
//   }

//   获得驰风震域海碧() {
//     const 驰风震域海碧数据: any = this.模拟循环.Buff和Dot数据?.['驰风震域·海碧']
//     const 驰风震域海碧频率 = 驰风震域海碧数据?.伤害频率 || 4
//     const 事件次数 = 驰风震域海碧数据?.最大作用次数 || 24
//     // 跃本身伤害吃不到梦悠
//     if (this.模拟循环.校验奇穴是否存在('梦悠')) {
//       this.模拟循环.添加buff?.({ 名称: '梦悠', 对象: '自身' })
//     }

//     this.风驰校验()

//     this.模拟循环.添加buff?.({ 名称: '驰风震域·海碧', 对象: '目标' })

//     this.添加驰风震域检测队列(事件次数, 驰风震域海碧频率)
//   }

//   风驰校验() {
//     if (this.模拟循环.校验奇穴是否存在('风驰')) {
//       const 驰风震域存续校验 =
//         this?.模拟循环?.当前目标buff列表?.['驰风震域']?.当前层数 ||
//         this?.模拟循环?.当前目标buff列表?.['驰风震域·海碧']?.当前层数

//       if (驰风震域存续校验) {
//         this.模拟循环.卸除buff?.({ 名称: '驰风震域', 对象: '目标' })
//         this.模拟循环.卸除buff?.({ 名称: '驰风震域·海碧', 对象: '目标' })
//         this.模拟循环?.删除待生效事件队列('驰风震域检测')
//         this.触发伤害行为('风驰')
//         if (this.模拟循环?.技能类实例集合?.振翅图南?.存在振翅图南校验()) {
//           this.模拟循环.添加buff?.({ 名称: '风驰', 对象: '自身' })
//         }
//         // this.振翅图南风驰快照()
//       }
//     }
//   }

//   // 振翅图南风驰快照() {
//   //   const 新待生效事件队列 = this.模拟循环.待生效事件队列.map((item) => {
//   //     const 当前风驰层数 = this.模拟循环?.当前自身buff列表?.['风驰']?.当前层数 || 0
//   //     if (item.事件名称.includes('振翅图南')) {
//   //       item.事件备注 = {
//   //         ...item.事件备注,
//   //         快照Buff: [`风驰·${当前风驰层数}`],
//   //       }
//   //     }
//   //     return item
//   //   })
//   //   this.模拟循环.待生效事件队列 = [...新待生效事件队列]
//   // }

//   添加驰风震域检测队列(事件次数, 频率) {
//     const 待生效事件: 待生效事件[] = []
//     for (let i = 1; i <= 事件次数; i++) {
//       const 事件时间 = this.模拟循环.当前时间 + 频率 * i
//       待生效事件.push({
//         事件名称: `驰风震域检测·${i + 1}`,
//         事件时间: 事件时间,
//         事件备注: {},
//       })
//     }
//     this.模拟循环.添加待生效事件队列(待生效事件)
//   }

//   驰风震域触发() {
//     // 跃本身伤害吃不到梦悠
//     if (this.模拟循环.校验奇穴是否存在('梦悠') && this.驰风震域存续判定()) {
//       this.模拟循环.添加buff?.({ 名称: '梦悠', 对象: '自身' })
//     }
//   }
// }

// export default 驰风震域

// export const 驰风震域类型 = typeof 驰风震域
