import 技能统一类 from '../../通用类/技能统一类'
import type 循环主类 from '../../main'
import 技能基础数据 from '../../../constant/skill'

class 醉逍遥 extends 技能统一类 {
  static 技能数据 = 技能基础数据.find((技能) => 技能.技能名称 === '醉逍遥')!
  技能名称 = '醉逍遥'

  constructor(模拟循环: 循环主类) {
    super(模拟循环)
  }

  释放() {
    if (this.模拟循环.当前自身buff列表.逍遥 || this.模拟循环.角色状态信息.醉意 < 3)
      return { 可以释放: false, 异常信息: '醉逍遥需要三层醉意，且当前不处于逍遥' }
    return { 可以释放: true }
  }

  命中() {
    this.保存释放记录()
    this.模拟循环.角色状态信息.醉意 = 0
    this.模拟循环.添加战斗日志({
      日志: '醉逍遥消耗3点醉意，醉意变为0',
      日志类型: '技能释放结果',
    })
    if (this.模拟循环.校验奇穴是否存在('复征'))
      this.模拟循环.添加buff({ 名称: '复征', 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: '越渊', 对象: '自身' })
    this.模拟循环.添加buff({ 名称: '逍遥', 对象: '自身' })
    this.模拟循环.切换角色体态('逍遥', this.技能名称)
    this.模拟循环.添加buff({ 名称: '酩酊大醉', 对象: '自身' })
    this.模拟循环.添加buff({ 名称: '昊破', 对象: '自身' })
  }
}

export default 醉逍遥
