import type { 技能基础数据模型 } from '@/@types/技能'
import { 获取破招实际系数 } from '../../统一数据/系数计算'

import 通用增益 from './技能增益/通用增益/通用增益'
import 三星临增益 from './技能增益/三星临'
import 兵主逆增益 from './技能增益/兵主逆'
import 天斗旋增益 from './技能增益/天斗旋'
import 鬼星开穴增益 from './技能增益/鬼星开穴'
import 亘天增益 from './技能增益/亘天'
import 起卦增益 from './技能增益/起卦'
import 变卦增益 from './技能增益/变卦'
import 奇门飞宫增益 from './技能增益/奇门飞宫'
import 返闭惊魂增益 from './技能增益/返闭惊魂'
import 纵横三才增益 from './技能增益/纵横三才'
import 火离增益 from './技能增益/火离增益'

import 九字诀山卦通用增益 from './技能增益/通用增益/九字诀山卦通用增益'
import { 属性类型 } from '@/@types/属性'
import 通用外功增益 from './技能增益/通用增益/通用外功'
import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'

const 非山卦三星临: Partial<技能基础数据模型> = {
  统计名称: '三星临',
  秘籍依赖技能: '三星临',
  技能伤害系数: 330,
  基础伤害_基础值: 88,
  基础伤害_浮动值: 56,
  技能增益列表: 三星临增益,
}

const 非山卦兵主逆: Partial<技能基础数据模型> = {
  统计名称: '兵主逆',
  秘籍依赖技能: '兵主逆',
  技能伤害系数: 388.08000000000004,
  基础伤害_基础值: 390,
  基础伤害_浮动值: 188,
  技能增益列表: 兵主逆增益,
}

const 非山卦天斗旋: Partial<技能基础数据模型> = {
  统计名称: '天斗旋',
  秘籍依赖技能: '天斗旋',
  技能伤害系数: 942.3480000000003,
  基础伤害_基础值: 620,
  基础伤害_浮动值: 425,
  技能增益列表: 天斗旋增益,
}

const 鬼星开穴: Partial<技能基础数据模型> = {
  秘籍依赖技能: '鬼星开穴',
  技能伤害系数: 742.5000000000001, // 18级数据，19 20 21为点了奇穴 擎羊 的情况，一般点不出来
  基础伤害_基础值: 766,
  基础伤害_浮动值: 525,
  技能增益列表: 鬼星开穴增益,
  技能等级数据: {
    '19': {
      技能伤害系数: 913.2750000000001,
      基础伤害_基础值: 1456,
      基础伤害_浮动值: 997,
    },
    '20': {
      技能伤害系数: 1084.0500000000002,
      基础伤害_基础值: 1456,
      基础伤害_浮动值: 997,
    },
    '21': {
      技能伤害系数: 1254.825,
      基础伤害_基础值: 1456,
      基础伤害_浮动值: 997,
    },
  },
}

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '32886',
    技能名称: '破', // 32886
    统计名称: '破',
    技能伤害系数: 获取破招实际系数(740529.4363607038),
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 获取破招实际系数(740529.4363607038) },
      2: { 技能伤害系数: 获取破招实际系数(-577039.42586368) },
      3: { 技能伤害系数: 获取破招实际系数(-341271.13879552006) },
    },
  },
  {
    技能ID: '25512',
    技能名称: '魂击', // 25512
    伤害类型: '外功',
    技能伤害系数: 21,
    武器伤害系数: 1,
    技能增益列表: [
      ...通用外功增益,
      {
        增益名称: '普通攻击增伤',
        增益所在位置: '职业',
        增益类型: '全局启用',
        增益启用: true,
        增益集合: [{ 属性: 属性类型.通用增伤, 值: 205 / 1024 }],
      },
    ],
  },
  {
    技能ID: '24558',
    技能名称: '三星临',
    ...非山卦三星临,
  },
  {
    技能ID: '24675',
    技能名称: '三星临·水',
    ...非山卦三星临,
  },
  {
    技能ID: '24677',
    技能名称: '三星临·火',
    ...非山卦三星临,
  },
  {
    技能ID: '24811',
    技能名称: '兵主逆',
    ...非山卦兵主逆,
  },
  {
    技能ID: '24812',
    技能名称: '兵主逆·水',
    ...非山卦兵主逆,
  },
  {
    技能ID: '24814',
    技能名称: '兵主逆·火',
    ...非山卦兵主逆,
  },
  {
    技能ID: '24821',
    技能名称: '天斗旋',
    ...非山卦天斗旋,
  },
  {
    技能ID: '24822',
    技能名称: '天斗旋·水',
    ...非山卦天斗旋,
  },
  {
    技能ID: '24824',
    技能名称: '天斗旋·火',
    ...非山卦天斗旋,
  },
  {
    技能ID: '24676',
    技能名称: '三星临·山',
    统计名称: '三星临',
    秘籍依赖技能: '三星临',
    技能伤害系数: 380,
    基础伤害_基础值: 92,
    基础伤害_浮动值: 58,
    技能增益列表: [...三星临增益, ...九字诀山卦通用增益],
  },
  {
    技能ID: '24813',
    技能名称: '兵主逆·山',
    统计名称: '兵主逆',
    秘籍依赖技能: '兵主逆',
    技能伤害系数: 446,
    基础伤害_基础值: 409,
    基础伤害_浮动值: 197,
    技能增益列表: [...兵主逆增益, ...九字诀山卦通用增益],
  },
  {
    技能ID: '24823',
    技能名称: '天斗旋·山',
    统计名称: '天斗旋',
    秘籍依赖技能: '天斗旋',
    技能伤害系数: 1083,
    基础伤害_基础值: 651,
    基础伤害_浮动值: 446,
    技能增益列表: [...天斗旋增益, ...九字诀山卦通用增益],
  },
  {
    技能ID: '24454',
    技能名称: '卦象·火离',
    技能伤害系数: 240,
    基础伤害_基础值: 75,
    基础伤害_浮动值: 43,
    技能增益列表: 火离增益,
  },
  {
    技能ID: '25031',
    技能名称: '焚如·火离',
    技能伤害系数: 360,
    基础伤害_基础值: 75,
    基础伤害_浮动值: 43,
    技能增益列表: 火离增益,
  },
  {
    技能ID: '24870',
    技能名称: '鬼星开穴',
    统计名称: '鬼星开穴',
    ...鬼星开穴,
  },
  {
    技能ID: '37311',
    技能名称: '鬼星开穴·龙回首',
    ...鬼星开穴,
    技能伤害系数: 631.1250000000001,
  },
  {
    技能ID: '33236',
    技能名称: '列宿游',
    统计名称: '列宿游',
    技能伤害系数: 1000,
    基础伤害_基础值: 34,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  /**
   * 点出踏斗:
   *    12尺以上造成3级别=伤害
   *    12尺以下造成2级伤害
   * 不点奇穴造成1级伤害 (系数为0)
   */
  {
    技能ID: '42423', // 主动
    技能名称: '纵横三才·主动',
    统计名称: '纵横三才',
    基础伤害_基础值: 60,
    基础伤害_浮动值: 20,
    技能伤害系数: 920,
    技能增益列表: 纵横三才增益,
  },
  {
    技能ID: '28815',
    技能名称: '纵横三才', // 连极阵
    统计名称: '纵横三才',
    基础伤害_基础值: 60,
    基础伤害_浮动值: 20,
    技能伤害系数: 506,
    技能增益列表: 纵横三才增益,
  },
  {
    技能ID: '30847',
    技能名称: '天网',
    技能伤害系数: 100,
    基础伤害_基础值: 50,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '34683',
    技能名称: '亘天',
    秘籍依赖技能: '天斗旋',
    技能伤害系数: 660,
    基础伤害_基础值: 34,
    基础伤害_浮动值: 5,
    技能增益列表: 亘天增益,
  },
  {
    技能ID: '25174',
    技能名称: '灵器',
    技能伤害系数: 260,
    基础伤害_基础值: 33,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '37599',
    技能名称: '阵星入舆',
    技能伤害系数: 297,
    基础伤害_基础值: 34,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '42520', // 42520_2
    技能名称: '御前星',
    技能伤害系数: 540,
    基础伤害_基础值: 100,
    基础伤害_浮动值: 100,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '37599',
    技能名称: '三星临·神兵',
    技能伤害系数: 50,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '33588', // 33588_1
    技能名称: '神兵·合灯',
    技能伤害系数: 1052,
    基础伤害_基础值: 120,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '33588', // 33588_2
    技能名称: '神兵·循环天转',
    技能伤害系数: 1347,
    基础伤害_基础值: 120,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '24375',
    技能名称: '起卦',
    技能伤害系数: 0,
    技能增益列表: 起卦增益,
  },
  {
    技能ID: '24378',
    技能名称: '变卦',
    技能伤害系数: 0,
    技能增益列表: 变卦增益,
  },
  {
    技能ID: '24378',
    技能名称: '奇门飞宫',
    技能伤害系数: 0,
    技能增益列表: 奇门飞宫增益,
  },
  {
    技能ID: '24380',
    技能名称: '返闭惊魂',
    技能伤害系数: 0,
    技能增益列表: 返闭惊魂增益,
  },
  {
    技能ID: '10615_31796', // 10615_31796
    技能名称: '知微(DOT)',
    统计名称: '知微',
    DOT生效间隔: 32,
    DOT跳数: 15,
    基础伤害_基础值: 26,
    技能伤害系数: 1400,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '42509',
    技能名称: '太白蚀昴',
    技能伤害系数: 206,
    基础伤害_基础值: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '45032',
    技能名称: '镇星入舆',
    技能伤害系数: 1900,
    基础伤害_基础值: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '24373',
    技能名称: '往者定',
    技能伤害系数: 250,
    基础伤害_基础值: 48,
    基础伤害_浮动值: 39,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '43806',
    技能名称: '起符',
    基础伤害_基础值: 0,
    技能伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '43728',
    技能名称: '化卦坠符',
    基础伤害_基础值: 0,
    技能伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '43728',
    技能名称: '应卦震符',
    基础伤害_基础值: 0,
    技能伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '43902',
    技能名称: '雷亟',
    基础伤害_基础值: 1462897,
    技能伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '43724',
    技能名称: '天麟踏星坠',
    基础伤害_基础值: 2025550,
    技能伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '43901',
    技能名称: '奔雷怒啸',
    基础伤害_基础值: 1575427,
    技能伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '43722',
    技能名称: '崩山重踏',
    基础伤害_基础值: 2925794,
    技能伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '43721',
    技能名称: '疾风连爪',
    基础伤害_基础值: 1350366,
    技能伤害系数: 0,
    技能增益列表: 通用增益,
  },

  // --------------
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
  三星临增益,
  兵主逆增益,
  天斗旋增益,
  鬼星开穴增益,
  亘天增益,
}

export { 技能增益 }
