/**
 * @name 心法模块-北傲诀
 * 模块写入者：唐宋
 */
import type { 心法配置类型 } from '@/心法模块/interface'

import 背景图 from './资源/背景图'
import 默认数据 from './默认数据'
import 加速阈值 from './默认数据/加速阈值'
import 计算循环 from './计算循环'
import 奇穴数据 from './奇穴'
import 技能系数, { 技能增益 } from './技能系数'

const 心法配置: 心法配置类型 = {
  加速阈值,
  名称: '傲血战意',
  踏天境: () => import('./推荐配装'),
  简写: 'axzy',
  模块负责人: '唐宋',
  //邀请使用: true,
  数据提供: '青墨白宣',
  所属门派: '天策',
  主属性: '力道',
  功法: '外功',
  基础属性: { 基础攻击: 2789 },
  主属性额外加成: { 面板攻击: 563 / 1024, 破防等级: 205 / 1024 },
  基础气血加成: 0,
  奇穴数据: 奇穴数据,
  技能系数: 技能系数,
  技能增益: 技能增益,
  计算循环: 计算循环,
  默认数据: 默认数据,
  覆盖率: { 套装会心会效: 0.7 },
  系统配置: {
    主题色: 'hsl(0 65% 48% / 1)',
    心法图标: 'https://img.jx3box.com/image/xf/10026.png',
    背景图: 背景图,
    背景色渐变: `linear-gradient(to right, rgba(0,0,0,0.5) 5%, rgba(70, 0, 0, 0.2) 70%)`,
  },
}

export default 心法配置
