import type { 技能基础数据模型 } from '@/@types/技能'

import 通用增益 from './技能增益/通用增益/通用增益'
import 梅花枪法增益 from './技能增益/梅花枪法'
import 穿云增益 from './技能增益/穿云'
import 战八方增益 from './技能增益/战八方'
import 龙吟增益 from './技能增益/龙吟'
import 灭增益 from './技能增益/灭'
import 龙牙增益 from './技能增益/龙牙'
import 突增益 from './技能增益/突'
import 断魂刺增益 from './技能增益/断魂刺'
import 流血增益 from './技能增益/流血'
import 破罡增益 from './技能增益/破罡'
import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'
import { 属性类型 } from '@/@types/属性'

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '14887',
    技能名称: '战八方·一',
    统计名称: '战八方',
    秘籍依赖技能: '战八方',
    技能伤害系数: 290,
    基础伤害_基础值: 9,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 战八方增益,
  },
  {
    技能ID: '46148',
    技能名称: '战八方·二三',
    统计名称: '战八方',
    秘籍依赖技能: '战八方',
    技能伤害系数: 290,
    基础伤害_基础值: 9,
    基础伤害_浮动值: 1,
    技能增益列表: 战八方增益,
  },
  {
    技能ID: '12',
    技能名称: '梅花枪法',
    统计名称: '梅花枪法',
    技能伤害系数: 27,
    武器伤害系数: 1,
    技能增益列表: 梅花枪法增益,
  },
  {
    技能ID: '18208',
    技能名称: '穿云·一',
    统计名称: '穿云',
    秘籍依赖技能: '穿云',
    技能伤害系数: 427,
    基础伤害_基础值: 16,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 穿云增益,
  },
  {
    技能ID: '18207',
    技能名称: '穿云·二',
    统计名称: '穿云',
    秘籍依赖技能: '穿云',
    技能伤害系数: 427,
    基础伤害_基础值: 16,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 穿云增益,
  },
  {
    技能ID: '18603',
    技能名称: '龙吟',
    统计名称: '龙吟',
    技能伤害系数: 639,
    基础伤害_基础值: 19,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 龙吟增益,
  },
  {
    技能ID: '701',
    技能名称: '灭·斩杀',
    统计名称: '灭',
    秘籍依赖技能: '灭',
    技能伤害系数: 628,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 灭增益,
  },
  {
    技能ID: '701_1',
    技能名称: '灭·自伤',
    统计名称: '灭',
    真实伤害: 1,
    伤害计算类型: '真实伤害',
    技能伤害系数: 0,
    基础伤害_基础值: 0,
    基础伤害_浮动值: 0,
    武器伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '702',
    技能名称: '灭',
    统计名称: '灭',
    秘籍依赖技能: '灭',
    技能伤害系数: 418,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 灭增益,
  },
  {
    技能ID: '6525',
    技能名称: '灭·破楼兰·一',
    统计名称: '灭',
    秘籍依赖技能: '灭',
    技能伤害系数: 628,
    基础伤害_基础值: 11,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 灭增益,
  },
  {
    技能ID: '6526',
    技能名称: '灭·破楼兰·二',
    统计名称: '灭',
    秘籍依赖技能: '灭',
    技能伤害系数: 418,
    基础伤害_基础值: 5,
    基础伤害_浮动值: 6,
    武器伤害系数: 0.25,
    技能增益列表: 灭增益,
  },
  {
    技能ID: '24898',
    技能名称: '灭·骑驭',
    统计名称: '灭',
    秘籍依赖技能: '灭',
    技能伤害系数: 42,
    武器伤害系数: 1,
    技能增益列表: 灭增益,
  },
  {
    技能ID: '431',
    技能名称: '突',
    统计名称: '突',
    技能伤害系数: 16,
    基础伤害_基础值: 3,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 突增益,
  },
  {
    技能ID: '15002',
    技能名称: '龙牙·龙血',
    统计名称: '龙牙',
    秘籍依赖技能: '龙牙',
    技能伤害系数: 255,
    基础伤害_基础值: 2,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 龙牙增益,
  },
  {
    技能ID: '18773',
    技能名称: '龙牙',
    统计名称: '龙牙',
    秘籍依赖技能: '龙牙',
    技能伤害系数: 851,
    基础伤害_基础值: 22,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 龙牙增益,
  },
  {
    技能名称: '夜征',
    基础伤害_基础值: 22,
    基础伤害_浮动值: 1,
    技能伤害系数: 553,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '36568',
    技能名称: '击水',
    统计名称: '击水',
    技能伤害系数: 239,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '13778',
    技能名称: '乘龙箭',
    技能伤害系数: 160,
    基础伤害_基础值: 21,
    基础伤害_浮动值: 2,
    武器伤害系数: 0,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '409',
    技能名称: '断魂刺',
    统计名称: '断魂刺',
    技能伤害系数: 16,
    基础伤害_基础值: 3,
    基础伤害_浮动值: 1,
    武器伤害系数: 1,
    技能增益列表: 断魂刺增益,
  },
  {
    技能ID: '12461_401', // 401
    技能名称: '流血(DOT)', // 击水流血
    统计名称: '流血(DOT)',
    技能伤害系数: 962.680670613486, // 401
    DOT生效间隔: 32,
    DOT跳数: 7, // 最大三层
    基础伤害_基础值: 1,
    技能增益列表: 流血增益,
  },
  // 还有一个牙璋流血写
  {
    技能ID: '3442_18591', // 18591
    技能名称: '流血(DOT)·普通',
    统计名称: '流血(DOT)·普通',
    技能伤害系数: 962.680670613486, // 18591
    DOT生效间隔: 32,
    DOT跳数: 7, // 最大两层
    基础伤害_基础值: 1,
    技能增益列表: 流血增益,
  },
  {
    技能ID: '25772',
    技能名称: '龙牙·神兵',
    技能伤害系数: 50,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '44364',
    技能名称: '破罡',
    技能伤害系数: 300,
    基础伤害_基础值: 16,
    基础伤害_浮动值: 31,
    技能增益列表: 破罡增益,
  },
  {
    技能ID: '24009',
    技能名称: '破军',
    技能伤害系数: 84,
    基础伤害_基础值: 16,
    基础伤害_浮动值: 31,
    武器伤害系数: 1,
    技能增益列表: 破罡增益,
  },
  {
    技能ID: '31031',
    技能名称: '画角闻龙',
    技能伤害系数: 615,
    基础伤害_基础值: 496,
    基础伤害_浮动值: 52,
    技能增益列表: [
      ...通用增益,
      {
        增益名称: '技能秘籍', // 秘籍ID 6442
        增益所在位置: '技能',
        增益类型: '全局启用',
        增益启用: true,
        增益集合: [{ 属性: 属性类型.通用增伤, 值: 512 / 1024 }],
      },
    ],
  },
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

const 技能增益 = {
  通用增益,
}

export { 技能增益 }

export default 技能基础数据
