/**
 * @name 心法模块-冰心诀
 * 模块写入者：蓝团
 */
import type { 心法配置类型 } from '@/心法模块/interface'

import 奇穴数据 from './奇穴'
import 技能系数, { 技能增益 } from './技能系数'
import 计算循环 from './计算循环'
import 背景图 from './资源/背景图'
import 默认数据 from './默认数据'
import 加速阈值 from './默认数据/加速阈值'

const 心法配置: 心法配置类型 = {
  加速阈值,
  名称: '冰心诀',
  踏天境: () => import('./推荐配装'),
  模块负责人: '长倦 蓝团',
  // 邀请使用: true,
  // 数据提供: '内部使用 请勿传播',
  数据提供: '数据：考拉 唐宋；测试：长倦',
  所属门派: '七秀',
  简写: 'bxj',
  主属性: '根骨',
  功法: '内功',
  基础属性: { 基础攻击: 2586 },
  主属性额外加成: { 面板攻击: 748 / 1024, 会心等级: 20 / 1024 },
  基础气血加成: 0,
  奇穴数据,
  技能系数,
  技能增益,
  计算循环,
  默认数据,
  覆盖率: { 套装会心会效: 0.7 },
  系统配置: {
    主题色: '#de65b1',
    心法图标: 'https://img.jx3box.com/image/xf/10081.png',
    背景图,
    背景色渐变: `linear-gradient(to right, rgba(0,0,0,0.6) 5%, rgba(222, 101, 177, 0.25) 70%)`,
    // 背景色: 'rgba(168,88,157, 0.615)',
  },
}

export default 心法配置
