import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import { ERROR_ACTION } from '../../utils'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 拿云式 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '拿云式')

  constructor(模拟循环) {
    super(模拟循环)
    拿云式.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '拿云式')
    this.初始化技能运行数据()
  }

  释放() {
    if (
      (!this.模拟循环.当前自身buff列表.拿云?.当前层数 ||
        this.模拟循环.当前自身buff列表.拿云?.当前层数 < 10) &&
      !this.模拟循环.当前目标buff列表.斩杀状态?.当前层数
    ) {
      return {
        可以释放: false,
        异常信息: { 信息: ERROR_ACTION.无法释放拿云式?.信息 },
      }
    }
  }

  释放前初始化() {
    const 当前技能 = this.模拟循环.技能基础数据?.find((item) => item.技能名称 === '拿云式')
    if (当前技能) {
      当前技能.技能GCD组 = this.是否处于小飞棍减CD模式() ? '小飞棍' : '公共'
    }
  }

  命中() {
    this.身意触发()

    const 当前禅那 = this.模拟循环.角色状态信息.禅那
    const 伤害技能 = ['拿云式·一', '拿云式·二', '拿云式·三'][当前禅那 - 1]
    const 是否斩杀 = this.模拟循环.当前目标buff列表.斩杀状态?.当前层数
    const 是否净果 = this.模拟循环.校验奇穴是否存在('净果')

    let 额外增益: string[] = []
    if (this.众嗔擒龙判定()) {
      额外增益.push('众嗔')
    }

    this.触发伤害行为(
      `${伤害技能}${是否斩杀 ? '·斩杀' : ''}${是否斩杀 && 是否净果 ? '·净果' : ''}`,
      1,
      额外增益,
    )

    this.触发伤害行为('拿云式·武伤', 1)

    if (!this.模拟循环.当前目标buff列表?.斩杀状态?.当前层数) {
      this.模拟循环.卸除buff?.({ 名称: '拿云', 对象: '自身', 卸除层数: 10 })
    }
    this.结算果报('拿云式')
    if (this.模拟循环.秘籍?.['拿云式']?.includes('命中回豆')) {
      this.消耗禅那后获得1点()
    }

    const 消贪层数 = this.众嗔拿云触发贪破()

    this.概率触发拿云()

    this.触发破招(当前禅那)

    this.保存释放记录('拿云式', 消贪层数, 当前禅那)
  }

  触发破招(当前禅那) {
    if (当前禅那 === 3) {
      this.触发伤害行为('破', 1, [], undefined, 2)
      this.模拟循环.添加buff({ 名称: '贪破', 对象: '自身', 新增层数: 1 })
      if (this.模拟循环.校验奇穴是否存在('降魔渡厄')) {
        this.触发伤害行为('降魔·拿云式', 1)
      }
    }
  }

  众嗔拿云触发贪破() {
    if (this.众嗔擒龙判定()) {
      return this.触发贪破()
    } else {
      return undefined
    }
  }

  保存释放记录(名称, 消贪层数, 当前禅那) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      特殊标记: 消贪层数,
      伤害段数: 当前禅那,
      重要buff列表: this.获取当前重要buff列表(['擒龙', '风特效_快照', '金刚日轮']),
    }
  }
}

export default 拿云式

export const 拿云式类型 = typeof 拿云式
