import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import { ERROR_ACTION } from '../../utils'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 拿云式 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '拿云式')

  constructor(模拟循环) {
    super(模拟循环)
    拿云式.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '拿云式')
    this.初始化技能运行数据()
  }

  释放() {
    if (
      !this.模拟循环.是否能够使用拿云式 &&
      !this.模拟循环.当前目标buff列表.斩杀状态?.当前层数 &&
      !this.模拟循环.校验奇穴是否存在('净果')
    ) {
      return {
        可以释放: false,
        异常信息: { 信息: ERROR_ACTION.无法释放拿云式?.信息 },
      }
    }
  }

  释放前初始化() {
    const 当前技能 = this.模拟循环.技能基础数据?.find((item) => item.技能名称 === '拿云式')
    if (当前技能) {
      当前技能.技能GCD组 = this.是否处于小飞棍减CD模式() ? '小飞棍' : '公共'
    }
  }

  命中() {
    const 当前禅那 = this.模拟循环.角色状态信息.禅那
    const 伤害技能 = ['拿云式·一', '拿云式·二', '拿云式·三'][当前禅那 - 1]
    const 是否斩杀 = this.模拟循环.当前目标buff列表.斩杀状态?.当前层数
    const 是否众嗔 =
      !!this.模拟循环.校验奇穴是否存在('众嗔') &&
      !!this.模拟循环.技能类实例集合?.横扫六合DOT?.横扫六合DOT存在判定()
    this.触发伤害行为(`${伤害技能}${是否斩杀 ? '·斩杀' : ''}`, 1, 是否众嗔 ? ['众嗔'] : [])
    this.触发伤害行为('拿云式·武伤', 1)
    if (
      this.模拟循环.当前自身buff列表?.布泽?.当前层数 &&
      this.模拟循环.当前目标buff列表.斩杀状态?.当前层数
    ) {
      this.触发伤害行为('布泽', 1)
      this.模拟循环.卸除buff?.({ 名称: '布泽', 对象: '自身', 卸除层数: 1 })
    }
    if (当前禅那 === 3) {
      this.触发伤害行为('破', 1, [], undefined, 2)
      this.模拟循环.添加buff({ 名称: '贪破', 对象: '自身', 新增层数: 1 })
      if (this.模拟循环.校验奇穴是否存在('降魔渡厄')) {
        this.触发伤害行为('降魔·拿云式', 1)
      }
      if (this.模拟循环.校验奇穴是否存在('布泽')) {
        this.模拟循环.添加buff?.({ 名称: '布泽', 对象: '自身', 新增层数: 1 })
      }
    }
    if (this.模拟循环.校验奇穴是否存在('挂碍')) {
      // this.触发伤害行为('挂碍', 1)
      this.模拟循环.技能类实例集合?.守缺式?.减少调息时间?.(每秒郭氏帧 * 3)
    }
    if (!this.模拟循环.当前目标buff列表?.斩杀状态?.当前层数) {
      this.模拟循环.是否能够使用拿云式 = false
    }
    this.结算果报('拿云式')
    if (this.模拟循环.秘籍?.['拿云式']?.includes('命中回豆')) {
      this.消耗禅那后获得1点()
    }
    this.保存释放记录('拿云式')
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['布泽', '普渡', '擒龙', '罗汉金身', '身意']),
    }
  }
}

export default 拿云式

export const 拿云式类型 = typeof 拿云式
