import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 沧浪三叠 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '沧')
  static 回复锐意 = 0
  static 释放前洄涛层数 = 0

  constructor(模拟循环) {
    super(模拟循环)
  }

  检查GCD() {
    const 单刀GCD = this.模拟循环.GCD组?.单刀 || 0
    const 双刀GCD = this.模拟循环.GCD组?.双刀 || 0
    const 最大GCD = Math.max(单刀GCD, 双刀GCD)
    return 最大GCD || 0
  }

  判断沧链触发伤害() {
    const 沧链层数 = this.模拟循环.当前自身buff列表?.['沧链']?.当前层数
    if (!沧链层数) {
      this.沧浪造成伤害?.('沧浪三叠·一', 1)
      // 添加两层沧链buff
      this.模拟循环.添加buff?.({ 名称: '沧链', 对象: '自身', 新增层数: 2 })
    } else if (沧链层数 > 1) {
      this.沧浪造成伤害?.('沧浪三叠·二', 2)
      // 消耗一层沧链buff
      this.模拟循环.卸除buff?.({ 名称: '沧链', 对象: '自身', 卸除层数: 1 })
    } else if (沧链层数 === 1) {
      this.沧浪造成伤害?.('沧浪三叠·三', 3)
      this.模拟循环.卸除buff?.({ 名称: '沧链', 对象: '自身', 卸除层数: 2 })
    }
  }

  截流判定() {
    const 当前截流层数 = this.模拟循环.当前自身buff列表?.['截流']?.当前层数 || 0
    if (当前截流层数) {
      this.模拟循环.添加buff?.({ 名称: '长溯', 对象: '目标' })
    }
  }

  命中() {
    沧浪三叠.释放前洄涛层数 = this.模拟循环.当前自身buff列表?.['洄涛']?.当前层数 || 0
  }

  释放后() {
    this.模拟循环.卸除buff?.({ 名称: '截流', 对象: '自身', 卸除层数: 1 })
  }

  滔天判定() {
    return (
      this.模拟循环.校验奇穴是否存在?.('裂海横天') &&
      !!this.模拟循环.当前自身buff列表?.['倾怒']?.当前层数 &&
      !!this.模拟循环.当前自身buff列表?.['洄涛']?.当前层数 &&
      this.模拟循环.当前自身buff列表?.['洄涛']?.当前层数 >= 2
    )
  }

  造成伤害(索引) {
    this.弱点击破判定()

    if (this.滔天判定()) {
      this.消耗洄涛('滔天消耗')
      this.消耗洄涛('滔天消耗')
      this.沧浪造成伤害?.('沧浪三叠·一', 1)
      this.沧浪造成伤害?.('沧浪三叠·二', 2)
      this.沧浪造成伤害?.('沧浪三叠·三', 3)
      this.保存释放记录('沧浪三叠·滔天', 4)
      this.模拟循环.卸除buff?.({ 名称: '沧链', 对象: '自身', 卸除层数: 2 })
    } else {
      this.判断沧链触发伤害()
    }

    if (
      !!this.模拟循环.当前自身buff列表?.['洄涛']?.当前层数 &&
      this.模拟循环.当前自身buff列表?.['洄涛']?.当前层数 >= 1
    ) {
      this.判定破浪三式洄涛()
    }
  }

  沧浪造成伤害(名称, 段数) {
    this.截流判定()
    this.触发伤害行为(名称)
    this.保存释放记录(名称, 段数)
  }

  保存释放记录(名称, 段数?) {
    this.本次释放记录 = {
      伤害段数: 段数 || undefined,
      实际伤害技能: 名称,
      特殊标记: 沧浪三叠.释放前洄涛层数,
      重要buff列表: this.获取当前重要buff列表(['灭影追风', '流岚']),
    }
  }
}

export default 沧浪三叠

export const 沧浪三叠类型 = typeof 沧浪三叠
