import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'
class 赤日轮 extends 技能统一类 {
  技能等级 = 33
  static 技能数据 = 循环模拟技能基础数据.find((技能) => 技能.技能名称 === '赤日轮')

  constructor(模拟循环) {
    super(模拟循环)
  }
  当前段数 = 0
  上次命中时间 = -32
  命中() {
    if (this.模拟循环.当前时间 - this.上次命中时间 >= 32) this.当前段数 = 0
    this.当前段数 = (this.当前段数 % 3) + 1
    this.上次命中时间 = this.模拟循环.当前时间
    this.回复灵力(20, 0, '赤日轮')
  }
  造成伤害() {
    this.保存释放记录()
    this.触发伤害行为(
      this.当前段数 === 1 ? '赤日轮' : '赤日轮' + (this.当前段数 === 2 ? '二段' : '三段'),
    )
    this.触发伤害行为('通用武伤', 1, [], undefined, false, 1)
  }
  保存释放记录() {
    const 实际伤害技能 =
      this.当前段数 === 1 ? '赤日轮' : '赤日轮' + (this.当前段数 === 2 ? '二段' : '三段')
    this.本次释放记录 = {
      实际伤害技能,
      伤害段数: 1,
      重要buff列表: this.模拟循环.获取伤害增益列表(实际伤害技能),
      特殊标记: this.当前段数,
    }
  }
}
export default 赤日轮
