import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 按数字生成数组 } from '@/工具函数/help'
import { 每秒郭氏帧 } from '@/数据/常量'
class 万灵丹 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '万灵丹')
  static 本次释放前内力 = 0

  constructor(模拟循环) {
    super(模拟循环)
  }

  释放() {
    // 立即回复11%内力
    this.模拟循环.回复内力?.(11)
    this.获得万灵丹()
    万灵丹.本次释放前内力 = Math.round(this.模拟循环.角色状态信息?.内力 || 0)
    this.保存释放记录()
    return
  }

  保存释放记录() {
    this.本次释放记录 = {
      底部标识: 万灵丹.本次释放前内力,
    }
  }

  获得万灵丹() {
    const 当前身上有万灵丹 = this.万灵丹状态校验()
    this.模拟循环.添加buff?.({ 名称: '万灵丹', 对象: '自身' })
    if (!当前身上有万灵丹) {
      this.添加万灵丹每秒回复事件()
    }
  }

  添加万灵丹每秒回复事件(初始时间 = 0) {
    let 当前时间 = this.模拟循环.当前时间 || 0
    if (当前时间 === 0) {
      当前时间 = -(每秒郭氏帧 - 初始时间)
    }

    const 待生效事件 = 按数字生成数组(31).map((次数) => {
      return {
        事件名称: '万灵丹_秒回',
        事件时间: 当前时间 + 每秒郭氏帧 * 次数,
      }
    })

    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  万灵丹每秒回复() {
    // 仅在buff存在时生效
    if (!this.万灵丹状态校验()) return

    // 每秒获得0.5%内力
    this.模拟循环.回复内力?.(0.5)
  }

  万灵丹状态校验() {
    return !!this?.模拟循环?.当前自身buff列表?.['万灵丹']?.当前层数
  }
}

export default 万灵丹

export const 万灵丹类型 = typeof 万灵丹
