import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'
import { ERROR_ACTION } from '../../utils'
import type { 循环基础技能数据类型 } from '../../type'
class 净世破魔击 extends 技能统一类 {
  技能等级 = 32
  static 技能数据 = 循环模拟技能基础数据.find((技能) => 技能.技能名称 === '净世破魔击')

  constructor(模拟循环) {
    super(模拟循环)
  }
  释放(当前技能?: 循环基础技能数据类型) {
    const 指定颜色 = 当前技能?.技能名称.split('·')[1]
    const 满灵 = this.模拟循环.角色状态信息.满灵
    return 满灵 && (!指定颜色 || 满灵 === 指定颜色)
      ? { 可以释放: true }
      : { 可以释放: false, 异常信息: ERROR_ACTION.满灵不足 }
  }
  命中() {
    this.模拟循环.技能类实例集合.赤日轮.当前段数 = 0
    this.模拟循环.技能类实例集合.幽月轮.当前段数 = 0
    this.消耗满灵(false)
    if (this.本次消耗满灵 === '月' && this.模拟循环.秘籍['净世破魔击']?.includes('月破回灵'))
      this.回复灵力(0, 20, '月破回灵', true)
  }
  月破剩余段数 = 0
  造成伤害() {
    this.保存释放记录()
    const 颜色 = this.本次消耗满灵!
    this.触发伤害行为('净世破魔击·' + 颜色)
    this.触发伤害行为('通用武伤', 1, [], undefined, false, 颜色 === '日' ? 5 : 6)
    this.诛邪镇魔()
    if (颜色 === '月') {
      this.月破剩余段数 = 2
      this.模拟循环.添加待生效事件队列(
        [1, 2].map((帧) => ({
          事件名称: '净世破魔击技能读条',
          事件时间: this.模拟循环.当前时间 + 帧,
          事件备注: { 技能名称: '净世破魔击' },
        })),
      )
    }
  }
  读条伤害() {
    this.触发伤害行为('净世破魔击·月')
    this.触发伤害行为('通用武伤', 1, [], undefined, false, 6)
    this.月破剩余段数 -= 1
    if (!this.月破剩余段数) this.满灵技能结束()
  }
  释放后() {
    if (this.本次消耗满灵 === '日') this.满灵技能结束()
    else this.模拟循环.待生效事件结算(this.模拟循环.当前时间 + 2)
  }
  保存释放记录() {
    const 实际伤害技能 = '净世破魔击·' + this.本次消耗满灵
    this.本次释放记录 = {
      实际伤害技能,
      伤害段数: this.本次消耗满灵 === '月' ? 3 : 1,
      重要buff列表: this.模拟循环.获取伤害增益列表(实际伤害技能),
      特殊标记: this.本次消耗满灵,
    }
  }
}
export default 净世破魔击
