import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '悬微',
        奇穴图片: 'https://icon.jx3box.com/icon/25044.png',
        id: '42123',
        奇穴描述:
          '“夹线”命中后束缚目标（效果视为击倒）。“提线”触发所需“缠绞”层数变为3层，控制的目标受到自身的“寄线”伤害提高400%。',
      },
      {
        奇穴名称: '叠拍',
        奇穴图片: 'https://icon.jx3box.com/icon/25060.png',
        id: '42113',
        奇穴描述:
          '“落笼簿”调息时间降低至10秒，持续时间降低至4秒。施展后重置“傀儡调”套路招式基础调息时间。',
      },
      {
        奇穴名称: '联套',
        奇穴图片: 'https://icon.jx3box.com/icon/25061.png',
        id: '42114',
        奇穴描述:
          '“落笼簿”调息时间增加至50秒，操控时间提升至20秒，施展后心络上限提高60点，并恢复60点心络。期间每次施展<NounID 163>都会使<NounID 163>伤害提高9%，最多叠加8层。结束操控时消失。',
      },
      {
        奇穴名称: '绞网',
        奇穴图片: 'https://icon.jx3box.com/icon/25062.png',
        id: '42115',
        奇穴描述:
          '“织心谣”套路招式消耗心络时不再生成“寄线”，而是对生成位置直接造成“寄线”范围伤害。“寄线”造成的伤害提高100%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '天织',
        奇穴图片: 'https://icon.jx3box.com/icon/25037.png',
        id: '42116',
        奇穴描述:
          '“勾线”无需选择目标，会向正前方20尺矩形范围造成伤害，伤害提高30%，可在提线中施展。',
      },
      {
        奇穴名称: '曳绪',
        奇穴图片: 'https://icon.jx3box.com/icon/25034.png',
        id: '42117',
        奇穴描述:
          '“勾线”不再充能，调息时间降低至5秒，伤害降低35%，施展时不再消耗心络，施展后每0.5秒会消耗5点心络对20尺内单体目标造成伤害（当前目标优先），最多20秒。当心络不足5点时结束。',
      },
      {
        奇穴名称: '散板',
        奇穴图片: 'https://icon.jx3box.com/icon/25072.png',
        id: '42144',
        奇穴描述: '“落笼簿”施展后降低“勾线”“连环慢”7秒调息时间。',
      },
      {
        奇穴名称: '钤束',
        奇穴图片: 'https://icon.jx3box.com/icon/25038.png',
        id: '42119',
        奇穴描述: '“绊线”命中后使自身基础攻击力提高15%，无双提高30%，持续18秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '绎心',
        奇穴图片: 'https://icon.jx3box.com/icon/25039.png',
        id: '42120',
        奇穴描述:
          '“提线”控制期间，目标受到治疗效果降低60%，受到伤害提高10%。每秒会使目标受到<SUB 42260 1>阴性内功伤害，并恢复自身10%最大气血值。',
      },
      {
        奇穴名称: '七撩',
        奇穴图片: 'https://icon.jx3box.com/icon/25048.png',
        id: '42127',
        奇穴描述:
          '“落笼簿”期间“千里急”可直接激活第三段，“连环慢”“千里急”命中目标时会使其获得“七撩”效果：受到“千里急”伤害提高60%，持续5秒。<TALENT_CORE 42114 1>',
      },
      {
        奇穴名称: '缭乱',
        奇穴图片: 'https://icon.jx3box.com/icon/25035.png',
        id: '42149',
        奇穴描述:
          '“落笼簿”期间自身“傀儡调”套路招式伤害提高20%，持续5秒；结束“落笼簿”后自身“织心谣”套路招式伤害提高10%，持续5秒。<TALENT_CORE 42113 1>',
      },
      {
        奇穴名称: '寄意',
        奇穴图片: 'https://icon.jx3box.com/icon/25042.png',
        id: '42122',
        奇穴描述: '“千里急”“生地狱”会心提高15%，会心效果提高15%。施展后降低“勾线”1秒调息时间。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '任风波',
        奇穴图片: 'https://icon.jx3box.com/icon/25056.png',
        id: '42132',
        奇穴描述:
          '“游丝枕月”免控时间增加3秒。二段招式可施展时间延长至20秒，改为向后飘荡一段距离落地，伶影将立即出现在自身原位置并施展一次无需运功的“四边静”。',
      },
      {
        奇穴名称: '迟桎',
        奇穴图片: 'https://icon.jx3box.com/icon/25059.png',
        id: '42112',
        奇穴描述:
          '“寄线”激活后，被自身“提线”目标触碰时才会触发并禁疗目标2秒。其他目标触碰时不会触发，但获得“迟桎”效果：吸收3%最大气血值的治疗，最多叠加5层，每秒最多获得1次。',
      },
      {
        奇穴名称: '摄魄',
        奇穴图片: 'https://icon.jx3box.com/icon/25045.png',
        id: '42124',
        奇穴描述: '受到“勾线”伤害的目标受到治疗效果降低50%，持续3秒。',
      },
      {
        奇穴名称: '黄粱',
        奇穴图片: 'https://icon.jx3box.com/icon/25046.png',
        id: '42125',
        奇穴描述: '“挑丝”施展后可以使“障幕虚影”调息时间降低3秒。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '应天长',
        奇穴图片: 'https://icon.jx3box.com/icon/25058.png',
        id: '42415',
        奇穴描述:
          '未操控伶影时方可施展。\\n充能3层，恢复20心络，对目标造成<SUB 42417 1>阴性内功伤害。若目标在伶影6尺范围内则触发一段“千里急”并使该次“千里急”附带5秒的持续伤害。',
      },
      {
        奇穴名称: '金缕',
        奇穴图片: 'https://icon.jx3box.com/icon/25077.png',
        id: '42130',
        奇穴描述:
          '“寄线”会在目标位置附近生成丝线，被触碰引爆时，对触碰者额外造成<SUB 42381 1>阴性内功伤害。',
      },
      {
        奇穴名称: '锁南枝',
        奇穴图片: 'https://icon.jx3box.com/icon/24871.png',
        id: '41446',
        奇穴描述:
          '未操控伶影时方可施展。\\n消耗50点心络。编织一个15尺的“缠丝阵”，持续10秒。缠丝阵会持续吸收15尺范围内的所有自身丝线，并对范围内5个侠士目标造成<SUB 42335 1>阴性内功伤害“笼绊”，每吸收1根丝线，伤害提高100%。\\n在范围内的5个非静止侠士目标每0.5秒受到<SUB 42336 1>阴性内功伤害“止足”，对自身“提线”目标伤害增加150%。',
      },
      {
        奇穴名称: '镜同',
        奇穴图片: 'https://icon.jx3box.com/icon/25071.png',
        id: '42147',
        奇穴描述:
          '伶影施展“千里急”“生地狱”“四边静”时，会对受自身“障幕”效果影响的目标身后召唤一个巨大伶影分身释放相同的招式，但伤害只有原本的40%（同一个目标被镜同重复命中时，后续伤害衰减）。“虚影”不再持续产生伶影。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '三合',
        奇穴图片: 'https://icon.jx3box.com/icon/25041.png',
        id: '42126',
        奇穴描述: '“夹线”命中时，使目标3秒内无法施展内功招式。<TALENT_CORE 42123 1>',
      },
      {
        奇穴名称: '傀梦令',
        奇穴图片: 'https://icon.jx3box.com/icon/25075.png',
        id: '41452',
        奇穴描述:
          '将伶影拉回身旁与之共舞，持续对15尺范围最多5个目标造成<SUB 42033 1>阴性内功伤害，并在即将结束时造成<SUB 42247 1>阴性内功伤害。“傀梦令”期间，强制切回主人视角且无法施展伶影招式，自身免疫任何伤害。',
      },
      {
        奇穴名称: '绮结',
        奇穴图片: 'https://icon.jx3box.com/icon/25053.png',
        id: '42148',
        奇穴描述: '受到自身锁足、定身的目标，被控制期间受到伤害提高15%。',
      },
      {
        奇穴名称: '鼓关',
        奇穴图片: 'https://icon.jx3box.com/icon/25064.png',
        id: '42137',
        奇穴描述:
          '“千里急”增加第四段，可对自身20尺范围内目标施展，伶影短暂消失并冲向目标，对其造成<SUB 42384 1>阴性内功伤害。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '双音',
        奇穴图片: 'https://icon.jx3box.com/icon/25063.png',
        id: '42136',
        奇穴描述: '“连环慢”二段招式额外充能1层，施展后恢复5%最大气血值。',
      },
      {
        奇穴名称: '驻云飞',
        奇穴图片: 'https://icon.jx3box.com/icon/25043.png',
        id: '42268',
        奇穴描述:
          '未操控伶影时方可施展。\\n命中正在运功的目标时打断其运功，使其被“夹线”控制。若成功控制则激活“提线”，若未成功控制目标则重置自身“夹线”调息时间。',
      },
      {
        奇穴名称: '慢煞',
        奇穴图片: 'https://icon.jx3box.com/icon/25051.png',
        id: '42129',
        奇穴描述:
          '“落笼簿”期间，本体每次受到攻击时都会恢复5%已损生命值。“落笼簿”结束时，获得10%最大气血值的护盾。',
      },
      {
        奇穴名称: '偃卫',
        奇穴图片: 'https://icon.jx3box.com/icon/25065.png',
        id: '42139',
        奇穴描述:
          '“替形幻生”调息时间增加30秒，可对队友施展。触发替形幻生时，若伶影被攻击，则使攻击者的攻击力降低100%，持续6秒。',
      },
      {
        奇穴名称: '协幽',
        奇穴图片: 'https://icon.jx3box.com/icon/25067.png',
        id: '42135',
        奇穴描述: '“绊线”增加3秒调息时间，命中敌对侠士时额外造成一次伤害。',
      },
      {
        奇穴名称: '移宫',
        奇穴图片: 'https://icon.jx3box.com/icon/25068.png',
        id: '42141',
        奇穴描述: '“生地狱”会将伶影15尺范围内最多5个带有自身“缠绞”效果的目标拉至伶影位置。',
      },
      {
        奇穴名称: '犯调',
        奇穴图片: 'https://icon.jx3box.com/icon/25069.png',
        id: '42142',
        奇穴描述: '“四边静”造成的锁足效果将强化为定身。',
      },
      {
        奇穴名称: '寡合',
        奇穴图片: 'https://icon.jx3box.com/icon/25070.png',
        id: '42143',
        奇穴描述: '未操控伶影时，自身及伶影造成的伤害无视目标60%内功防御。',
      },
      {
        奇穴名称: '歇拍',
        奇穴图片: 'https://icon.jx3box.com/icon/25036.png',
        id: '42118',
        奇穴描述: '“落笼簿”期间，自身免疫封内、打断、缴械、沉默；结束控制后，该效果在2秒后消失。',
      },
      {
        奇穴名称: '迭影',
        奇穴图片: 'https://icon.jx3box.com/icon/25074.png',
        id: '42145',
        奇穴描述:
          '“生地狱”可在非操控状态施展。施展后使自身5秒内“绊线”恢复10点心络，伤害提高50%且返还0.5秒基础调息时间。',
      },
      {
        奇穴名称: '谐调',
        奇穴图片: 'https://icon.jx3box.com/icon/25073.png',
        id: '42146',
        奇穴描述: '“勾线”完整运功时，根据施展时消耗的心络，对非侠士目标造成一次额外伤害。',
      },
      {
        奇穴名称: '相思引',
        奇穴图片: 'https://icon.jx3box.com/icon/25049.png',
        id: '42332',
        奇穴描述:
          '未操控伶影时，用丝线将敌对侠士向伶影方向拉扯一段距离。\\n操控伶影时，用丝线将自身拉到伶影位置并返还15秒调息时间。',
      },
    ],
  },
]

export default 奇穴数据
