import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 韦陀献杵 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '韦陀献杵')

  constructor(模拟循环) {
    super(模拟循环)
    韦陀献杵.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '韦陀献杵')
    this.初始化技能运行数据()
  }

  命中() {
    const 当前禅那 = this.模拟循环.角色状态信息.禅那
    const 伤害技能 = ['韦陀献杵·一', '韦陀献杵·二', '韦陀献杵·三'][当前禅那 - 1]
    const 是否众嗔 =
      !!this.模拟循环.校验奇穴是否存在('众嗔') &&
      !!this.模拟循环.技能类实例集合?.横扫六合DOT?.横扫六合DOT存在判定()
    this.触发伤害行为(伤害技能, 1, 是否众嗔 ? ['众嗔'] : [])
    this.触发伤害行为('韦陀献杵·武伤', 1)
    if (this.模拟循环.当前自身buff列表?.布泽?.当前层数) {
      this.触发伤害行为('布泽', 1)
      this.模拟循环.卸除buff?.({ 名称: '布泽', 对象: '自身', 卸除层数: 1 })
    }
    if (当前禅那 === 3) {
      this.触发伤害行为('破', 1, [], undefined, 1)
      this.模拟循环.添加buff({ 名称: '贪破', 对象: '自身', 新增层数: 1 })
      if (this.模拟循环.校验奇穴是否存在('降魔渡厄')) {
        this.触发伤害行为('降魔·韦陀献杵', 1)
      }
      if (this.模拟循环.校验奇穴是否存在('布泽')) {
        this.模拟循环.添加buff?.({ 名称: '布泽', 对象: '自身', 新增层数: 1 })
      }
    }
    if (this.模拟循环.校验奇穴是否存在('明法')) {
      this.模拟循环.添加buff?.({ 名称: '普渡', 对象: '自身', 新增层数: 1 })
    }
    this.结算果报('韦陀献杵')
    if (this.模拟循环.秘籍?.['韦陀献杵']?.includes('命中回豆')) {
      this.消耗禅那后获得1点()
    }
    if (this.模拟循环.当前自身buff列表?.橙武?.当前层数) {
      this.回复禅那('橙武', 3)
    }
    this.保存释放记录('韦陀献杵')
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['布泽', '普渡', '擒龙', '罗汉金身', '身意']),
    }
  }
}

export default 韦陀献杵

export const 韦陀献杵类型 = typeof 韦陀献杵
