import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 引窍 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '引窍')
  static 释放时涣风层数 = 0

  constructor(模拟循环) {
    super(模拟循环)

    引窍.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '引窍')
  }

  命中() {
    // 记录释放时涣风层数
    引窍.释放时涣风层数 = this.模拟循环.当前目标buff列表?.['涣风']?.当前层数 || 0
    let 任脉增伤倍率 = 1
    let 督脉增伤倍率 = 1
    const 当前任脉值 = this.模拟循环.角色状态信息.能量信息.任脉
    const 当前督脉值 = this.模拟循环.角色状态信息.能量信息.督脉
    const 存在CWBuff = this.模拟循环.当前自身buff列表?.['橙武']?.当前层数

    if (this.模拟循环.校验奇穴是否存在('清然')) {
      if (当前督脉值 - 当前任脉值 >= 20) {
        督脉增伤倍率 = 督脉增伤倍率 + 1
      }
    }

    if (存在CWBuff) {
      任脉增伤倍率 = 任脉增伤倍率 + 0.6
      督脉增伤倍率 = 督脉增伤倍率 + 0.6
    }

    const 实际可消耗任脉 = this.模拟循环.判断消耗能量值('任脉')
    const 实际可消耗督脉 = this.模拟循环.判断消耗能量值('督脉')
    const 消耗总额 = this.模拟循环.判断消耗总额()

    // 风徊絮转 -PVP

    const 最终任脉倍率 = Math.floor(实际可消耗任脉 * 任脉增伤倍率)
    const 最终督脉倍率 = Math.floor(实际可消耗督脉 * 督脉增伤倍率)

    // 本体上海
    this.触发伤害行为('引窍', 1, [], undefined, 最终任脉倍率 + 1)

    // 破招伤害
    const 破招倍率 = Math.floor(消耗总额 / 2)
    this.触发伤害行为('破', 1, [], undefined, 破招倍率 + 1)

    // 引爆绝脉
    const 当前绝脉层数 = this.模拟循环.当前目标buff列表?.['绝脉']?.当前层数
    this.触发伤害行为('绝脉', 1, [`绝脉督脉·${最终督脉倍率}`], undefined, 当前绝脉层数)
    this.模拟循环.卸除buff?.({ 名称: '绝脉', 对象: '目标', 卸除层数: 最终督脉倍率 })

    // 引爆蛰微
    this.模拟循环.技能类实例集合?.蛰微?.引窍引爆?.(最终督脉倍率)

    // 神封
    const 神封校验结果 = this.模拟循环.神封校验()
    this.模拟循环.消耗当前一半能量()
    if (神封校验结果) {
      this.模拟循环.神封触发()
    }

    // CW回能
    if (存在CWBuff) {
      this?.模拟循环?.回复能量(30, '任脉')
      this?.模拟循环?.回复能量(30, '督脉')
    }

    if (this.模拟循环.当前自身buff列表?.['一阳来复']?.当前层数) {
      this?.模拟循环?.回复能量(15, '任脉')
      this?.模拟循环?.回复能量(15, '督脉')
      this?.模拟循环?.卸除buff({ 名称: '一阳来复', 对象: '自身', 卸除层数: 1 })
    }

    this.模拟循环.技能类实例集合?.经脉循行.经脉循行卸除校验()
    const 释放后有无经脉循行 = this.模拟循环.技能类实例集合?.经脉循行.经脉循行状态校验() ? 1 : 2

    this.模拟循环.卸除buff({ 名称: '涣风', 对象: '目标', 卸除层数: 3 })
    this.保存释放记录(释放后有无经脉循行)
    this.模拟循环.添加buff?.({ 名称: '含章挺秀阵', 对象: '自身', 新增层数: 1 })
  }

  保存释放记录(段数) {
    this.本次释放记录 = {
      伤害段数: 段数,
      重要buff列表: this.获取当前重要buff列表(['出岫']),
    }

    if (引窍.释放时涣风层数) {
      this.本次释放记录.特殊标记 = 引窍.释放时涣风层数
    }
  }
}

export default 引窍

export const 引窍类型 = typeof 引窍
