import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 引窍 extends 技能统一类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '引窍')
  释放时涣风层数 = 0

  constructor(模拟循环) {
    super(模拟循环)

    引窍.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '引窍')
  }

  命中() {
    // 记录释放时涣风层数
    this.释放时涣风层数 = this.模拟循环.当前目标buff列表?.['涣风']?.当前层数 || 0
    let 督脉增伤倍率 = 1
    const 当前任脉值 = this.模拟循环.角色状态信息.能量信息.任脉
    const 当前督脉值 = this.模拟循环.角色状态信息.能量信息.督脉

    if (this.模拟循环.校验奇穴是否存在('清然')) {
      督脉增伤倍率 = 督脉增伤倍率 + 1
    }

    const 实际可消耗任脉 = this.模拟循环.判断消耗能量值('任脉')
    const 督脉伤害取值 = this.模拟循环.判断消耗能量值('督脉')
    const 实际可消耗督脉 =
      this.模拟循环.校验奇穴是否存在('清然') && 当前督脉值 - 当前任脉值 < 20 ? 0 : 督脉伤害取值
    const 消耗总额 = 实际可消耗任脉 + 实际可消耗督脉
    const 来复返还 = !!this.模拟循环.当前自身buff列表.一阳来复?.当前层数
    if (来复返还) this.模拟循环.卸除buff({ 名称: '一阳来复', 对象: '自身' })
    this.模拟循环.角色状态信息.能量信息.任脉 -= 实际可消耗任脉
    this.模拟循环.角色状态信息.能量信息.督脉 -= 实际可消耗督脉
    const 涣风增益 = this.释放时涣风层数 ? [`涣风·${this.释放时涣风层数}`] : []
    this.模拟循环.卸除buff({ 名称: '涣风', 对象: '目标', 卸除层数: 3 })

    // 风徊絮转 -PVP

    const 最终任脉倍率 = 实际可消耗任脉
    const 最终督脉倍率 = Math.floor(督脉伤害取值 * 督脉增伤倍率)

    this.触发伤害行为('引窍', 1, 涣风增益, undefined, 最终任脉倍率 + 1)

    // 破招伤害
    const 破招倍率 = Math.floor(消耗总额 / 2)
    this.触发伤害行为('破', 1, 涣风增益, undefined, 破招倍率 + 1)

    // 引爆绝脉
    const 当前绝脉层数 = this.模拟循环.当前目标buff列表?.['绝脉']?.当前层数
    if (当前绝脉层数) {
      this.触发伤害行为(
        '绝脉',
        1,
        [...涣风增益, `绝脉督脉·${最终督脉倍率}`],
        undefined,
        当前绝脉层数,
      )
      this.模拟循环.卸除buff({ 名称: '绝脉', 对象: '目标', 卸除层数: 当前绝脉层数 })
    }

    // 引爆蛰微
    if (实际可消耗督脉 > 0) {
      this.模拟循环.技能类实例集合.蛰微.引窍引爆(最终督脉倍率, 涣风增益)
    }

    // 神封
    const 神封校验结果 =
      this.模拟循环.校验奇穴是否存在('神封') && (实际可消耗任脉 === 40 || 实际可消耗督脉 === 40)
    if (神封校验结果) {
      this.模拟循环.神封触发()
    }

    this.橙武回能()

    if (来复返还) {
      this.模拟循环.回复能量(实际可消耗任脉, '任脉')
      this.模拟循环.回复能量(实际可消耗督脉, '督脉')
    }

    this.模拟循环.技能类实例集合?.经脉循行.经脉循行卸除校验()
    const 释放后有无经脉循行 = this.模拟循环.技能类实例集合?.经脉循行.经脉循行状态校验() ? 1 : 2

    this.保存释放记录(释放后有无经脉循行)
    this.模拟循环.添加buff?.({ 名称: '含章挺秀阵', 对象: '自身', 新增层数: 1 })
  }

  保存释放记录(段数) {
    this.本次释放记录 = {
      伤害段数: 段数,
      重要buff列表: this.获取当前重要buff列表(['出岫']),
    }

    if (this.释放时涣风层数) {
      this.本次释放记录.特殊标记 = this.释放时涣风层数
    }
  }
}

export default 引窍

export const 引窍类型 = typeof 引窍
