import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 引窍 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '引窍')
  static 释放重置 = false

  constructor(模拟循环) {
    super(模拟循环)

    //
    引窍.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '引窍')

    this.初始化技能运行数据()
  }

  重置调息时间() {
    this.更新技能运行数据({ 待充能时间点: [] })
  }

  释放后() {
    if (引窍.释放重置) {
      this.更新技能运行数据({ 待充能时间点: [] })
    }
    引窍.释放重置 = false
  }

  一阳来复叠层重置() {
    if (this.模拟循环.校验奇穴是否存在('一阳来复')) {
      const 当前一阳来复层数 = this.模拟循环.当前自身buff列表?.['一阳来复']?.当前层数 || 0
      if (当前一阳来复层数 >= 5) {
        this.模拟循环.卸除buff?.({ 名称: '一阳来复', 对象: '自身', 卸除层数: 6 })
        // this.模拟循环.添加buff?.({ 名称: '来复', 对象: '自身' })
      } else {
        this.模拟循环.添加buff?.({ 名称: '一阳来复', 对象: '自身' })
      }
    }
  }

  命中() {
    引窍.释放重置 = false
    this.一阳指胧雾观花云散校验()

    if (this.模拟循环.校验奇穴是否存在('悬枢')) {
      this.模拟循环.添加buff?.({ 名称: '绝脉', 对象: '目标' })
      this.模拟循环.添加buff?.({ 名称: '绝脉', 对象: '目标' })
    }

    // 这一行要放在触发悬枢的前面，能否引爆看释放前绝脉数量
    const 当前绝脉层数 = this.模拟循环.当前目标buff列表?.['绝脉']?.当前层数 || 0

    const 存在CWBuff = this.模拟循环.当前自身buff列表?.['橙武']?.当前层数
    const 当前任脉值 = this.模拟循环.角色状态信息.能量信息.任脉
    const 当前督脉值 = this.模拟循环.角色状态信息.能量信息.督脉
    const 伤害等级 = Math.ceil(Math.max(Math.min(当前任脉值 * 0.5, 50), 1)) + 1
    const 消耗能量 = Math.floor((当前任脉值 + 当前督脉值) * 0.5)
    // 玉枕奇穴消耗能量增益，通过add 30487 buff 实现。在最后才del，所以在del前引窍触发的相关上海都能吃到加成
    if (当前任脉值 > 0) {
      this.触发伤害行为(
        '引窍',
        1,
        [`玉枕·${消耗能量}`, ...(存在CWBuff ? ['橙武引窍'] : [])],
        undefined,
        伤害等级,
      )
      this.触发伤害行为('破', 1, [`玉枕·${消耗能量}`], undefined, 伤害等级)
    } else {
      this.触发伤害行为(
        '引窍',
        1,
        [`玉枕·${消耗能量}`, ...(存在CWBuff ? ['橙武引窍'] : [])],
        undefined,
        1,
      )
      this.触发伤害行为('破', 1, [`玉枕·${消耗能量}`], undefined, 1)
    }

    this.一阳来复叠层重置()

    this.模拟循环.技能类实例集合?.一阳来复?.减少调息时间?.(每秒郭氏帧 * 5)

    this.模拟循环.添加战斗日志({
      日志: `引窍伤害等级${伤害等级}`,
      日志类型: '技能释放结果',
    })

    if (
      (this.模拟循环.技能类实例集合?.经脉循行.经脉循行状态校验() &&
        this.模拟循环.校验奇穴是否存在('丘墟')) ||
      存在CWBuff
    ) {
      引窍.释放重置 = true
    }

    const 引爆绝脉次数 = Math.floor(Math.min(当前绝脉层数, 当前督脉值 * 0.1 + 2))

    if (引爆绝脉次数) {
      // 引窍Lua中，先引爆后触发30487，所以这里的绝脉也可以吃到
      this.触发伤害行为('绝脉', 1, [`玉枕·${消耗能量}`], undefined, 引爆绝脉次数)
      this.模拟循环.添加战斗日志({
        日志: `引窍引爆绝脉等级${引爆绝脉次数}`,
        日志类型: '技能释放结果',
      })

      this.模拟循环.卸除buff?.({ 名称: '绝脉', 对象: '目标', 卸除层数: 引爆绝脉次数 })
    }

    const 神封校验结果 = this.模拟循环.神封校验()

    this.模拟循环.消耗当前一半能量()

    if (神封校验结果) {
      this.模拟循环.神封触发()
    }

    this.模拟循环.技能类实例集合?.经脉循行.经脉循行卸除校验()

    if (存在CWBuff) {
      this?.模拟循环?.回复能量(30, '任脉')
      this?.模拟循环?.回复能量(30, '督脉')
    }

    this.模拟循环.判断扬尘()

    const 释放后有无经脉循行 = this.模拟循环.技能类实例集合?.经脉循行.经脉循行状态校验() ? 1 : 2

    this.保存释放记录(释放后有无经脉循行)

    this.模拟循环.添加buff?.({ 名称: '含章挺秀阵', 对象: '自身', 新增层数: 1 })
  }

  保存释放记录(段数) {
    this.本次释放记录 = {
      伤害段数: 段数,
      重要buff列表: this.获取当前重要buff列表(['出岫']),
    }
  }
}

export default 引窍

export const 引窍类型 = typeof 引窍
