import type { 技能基础数据模型 } from '@/@types/技能'
import { 获取破招实际系数 } from '../../统一数据/系数计算'
// import { 属性类型 } from '@/@types/属性'

import 通用增益 from './技能增益/通用增益/通用增益'
import 停云势增益 from './技能增益/停云势增益'
import 行云势增益 from './技能增益/行云势增益'
import 留客雨增益 from './技能增益/留客雨增益'
import 决云势增益 from './技能增益/决云势增益'
import 断云势增益 from './技能增益/断云势增益'
import 横云断浪增益 from './技能增益/横云断浪增益'
import 沧浪三叠增益 from './技能增益/沧浪三叠增益'
import 孤锋破浪增益 from './技能增益/孤锋破浪增益'
import 避实击虚增益 from './技能增益/避实击虚增益'
import 触石雨增益 from './技能增益/触石雨增益'

import 流血通用增益 from './技能增益/流血增益'
import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'

const 流血基础伤害 = 114
const 流血DOT跳数 = 3
const 流血DOT间隔 = 32
const 流血基础系数 = 110.00000000000001 * 1.5
const 斩浪破锋基础系数 = 500

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '33146',
    技能名称: '破',
    统计名称: '破',
    // 技能伤害系数: 获取破招实际系数(1048576 * (0.48 * 1.3 * 1.1 * 0.8 - 1)),
    技能伤害系数: 获取破招实际系数(-430251),
    技能增益列表: 通用增益,
  },
  {
    技能ID: '40828',
    技能名称: '破·击破',
    统计名称: '破',
    是否为破招伤害: true,
    技能伤害系数: 获取破招实际系数(-911170),
    技能增益列表: 通用增益,
  },
  {
    技能ID: '33239',
    技能名称: '行云势·神兵',
    技能伤害系数: 60,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32149',
    技能名称: '行云势·一',
    秘籍依赖技能: '行云势',
    技能伤害系数: 135 * 1.5 * 1.2 * 1.25 * 1.1 * 1.12 * 1.15,
    基础伤害_基础值: 180,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 行云势增益,
  },
  {
    技能ID: '32150',
    技能名称: '行云势·二',
    秘籍依赖技能: '行云势',
    技能伤害系数: 159 * 1.5 * 1.2 * 1.25 * 1.1 * 1.12 * 1.15,
    基础伤害_基础值: 216,
    基础伤害_浮动值: 18,
    武器伤害系数: 1.5,
    技能增益列表: 行云势增益,
  },
  {
    技能ID: '32151',
    技能名称: '行云势·三',
    秘籍依赖技能: '行云势',
    // 技能伤害系数: 190 * 1.5 * 1.5 * 1.2 * 1.25 * 1.1 * 0.9,
    技能伤害系数: 634.8375000000001 * 1.12 * 1.15,
    基础伤害_基础值: 270,
    基础伤害_浮动值: 22,
    武器伤害系数: 2,
    技能增益列表: 行云势增益,
  },
  {
    技能ID: '32153',
    技能名称: '停云势',
    技能伤害系数: 240 * 1.5 * 0.9 * 1.2,
    基础伤害_基础值: 405,
    基础伤害_浮动值: 15,
    武器伤害系数: 2,
    技能增益列表: 停云势增益,
  },
  {
    技能ID: '32246',
    技能名称: '留客雨',
    技能伤害系数: 200,
    基础伤害_基础值: 160,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 留客雨增益,
  },
  {
    技能ID: '32510',
    技能名称: '避实击虚',
    统计名称: '避实击虚',
    技能伤害系数: 102.96000000000002,
    基础伤害_基础值: 35,
    基础伤害_浮动值: 5,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
    技能等级数据: {
      '1,7': {
        基础伤害_基础值: [35, 42, 45, 50, 55, 60],
        技能伤害系数: (i) => {
          switch (i) {
            case 6:
              return 261.85499999999996
            case 5:
              return 209.48399999999998
            case 4:
              return 164.73600000000005
            case 3:
              return 138.99600000000004
            case 2:
              return 115.83000000000001
            default:
              return 102.96000000000002
          }
        },
      },
    },
  },
  {
    技能ID: '32154',
    技能名称: '决云势',
    技能伤害系数: 225.6,
    基础伤害_基础值: 196,
    基础伤害_浮动值: 6,
    武器伤害系数: 1,
    技能增益列表: 决云势增益,
  },
  {
    技能ID: '32357',
    技能名称: '驰风八步·一',
    秘籍依赖技能: '驰风八步',
    技能伤害系数: 45,
    基础伤害_基础值: 10,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32167',
    技能名称: '断云势',
    统计名称: '断云势',
    秘籍依赖技能: '断云势',
    技能伤害系数: 471,
    基础伤害_基础值: 172,
    基础伤害_浮动值: 22,
    武器伤害系数: 2,
    技能增益列表: 断云势增益,
  },
  {
    技能ID: '32348',
    技能名称: '断云势·额外伤害',
    统计名称: '断云势',
    秘籍依赖技能: '断云势',
    技能伤害系数: 164,
    基础伤害_基础值: 69,
    基础伤害_浮动值: 9,
    武器伤害系数: 2,
    技能增益列表: 断云势增益,
  },
  {
    技能ID: '32602',
    技能名称: '沧浪三叠·一',
    统计名称: '沧浪三叠·一',
    秘籍依赖技能: '沧浪三叠',
    技能伤害系数: 276.0 * 1.15,
    基础伤害_基础值: 204,
    基础伤害_浮动值: 16,
    武器伤害系数: 2,
    技能增益列表: 沧浪三叠增益,
  },
  {
    技能ID: '32359',
    技能名称: '沧浪三叠·滔天·一',
    统计名称: '沧浪三叠·一',
    秘籍依赖技能: '沧浪三叠',
    技能伤害系数: 251 * 1.15,
    基础伤害_基础值: 204,
    基础伤害_浮动值: 16,
    武器伤害系数: 2,
    技能增益列表: 沧浪三叠增益,
  },
  {
    技能ID: '32603',
    技能名称: '沧浪三叠·二',
    统计名称: '沧浪三叠·二',
    秘籍依赖技能: '沧浪三叠',
    技能伤害系数: 306.0 * 1.15,
    基础伤害_基础值: 267,
    基础伤害_浮动值: 21,
    武器伤害系数: 2.5,
    技能增益列表: 沧浪三叠增益,
  },
  {
    技能ID: '32360',
    技能名称: '沧浪三叠·滔天·二',
    统计名称: '沧浪三叠·二',
    秘籍依赖技能: '沧浪三叠',
    技能伤害系数: 278 * 1.15,
    基础伤害_基础值: 267,
    基础伤害_浮动值: 21,
    武器伤害系数: 2.5,
    技能增益列表: 沧浪三叠增益,
  },
  {
    技能ID: '32604',
    技能名称: '沧浪三叠·三',
    统计名称: '沧浪三叠·三',
    秘籍依赖技能: '沧浪三叠',
    技能伤害系数: 348 * 1.15,
    基础伤害_基础值: 293,
    基础伤害_浮动值: 23,
    武器伤害系数: 3,
    技能增益列表: 沧浪三叠增益,
  },
  {
    技能ID: '32361',
    技能名称: '沧浪三叠·滔天·三',
    统计名称: '沧浪三叠·三',
    秘籍依赖技能: '沧浪三叠',
    技能伤害系数: 317 * 1.15,
    基础伤害_基础值: 293,
    基础伤害_浮动值: 23,
    武器伤害系数: 3,
    技能增益列表: 沧浪三叠增益,
  },
  {
    技能ID: '32234',
    技能名称: '横云断浪',
    技能伤害系数: 432,
    基础伤害_基础值: 721,
    基础伤害_浮动值: 88,
    武器伤害系数: 3,
    技能增益列表: 横云断浪增益,
  },
  {
    技能ID: '32235',
    技能名称: '孤锋破浪',
    // 技能伤害系数: 650 * 0.9 * 0.85 * 0.9 * 1.1 * 1.15 * 1.2 * 1.1 * 1.1,
    技能伤害系数: 822.0049695000001 * 1.15,
    基础伤害_基础值: 1450,
    基础伤害_浮动值: 75,
    武器伤害系数: 3,
    技能增益列表: 孤锋破浪增益,
  },
  {
    技能ID: '34695',
    技能名称: '界破',
    技能伤害系数: 487.0250000000001,
    基础伤害_基础值: 160,
    基础伤害_浮动值: 317,
    技能增益列表: [
      ...通用增益,
      // {
      //   增益名称: '技能非侠',
      //   增益启用: true,
      //   增益所在位置: '技能',
      //   增益类型: '全局启用',
      //   增益集合: [{ 属性: 属性类型.非侠增伤, 值: 502 / 1024 }],
      // },
    ],
  },
  {
    技能ID: '32766',
    技能名称: '触石雨',
    技能伤害系数: 200,
    基础伤害_基础值: 180,
    基础伤害_浮动值: 15,
    技能增益列表: 触石雨增益,
  },
  {
    技能ID: '32591',
    技能名称: '截辕',
    统计名称: '截辕',
    技能伤害系数: 280.5,
    基础伤害_基础值: 77,
    基础伤害_浮动值: 25,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '33133',
    技能名称: '截辕（DOT）',
    技能伤害系数: 400 * 0.75 * 1.1,
    DOT生效间隔: 48,
    DOT跳数: 6,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32974',
    技能名称: '云刀',
    技能伤害系数: 24,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '流血·一',
    统计名称: '流血',
    秘籍依赖技能: '横云断浪',
    技能伤害系数: 流血基础系数,
    DOT生效间隔: 流血DOT间隔,
    DOT跳数: 流血DOT跳数,
    基础伤害_基础值: 流血基础伤害,
    技能增益列表: 流血通用增益,
  },
  {
    技能名称: '流血·二',
    统计名称: '流血',
    秘籍依赖技能: '横云断浪',
    技能伤害系数: 流血基础系数,
    DOT生效间隔: 流血DOT间隔,
    DOT跳数: 流血DOT跳数,
    基础伤害_基础值: 流血基础伤害,
    伤害计算次数: 2,
    技能增益列表: 流血通用增益,
  },
  {
    技能名称: '流血·三',
    统计名称: '流血',
    秘籍依赖技能: '横云断浪',
    技能伤害系数: 流血基础系数,
    DOT生效间隔: 流血DOT间隔,
    DOT跳数: 流血DOT跳数,
    基础伤害_基础值: 流血基础伤害,
    伤害计算次数: 3,
    技能增益列表: 流血通用增益,
  },
  {
    技能名称: '流血·四',
    统计名称: '流血',
    秘籍依赖技能: '横云断浪',
    技能伤害系数: 流血基础系数,
    DOT生效间隔: 流血DOT间隔,
    DOT跳数: 流血DOT跳数,
    基础伤害_基础值: 流血基础伤害,
    伤害计算次数: 4,
    技能增益列表: 流血通用增益,
  },
  {
    技能名称: '流血·五',
    统计名称: '流血',
    秘籍依赖技能: '横云断浪',
    技能伤害系数: 流血基础系数,
    DOT生效间隔: 流血DOT间隔,
    DOT跳数: 流血DOT跳数,
    基础伤害_基础值: 流血基础伤害,
    伤害计算次数: 5,
    技能增益列表: 流血通用增益,
  },
  {
    技能名称: '流血·六',
    统计名称: '流血',
    秘籍依赖技能: '横云断浪',
    技能伤害系数: 流血基础系数,
    DOT生效间隔: 流血DOT间隔,
    DOT跳数: 流血DOT跳数,
    基础伤害_基础值: 流血基础伤害,
    基础伤害_浮动值: 流血基础伤害,
    伤害计算次数: 6,
    技能增益列表: 流血通用增益,
  },
  {
    技能ID: '34724',
    技能名称: '鸣锋',
    统计名称: '鸣锋',
    技能伤害系数: 400 * (1 + 1 * 0.13) * 0.5,
    基础伤害_基础值: 76,
    基础伤害_浮动值: 5,
    武器伤害系数: 0,
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 400 * (1 + 1 * 0.13) * 0.5, 基础伤害_基础值: 76 },
      2: { 技能伤害系数: 400 * (1 + 2 * 0.13) * 0.5, 基础伤害_基础值: 85 },
      3: { 技能伤害系数: 400 * (1 + 3 * 0.13) * 0.5, 基础伤害_基础值: 94 },
      4: { 技能伤害系数: 400 * (1 + 4 * 0.13) * 0.5, 基础伤害_基础值: 107 },
    },
  },
  {
    技能ID: '44538',
    技能名称: '滔天',
    统计名称: '滔天',
    技能伤害系数: 640,
    基础伤害_基础值: 18,
    基础伤害_浮动值: 18,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },

  {
    技能ID: '36118',
    技能名称: '潋风·携刃',
    技能伤害系数: 288.75,
    基础伤害_基础值: 78,
    基础伤害_浮动值: 10,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '斩浪破锋·一',
    统计名称: '斩浪破锋（DOT）',
    技能伤害系数: 斩浪破锋基础系数,
    DOT生效间隔: 48,
    DOT跳数: 6,
    基础伤害_基础值: 25,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '斩浪破锋·二',
    统计名称: '斩浪破锋（DOT）',
    技能伤害系数: 斩浪破锋基础系数,
    DOT生效间隔: 48,
    DOT跳数: 6,
    基础伤害_基础值: 25,
    伤害计算次数: 2,
    技能增益列表: 通用增益,
  },
  {
    技能名称: '斩浪破锋·三',
    统计名称: '斩浪破锋（DOT）',
    技能伤害系数: 斩浪破锋基础系数,
    DOT生效间隔: 48,
    DOT跳数: 6,
    基础伤害_基础值: 25,
    伤害计算次数: 3,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '40358',
    技能名称: '弱点击破',
    技能伤害系数: 504,
    基础伤害_基础值: 35,
    基础伤害_浮动值: 5,
    武器伤害系数: 1,
    统计名称: '击破',
    技能增益列表: 通用增益,
  },
  {
    技能ID: '40645',
    技能名称: '承磊·破',
    秘籍依赖技能: '孤锋破浪',
    技能伤害系数: 260,
    基础伤害_基础值: 290,
    基础伤害_浮动值: 15,
    武器伤害系数: 3,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '44995',
    技能名称: '潋风',
    技能伤害系数: 400,
    基础伤害_基础值: 10,
    基础伤害_浮动值: 8,
    技能增益列表: 通用增益,
  },
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

const 技能增益 = {
  通用增益,
  停云势增益,
  行云势增益,
  留客雨增益,
  决云势增益,
  断云势增益,
  沧浪三叠增益,
  横云断浪增益,
  孤锋破浪增益,
  避实击虚增益,
  触石雨增益,
  流血通用增益,
}

export { 技能增益 }

export default 技能基础数据
