import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 决云势 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '决')

  constructor(模拟循环) {
    super(模拟循环)
    决云势.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '决')

    this.初始化技能运行数据()
  }

  // 技能释放后更新运行数据() {
  //   const 待充能时间点 = this?.技能运行数据?.待充能时间点 || []

  //   const 本次释放充能 =
  //     (待充能时间点?.[待充能时间点.length - 1] || this.模拟循环?.当前时间 || 0) +
  //     (决云势?.技能数据?.技能CD || 0)
  //   const 新待充能时间点 = [...待充能时间点, 本次释放充能]
  //   this?.更新技能运行数据({
  //     待充能时间点: 新待充能时间点,
  //   })

  //   const 获取破绽层数 = this.模拟循环.当前目标buff列表?.['破绽']?.当前层数 || 0
  //   const 破绽减少CD = Math.min(8, 获取破绽层数 * 4) * 每秒郭氏帧
  //   this.减少调息时间(破绽减少CD)
  // }

  橙武触发重置调息() {
    this.重置调息时间()
  }

  命中() {
    if (决云势?.技能数据?.回复锐意) {
      this.触发回复锐意(决云势?.技能数据?.回复锐意, '诀云势')
    }
  }

  造成伤害() {
    this.触发伤害行为('决云势')
    this.弱点击破判定()
    this.保存释放记录()
  }

  // 释放后() {
  //   this.回复锐意()
  // }

  保存释放记录() {
    const 造成buff数据: any = this.获取施加重要buff信息('灭影追风') || {}

    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['灭影追风', '流岚']),
      造成buff数据,
    }
  }
}

export default 决云势

export const 决云势类型 = typeof 决云势
