import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '五明乐见',
        奇穴图片: 'https://icon.jx3box.com/icon/13403.png',
        id: '25160',
        奇穴描述: '“光明相”调息时间降低5秒，生效次数提高至3次，施展后5秒内自身造成伤害提高10%。',
      },
      {
        奇穴名称: '生灭予夺',
        奇穴图片: 'https://icon.jx3box.com/icon/3799.png',
        id: '44447',
        奇穴描述:
          '为目标添加缴械效果时，若其处于受控状态，则不再为其添加缴械，而是直接使其获得24%最大气血值的治疗吸收盾，持续6秒。',
      },
      {
        奇穴名称: '无明缚夜',
        奇穴图片: 'https://icon.jx3box.com/icon/27108.png',
        id: '32661',
        奇穴描述:
          '每秒在自身当前位置留下一枚暗影，至多5枚。5秒后所有暗影会锁定当前选中目标位置，并在蓄力1.5秒后朝该方向冲刺15尺，对2尺宽路径上至多5个敌对侠士目标造成<SUB 44463 1>阴性内功伤害，对气血值低于30%的目标造成的伤害提高50%。',
      },
      {
        奇穴名称: '冥月渡心',
        奇穴图片: 'https://icon.jx3box.com/icon/9556.png',
        id: '18629',
        奇穴描述:
          '立即获得满月，并获得<BUFF 27034 1 time><BUFF_NOUN 27034 1 月曜>。<TALENT 44487 1 玄月影寒><TALENT 38526 1 极曜破妄>',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '幽隐尘迹',
        奇穴图片: 'https://icon.jx3box.com/icon/3824.png',
        id: '5985',
        奇穴描述: '对有自身“烈日”效果的目标施展“净世破魔击”无视其15%化劲等级。',
      },
      {
        奇穴名称: '燎原烈火',
        奇穴图片: 'https://icon.jx3box.com/icon/3835.png',
        id: '5967',
        奇穴描述: '消耗满日或满月后获得5%最大气血值的护盾，可叠加2层，持续8秒。',
      },
      {
        奇穴名称: '恶秽满路',
        奇穴图片: 'https://icon.jx3box.com/icon/4578.png',
        id: '5989',
        奇穴描述:
          '“驱夜断愁”在背后命中自身“月劫”效果的目标使其3秒内无法施展轻功，不处于<NounID 4>状态下时也可施展且拥有25秒独立调息时间。',
      },
      {
        奇穴名称: '极曜破妄',
        奇穴图片: 'https://icon.jx3box.com/icon/11830.png',
        id: '38526',
        奇穴描述:
          '<TALENT_CORE 18629 1>“冥月渡心”施展后获得1层“光明相”，“月曜”期间<BUFF 25731 1 desc>。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '诛邪镇魔',
        奇穴图片: 'https://icon.jx3box.com/icon/11829.png',
        id: '22888',
        奇穴描述:
          '2.5秒内分别消耗满日与满月施展招式命中目标，根据两次招式类型造成一次阴阳混合各至多<SUB 26916 1>内功伤害。',
      },
      {
        奇穴名称: '灵光破晓',
        奇穴图片: 'https://icon.jx3box.com/icon/24972.png',
        id: '41889',
        奇穴描述:
          '“光明相”效果下消耗满月施展“生死劫”命中侠士目标后使其6秒内受到自身伤害提高10%，期间自身消耗满日施展“净世破魔击”命中该目标额外附带6秒可叠加的8%最大气血值的治疗吸收盾。',
      },
      {
        奇穴名称: '玄月影寒',
        奇穴图片: 'https://icon.jx3box.com/icon/27113.png',
        id: '44487',
        奇穴描述:
          '<TALENT_CORE 18629 1><BUFF_NOUN 27034 1 月曜>可以通过施展“冥月渡心”的二段招式主动结束，效果结束后<BUFF 33144 1 desc>',
      },
      {
        奇穴名称: '无明业火',
        奇穴图片: 'https://icon.jx3box.com/icon/3836.png',
        id: '6717',
        奇穴描述: '在目标背后施展招式会心几率和会心效果提高12%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '净体不畏',
        奇穴图片: 'https://icon.jx3box.com/icon/14103.png',
        id: '25166',
        奇穴描述:
          '“烈日斩”“银月斩”命中自身异色斩不利效果的目标造成的伤害提高50%。“净世破魔击”命中自身同色斩不利效果的目标造成<SUB 26708 0>对应属性内功额外伤害，若目标非侠士则此伤害提高75%。',
      },
      {
        奇穴名称: '靡业报劫',
        奇穴图片: 'https://icon.jx3box.com/icon/19171.png',
        id: '34372',
        奇穴描述:
          '消耗满日或满月施展“生死劫”使目标每2秒受到对应属性内功伤害，持续20秒，每种属性的效果只可作用于一个目标。该伤害视为“生死劫”，享受其秘籍加成。',
      },
      {
        奇穴名称: '圣裁刑晷',
        奇穴图片: 'https://icon.jx3box.com/icon/24456.png',
        id: '21174',
        奇穴描述:
          '施展“怖畏暗刑”会标记当前目标6秒并布下圣裁庭，标记结束后对其降下圣裁，造成(<SUB 40209 11>-<SUB 40209 20>点)<NounID 13>阳性内功伤害，期间目标受到伤害越多则圣裁伤害越高。若降下圣裁时目标仍位于圣裁庭内，则最终伤害提高50%(<SUB 40209 1>-<SUB 40209 10>点)。目标被标记期间不再受自身缴械效果影响。',
      },
      {
        奇穴名称: '赤日赫炎',
        奇穴图片: 'https://icon.jx3box.com/icon/18288.png',
        id: '32622',
        奇穴描述:
          '消耗满日施展“生死劫”会标记侠士目标5秒，时间结束后使其受到等同于效果期间受到治疗量30%的伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '明赦尊谕',
        奇穴图片: 'https://icon.jx3box.com/icon/19168.png',
        id: '41988',
        奇穴描述:
          '“怖畏暗刑”替换为“明赦尊谕”：<SUB 34347 0>\\n以此方式替换的“明赦尊谕”视为“怖畏暗刑”，但不再充能、施展需基础调息时间、无需目标。',
      },
      {
        奇穴名称: '灼业焚心',
        奇穴图片: 'https://icon.jx3box.com/icon/24971.png',
        id: '34511',
        奇穴描述:
          '“贪魔体”期间每秒对周围8尺内10个目标造成<SUB 34510 1>阳性内功伤害并使其减速90%。每次命中侠士目标时使该伤害提高20%，至多生效10次，且对每个目标有15秒独立调息时间。',
      },
      {
        奇穴名称: '日月连璧',
        奇穴图片: 'https://icon.jx3box.com/icon/27109.png',
        id: '44446',
        奇穴描述:
          '施展获得日灵或月魂的伤害招式时，会在短暂延迟后对目标追加施展对应“赤日轮”或“幽月轮”。以此方式触发的追加施展无需基础调息时间，不再重复触发追加，对非受控目标造成原本10%的伤害。',
      },
      {
        奇穴名称: '寂灭劫灰',
        奇穴图片: 'https://icon.jx3box.com/icon/24453.png',
        id: '40190',
        奇穴描述:
          '“净世破魔击”命中侠士目标使其4秒内受到自身“净世破魔击·日”伤害提高25%，至多叠加3层，若已叠加至满层则额外使时间延长2秒。消耗满月施展“生死劫”会回收40尺内目标的上述效果并施加给当前目标，以此方式施加最大层数时本次“生死劫·月”造成的伤害提高60%，“月劫”效果提升至60%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '日月晦',
        奇穴图片: 'https://icon.jx3box.com/icon/16204.png',
        id: '28593',
        奇穴描述:
          '三段招式，各段施展后依次获得满日、满月、满日和满月。\\n每段施展时，获得1秒<BUFF_NOUN 4468 1 超然>并向目标点方向冲刺12尺，对4尺宽冲刺路径上的至多6个敌对目标造成<SUB 30321 1>对应属性内功伤害，并附带“烈日”和“银月斩”效果。\\n该招式可在冲刺过程中施展。完整施展后，会在“超然”效果结束后获得3秒<NounID 4>。',
      },
      {
        奇穴名称: '崇光斩恶',
        奇穴图片: 'https://icon.jx3box.com/icon/21960.png',
        id: '37337',
        奇穴描述: '“光明相”替换为“崇光斩恶”，<SUB 37335 1>',
      },
      {
        奇穴名称: '圣焰令',
        奇穴图片: 'https://icon.jx3box.com/icon/24978.png',
        id: '41762',
        奇穴描述:
          '获得4秒<BUFF_NOUN 4468 1 超然>并在20尺内目标点位置燃起<SUB_NOUN 43410 1 圣焰>，随后遁入<BUFF_NOUN 31448 1 微妙风>并在短暂延迟后于其中现身(可通过跳跃按键打断并留在原地)。“微妙风”期间处于圣焰或其余烬中可施展二段招式<SUB_NOUN 41764 1 涤罪>。',
      },
      {
        奇穴名称: '伏明众生',
        奇穴图片: 'https://icon.jx3box.com/icon/9537.png',
        id: '18626',
        奇穴描述:
          '100点日灵方可施展。获得6秒<BUFF_NOUN 4468 1 超然>，并使自身6秒内消耗满灵施展“净世破魔击”后获得满日，期间“净世破魔击·日”范围扩大至360度。效果结束后获得100点月魂。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '寒月耀',
        奇穴图片: 'https://icon.jx3box.com/icon/3787.png',
        id: '3961',
        奇穴描述:
          '打断目标运功，并对其造成<SKILL LunarDamage>点(+<SKILLEx {D0} {SkillLunarAP}>)阴性内功伤害和100%武器伤害。命中正在运功的侠士目标后使自身获得满月。',
      },
      {
        奇穴名称: '血泪成悦',
        奇穴图片: 'https://icon.jx3box.com/icon/3819.png',
        id: '5974',
        奇穴描述: '造成伤害的10%转化为自身气血。',
      },
      {
        奇穴名称: '净身明礼',
        奇穴图片: 'https://icon.jx3box.com/icon/3793.png',
        id: '18279',
        奇穴描述:
          '“烈日斩”“银月斩”伤害提高25%，施展时对目标周围6尺的5个目标造成<SUB 40931 1>阳性或<SUB 40932 1>阴性内功伤害，并附带“烈日”或“银月斩”效果。',
      },
      {
        奇穴名称: '秽身浴露',
        奇穴图片: 'https://icon.jx3box.com/icon/3832.png',
        id: '6718',
        奇穴描述:
          '“贪魔体”施展后卸除自身所有混元、阳性、阴性、毒性及持续伤害不利效果，期间每秒回复4%最大气血值，提前结束则获取剩余恢复值。',
      },
      {
        奇穴名称: '善恶如梦',
        奇穴图片: 'https://icon.jx3box.com/icon/3867.png',
        id: '6727',
        奇穴描述:
          '<TALENT_CORE 32661 1>消耗满日或满月施展“生死劫”，额外附带另一种“生死劫”的效果，该额外效果不受其他奇穴或秘籍效果影响。',
      },
      {
        奇穴名称: '光影',
        奇穴图片: 'https://icon.jx3box.com/icon/4173.png',
        id: '6893',
        奇穴描述: '施展“幻光步”解除自身封内、缴械效果，并使自身不受此类效果影响，持续3秒。',
      },
      {
        奇穴名称: '净恶瑕诛',
        奇穴图片: 'https://icon.jx3box.com/icon/20074.png',
        id: '36093',
        奇穴描述: '施展“流光囚影”后8秒内下三次<BUFF 27062 1 desc>。',
      },
      {
        奇穴名称: '彻世逐邪',
        奇穴图片: 'https://icon.jx3box.com/icon/24974.png',
        id: '41888',
        奇穴描述:
          '“无明魂锁”调息时间提高8秒，使目标失去行动力期间：不会受到伤害和增益效果，不可被敌方和友方选中。',
      },
      {
        奇穴名称: '劳心忡寿',
        奇穴图片: 'https://icon.jx3box.com/icon/7441.png',
        id: '14695',
        奇穴描述: '“超然”期间自身受到的范围类伤害降低20%，受治疗成效提高10%。',
      },
      {
        奇穴名称: '明光恒照',
        奇穴图片: 'https://icon.jx3box.com/icon/3825.png',
        id: '34383',
        奇穴描述: '消耗满日或满月后，下一次消耗异色满灵施展招式时对应属性内功攻击力提高18%。',
      },
      {
        奇穴名称: '天地诛戮',
        奇穴图片: 'https://icon.jx3box.com/icon/3830.png',
        id: '5979',
        奇穴描述:
          '“赤日轮”“幽月轮”第三段对非侠士目标施展后使自身<BUFF 4754 1 desc>，持续<BUFF 4754 1 time>。',
      },
      {
        奇穴名称: '用晦而明',
        奇穴图片: 'https://icon.jx3box.com/icon/3846.png',
        id: '17567',
        奇穴描述:
          '施展阴阳内功招式造成伤害时无视目标<BUFF 12575 1 desc>防御等级。“生死劫”变为2层充能招式，充能时间12秒，消耗满日或满月施展时使对应阳性或阴性的下3次无视防御效果强化至<BUFF 12575 2 desc>。',
      },
    ],
  },
]

export default 奇穴数据
