import { 循环数据 } from '@/@types/循环'

const 橙武手动: Partial<循环数据> = {
  名称: '紫武锁神一段',
  奇穴: [
    "逆脉·悟",
    "风扬·悟",
    "入静·悟",
    "一阳化生·悟"
  ],
  技能序列: [
    '一阳指', '引窍', '一阳化生', '引窍', '引窍', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳化生', '引窍', '引窍', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳化生', '引窍', '引窍', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳化生', '引窍', '引窍', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳化生', '引窍', '引窍', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳化生', '引窍', '引窍', '引窍', '换行', '断脉', '一阳指', '截阳', '锁神', '断脉', '一阳指', '引窍', '一阳指', '引窍', '一阳指', '引窍', '换行'
  ],
}

export default 橙武手动
