import { 装备属性信息模型, 装备选择范围类型, 装备类型枚举 } from '@/@types/装备'
import 获取当前数据 from '@/数据/数据工具/获取当前数据'
import { 获取装备数据描述 } from '../功能组件/装备选择/装备部位选择'

export const 获取过滤后装备列表 = (
  装备数据列表: 装备属性信息模型[],
  装备选择范围: 装备选择范围类型,
  部位: string,
): 装备属性信息模型[] => {
  if (
    装备选择范围?.品级范围?.length ||
    装备选择范围?.词条类型?.length ||
    装备选择范围?.过滤类型?.length
  ) {
    let 新列表 = [...装备数据列表]
    if (装备选择范围?.品级范围?.length) {
      新列表 = 新列表?.filter(
        (item) =>
          (item?.装备品级 >= (装备选择范围?.品级范围?.[0] || 0) &&
            item?.装备品级 <= (装备选择范围?.品级范围?.[1] || 0)) ||
          (部位 === '武器' && item?.装备类型 === '橙武'),
      )
    }
    if (装备选择范围?.词条类型?.length) {
      新列表 = 新列表?.filter((item) => {
        return 装备选择范围?.词条类型?.some((a) => 获取装备数据描述(item)?.includes(a))
      })
    }
    if (装备选择范围?.过滤类型?.length) {
      新列表 = 新列表?.filter((item) => {
        let 是否过滤 = false
        if (装备选择范围?.过滤类型?.includes('特效')) {
          是否过滤 = !!(item?.装备特效?.includes('试炼') || item?.装备特效?.includes('特效_'))
        }
        if (!是否过滤) {
          if (装备选择范围?.过滤类型?.includes('精简')) {
            是否过滤 = !!(
              item?.装备类型 === 装备类型枚举.副本精简 && !item?.装备特效?.includes('试炼')
            )
          }
        }
        if (!是否过滤) {
          if (装备选择范围?.过滤类型?.includes('无修')) {
            是否过滤 = item?.装备名称?.includes('无修')
          }
        }
        return !是否过滤
      })
    }
    return 新列表
  } else {
    return 装备数据列表
  }
}

export const 获取部位候选装备 = (
  部位名: string,
  装备选择范围: 装备选择范围类型,
): 装备属性信息模型[] => {
  const { 装备数据 } = 获取当前数据()
  const 部位装备列表 = 装备数据?.[部位名] || []
  return 获取过滤后装备列表(部位装备列表, 装备选择范围, 部位名)
}
