import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 并蒂夺株悟 extends 有CD技能通用类 {
  // 持续4s，每秒1跳，共4跳
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '并蒂夺株·悟')
  static 作用次数 = 4
  static 作用间隔 = 16
  static 首次间隔 = 0

  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
    并蒂夺株悟.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '并蒂夺株·悟')
  }

  命中() {
    this.对阵招式橙武减少绝技技能CD()
    this.减少苍棘缚地CD(48)
    this.保存释放记录('并蒂夺株·悟')
    this.并蒂夺株持续伤害()
  }

  并蒂夺株持续伤害() {
    const 待生效事件队列: 待生效事件[] = []
    const 作用次数 = 并蒂夺株悟.作用次数
    for (let i = 0; i < 作用次数; i++) {
      待生效事件队列.push({
        事件名称: '并蒂夺株',
        事件时间: this.模拟循环.当前时间 + 并蒂夺株悟.首次间隔 + 并蒂夺株悟.作用间隔 * (i + 1),
        事件备注: {
          技能名称: '并蒂夺株·悟',
        },
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  并蒂夺株结算() {
    this.改变温寒(1, '并蒂夺株·悟')
    this.触发伤害行为('并蒂夺株·悟')
    // 并蒂持续的4s内，每跳给苍棘上"下一次攻击增伤"BUFF
    this.模拟循环.添加buff?.({ 名称: '并蒂增伤', 对象: '自身' })
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表([]),
    }
  }
}

export default 并蒂夺株悟

export const 并蒂夺株悟类型 = typeof 并蒂夺株悟
