import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 振翅图南 extends 有CD技能通用类 {
  // lua入口 20259
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '振翅图南')
  static 个数索引 = -1
  static 最大索引 = 4
  static 击浪最大延迟跳数 = 20

  constructor(模拟循环) {
    super(模拟循环)
    振翅图南.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '振翅图南')
    振翅图南.个数索引 = -1
    this.初始化技能运行数据()
  }

  重置调息时间() {
    this.更新技能运行数据({ 待充能时间点: [] })
  }

  命中() {
    this.添加振翅图南事件()
    // 驰行
    if (this.模拟循环.校验奇穴是否存在('驰行')) {
      this.模拟循环.添加buff?.({ 名称: '驰行', 对象: '自身' })
    }
    this.保存释放记录()
  }

  存在振翅图南校验() {
    const 振翅图南名称列表 = Array.from({ length: 振翅图南.最大索引 }, (_, i) => `振翅图南_${i}`)
    const 当前存在振翅图南 = Object.keys(this.模拟循环?.当前目标buff列表 || {}).some((item) =>
      振翅图南名称列表.includes(item),
    )
    return 当前存在振翅图南
  }

  延长最新振翅图南(延长跳数) {
    const 延长索引 = 振翅图南.个数索引
    if (延长索引 === -1) {
      return
    }
    const 本次振翅图南名称 = `振翅图南_${延长索引}`
    const 当前索引序列 = this.模拟循环.待生效事件队列?.filter((item) =>
      item.事件名称?.includes(本次振翅图南名称),
    )
    const 当前剩余跳数 = 当前索引序列?.length || 0
    if (!当前剩余跳数) {
      return
    }
    const 当前最后一跳数据 = 当前索引序列?.[当前索引序列?.length - 1] || {}
    const 当前最后一跳时间 = 当前最后一跳数据?.事件时间 || 0
    const 当前最后一跳备注 = 当前最后一跳数据?.事件备注 || {}
    const 延长后跳数 = Math.min(当前剩余跳数 + 延长跳数, 振翅图南.击浪最大延迟跳数)
    const 实际可延长次数 = 延长后跳数 - 当前剩余跳数 // 最多延长至10秒 0.5秒一跳 20跳
    if (!实际可延长次数) {
      return
    }
    this.添加待生效事件(本次振翅图南名称, 当前最后一跳时间, 实际可延长次数, 当前最后一跳备注)
    // 处理UIBuff
    const 当前索引Buff = this?.模拟循环?.当前目标buff列表?.[本次振翅图南名称]
    if (当前索引Buff) {
      const 振翅图南数据: any = this.模拟循环.Buff和Dot数据?.[本次振翅图南名称]
      const 振翅图南间隔 = 振翅图南数据?.伤害频率 || 8

      this.模拟循环.当前目标buff列表[本次振翅图南名称] = {
        ...当前索引Buff,
        刷新时间: (当前索引Buff.刷新时间 || 0) + 振翅图南间隔 * 实际可延长次数,
      }
    }
  }

  添加振翅图南事件() {
    const 本次索引 = (振翅图南.个数索引 + 1) % 振翅图南.最大索引
    振翅图南.个数索引 = 本次索引
    const 本次振翅图南名称 = `振翅图南_${本次索引}`
    this.模拟循环.添加buff?.({ 名称: 本次振翅图南名称, 对象: '目标' })
    this.添加待生效事件(本次振翅图南名称)
  }

  添加待生效事件(添加名称, 初始时间 = this.模拟循环.当前时间, 添加次数?, 事件备注?) {
    const 振翅图南数据: any = this.模拟循环.Buff和Dot数据?.[添加名称]
    const 振翅图南次数 = 添加次数 || 振翅图南数据?.最大作用次数 || 12
    const 振翅图南间隔 = 振翅图南数据?.伤害频率 || 8
    const 待生效事件: 待生效事件[] = []
    for (let i = 1; i <= 振翅图南次数; i++) {
      const 事件时间 = 初始时间 + 振翅图南间隔 * i
      待生效事件.push({
        事件名称: `${添加名称}·${i}`,
        事件时间: 事件时间,
        事件备注: { ...事件备注 },
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  振翅图南触发() {
    this.振翅图南造成伤害()
    this.振翅图南消失检测()
  }

  振翅图南消失检测() {
    const 存在 = this.存在振翅图南校验()
    if (!存在 && this.模拟循环?.当前自身buff列表?.['风驰']?.当前层数) {
      this.模拟循环.卸除buff?.({ 名称: '风驰', 对象: '自身', 卸除层数: 3 })
      this.模拟循环.添加战斗日志?.({
        日志: '振翅图南消失卸除风驰',
        日志类型: '自身buff变动',
      })
    }
  }

  振翅图南造成伤害() {
    const 当前风驰层数 = this.模拟循环?.当前自身buff列表?.['风驰']?.当前层数 || 0

    const 伤害Buff = 当前风驰层数 ? [`风驰·${当前风驰层数}`] : []
    this.触发伤害行为('振翅图南', 1, 伤害Buff)
  }

  保存释放记录() {
    if (this.模拟循环.校验奇穴是否存在('驰行')) {
      const 造成buff数据 = this.获取施加重要buff信息('驰行')
      this.本次释放记录 = 造成buff数据 ? { 造成buff数据 } : {}
    }
  }
}

export default 振翅图南

export const 振翅图南类型 = typeof 振翅图南
