import type { 技能基础数据模型 } from '@/@types/技能'

import 通用增益 from './技能增益/通用增益/通用增益'
import 普攻增益 from './技能增益/普攻'
import 韦陀献杵增益 from './技能增益/韦陀献杵'
import 拿云式增益 from './技能增益/拿云式'
import 守缺式增益 from './技能增益/守缺式'
import 捕风式增益 from './技能增益/捕风式'
import 普渡四方增益 from './技能增益/普渡四方'
import { 横扫六合增益, 横扫六合增益_普渡, 横扫六合增益_直伤 } from './技能增益/横扫六合'
import 擒龙决增益 from './技能增益/擒龙决'
import 通用武伤增益 from './技能增益/通用增益/通用武伤'
import 真实伤害系数 from '@/心法模块/统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'
import { 按数字生成数组 } from '@/心法模块/模块工具/按数字生成数组'
import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import { 获取破招实际系数 } from '@/心法模块/统一数据/系数计算'
import 降魔增益 from './技能增益/降魔'
import 布泽增益 from './技能增益/布泽'

const 贪破函数 = () => {
  const 数组 = 按数字生成数组(10)
  return 数组.map((item) => {
    return {
      BuffId: 24453,
      Buff层数: item,
      增益名称: `贪破·${item}`,
      增益所在位置: '技能',
      增益类型: '部分启用',
      增益集合: [{ 属性: 属性类型.郭氏破招, 值: -50 * item }],
    } as 技能增益列表类型
  })
}

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '32887',
    技能名称: '破',
    统计名称: '破',
    技能伤害系数: 获取破招实际系数(1048576 * ((0.654075 * 1.4 * 1.3) / 1.3 - 1)),
    技能增益列表: [...通用增益, ...贪破函数()],
    技能等级数据: {
      // 韦陀献杵
      1: { 技能伤害系数: 获取破招实际系数(1048576 * ((0.654075 * 1.4 * 1.3) / 1.3 - 1)) },
      // 拿云式
      2: { 技能伤害系数: 获取破招实际系数(1048576 * ((0.654075 * 1.4 * 1.3) / 1.3 - 1)) },
      // 贪破
      3: { 技能伤害系数: 获取破招实际系数(1048576 * ((0.13 * 1.3) / 1.2 - 1)) },
    },
  },
  {
    技能ID: '11',
    技能名称: '六合棍',
    伤害类型: '外功',
    技能伤害系数: 27,
    武器伤害系数: 1,
    技能增益列表: 普攻增益,
  },
  {
    技能ID: '3849',
    技能名称: '韦陀献杵·一',
    秘籍依赖技能: '韦陀献杵',
    统计名称: '韦陀献杵',
    技能伤害系数: 203,
    基础伤害_基础值: 60,
    技能增益列表: [...韦陀献杵增益],
  },
  {
    技能ID: '3850',
    技能名称: '韦陀献杵·二',
    秘籍依赖技能: '韦陀献杵',
    统计名称: '韦陀献杵',
    技能伤害系数: 406,
    基础伤害_基础值: 120,
    技能增益列表: [...韦陀献杵增益],
  },
  {
    技能ID: '3848',
    技能名称: '韦陀献杵·三',
    秘籍依赖技能: '韦陀献杵',
    统计名称: '韦陀献杵',
    技能伤害系数: 609,
    基础伤害_基础值: 174,
    基础伤害_浮动值: 10,
    技能增益列表: [...韦陀献杵增益],
  },
  {
    技能ID: '19090_1',
    技能名称: '普渡四方·武伤',
    统计名称: '普渡四方',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 通用武伤增益,
  },
  {
    技能ID: '19090_2',
    技能名称: '韦陀献杵·武伤',
    统计名称: '韦陀献杵',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 2,
    技能增益列表: 通用武伤增益,
  },
  {
    技能ID: '19090_3',
    技能名称: '横扫六合·武伤',
    统计名称: '横扫六合',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 通用武伤增益,
  },
  {
    技能ID: '19090_4',
    技能名称: '摩诃无量·武伤',
    统计名称: '摩诃无量',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 通用武伤增益,
  },
  {
    技能ID: '236',
    技能名称: '摩诃无量',
    统计名称: '摩诃无量',
    技能伤害系数: 16,
    基础伤害_基础值: 22,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '271_1',
    技能名称: '降魔·韦陀献杵',
    统计名称: '降魔',
    秘籍依赖技能: '韦陀献杵',
    技能伤害系数: 243,
    基础伤害_基础值: 6,
    技能增益列表: 降魔增益,
  },
  {
    技能ID: '271_5',
    技能名称: '降魔·拿云式',
    统计名称: '降魔',
    秘籍依赖技能: '拿云式',
    技能伤害系数: 263,
    基础伤害_基础值: 26,
    技能增益列表: 降魔增益,
  },
  {
    // 原始守缺式
    技能ID: '3816',
    技能名称: '守缺式',
    秘籍依赖技能: '守缺式',
    统计名称: '守缺式',
    技能伤害系数: 475,
    基础伤害_基础值: 142,
    基础伤害_浮动值: 5,
    技能增益列表: 守缺式增益,
  },
  {
    技能ID: '13683',
    技能名称: '拿云式·一',
    统计名称: '拿云式',
    秘籍依赖技能: '拿云式',
    技能伤害系数: 218,
    基础伤害_基础值: 82,
    基础伤害_浮动值: 8,
    技能增益列表: 拿云式增益,
  },
  {
    技能ID: '13681',
    技能名称: '拿云式·二',
    统计名称: '拿云式',
    秘籍依赖技能: '拿云式',
    技能伤害系数: 438,
    基础伤害_基础值: 164,
    基础伤害_浮动值: 817,
    技能增益列表: 拿云式增益,
  },
  {
    技能ID: '13685',
    技能名称: '拿云式·三',
    统计名称: '拿云式',
    秘籍依赖技能: '拿云式',
    技能伤害系数: 659,
    基础伤害_基础值: 246,
    基础伤害_浮动值: 25,
    技能增益列表: 拿云式增益,
  },
  {
    技能ID: '36051',
    技能名称: '拿云式·三·斩杀·净果',
    统计名称: '拿云式',
    秘籍依赖技能: '拿云式',
    技能伤害系数: 758,
    基础伤害_基础值: 246,
    基础伤害_浮动值: 25,
    技能增益列表: 拿云式增益,
  },
  {
    // 不点幻身
    技能ID: '3810',
    技能名称: '横扫六合',
    秘籍依赖技能: '横扫六合',
    统计名称: '横扫六合',
    技能伤害系数: 530,
    基础伤害_基础值: 75,
    技能增益列表: [...横扫六合增益, ...横扫六合增益_普渡, ...横扫六合增益_直伤],
  },
  {
    // 743_3830
    技能ID: '743',
    技能名称: '横扫六合(DOT)',
    秘籍依赖技能: '横扫六合',
    统计名称: '横扫六合(DOT)',
    DOT生效间隔: 32,
    DOT跳数: 6,
    技能伤害系数: 757,
    基础伤害_基础值: 45,
    技能增益列表: [...横扫六合增益],
  },
  {
    技能ID: '14951',
    技能名称: '捕风式',
    技能伤害系数: 150,
    基础伤害_基础值: 60,
    基础伤害_浮动值: 6,
    技能增益列表: 捕风式增益,
  },
  {
    技能ID: '17641',
    技能名称: '普渡四方',
    秘籍依赖技能: '普渡四方',
    统计名称: '普渡四方',
    技能伤害系数: 558,
    基础伤害_基础值: 156,
    基础伤害_浮动值: 15,
    技能增益列表: 普渡四方增益,
  },
  {
    技能ID: '17642',
    技能名称: '普渡四方·二',
    秘籍依赖技能: '普渡四方',
    统计名称: '普渡四方',
    技能伤害系数: 558,
    基础伤害_基础值: 156,
    基础伤害_浮动值: 15,
    技能增益列表: 普渡四方增益,
  },
  {
    技能ID: '25766',
    技能名称: '守缺式·神兵',
    技能伤害系数: 50,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '28542',
    技能名称: '六合棍意',
    技能伤害系数: 119,
    基础伤害_基础值: 75,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '28619',
    技能名称: '千斤坠',
    技能伤害系数: 50,
    基础伤害_基础值: 28,
    基础伤害_浮动值: 3,
    技能增益列表: 通用增益,
    技能等级数据: {
      '1': {
        技能伤害系数: 50.0,
      },
      '2': {
        技能伤害系数: 75.0,
      },
    },
  },
  {
    技能ID: '29516',
    技能名称: '金刚日轮',
    技能伤害系数: 480,
    基础伤害_基础值: 28,
    基础伤害_浮动值: 3,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32656',
    技能名称: '金刚龙爪功',
    统计名称: '金刚龙爪功',
    技能伤害系数: 390,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32659',
    技能名称: '果报',
    技能伤害系数: 1084,
    技能增益列表: 通用增益,
  },
  // {
  //   技能ID: '32660',
  //   技能名称: '果报横扫',
  //   技能伤害系数: 1820,
  //   基础伤害_基础值: 28,
  //   基础伤害_浮动值: 3,
  //   技能增益列表: 通用增益,
  // },
  {
    技能ID: '38615',
    技能名称: '布泽',
    统计名称: '布泽',
    技能伤害系数: 800,
    技能增益列表: 布泽增益,
    技能等级数据: {
      '1': { 技能伤害系数: 270 },
      '2': { 技能伤害系数: 560 },
      '3': { 技能伤害系数: 880 },
      '4': { 技能伤害系数: 1280 },
      '5': { 技能伤害系数: 1680 },
      '6': { 技能伤害系数: 2080 },
    },
  },
  {
    技能ID: '23366', // 特效
    技能名称: '三面暴焰',
    技能伤害系数: 0,
    技能增益列表: 通用增益,
    基础伤害_基础值: 24661,
    技能等级数据: {
      '1,5': {
        基础伤害_基础值: [24661, 37577, 211280, 506377],
      },
    },
  },
  {
    技能ID: '23367', // 特效
    技能名称: '六臂屠魔',
    技能伤害系数: 0,
    技能增益列表: 通用增益,
    基础伤害_基础值: 3106,
    技能等级数据: {
      '1,5': {
        基础伤害_基础值: [3106, 6012, 33805, 81020],
      },
    },
  },
  {
    技能ID: '23368', // 特效
    技能名称: '六臂闪杀',
    技能伤害系数: 0,
    技能增益列表: 通用增益,
    基础伤害_基础值: 369,
    技能等级数据: {
      '1,5': {
        基础伤害_基础值: [369, 2004, 11268, 27007],
      },
    },
  },
  {
    技能ID: '23369', // 特效
    技能名称: '火云掌',
    技能伤害系数: 0,
    技能增益列表: 通用增益,
    基础伤害_基础值: 60587,
    技能等级数据: {
      '1,5': {
        基础伤害_基础值: [60587, 62127, 349316, 837210],
      },
    },
  },
  {
    技能ID: '23370', // 特效
    技能名称: '黑天金刚铃',
    技能伤害系数: 0,
    技能增益列表: 通用增益,
    基础伤害_基础值: 204289,
    技能等级数据: {
      '1,5': {
        基础伤害_基础值: [204289, 405830, 2281825, 5063771],
      },
    },
  },
  {
    技能ID: '445', // 特效
    技能名称: '擒龙',
    秘籍依赖技能: '擒龙决',
    技能伤害系数: 0,
    技能增益列表: 擒龙决增益,
  },
  // --------------
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
  擒龙决增益,
}

export { 技能增益 }
