import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 按数字生成数组 } from '@/工具函数/help'
import { 每秒郭氏帧 } from '@/数据/常量'
class 千枝绽蕊 extends 有CD技能通用类 {
  // scripts/skill/北天药宗/北天药宗_商陆其根.lua
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '千枝绽蕊')
  static 本次释放前内力 = 0

  constructor(模拟循环) {
    super(模拟循环)
  }

  释放() {
    this.获得千枝绽蕊()
    this.模拟循环.卸除buff({ 名称: '千枝伏藏', 对象: '自身' })
    this.模拟循环.删除待生效事件队列(`千枝伏藏_秒回`)
    千枝绽蕊.本次释放前内力 = this.模拟循环.角色状态信息?.内力 || 0
    this.保存释放记录()
    return
  }

  保存释放记录() {
    this.本次释放记录 = {
      底部标识: 千枝绽蕊.本次释放前内力,
    }
  }

  获得千枝绽蕊() {
    const 当前身上有千枝绽蕊 = this.千枝绽蕊状态校验()
    this.模拟循环.添加buff?.({ 名称: '千枝绽蕊', 对象: '自身' })
    if (!当前身上有千枝绽蕊) {
      this.添加千枝绽蕊每秒消耗事件()
    }
  }

  添加千枝绽蕊每秒消耗事件(初始时间 = 0) {
    let 当前时间 = this.模拟循环.当前时间 || 0
    if (当前时间 === 0) {
      当前时间 = -(每秒郭氏帧 - 初始时间)
    }

    const 待生效事件 = 按数字生成数组(1000).map((次数) => {
      return {
        事件名称: '千枝绽蕊_秒耗',
        事件时间: 当前时间 + 每秒郭氏帧 * 次数,
      }
    })

    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  千枝绽蕊每秒消耗() {
    // 仅在buff存在时生效
    if (!this.千枝绽蕊状态校验()) return

    const 当前内力 = this?.模拟循环?.角色状态信息?.内力
    if (当前内力 <= 5) {
      this.模拟循环.卸除buff?.({ 名称: '千枝绽蕊', 对象: '自身', 卸除层数: 1 })
      this.模拟循环.删除待生效事件队列(`千枝绽蕊_秒耗`)
      this.模拟循环.技能类实例集合.千枝伏藏.获得千枝伏藏()
      return
    }
    // 每秒郭氏帧消耗内力5
    this.模拟循环.消耗内力?.(5)
  }

  初始化千枝绽蕊(初始时间) {
    this.添加千枝绽蕊每秒消耗事件(初始时间)
  }

  千枝绽蕊状态校验() {
    return !!this?.模拟循环?.当前自身buff列表?.['千枝绽蕊']?.当前层数
  }
}

export default 千枝绽蕊

export const 千枝绽蕊类型 = typeof 千枝绽蕊
