import type { 技能基础数据模型 } from '@/@types/技能'
// import { 获取破招实际系数 } from '../../统一数据/系数计算'
// import { 属性类型 } from '@/@types/属性'

import 通用增益 from './技能增益/通用增益/通用增益'
import { 勾线增益 } from './技能增益/勾线'
import { 绊线增益 } from './技能增益/绊线'
import { 寄线增益 } from './技能增益/寄线'
import { 挑丝增益 } from './技能增益/挑丝'
import { 千里急增益 } from './技能增益/千里急'
import { 生地狱增益 } from './技能增益/生地狱'
import { 障幕虚影增益 } from './技能增益/障幕虚影'

import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'
import { 按数字生成数组 } from '@/工具函数/help'
// import { 属性类型 } from '@/@types/属性'

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: 42559,
    技能名称: '破',
    统计名称: '破',
    // 技能伤害系数: 获取破招实际系数(1048576 * (0.3612842559814453 - 1)),
    技能伤害系数: 8.534 * 0.5800008773803711,
    技能增益列表: 通用增益,
  },

  {
    技能ID: 41486,
    技能名称: '勾线',
    秘籍依赖技能: '勾线',
    统计名称: '勾线',
    技能伤害系数: 422,
    基础伤害_基础值: 430,
    基础伤害_浮动值: 20,
    技能增益列表: 勾线增益,
    技能等级数据: {
      1: { 技能伤害系数: 422 },
      2: { 技能伤害系数: 444 },
      3: { 技能伤害系数: 466 },
      4: { 技能伤害系数: 488 },
      5: { 技能伤害系数: 510 },
      6: { 技能伤害系数: 532 },
      7: { 技能伤害系数: 554 },
      8: { 技能伤害系数: 576 },
      9: { 技能伤害系数: 598 },
      10: { 技能伤害系数: 620 },
      11: { 技能伤害系数: 642 },
      12: { 技能伤害系数: 664 },
      13: { 技能伤害系数: 686 },
      14: { 技能伤害系数: 708 },
      15: { 技能伤害系数: 730 },
      16: { 技能伤害系数: 752 },
      17: { 技能伤害系数: 772 },
      18: { 技能伤害系数: 794 },
      19: { 技能伤害系数: 816 },
      20: { 技能伤害系数: 838 },
    },
  },
  {
    技能ID: 42265,
    技能名称: '绊线',
    秘籍依赖技能: '绊线',
    技能伤害系数: 600 * 1.2,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    技能增益列表: 绊线增益,
  },
  {
    技能ID: 42098,
    技能名称: '寄线',
    秘籍依赖技能: '寄线',
    技能伤害系数: 170,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    技能增益列表: 寄线增益,
  },
  {
    技能ID: 41994,
    技能名称: '勾线·伶影',
    秘籍依赖技能: '勾线',
    技能伤害系数: 105,
    基础伤害_基础值: 300,
    基础伤害_浮动值: 20,
    技能增益列表: 寄线增益,
    技能等级数据: {
      1: { 技能伤害系数: 105 },
      2: { 技能伤害系数: 131 },
    },
  },
  {
    技能ID: 41465,
    技能名称: '挑丝',
    秘籍依赖技能: '挑丝',
    技能伤害系数: 480,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    技能增益列表: 挑丝增益,
  },
  {
    技能ID: 41471,
    技能名称: '千里急·壹',
    秘籍依赖技能: '千里急',
    技能伤害系数: 140,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    技能增益列表: 千里急增益,
  },
  {
    技能ID: 41472,
    技能名称: '千里急·贰',
    秘籍依赖技能: '千里急',
    技能伤害系数: 210,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    技能增益列表: 千里急增益,
  },
  {
    技能ID: 41473,
    技能名称: '千里急·叁',
    秘籍依赖技能: '千里急',
    技能伤害系数: 280,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    技能增益列表: 千里急增益,
  },
  {
    技能ID: 42384,
    技能名称: '千里急·肆',
    秘籍依赖技能: '千里急',
    技能伤害系数: 420,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    武器伤害系数: 1,
    技能增益列表: 千里急增益,
  },
  {
    技能ID: 42417,
    技能名称: '应天长',
    技能伤害系数: 1400,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: 42021,
    技能名称: '生地狱',
    统计名称: '生地狱',
    技能伤害系数: 245 * 0.8,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    武器伤害系数: 1,
    技能等级数据: {
      '1,7': {
        基础伤害_基础值: 按数字生成数组(6).map((i) => 130 + i * 20),
        // 进傀儡增系数
        技能伤害系数: (i) => {
          return (210 + i * 37) * 0.8
        },
      },
    },
    技能增益列表: [...生地狱增益],
  },
  {
    技能ID: 42576,
    技能名称: '障幕虚影',
    技能伤害系数: 280,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    武器伤害系数: 1,
    技能增益列表: 障幕虚影增益,
  },
  {
    技能ID: 42976,
    技能名称: '谐调',
    技能伤害系数: 500,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 500 },
      2: { 技能伤害系数: 1000 },
      3: { 技能伤害系数: 2000 },
    },
  },
  {
    技能ID: 43086,
    技能名称: '绊线·神兵',
    技能伤害系数: 65,
    基础伤害_基础值: 0,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },
  {
    技能ID: 43081,
    技能名称: '夹线',
    技能伤害系数: 2600,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 5,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '32145',
    技能名称: '刻木(DOT)',
    统计名称: '刻木(DOT)',
    秘籍依赖技能: '千里急',
    技能伤害系数: 1600,
    DOT生效间隔: 32,
    DOT跳数: 5,
    基础伤害_基础值: 58,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '31945_42702',
    技能名称: '千里急(DOT)',
    秘籍依赖技能: '千里急',
    技能伤害系数: 1200,
    DOT生效间隔: 32,
    DOT跳数: 5,
    基础伤害_基础值: 58,
    技能增益列表: 千里急增益,
  },
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

const 技能增益 = {
  通用增益,
  千里急增益,
}

export { 技能增益 }

export default 技能基础数据
