import { 获取实际帧数 } from '@/工具函数/data'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 乘龙箭 extends 有CD技能通用类 {
  获取读条时间() {
    return Math.max(1, 获取实际帧数(8, this.模拟循环.加速值))
  }

  命中() {
    this.模拟循环.添加待生效事件队列([
      {
        事件名称: '技能读条',
        事件时间: this.模拟循环.当前时间 + this.获取读条时间(),
        事件备注: { 技能名称: '乘龙箭' },
      },
    ])
    this.模拟循环.技能类实例集合.梅花枪法.延后读条期间普攻(
      this.模拟循环.当前时间 + this.获取读条时间(),
    )
  }

  读条伤害() {
    this.触发伤害行为('乘龙箭')
    this.回复战意('乘龙箭', 1)
    this.模拟循环.添加buff({ 名称: '破甲', 对象: '目标' })
    this.本次释放记录 = {
      实际伤害技能: '乘龙箭',
      伤害段数: 1,
      造成buff数据: this.获取施加重要buff信息('破甲')!,
    }
  }
}

export default 乘龙箭

export const 乘龙箭类型 = typeof 乘龙箭
