export default {
  "装备基础属性": {
    "基础攻击": 60731,
    "破防等级": 93203,
    "无双等级": 108676,
    "会心等级": 64532,
    "会心效果等级": 8124,
    "全能等级": 0,
    "武器伤害_最小值": 8212,
    "武器伤害_最大值": 13687,
    "破招值": 0,
    "力道": 44,
    "元气": 44,
    "身法": 10659,
    "根骨": 44,
    "体质": 186110,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 2801,
    "装分": 688959
  },
  "装备镶嵌附魔属性": {
    "基础攻击": 11343,
    "破防等级": 7728,
    "无双等级": 8032,
    "会心等级": 2274,
    "会心效果等级": 2274,
    "全能等级": 0,
    "武器伤害_最小值": 0,
    "武器伤害_最大值": 0,
    "破招值": 0,
    "力道": 44,
    "元气": 44,
    "身法": 236,
    "根骨": 44,
    "体质": 2119,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 2801
  },
  "装备列表": [
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAgilityBase",
          "镶嵌宝石等级": 7
        },
        {
          "镶嵌类型": "atPhysicsOvercomeBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 106783,
      "装备部位": "帽子",
      "附魔": "攻击+761"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsCriticalStrike",
          "镶嵌宝石等级": 7
        },
        {
          "镶嵌类型": "atPhysicsCriticalDamagePowerBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 106815,
      "装备部位": "衣服",
      "附魔": "无双+836"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsCriticalStrike",
          "镶嵌宝石等级": 7
        },
        {
          "镶嵌类型": "atPhysicsAttackPowerBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 106719,
      "装备部位": "腰带",
      "附魔": "无双+836"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsCriticalDamagePowerBase",
          "镶嵌宝石等级": 7
        },
        {
          "镶嵌类型": "atPhysicsAttackPowerBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 106953,
      "装备部位": "护腕",
      "附魔": "无双+2801"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsCriticalDamagePowerBase",
          "镶嵌宝石等级": 7
        },
        {
          "镶嵌类型": "atPhysicsAttackPowerBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 106981,
      "装备部位": "下装",
      "附魔": "无双+2801"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsAttackPowerBase",
          "镶嵌宝石等级": 7
        },
        {
          "镶嵌类型": "atPhysicsOvercomeBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 106751,
      "装备部位": "鞋子",
      "附魔": "攻击+761"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 44290,
      "装备部位": "项链",
      "附魔": "体质+1037"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsOvercomeBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 8,
      "id": 47806,
      "装备部位": "腰坠",
      "附魔": "体质+1037"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 44359,
      "装备部位": "戒指",
      "附魔": "攻击+761"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 44359,
      "装备部位": "戒指",
      "附魔": "攻击+761"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsCriticalStrike",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 42670,
      "装备部位": "暗器",
      "附魔": "加速+2801"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atPhysicsAttackPowerBase",
          "镶嵌宝石等级": 7
        },
        {
          "镶嵌类型": "atAgilityBase",
          "镶嵌宝石等级": 7
        },
        {
          "镶嵌类型": "atPhysicsOvercomeBase",
          "镶嵌宝石等级": 7
        }
      ],
      "当前精炼等级": 6,
      "id": 42727,
      "装备部位": "武器",
      "附魔": "攻击+761"
    }
  ],
  "五彩石": "彩·见切·斩铁·痛击(陆)",
  "装备增益": {
    "大附魔_伤帽": 2,
    "大附魔_伤衣": 2,
    "大附魔_伤腰": 2,
    "大附魔_伤腕": 2,
    "大附魔_伤鞋": 2,
    "常驻套装会心会效": 1,
    "套装技能": 1,
    "风特效腰坠": 2,
    "水特效武器": 2
  }
}