export default {
  装备基础属性: {
    基础攻击: 67615,
    破防等级: 113877,
    无双等级: 107288,
    会心等级: 91859,
    会心效果等级: 21328,
    全能等级: 0,
    武器伤害_最小值: 10275,
    武器伤害_最大值: 17125,
    破招值: 0,
    力道: 44,
    元气: 44,
    身法: 12878,
    根骨: 44,
    体质: 222253,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 14811,
    装分: 831217,
  },
  装备镶嵌附魔属性: {
    基础攻击: 12841,
    破防等级: 12598,
    无双等级: 11148,
    会心等级: 3951,
    会心效果等级: 1317,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 0,
    力道: 44,
    元气: 44,
    身法: 380,
    根骨: 44,
    体质: 3081,
    基础气血上限: 160878,
    额外气血上限: 0,
    加速等级: 7378,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAgilityBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109244,
      装备部位: '帽子',
      附魔: '加速+3279',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109276,
      装备部位: '衣服',
      附魔: '无双+978',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109180,
      装备部位: '腰带',
      附魔: '无双+978',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109419,
      装备部位: '护腕',
      附魔: '无双+3279',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109448,
      装备部位: '下装',
      附魔: '无双+3279',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 109212,
      装备部位: '鞋子',
      附魔: '攻击+891',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 47868,
      装备部位: '项链',
      附魔: '体质+1518',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 8,
      id: 49071,
      装备部位: '腰坠',
      附魔: '体质+1518',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 47942,
      装备部位: '戒指',
      附魔: '攻击+1559',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 47942,
      装备部位: '戒指',
      附魔: '攻击+1559',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 6,
      id: 44405,
      装备部位: '暗器',
      附魔: '加速+4099',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atAgilityBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 8,
      id: 44286,
      装备部位: '武器',
      附魔: '攻击+891',
    },
  ],
  五彩石: '彩·锐刃·无双·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    常驻套装会心会效: 1,
    套装技能: 1,
    特效_40788: 3,
    特效_40793: 3,
    特效_40803: 2,
    小橙武特效_会心: 1,
    小橙武特效: 6,
  },
}
