export default {
  装备基础属性: {
    基础攻击: 8740,
    破防等级: 2581,
    无双等级: 8290,
    会心等级: 1081,
    会心效果等级: 19,
    全能等级: 0,
    武器伤害_最小值: 189,
    武器伤害_最大值: 315,
    力道: 17,
    元气: 17,
    身法: 2284,
    根骨: 18,
    体质: 6346,
    基础气血上限: 3956,
    额外气血上限: 0,
    加速等级: 448,
    装分: 24030,
  },
  装备镶嵌附魔属性: {
    基础攻击: 2827,
    破防等级: 278,
    无双等级: 82,
    会心等级: 57,
    会心效果等级: 19,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    力道: 17,
    元气: 17,
    身法: 200,
    根骨: 18,
    体质: 18,
    基础气血上限: 3956,
    额外气血上限: 0,
    加速等级: 216,
  },
  装备列表: [
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAgilityBase',
          镶嵌宝石等级: 7,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 112320,
      装备部位: '帽子',
      装备部位索引: '_1',
      附魔: 16500,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 7,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 112352,
      装备部位: '衣服',
      装备部位索引: '_2',
      附魔: 16598,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 7,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 112018,
      装备部位: '腰带',
      装备部位索引: '_3',
      附魔: 16600,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 7,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 112491,
      装备部位: '护腕',
      装备部位索引: '_4',
      附魔: 16540,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 7,
        },
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 112519,
      装备部位: '下装',
      装备部位索引: '_5',
      附魔: 16490,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 7,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 112288,
      装备部位: '鞋子',
      装备部位索引: '_6',
      附魔: 16550,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atStrainBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 49907,
      装备部位: '项链',
      装备部位索引: '_7',
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 8,
      id: 51362,
      装备部位: '腰坠',
      装备部位索引: '_8',
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 49937,
      装备部位: '戒指',
      装备部位索引: '_9',
      附魔: 16610,
    },
    {
      镶嵌孔数组: [],
      当前精炼等级: 6,
      id: 49937,
      装备部位: '戒指',
      装备部位索引: '_10',
      附魔: 16610,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 46669,
      装备部位: '暗器',
      装备部位索引: '_11',
      附魔: 16616,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 7,
        },
        {
          镶嵌类型: 'atAgilityBase',
          镶嵌宝石等级: 7,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 7,
        },
      ],
      当前精炼等级: 6,
      id: 46726,
      装备部位: '武器',
      装备部位索引: '_12',
      附魔: 16486,
    },
  ],
  五彩石: '彩·瞬影·斩铁·锐刃(陆)',
  装备增益: {
    大附魔_伤帽: 2,
    大附魔_伤衣: 2,
    大附魔_伤腰: 2,
    大附魔_伤腕: 2,
    大附魔_伤鞋: 2,
    常驻套装会心会效: 1,
    套装技能: 1,
    风特效腰坠: 36,
    水特效武器: 87,
  },
}
