import { 获取实际帧数 } from '@/工具函数/data'
import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 蛇影 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '蛇影')

  constructor(模拟循环) {
    super(模拟循环)
    蛇影.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '蛇影')
    this.初始化技能运行数据()
  }

  获取读条时间() {
    const 基础读条时间 = this.模拟循环.校验奇穴是否存在('蛇悉')
      ? 每秒郭氏帧 * 1.25
      : 蛇影.技能数据?.读条时间
    if (this.模拟循环.当前自身buff列表?.['降厄']?.当前层数) {
      return 获取实际帧数(基础读条时间, this.模拟循环.加速值, 0, 512)
    }
    return 基础读条时间 || 0
  }

  释放() {}

  读条(读条开始时间: number) {
    this.模拟循环.添加待生效事件队列([
      {
        事件名称: '技能读条',
        事件时间: 读条开始时间 + this.获取读条时间(),
        事件备注: {
          技能名称: '蛇影',
        },
      },
    ])
  }

  读条伤害() {
    this.蛇影命中()
  }

  命中() {
    const 读条时间 = this.获取读条时间()
    if (!读条时间) {
      this.蛇影命中()
    }
  }

  蛇影命中() {
    this.模拟循环.技能类实例集合?.蛇影DOT?.获得和刷新蛇影DOT()
    if (this.模拟循环.校验奇穴是否存在('蛇悉')) {
      this.模拟循环.添加buff({ 名称: '蛇悉', 对象: '自身', 新增层数: 1 })
      this.触发伤害行为('蛇影', 1)
    }
    this.触发降厄('蛇影')
    this.触发残香()
    this.触发荒息('蛇影')
    this.处理虫魄('蛇影')
    this.圣蝎献祭处理()
    this.保存释放记录('蛇影')
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['引魂', '降厄', '圣蝎献祭']),
    }
  }
}

export default 蛇影

export const 蛇影类型 = typeof 蛇影
