import { 五彩石数据类型 } from '@/@types/五彩石'
import { 属性类型 } from '@/@types/属性'
import { 五彩石增益类型枚举 } from '@/@types/枚举'

const 五彩石_五级: 五彩石数据类型[] = [
  {
    五彩石名称: '彩·霸体·锐刃·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·霸体·锐刃·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·霸体·锐刃·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·霸体·斩铁·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·霸体·斩铁·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·霸体·斩铁·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·霸体·痛击·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·霸体·痛击·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·霸体·痛击·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.体质, 增益名称: 五彩石增益类型枚举.体质, 增益数值: 609 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·锐刃·斩铁·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·斩铁·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·锐刃·斩铁·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·斩铁·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·痛击·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·痛击·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·痛击·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·痛击·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·破招·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·破招·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·破招·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·锐刃·破招·急速(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·狂攻·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 994 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·狂攻·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 994 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·急速·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·急速·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·无双·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·无双·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·锐刃·无双·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·锐刃·无双·急速(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 331 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·锐刃·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·锐刃·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·斩铁·锐刃·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·锐刃·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·痛击·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·痛击·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·斩铁·痛击·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·痛击·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·破招·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·破招·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·斩铁·破招·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·斩铁·狂攻·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 994 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·狂攻·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 994 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·无双·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·斩铁·无双·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·斩铁·无双·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·锐刃·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·见切·锐刃·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·锐刃·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·斩铁·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·见切·斩铁·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·斩铁·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·见切·痛击·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·见切·痛击·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·见切·痛击·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.外功会心等级, 增益名称: 五彩石增益类型枚举.会心等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·痛击·锐刃·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·痛击·锐刃·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·锐刃·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·锐刃·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·斩铁·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·痛击·斩铁·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·痛击·斩铁·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·斩铁·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·破招·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·痛击·破招·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·破招·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·痛击·狂攻·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 994 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·狂攻·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 994 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·无双·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·痛击·无双·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·痛击·无双·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 1219,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·锐刃·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·破招·锐刃·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·破招·锐刃·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·斩铁·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·破招·斩铁·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·斩铁·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·痛击·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·破招·痛击·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·破招·痛击·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·破招·急速·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 1219 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·锐刃·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·无双·锐刃·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·无双·锐刃·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·斩铁·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·无双·斩铁·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·斩铁·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·痛击·狂攻(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 1987 },
    ],
  },
  {
    五彩石名称: '彩·无双·痛击·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·无双·痛击·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·无双·急速·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 1219 },
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·急速·破招·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 1219 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·急速·锐刃·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·急速·锐刃·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 1219 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·急速·无双·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.加速等级, 增益名称: 五彩石增益类型枚举.加速等级, 增益数值: 1219 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·狂攻·破招·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·狂攻·破招·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·狂攻·破招·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
  {
    五彩石名称: '彩·狂攻·锐刃·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·狂攻·锐刃·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.外功基础攻击, 增益名称: 五彩石增益类型枚举.外功基础攻击, 增益数值: 662 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·狂攻·斩铁·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·狂攻·斩铁·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 2438 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·狂攻·痛击·破招(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.破招值, 增益名称: 五彩石增益类型枚举.破招值, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·狂攻·痛击·无双(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 2438,
      },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·狂攻·无双·锐刃(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功基础攻击,
        增益名称: 五彩石增益类型枚举.外功基础攻击,
        增益数值: 1325,
      },
    ],
  },
  {
    五彩石名称: '彩·狂攻·无双·斩铁(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      { 增益类型: 属性类型.外功破防等级, 增益名称: 五彩石增益类型枚举.破防等级, 增益数值: 4875 },
    ],
  },
  {
    五彩石名称: '彩·狂攻·无双·痛击(伍)',
    五彩石等级: 5,
    装备增益: [
      { 增益类型: 属性类型.武器伤害, 增益名称: 五彩石增益类型枚举.武器伤害, 增益数值: 497 },
      { 增益类型: 属性类型.无双等级, 增益名称: 五彩石增益类型枚举.无双等级, 增益数值: 2438 },
      {
        增益类型: 属性类型.外功会心效果等级,
        增益名称: 五彩石增益类型枚举.会心效果等级,
        增益数值: 4875,
      },
    ],
  },
]

export default 五彩石_五级
