import { 属性类型 } from '@/@types/属性'
import { 装备增益可选类型类型, 装备特效增益数据, 装备特效枚举 } from '@/@types/装备'

const 装备增益数据 = {
  // 装备常见特效
  风特效腰坠: [{ 值: [35982, 43038], 属性: 属性类型.全破防等级 }], // BuffID: 29268
  // 套装会心会效: [
  //   { 值: [0.04], 属性: 属性类型.全会心百分比 },
  //   { 值: [41], 属性: 属性类型.郭氏全会心效果等级 },
  // ],
  常驻套装会心会效: [
    // set_id 6794
    { 值: [7908], 属性: 属性类型.全会心等级 },
    { 值: [2914], 属性: 属性类型.全会心效果等级 },
  ],
  切糕会心: [{ 值: [3494, 4098], 属性: 属性类型.全会心等级 }],
  切糕无双: [{ 值: [3494, 4098], 属性: 属性类型.无双等级 }],

  // 大附魔
  大附魔_伤帽: [{ 值: [3501, 4099], 属性: 属性类型.全破防等级 }], // BuffID: 15436
  大附魔_伤腰: [{ 值: [(0.038 * 8) / 32], 属性: 属性类型.通用增伤 }],

  // 节日特效
  龙门飞剑武器: [
    { 值: [(11790 * 6) / 30], 属性: 属性类型.全会心等级 },
    { 值: [(5610 * 6) / 30], 属性: 属性类型.全会心效果等级 },
  ],
  冬至套装: [
    { 值: [2550], 属性: 属性类型.全会心等级 },
    { 值: [930], 属性: 属性类型.全会心效果等级 },
  ],

  // 副本精简常驻特效
  特效_40790: [
    { 值: [988, 1155, 1350], 属性: 属性类型.全会心等级 },
    { 值: [988, 1155, 1350], 属性: 属性类型.全破防等级 },
  ],
  特效_40793: [{ 值: [2824, 3301, 3857], 属性: 属性类型.无双等级 }],
  特效_40802: [{ 值: [1412, 1650, 1928], 属性: 属性类型.全破防等级, 可叠加: true }],
  特效_40803: [{ 值: [1412, 1650, 1928], 属性: 属性类型.全会心等级, 可叠加: true }],
  特效_40804: [{ 值: [1412, 1650, 1928], 属性: 属性类型.破招值, 可叠加: true }],
  特效_41065: [{ 值: [1412, 1650, 1928], 属性: 属性类型.无双等级, 可叠加: true }],

  // 试炼之地常驻特效
  试炼鞋子破防: [
    {
      值: [4218, 4391, 4072, 4393, 4728, 5136, 5521, 6000]?.map((增益) => 增益 * 0.5),
      属性: 属性类型.全破防等级,
    },
  ],
  试炼鞋子会心: [
    {
      值: [4218, 4391, 4072, 4393, 4728, 5136, 5521, 6000]?.map((增益) => 增益 * 0.5),
      属性: 属性类型.全会心等级,
    },
  ],
  // 29537
  试炼腰坠会效: [
    {
      值: [270, 282, 261, 282, 303, 330, 354, 385]?.map((增益) => 增益 * 5),
      属性: 属性类型.全会心效果等级,
    },
  ],
  // 29536
  试炼腰坠破防: [
    {
      值: [270, 282, 261, 282, 303, 330, 354, 385]?.map((增益) => 增益 * 5),
      属性: 属性类型.全破防等级,
    },
  ],
  // 大橙武特效 - 29608
  大橙武特效: [
    {
      // 17100 18300 25950 20750 29575 23650 31625 34375 37125 40500 42500
      值: [671, 718, 765, 814, 864, 930, 997, 1080, 1166, 1272, 1335]?.map((增益) => 增益 * 5),
      属性: 属性类型.无双等级,
    },
  ],
  // 小橙武特效 - 29608
  小橙武特效: [
    {
      // 24500 27000 29500 32000 35000 39750
      值: [769, 848, 926, 1005, 1099, 1241]?.map((增益) => 增益 * 5),
      属性: 属性类型.无双等级,
    },
  ],
} as { [key in 装备增益可选类型类型]: 装备特效增益数据[] }

const 功法特殊增益数据 = {
  内功: {
    水特效武器: [{ 值: [2560, 3060], 属性: 属性类型.全基础攻击 }], // BuffID: 4761 水·灭虚
    大附魔_伤衣: [{ 值: [951 + 110, 1114 + 129], 属性: 属性类型.全基础攻击 }], // SkillID: 22151
  },
  天罗诡道: {
    水特效武器: [{ 值: [2560, 3060], 属性: 属性类型.全基础攻击 }], // BuffID: 4761 水·灭虚
    大附魔_伤衣: [{ 值: [951 + 110, 1114 + 129], 属性: 属性类型.全基础攻击 }], // SkillID: 22151
  },
  外功: {
    水特效武器: [{ 值: [2300, 2750], 属性: 属性类型.全基础攻击 }], // BuffID: 4761 水·斩流
    大附魔_伤衣: [{ 值: [951, 1114], 属性: 属性类型.全基础攻击 }], // SkillID: 22151
  },
}

const 装备特效存在等级: 装备特效枚举[] = [装备特效枚举.水特效武器, 装备特效枚举.风特效腰坠]

export { 功法特殊增益数据, 装备特效存在等级 }

export default 装备增益数据
