const 绘制点线 = (节点: number[][], 连线: number[][], 实心: boolean, 半径: number) => {
  const 线条 = 连线
    .map(([起点, 终点]) => {
      const [起点横, 起点纵] = 节点[起点]
      const [终点横, 终点纵] = 节点[终点]
      const 长度 = Math.hypot(终点横 - 起点横, 终点纵 - 起点纵)
      const 横向留白 = ((终点横 - 起点横) / 长度) * (半径 + 0.8)
      const 纵向留白 = ((终点纵 - 起点纵) / 长度) * (半径 + 0.8)
      return `<path d="M${起点横 + 横向留白} ${起点纵 + 纵向留白}L${终点横 - 横向留白} ${终点纵 - 纵向留白}" stroke="#e6be71" stroke-width="1.6" stroke-linecap="round"/>`
    })
    .join('')
  const 圆点 = 节点
    .map(
      ([横, 纵]) =>
        `<circle cx="${横}" cy="${纵}" r="${半径}" fill="${实心 ? '#f2cc79' : 'none'}" stroke="#ffe4a3" stroke-width="1.6"/>`,
    )
    .join('')
  return `${线条}${圆点}`
}

const 洛书点线 = [
  绘制点线(
    [
      [40, 14],
      [40, 40],
      [40, 66],
    ],
    [
      [0, 1],
      [1, 2],
    ],
    false,
    5.2,
  ),
  绘制点线(
    [
      [40, 12],
      [12, 40],
      [40, 40],
      [68, 40],
      [40, 68],
    ],
    [
      [0, 2],
      [1, 2],
      [2, 3],
      [2, 4],
    ],
    false,
    5,
  ),
  绘制点线(
    Array.from({ length: 7 }, (_, 序号) => [40, 7 + 序号 * 11]),
    Array.from({ length: 6 }, (_, 序号) => [序号, 序号 + 1]),
    false,
    3.8,
  ),
  绘制点线(
    Array.from({ length: 9 }, (_, 序号) => [7 + 序号 * 8.25, 40]),
    Array.from({ length: 8 }, (_, 序号) => [序号, 序号 + 1]),
    false,
    2.7,
  ),
  绘制点线(
    [
      [31, 14],
      [66, 50],
      [50, 65],
      [14, 31],
    ],
    [
      [0, 1],
      [1, 2],
      [2, 3],
      [3, 0],
    ],
    true,
    5.1,
  ),
  绘制点线(
    [
      [32, 18],
      [47, 33],
      [62, 48],
      [47, 63],
      [32, 48],
      [17, 33],
    ],
    [
      [0, 1],
      [1, 2],
      [2, 3],
      [3, 4],
      [4, 5],
      [5, 0],
    ],
    true,
    4.3,
  ),
  绘制点线(
    [
      [48, 10],
      [67, 29],
      [53, 43],
      [39, 57],
      [25, 71],
      [6, 52],
      [20, 38],
      [34, 24],
    ],
    [
      [0, 1],
      [1, 2],
      [2, 3],
      [3, 4],
      [4, 5],
      [5, 6],
      [6, 7],
      [7, 0],
    ],
    true,
    3.5,
  ),
]
export const 星符素材 = [
  '<path d="M40 8L45 32 69 40 45 47 40 72 34 47 11 40 34 32Z" fill="#fff1bd"/><path d="M21 19L27 25M58 56L64 62M60 19L54 25M21 61L27 55" stroke="#eac06b" stroke-width="2"/>',
  ...洛书点线,
].map(
  (图案) =>
    `data:image/svg+xml,${encodeURIComponent(
      `<svg xmlns="http://www.w3.org/2000/svg" width="80" height="80" viewBox="0 0 80 80">${图案}</svg>`,
    )}`,
)
