const 现有配装 = {
  _1: {
    镶嵌孔数组: [
      { 镶嵌类型: 'atStrainBase', 镶嵌宝石等级: 8 },
      { 镶嵌类型: 'atMagicAttackPowerBase', 镶嵌宝石等级: 8 },
    ],
    当前精炼等级: 6,
    id: 111752,
    装备部位: '帽子',
    装备部位索引: '_1',
  },
  _2: {
    镶嵌孔数组: [
      { 镶嵌类型: 'atSpiritBase', 镶嵌宝石等级: 8 },
      { 镶嵌类型: 'atMagicCriticalStrike', 镶嵌宝石等级: 6 },
    ],
    当前精炼等级: 6,
    id: 111722,
    装备部位: '衣服',
    装备部位索引: '_2',
  },
  _3: {
    镶嵌孔数组: [
      { 镶嵌类型: 'atMagicAttackPowerBase', 镶嵌宝石等级: 8 },
      { 镶嵌类型: 'atSpiritBase', 镶嵌宝石等级: 8 },
    ],
    当前精炼等级: 6,
    id: 111734,
    装备部位: '腰带',
    装备部位索引: '_3',
  },
  _4: {
    镶嵌孔数组: [
      { 镶嵌类型: 'atStrainBase', 镶嵌宝石等级: 8 },
      { 镶嵌类型: 'atSpiritBase', 镶嵌宝石等级: 8 },
    ],
    当前精炼等级: 6,
    id: 111728,
    装备部位: '护腕',
    装备部位索引: '_4',
  },
  _5: {
    镶嵌孔数组: [
      { 镶嵌类型: 'atMagicAttackPowerBase', 镶嵌宝石等级: 8 },
      { 镶嵌类型: 'atMagicCriticalStrike', 镶嵌宝石等级: 6 },
    ],
    当前精炼等级: 6,
    id: 111710,
    装备部位: '下装',
    装备部位索引: '_5',
  },
  _6: {
    镶嵌孔数组: [
      { 镶嵌类型: 'atMagicAttackPowerBase', 镶嵌宝石等级: 8 },
      { 镶嵌类型: 'atMagicOvercome', 镶嵌宝石等级: 8 },
    ],
    当前精炼等级: 6,
    id: 111776,
    装备部位: '鞋子',
    装备部位索引: '_6',
  },
  _7: {
    镶嵌孔数组: [{ 镶嵌类型: 'atStrainBase', 镶嵌宝石等级: 6 }],
    当前精炼等级: 4,
    id: 49730,
    装备部位: '项链',
    装备部位索引: '_7',
  },
  _8: {
    镶嵌孔数组: [{ 镶嵌类型: 'atSpiritBase', 镶嵌宝石等级: 8 }],
    当前精炼等级: 6,
    id: 49718,
    装备部位: '腰坠',
    装备部位索引: '_8',
  },
  _9: {
    镶嵌孔数组: [],
    当前精炼等级: 6,
    id: 49724,
    装备部位: '戒指',
    装备部位索引: '_9',
    附魔: 16625,
  },
  _10: {
    镶嵌孔数组: [],
    当前精炼等级: 6,
    id: 49724,
    装备部位: '戒指',
    装备部位索引: '_10',
    附魔: 16625,
  },
  _11: {
    镶嵌孔数组: [{ 镶嵌类型: 'atSpiritBase', 镶嵌宝石等级: 8 }],
    当前精炼等级: 6,
    id: 46323,
    装备部位: '暗器',
    装备部位索引: '_11',
  },
  _12: {
    镶嵌孔数组: [
      { 镶嵌类型: 'atMagicAttackPowerBase', 镶嵌宝石等级: 8 },
      { 镶嵌类型: 'atSpiritBase', 镶嵌宝石等级: 8 },
      { 镶嵌类型: 'atMagicOvercome', 镶嵌宝石等级: 8 },
    ],
    当前精炼等级: 6,
    id: 46278,
    装备部位: '武器',
    装备部位索引: '_12',
    附魔: 16486,
  },
  大附魔_伤帽: 0,
  大附魔_伤衣: 0,
  大附魔_伤腰: 0,
  大附魔_伤腕: 0,
  大附魔_伤鞋: 0,
  五彩石: '彩·潮生·灭气·激流(陆)',
}

export default 现有配装
