import { ERROR_ACTION } from '../../utils'
import 技能统一类 from '../../通用类/技能统一类'
import { 擒龙连段标记 } from '../../../constant/skill'

const 招式名称 = ['惊燕式', '逐鹰式', '控鹤式', '起凤式', '腾蛟式', '擒龙式']
const 招式图标 = [8568, 8569, 8572, 8573, 8570, 8571]

class 擒龙六斩 extends 技能统一类 {
  constructor(模拟循环) {
    super(模拟循环)
    this.技能数据 = 模拟循环.技能基础数据.find((技能) => 技能.技能名称 === '擒龙六斩')
  }

  释放() {
    if (!this.模拟循环.校验奇穴是否存在('龙息')) {
      return { 可以释放: false, 异常信息: { 信息: '未启用奇穴：龙息' } }
    }
    if (this.模拟循环.角色状态信息.刀魂 < this.技能数据.消耗数量!) {
      return { 可以释放: false, 异常信息: ERROR_ACTION.资源不足 }
    }
    return { 可以释放: true }
  }

  命中() {
    this.模拟循环.变更资源('刀魂', -this.技能数据.消耗数量!, '擒龙六斩')
    this.模拟循环.开始战斗()
  }

  造成伤害() {
    const 模拟 = this.模拟循环
    const 当前式 = 擒龙连段标记.findIndex((名称) => 模拟.当前自身buff列表[名称]) + 2
    模拟.添加buff({ 名称: '龙息', 对象: '自身' })
    模拟.添加buff({ 名称: '叠霜', 对象: '自身' })
    const 叠霜层数 = 模拟.当前自身buff列表.叠霜.当前层数
    const 增益 = [`${模拟.奇穴.includes('霜云') ? '霜云' : '叠霜'}·${叠霜层数}`]
    this.触发伤害行为(`${招式名称[当前式 - 1]}·一`, 1, 增益)
    this.触发伤害行为(`${招式名称[当前式 - 1]}·二`, 1, 增益)
    this.本次释放记录 = {
      实际伤害技能: 招式名称[当前式 - 1],
      实际图标: `https://icon.jx3box.com/icon/${招式图标[当前式 - 1]}.png`,
    }
    if (当前式 % 2 === 0) 模拟.添加buff({ 名称: '碎江天机会', 对象: '自身' })
    if (模拟.秘籍.擒龙六斩?.includes('回狂意')) 模拟.变更资源('狂意', 9, '擒龙六斩秘籍')
    if (模拟.秘籍.擒龙六斩?.includes('回气劲')) 模拟.变更资源('气劲', 9, '擒龙六斩秘籍')
    if (当前式 > 1) 模拟.卸除buff({ 名称: 擒龙连段标记[当前式 - 2], 对象: '自身' })
    if (当前式 !== 6) {
      if (当前式 === 1) {
        模拟.添加待生效事件队列([
          {
            事件名称: '擒龙一式转二式',
            事件时间: 模拟.当前时间 + 6,
            事件备注: { 技能名称: this.技能数据.技能名称 },
          },
        ])
      } else {
        模拟.添加buff({ 名称: 擒龙连段标记[当前式 - 1], 对象: '自身' })
      }
    }
    if (当前式 === 6 || 模拟.当前自身buff列表.叠霜?.当前层数 === 6) {
      模拟.卸除buff({ 名称: '叠霜', 对象: '自身', 卸除层数: 6 })
    }
  }

  一式转二式() {
    this.模拟循环.添加buff({ 名称: 擒龙连段标记[0], 对象: '自身' })
  }
}

export default 擒龙六斩
