import { 装备特效枚举 } from '@/@types/装备'
import 装备特效数据, { 装备特效描述 } from '@/数据/装备/装备增益数据/装备特效数据'
import { 获取副本特效增益表现 } from '../根据装备信息获取基础属性/装备特效判断'

export const 获取装备特效展示信息 = (
  特效名称: 装备特效枚举,
  装备品级: number,
  装备特效等级: any,
) => {
  const 特效数据 = 装备特效数据?.[特效名称]
  if (!特效数据?.描述) {
    return ''
  }
  let 特效等级 = 1
  if (特效数据?.档位规则 === '触发等级') {
    特效等级 = 装备特效等级 ? +装备特效等级 : 1
  } else if (特效数据?.档位规则 === '副本品级') {
    特效等级 = 获取副本特效增益表现(装备品级, 装备特效等级)
  }
  const 最终描述 = 获取该等级实际描述(特效数据.描述, 特效等级)
  return 最终描述
}

const 获取该等级实际描述 = (描述: 装备特效描述, 特效等级: number) => {
  let desc = 描述?.描述
  // 使用正则表达式替换所有【数值_x】占位符
  desc = desc.replace(/数值_(\d+)/g, (match, num) => {
    const 数值 = 描述?.数值?.[`数值_${num}`]
    if (数值?.[特效等级] !== undefined) {
      return 数值[特效等级].toString()
    }
    return match // 保留未找到的占位符
  })

  return desc
}
