import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 孔雀翎 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '孔雀翎')

  constructor(模拟循环: any) {
    super(模拟循环)
    this.初始化技能运行数据()
  }

  释放() {
    // 检查神机值是否足够
    const 当前神机值 = this.模拟循环?.角色状态信息?.神机值 || 100
    const 消耗神机值 = 孔雀翎.技能数据!.消耗神机值 ?? 0
    if (当前神机值 < 消耗神机值) {
      return {
        可以释放: false,
        异常信息: {信息:`神机值不足，当前神机值：${当前神机值}，所需神机值：${消耗神机值}`}
      }
    }
    this.模拟循环.神机值变化(孔雀翎.技能数据!)
    return { 可以释放: true }
  }

  命中() {
    this.模拟循环?.添加buff({ 名称: '鸩羽', 对象: '目标' })
    this.触发伤害行为('孔雀翎', 1)
    this.保存释放记录('孔雀翎')
  }


  保存释放记录(名称: string) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['心无旁骛', '扬威', '神机好穷内攻增伤', '秋风散影','催寒','气魄','弩心','天风汲雨']),
    }
  }
}

export default 孔雀翎

export const 孔雀翎类型 = typeof 孔雀翎
