import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { ERROR_ACTION } from '../../utils'

class 折枝拂露 extends 有CD技能通用类 {
  释放() {
    return this.模拟循环.校验奇穴是否存在('折枝拂露')
      ? { 可以释放: true }
      : { 可以释放: false, 异常信息: ERROR_ACTION.折枝奇穴 }
  }

  命中() {
    this.本次释放记录 = {
      实际伤害技能: '折枝拂露',
      重要buff列表: this.获取当前重要buff列表(['相使']),
    }
    const 温寒 = this.模拟循环.角色状态信息.温寒
    if (温寒 > 0) {
      this.模拟循环.添加buff({ 名称: '折枝留春', 对象: '自身' })
    } else if (温寒 < 0) {
      this.模拟循环.技能类实例集合.沾衣未妨.折枝生成沾衣()
    }
    this.模拟循环.添加待生效事件队列([
      { 事件名称: '折枝拂露伤害', 事件时间: this.模拟循环.当前时间 + 8 },
    ])
  }

  延迟命中() {
    this.触发伤害行为('折枝拂露')
    this.模拟循环.技能类实例集合.逆乱.获得和刷新逆乱()
    this.模拟循环.技能类实例集合.逆乱.引爆并重新刷新(2, '折枝拂露')
  }
}

export default 折枝拂露
