import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 技能统一类 from '../../通用类/技能统一类'

class 击水三千 extends 技能统一类 {
  // lua入口 19737
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '击水三千')

  constructor(模拟循环) {
    super(模拟循环)
  }

  释放前() {
    if (this.模拟循环.当前自身buff列表?.['物化天行']?.当前层数) {
      this.折伞落地()
    }
  }

  判断击水链触发伤害() {
    const 击水链层数 = this.模拟循环.当前自身buff列表?.['击水链']?.当前层数
    if (!击水链层数) {
      this.击水三千造成伤害?.('击水三千·一', 1)
      // 添加两层击水buff
      this.模拟循环.添加buff?.({ 名称: '击水链', 对象: '自身', 新增层数: 2 })
    } else if (击水链层数 > 1) {
      this.击水三千造成伤害?.('击水三千·二', 2)
      // 消耗一层击水buff
      this.模拟循环.卸除buff?.({ 名称: '击水链', 对象: '自身', 卸除层数: 1 })
    } else if (击水链层数 === 1) {
      this.击水三千造成伤害?.('击水三千·三', 3)
      this.模拟循环.卸除buff?.({ 名称: '击水链', 对象: '自身', 卸除层数: 2 })
    }
  }

  命中() {
    this.判断击水链触发伤害()

    // 青冥
    if (this.模拟循环.校验奇穴是否存在('青冥')) {
      this.模拟循环.技能类实例集合?.青冥?.获得和刷新青冥?.()
    }

    // 驾鸾
    if (this.模拟循环.校验奇穴是否存在('驾鸾')) {
      this.模拟循环.技能类实例集合?.振翅图南?.减少调息时间?.(每秒郭氏帧 * 2)
    }

    // 击浪
    if (this.模拟循环.校验奇穴是否存在('击浪')) {
      this.模拟循环.技能类实例集合?.振翅图南?.延长最新振翅图南?.(6)
      this.击水续风驰()
      this.击水续驰行()
    }
  }

  击水续风驰() {
    if (this.模拟循环?.技能类实例集合?.振翅图南?.存在振翅图南校验()) {
      // 击水可以延长风驰Buff3秒，无描述。不好突破上限，先这么实现一下
      if (this?.模拟循环?.当前自身buff列表?.['风驰']?.当前层数) {
        const 往后推迟刷新时间 = Math.min(
          this.模拟循环.当前时间 || 0,
          (this.模拟循环.当前自身buff列表['风驰']?.刷新时间 || 0) + 每秒郭氏帧 * 3,
        )
        this.模拟循环.当前自身buff列表['风驰'] = {
          ...this.模拟循环.当前自身buff列表['风驰'],
          刷新时间: 往后推迟刷新时间,
        }
      }
    }
  }

  击水续驰行() {
    if (this.模拟循环?.技能类实例集合?.振翅图南?.存在振翅图南校验()) {
      // 击水可以延长风驰Buff3秒，无描述。不好突破上限，先这么实现一下
      if (this?.模拟循环?.当前自身buff列表?.['驰行']?.当前层数) {
        const 往后推迟刷新时间 = Math.min(
          this.模拟循环.当前时间 || 0,
          (this.模拟循环.当前自身buff列表['驰行']?.刷新时间 || 0) + 每秒郭氏帧 * 3,
        )
        this.模拟循环.当前自身buff列表['驰行'] = {
          ...this.模拟循环.当前自身buff列表['驰行'],
          刷新时间: 往后推迟刷新时间,
        }
      }
    }
  }

  击水三千造成伤害(名称, 段数) {
    this.触发伤害行为(名称)
    this.保存释放记录(名称, 段数)
  }

  保存释放记录(名称, 段数) {
    this.本次释放记录 = {
      伤害段数: 段数,
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['太息', '游仙', '梦悠']),
    }
  }
}

export default 击水三千

export const 击水三千类型 = typeof 击水三千
