// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import { ERROR_ACTION } from '../../utils'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 斩刀 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '斩刀')
  static 消耗怒气 = 0

  // 释放前怒气用于在左下角显示当前怒气，因为开启会显得界面比较乱，所以只作为自用。
  释放前怒气 = 0 // 释放前怒气自用标记-2026-04-18

  constructor(模拟循环) {
    super(模拟循环)

    斩刀.消耗怒气 = 15
  }
  释放() {
    const 当前怒气 = this.模拟循环.角色状态信息?.怒气 || 0
    if (当前怒气 < 斩刀.消耗怒气) {
      return {
        可以释放: false,
        异常信息: ERROR_ACTION.怒气不足,
      }
    }

    return { 可以释放: true }
  }
  命中() {
    // // 苍雪刀记录绝刀怒气用以判断触发的血誓怒气。
    this.记录绝刀怒气判定()
    // 用来在模拟器内显示援戈层数标记。
    this.记录释放时援戈层数()
    // 释放前怒气用于在左下角显示当前怒气，显示后界面比较乱，所以只作为自用。
    this.释放前怒气 = this.模拟循环.角色状态信息?.怒气 || 0 // 释放前怒气自用标记-2026-04-18

    const 目标有虚弱 = this.模拟循环.当前目标buff列表?.['虚弱']?.当前层数 || 0

    // 命中有虚弱的目标时移除虚弱效果
    if (目标有虚弱) {
      this.模拟循环.卸除buff?.({ 名称: '虚弱', 对象: '目标', 卸除层数: 1 })
    }

    // 命中有虚弱或流血的目标时添加流血效果
    if (目标有虚弱 || this.模拟循环.技能类实例集合?.流血?.当前层数()) {
      this.模拟循环.技能类实例集合?.流血?.获得和刷新流血?.()
    }

    // 点出绝返时获得狂绝
    if (this.模拟循环.校验奇穴是否存在?.('绝返')) {
      this.模拟循环.添加buff?.({ 名称: '狂绝', 对象: '自身', 新增层数: 1 })
    }
  }

  造成伤害() {
    const 有血怒_惊涌 = this.模拟循环.当前自身buff列表?.['血怒_惊涌']?.当前层数
    this.触发伤害行为('斩刀')

    if (有血怒_惊涌) {
      // 惊涌斩破是7级
      this.触发伤害行为('破', 1, [], undefined, false, 7)
    } else {
      //常规斩刀破招是2级
      this.触发伤害行为('破', 1, [], undefined, false, 2)
    }

    if (this.模拟循环.校验奇穴是否存在?.('麾远')) {
      this.触发伤害行为('麾远')
    }

    this.触发血誓效果(斩刀.绝刀怒气判定?.绝返等级)
    this.模拟循环.技能类实例集合?.盾击?.触发援戈伤害?.()

    // 怒气结算要在触发麟光之前，否则会先回怒再消耗
    this.触发消耗怒气(斩刀.消耗怒气, 斩刀.技能数据?.技能名称)
    this.模拟循环.技能类实例集合?.业火麟光?.触发麟光玄甲伤害?.()

    //偃守孤旌期间斩刀、闪刀无调息时间
    if (this.模拟循环.当前自身buff列表?.['战绝']?.当前层数) {
      this.重置苍雪刀调息时间()
    }
  }

  释放后() {
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武']),
    }
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
      特殊标记: this.获取释放时援戈层数(),
      // 释放前怒气用于在左下角显示当前怒气，显示后界面比较乱，所以只作为自用。
      // 伤害段数: this.释放前怒气,  // 释放前怒气自用标记-2026-04-18
    }
  }
}

export default 斩刀
export const 斩刀类型 = typeof 斩刀
