import { 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 待生效事件 } from '../../type'

class 劈风令 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '劈风令')

  constructor(模拟循环) {
    super(模拟循环)

    劈风令.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '劈风令')
    const 循环加速值 = this.模拟循环.加速值
    if (劈风令?.技能数据?.技能CD) {
      const 原始CD = 每秒郭氏帧 * 8
      const 加速后帧数 = 获取实际帧数(原始CD, 循环加速值)
      劈风令.技能数据.技能CD = 加速后帧数
    }

    this.初始化技能运行数据()
  }

  释放() {
    return
  }

  重置调息时间() {
    this.更新技能运行数据({ 待充能时间点: [] })
  }

  涣风触发() {
    if (this.模拟循环.校验奇穴是否存在('涣风')) {
      this.模拟循环.添加buff({ 名称: '涣风', 对象: '目标' })
    }
  }

  命中() {
    if (
      this.模拟循环.当前目标buff列表?.['骤风']?.当前层数 ||
      this.模拟循环.当前目标buff列表?.['横驱风靡']?.当前层数
    ) {
      this.触发伤害行为('劈风令')
      this.触发伤害行为('劈风令·骤')
      this.涣风触发()
      if (this.模拟循环.校验奇穴是否存在('纷飙')) {
        this.触发伤害行为('纷飙')
      }
    } else {
      this.触发伤害行为('劈风令')
    }

    if (this.模拟循环.校验奇穴是否存在('纷飙')) {
      this.模拟循环.技能类实例集合?.抟风令?.纷飙触发减少CD?.()
      this.模拟循环.技能类实例集合?.抟风令断?.纷飙触发减少CD?.()
    }

    if (this.模拟循环.校验奇穴是否存在('风萦')) {
      this.延迟触发风萦()
    }

    this.触发伤害行为('破', 1, [], undefined, 1)

    this.保存释放记录()
  }

  延迟触发风萦() {
    const 待生效事件: 待生效事件[] = []
    for (let i = 0; i <= 2; i++) {
      // 假设为5帧
      const 事件时间 = this.模拟循环.当前时间 + 20 + 16 * i
      待生效事件.push({
        事件名称: `风萦触发`,
        事件时间: 事件时间,
        事件备注: {},
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  风萦触发() {
    this.触发伤害行为('劈风令')
    this.触发伤害行为('破', 1, [], undefined, 1)
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['出岫']),
    }
  }
}

export default 劈风令

export const 劈风令类型 = typeof 劈风令
