// import 循环主类 from '../main'
import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 盾击 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '盾击')
  static 回复怒气 = 0

  // 释放前怒气用于在左下角显示当前怒气，因为开启会显得界面比较乱，所以只作为自用。
  释放前怒气 = 0 // 释放前怒气自用标记-2026-04-18

  constructor(模拟循环) {
    super(模拟循环)

    盾击.回复怒气 = 10

    this.初始化技能运行数据()
  }
  命中() {
    // 用来在模拟器内显示援戈层数标记。
    this.记录释放时援戈层数()
    // 释放前怒气用于在左下角显示当前怒气，显示后界面比较乱，所以只作为自用。
    this.释放前怒气 = this.模拟循环.角色状态信息?.怒气 || 0 // 释放前怒气自用标记-2026-04-18
  }
  判断盾击触发伤害() {
    const 盾击层数 = this.模拟循环.当前自身buff列表?.['盾击标记']?.当前层数 || 0
    if (!盾击层数) {
      this.触发伤害行为?.('盾击·正常')
      // 添加隐藏BUFF用于触发二段
      this.模拟循环.添加buff?.({ 名称: '盾击标记', 对象: '自身', 新增层数: 1 })
    } else if (盾击层数 === 1) {
      this.触发伤害行为?.('盾击·正常换动作')
      // 消耗二段buff，添加三段buff
      this.模拟循环.添加buff?.({ 名称: '盾击标记', 对象: '自身', 新增层数: 1 })
    } else if (盾击层数 === 2) {
      this.触发伤害行为?.('盾击·二')
      if (this?.模拟循环?.秘籍?.['盾击']?.some((a) => a === '三段回怒')) {
        this.模拟循环?.回复怒气?.(5, '盾击')
      }
      // 消耗三段buff
      this.模拟循环.卸除buff?.({ 名称: '盾击标记', 对象: '自身', 卸除层数: 2 })
    }
  }

  造成伤害() {
    this.判断盾击触发伤害()
    // 点出奇穴援戈时，触发击破·援戈破招伤害，成功造成破招伤害后获得援戈
    if (this.模拟循环.校验奇穴是否存在?.('援戈')) {
      this.触发伤害行为('击破·援戈')
      this.模拟循环.添加buff?.({ 名称: '援戈', 对象: '自身', 新增层数: 1 })
    }
    // 科研用的陷阵
    // if (this.模拟循环.当前自身buff列表?.['陷阵']?.当前层数) {
    if (
      this.模拟循环.校验奇穴是否存在?.('陷阵') &&
      !this.模拟循环.当前自身buff列表?.['陷阵']?.当前层数
    ) {
      this.触发伤害行为('地坼')
      this.模拟循环.添加buff?.({ 名称: '陷阵', 对象: '自身', 新增层数: 1 })
    }
    if (this.模拟循环?.大橙武模拟) {
      this.触发伤害行为?.('盾击·神兵', 0.25)
    }
  }
  // 在刀系技能中直接触发援戈伤害
  触发援戈伤害() {
    const 援戈层数 = this.模拟循环.当前自身buff列表?.['援戈']?.当前层数 || 0
    if (援戈层数 > 0) {
      const 有血怒 =
        this.模拟循环.当前自身buff列表?.['血怒'] || this.模拟循环.当前自身buff列表?.['血怒_惊涌']
      this.触发伤害行为(有血怒 ? '援戈·血影' : '援戈')
      this.模拟循环.卸除buff?.({ 名称: '援戈', 对象: '自身', 卸除层数: 1 })
    }
  }
  释放后() {
    this.触发回复怒气(盾击.回复怒气, 盾击.技能数据?.技能名称)
    this.模拟循环.技能类实例集合?.盾飞?.减少调息时间?.(每秒郭氏帧 * 2)
    this.保存释放记录()
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['血怒', '血怒_惊涌', '麟光玄甲', '援戈', '橙武']),
    }
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
      特殊标记: this.获取释放时援戈层数(),
      // 释放前怒气用于在左下角显示当前怒气，显示后界面比较乱，所以只作为自用。
      // 伤害段数: this.释放前怒气,  // 释放前怒气自用标记-2026-04-18
    }
  }
}

export default 盾击
export const 盾击类型 = typeof 盾击
