import type { 技能增益列表类型 } from '@/@types/技能'
import { 属性类型 } from '@/@types/属性'
import 大橙武技能增益 from './通用增益/大橙武技能增益'
import 通用增益 from './通用增益/通用增益'
import 门派套装增益 from './通用增益/门派套装增益'
import { 按数字生成数组 } from '@/心法模块/模块工具/按数字生成数组'

function 霜降函数(新妆 = true) {
  const 数组 = 按数字生成数组(6)
  return 数组.map((item) => {
    return {
      BuffId: 新妆 ? 30274 : 30273,
      RecipeId: 新妆 ? 5788 : 5787,
      Buff等级: item,
      增益名称: `${新妆 ? '霜降' : '霜降普通'}·${item}`,
      增益所在位置: '奇穴',
      依赖奇穴: '霜降',
      增益类型: '部分启用',
      增益集合: [
        {
          属性: 属性类型.系数增伤,
          // Buff等级1对应消耗0点剑舞。
          值: 1 + (item - 1) * 0.1,
        },
      ],
    } as 技能增益列表类型
  })
}

const 玳弦急曲增益: 技能增益列表类型[] = [
  ...通用增益,
  ...门派套装增益,
  ...大橙武技能增益,
  {
    增益名称: '盈袖',
    依赖奇穴: '盈袖',
    增益所在位置: '奇穴',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 0 }],
  },
  {
    BuffId: 25902,
    增益名称: '流玉影白糊弄版',
    增益所在位置: '奇穴',
    依赖奇穴: '流玉',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: (922 / 1024) * 0.7 }],
  },
  {
    BuffId: 25902,
    增益名称: '流玉',
    增益所在位置: '奇穴',
    依赖奇穴: '流玉',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 922 / 1024 }],
  },
  ...霜降函数(),
  {
    增益名称: '5%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 51 / 1024 }],
  },
  {
    增益名称: '4%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 41 / 1024 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
]

export default 玳弦急曲增益

// 6234 可受两种配方影响；6554 仅受新妆配方影响。
export const 玳弦本体增益: 技能增益列表类型[] = [...玳弦急曲增益, ...霜降函数(false)]
