export const 快捷添加数据: 快捷添加数据类型[] = [
  {
    名称: '兰钟循环',
    技能序列: ['阳明指', '兰摧玉折', '商阳指', '钟林毓秀', '阳明指', '钟林毓秀', '玉石俱焚'],
    color: 'cyan',
  },
  {
    名称: '吞商循环',
    技能序列: ['钟林毓秀', '商阳指', '阳明指', '商阳指', '阳明指', '商阳指', '玉石俱焚'],
    color: 'green',
  },
  {
    名称: '快雪循环',
    技能序列: ['快雪时晴', '阳明指', '兰摧玉折', '商阳指', '钟林毓秀', '玉石俱焚'],
    color: 'blue',
  },
  {
    名称: '阳商',
    技能序列: ['阳明指', '商阳指'],
    color: 'volcano',
  },
  {
    名称: '阳兰',
    技能序列: ['阳明指', '兰摧玉折'],
    color: 'volcano',
  },
  {
    名称: '阳钟',
    技能序列: ['阳明指', '钟林毓秀'],
    color: 'volcano',
  },
  {
    名称: '快2',
    技能序列: ['快雪时晴%{"作用次数":2}'],
    color: 'volcano',
  },
  {
    名称: '快3',
    技能序列: ['快雪时晴%{"作用次数":3}'],
    color: 'volcano',
  },
  {
    名称: '快4',
    技能序列: ['快雪时晴%{"作用次数":4}'],
    color: 'volcano',
  },
]

export interface 快捷添加数据类型 {
  名称: string
  技能序列: string[]
  color?: string
}
