import { 每秒郭氏帧 } from '@/数据/常量'
import { 循环基础技能数据类型 } from '../通用框架/类型定义/技能'
import { Buff枚举 } from '../通用框架/类型定义/Buff'

export const 通用循环模拟技能基础数据: 循环基础技能数据类型[] = [
  {
    技能名称: '特效腰坠',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 180,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/22900.png',
  },
]

// Map预备数据
export const 通用Buff数据: Buff枚举 = {
  风特效_英雄_快照: {
    类型: '自身',
    名称: '风特效_英雄_快照',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/3414.png',
  },
  风特效_快照: {
    类型: '自身',
    名称: '风特效_快照',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/3414.png',
  },

  // 唤醒10: {
  //   类型: '自身',
  //   名称: '唤醒10',
  //   最大层数: 1,
  //   最大持续时间: 每秒郭氏帧 * 60,
  //   图标: 'https://icon.jx3box.com/icon/18440.png',
  //   备注: '唤醒每层增伤2%，10层',
  // },
  // 唤醒20: {
  //   类型: '自身',
  //   名称: '唤醒20',
  //   最大层数: 1,
  //   最大持续时间: 每秒郭氏帧 * 60,
  //   图标: 'https://icon.jx3box.com/icon/18440.png',
  //   备注: '唤醒每层增伤2%，20层',
  // },
  // 唤醒30: {
  //   类型: '自身',
  //   名称: '唤醒30',
  //   最大层数: 1,
  //   最大持续时间: 每秒郭氏帧 * 60,
  //   图标: 'https://icon.jx3box.com/icon/18440.png',
  //   备注: '唤醒每层增伤2%，30层',
  // },
  // 易命: {
  //   类型: '自身',
  //   名称: '易命',
  //   最大层数: 1,
  //   最大持续时间: 每秒郭氏帧 * 60,
  //   图标: 'https://icon.jx3box.com/icon/337.png',
  //   备注: '承此余力，死战不息。自身最大气血、伤害与治疗效能显著提升',
  // },
  // 损毁5: {
  //   类型: '自身',
  //   名称: '损毁5',
  //   最大层数: 5,
  //   最大持续时间: 每秒郭氏帧 * 60,
  //   图标: 'https://icon.jx3box.com/icon/3452.png',
  //   备注: '损毁严重，每层使受到的伤害提高10%，5层',
  // },
  // 损毁20: {
  //   类型: '自身',
  //   名称: '损毁20',
  //   最大层数: 20,
  //   最大持续时间: 每秒郭氏帧 * 60,
  //   图标: 'https://icon.jx3box.com/icon/3452.png',
  //   备注: '损毁严重，每层使受到的伤害提高10%，20层',
  // },
  // 损毁50: {
  //   类型: '自身',
  //   名称: '损毁50',
  //   最大层数: 50,
  //   最大持续时间: 每秒郭氏帧 * 60,
  //   图标: 'https://icon.jx3box.com/icon/3452.png',
  //   备注: '损毁严重，每层使受到的伤害提高10%，50层',
  // },
}
