export const 快捷添加数据: 快捷添加数据类型[] = [
  {
    名称: '盾猛小节',
    技能序列: ['盾击', '盾击', '盾击', '盾击', '盾猛', '盾飞', '斩刀', '血怒%{\"延迟\":20}', '绝刀', '绝刀', '盾回%{\"延迟\":20}'],
    color: 'blue',
  },
  {
    名称: '阵云小节',
    技能序列: ['盾击', '盾击', '盾击', '盾飞', '阵云结晦', '月照连营', '雁门迢递', '斩刀', '绝刀', '绝刀', '盾回%{\"延迟\":20}'],
    color: 'magenta',
  },
  {
    名称: '业火小节',
    技能序列: ['盾击', '盾击', '盾击', '盾击', '业火麟光', '盾飞', '血怒%{\"延迟\":20}', '阵云结晦', '斩刀', '绝刀', '绝刀', '斩刀', '绝刀', '绝刀', '盾回%{\"延迟\":20}'],
    color: 'purple',
  },
  {
    名称: '盾压小节',
    技能序列: ['盾击', '盾击', '盾击', '盾猛', '盾压', '盾飞', '斩刀', '绝刀', '绝刀', '盾回%{\"延迟\":20}'],
    color: 'volcano',
  },
  // {
  //   名称: '业火橙武',
  //   技能序列: ['盾击', '盾击', '盾击', '盾击', '盾击', '业火麟光', '盾飞', '血怒%{\"延迟\":20}', '斩刀', '绝刀', '绝刀', '斩刀', '绝刀', '绝刀', '触发橙武%{\"延迟\":20}', '绝刀', '绝刀', '绝刀', '绝刀', '盾回%{\"延迟\":20}', '换行', '盾击', '盾飞', '斩刀', '盾回%{\"延迟\":20}', '盾击', '盾击', '盾飞', '血怒%{\"延迟\":20}', '绝刀', '绝刀', '盾回%{\"延迟\":20}'],
  //   color: 'red',
  // },

  // {
  //   名称: '一分钟',
  //   技能序列: ['盾击', '盾击', '盾击', '盾击', '业火麟光', '盾飞', '血怒%{\"延迟\":20}', '阵云结晦', '斩刀', '绝刀', '绝刀', '斩刀', '绝刀', '绝刀', '盾回%{\"延迟\":20}',
  //     '盾击', '盾击', '盾击', '盾击', '盾猛', '盾飞', '斩刀', '血怒%{\"延迟\":20}', '绝刀', '绝刀', '盾回%{\"延迟\":20}',
  //     '盾击', '盾击', '盾击', '盾飞', '月照连营', '雁门迢递', '斩刀', '绝刀', '绝刀', '盾回%{\"延迟\":20}',
  //     '盾击', '盾击', '盾击', '盾击', '盾猛', '盾飞', '斩刀', '血怒%{\"延迟\":20}', '绝刀', '绝刀', '盾回%{\"延迟\":20}',
  //     '盾击', '盾击', '盾击', '盾飞', '阵云结晦', '月照连营', '斩刀', '绝刀', '绝刀', '盾回%{\"延迟\":20}',
  //     '盾击', '盾击', '盾击', '盾猛', '盾压', '盾飞', '斩刀', '绝刀', '绝刀', '盾回%{\"延迟\":20}',],
  //   color: 'green',
  // },

]

export interface 快捷添加数据类型 {
  名称: string
  技能序列: string[]
  color?: string
}
