import { Buff枚举, 循环基础技能数据类型, 日志类型 } from '../simulator/type'
import { 基础GCD帧 } from '.'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 通用Buff数据, 通用循环模拟技能基础数据 } from '../../通用/通用技能/通用技能定义'

// 技能图标引入

const 循环模拟技能基础数据: 循环基础技能数据类型[] = [
  ...(通用循环模拟技能基础数据 as any),
  {
    技能名称: '战八方',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 0,
    技能GCD组: '公共',
    技能类型: '游龙骑法',
    图标: 'https://icon.jx3box.com/icon/643.png',
  },
  {
    技能名称: '穿云',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 2, //原始2 秘籍-0.5 cooldown 91 min 0 吃加速
    技能GCD组: '公共',
    技能类型: '羽林枪法',
    图标: 'https://icon.jx3box.com/icon/648.png',
  },
  {
    技能名称: '龙吟',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 8, //原始8 秘籍-1 cooldown 150 min 8 不吃加速
    技能GCD组: '公共',
    图标: 'https://icon.jx3box.com/icon/650.png',
    技能类型: '羽林枪法',
  },
  {
    技能名称: '龙牙',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 1.5, // cooldown 97 min 0 吃加速
    技能GCD组: '公共',
    技能类型: '羽林枪法',
    图标: 'https://icon.jx3box.com/icon/637.png',
  },
  {
    技能名称: '撼如雷',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 30, // cooldown 94 min 94 不吃加速
    技能GCD组: '自身',
    技能类型: '爆发',
    图标: 'https://icon.jx3box.com/icon/635.png',
  },
  //{
  //技能名称: '渊',
  //技能释放后添加GCD: 基础GCD帧,
  //技能CD: 每秒郭氏帧 * 30, // cooldown 448 min 448 不吃加速
  //技能GCD组: '自身',
  //显示类型: '奇穴技能',
  //技能类型: '爆发',
  //图标: 'https://icon.jx3box.com/icon/2985.png',
  //},
  {
    技能名称: '突',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 18, // cooldown 98 min 18 不吃加速
    技能GCD组: '自身',
    技能类型: '奔雷枪术',
    图标: 'https://icon.jx3box.com/icon/638.png',
  },
  {
    技能名称: '灭',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 8, // 原始8 秘籍-1 cooldown 101 min 8 不吃加速
    技能GCD组: '公共',
    技能类型: '奔雷枪术',
    图标: 'https://icon.jx3box.com/icon/636.png',
  },
  {
    技能名称: '任驰骋',
    技能释放后添加GCD: 基础GCD帧,
    最大充能层数: 2,
    技能CD: 每秒郭氏帧 * 40, // cooldown 108 min 40 不吃加速
    技能GCD组: '公共',
    技能类型: '游龙骑法',
    图标: 'https://icon.jx3box.com/icon/640.png',
  },
  {
    技能名称: '断魂刺',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25, // 原始25 秘籍-2  cooldown 105 min 25 不吃加速
    技能GCD组: '自身',
    技能类型: '游龙骑法',
    图标: 'https://icon.jx3box.com/icon/642.png',
  },
  {
    技能名称: '下马',
    技能释放后添加GCD: 0,
    技能CD: 0,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/1899.png',
    说明: '施展后主动下马',
  },
  {
    技能名称: '乘龙箭',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 30,
    技能GCD组: '公共',
    技能类型: '游龙骑法',
    是否为读条技能: true,
    图标: 'https://icon.jx3box.com/icon/2987.png',
    说明: '骑乘状态下施展，运功0.5秒，命中回复1点战意并使目标破甲10秒',
  },
  {
    技能名称: '触发橙武',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 50,
    技能GCD组: '自身',
    技能类型: '其他',
    显示类型: '大橙武模拟',
    图标: 'https://icon.jx3box.com/icon/2589.png',
  },
  {
    技能名称: '换行',
    技能释放后添加GCD: 0,
    技能CD: 0,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://img.jx3box.com/image/school/天策.png',
    说明: '插入换行将只以”换行“作为展示换行',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
  '循环异常',
]

export enum 技能GCD组 {
  公共,
  自身,
  换箭,
}

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  // Buff
  骑御: {
    类型: '自身',
    名称: '骑御',
    最大层数: 1,
    图标: 'https://icon.jx3box.com/icon/1899.png',
    备注: '以骑乘体态起手',
  },
  穿云链: {
    // 12284
    类型: '自身',
    名称: '穿云链',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/648.png',
    备注: '用于判定穿云一二段表现区分',
  },
  龙驭: {
    类型: '自身',
    名称: '龙驭',
    最大层数: 25,
    最大持续时间: 9999,
    图标: 'https://icon.jx3box.com/icon/13434.png',
    备注: '“骑御”期间每次施展龙牙会消耗一层“龙驭”本次龙牙伤害提高30%。',
  },
  龙印: {
    类型: '自身',
    // 28169
    名称: '龙印',
    最大层数: 3,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/13430.png',
    备注: '叠加至3层时则“龙牙”不消耗“战意”',
  },
  牧云: {
    类型: '自身',
    名称: '牧云',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/642.png',
    备注: '每层使自身外功会心率提高6%，外功会心效果提高25%，无双等级提高20%',
  },
  破楼兰标记: {
    // 8433
    类型: '自身',
    名称: '破楼兰标记',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 8,
    图标: 'https://icon.jx3box.com/icon/4558.png',
    备注: '8秒内可再次施展“灭”，再次施展或标记到期后，“灭”开始调息',
  },
  任驰骋读条中: {
    类型: '自身',
    名称: '任驰骋读条中',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 12,
    图标: 'https://icon.jx3box.com/icon/640.png',
    备注: '任驰骋读条中',
  },
  '驰骋·1': {
    类型: '自身',
    名称: '驰骋·1',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/640.png',
    备注: '描述 外功基础攻击提高15%并降低50%威胁值',
  },
  '驰骋·2': {
    类型: '自身',
    名称: '驰骋·2',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 15,
    图标: 'https://icon.jx3box.com/icon/640.png',
    备注: '描述 外功基础攻击提高30%并降低50%威胁值',
  },
  激雷: {
    类型: '自身',
    名称: '激雷',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/635.png',
    备注: '外功基础攻击力提高20%，外功会心几率提高30%，外功破防值提高20%',
  },
  夜征: {
    类型: '自身',
    名称: '夜征',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 12,
    图标: 'https://icon.jx3box.com/icon/635.png',
    备注: '外功会心几率提高30%，“激雷”效果持续期间自身无视目标70%外功防御，效果持续时间提高100%，期间“骑御”状态施展龙牙可额外消耗1层“龙驭”，造成一次额外伤害。',
  },
  //渊: {
  //类型: '自身',
  //名称: '渊',
  //最大层数: 1,
  //最大持续时间: 每秒郭氏帧 * 10,
  //图标: 'https://icon.jx3box.com/icon/2985.png',
  //备注: '使自身外功基础攻击力提高35%',
  //},
  破风: {
    类型: '目标',
    名称: '破风',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 14,
    图标: 'https://icon.jx3box.com/icon/647.png',
    备注: '击破目标护甲，使其外功防御等级降低280点',
  },
  破甲: {
    类型: '目标',
    名称: '破甲',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/2987.png',
    备注: '外功防御等级降低10%',
  },
  破军: {
    类型: '目标',
    名称: '破军',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 4,
    图标: 'https://icon.jx3box.com/icon/9521.png',
    备注: '受到该效果添加者招式攻击时额外触发一次外功伤害',
  },
  流血: {
    类型: '目标',
    名称: '流血',
    最大层数: 2,
    最大持续时间: 每秒郭氏帧 * 14,
    最大作用次数: 7,
    伤害频率: 32,
    图标: 'https://icon.jx3box.com/icon/647.png',
    备注: '每2秒造成一次伤害',
  },
  橙武: {
    类型: '自身',
    名称: '橙武',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/3111.png',
  },
  ...(通用Buff数据 as any),
}
