import type { 技能基础数据模型 } from '@/@types/技能'

import 通用增益 from './技能增益/通用增益/通用增益'
import { 获取破招实际系数 } from '../../统一数据/系数计算'
import 盾击增益 from './技能增益/盾击'
import 盾压增益 from './技能增益/盾压'
import 盾刀增益 from './技能增益/盾刀'
import 斩刀增益 from './技能增益/斩刀'
import 绝刀增益 from './技能增益/绝刀'
import 劫刀增益 from './技能增益/劫刀'
import 盾飞增益 from './技能增益/盾飞'
import 盾舞增益 from './技能增益/盾舞'
import 血怒增益 from './技能增益/血怒'
import { 属性类型 } from '@/@types/属性'
import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '32745',
    技能名称: '破',
    统计名称: '破',
    技能伤害系数: 获取破招实际系数(-629145.6),
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 获取破招实际系数(-629145.6) },
      2: { 技能伤害系数: 获取破招实际系数(-854453.12512) },
      3: { 技能伤害系数: 获取破招实际系数(-314572.80000000005) },
      4: { 技能伤害系数: 获取破招实际系数(-766215.45472) },
      5: { 技能伤害系数: 获取破招实际系数(-209715.19999999995) },
      6: { 技能伤害系数: 获取破招实际系数(-104857.59999999998) },
      7: { 技能伤害系数: 获取破招实际系数(-815628.550144) },
      8: { 技能伤害系数: 获取破招实际系数(-709743.345664) },
      9: {
        技能伤害系数: 获取破招实际系数(645587.2716800002),
        技能增益列表: [
          {
            增益名称: '技能无视',
            增益启用: true,
            增益所在位置: '技能',
            增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
            增益类型: '全局启用',
          },
          ...通用增益,
        ],
      },
    },
  },
  {
    技能ID: '37448',
    技能名称: '破·麟光',
    是否为破招伤害: true,
    技能伤害系数: 获取破招实际系数(-913513.5391744),
    技能增益列表: 通用增益,
  },
  {
    技能ID: '38890',
    技能名称: '破·绝刀惊涌',
    统计名称: '破',
    是否为破招伤害: true,
    技能伤害系数: 获取破招实际系数(-709743.345664),
    技能增益列表: [
      ...通用增益,
      {
        // 9889
        增益名称: '刀煞',
        增益所在位置: '奇穴',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
      },
    ],
    技能等级数据: {
      1: { 技能伤害系数: 获取破招实际系数(-709743.345664) },
      2: { 技能伤害系数: 获取破招实际系数(-641976.8147968) },
      3: { 技能伤害系数: 获取破招实际系数(-574210.2839295999) },
      4: { 技能伤害系数: 获取破招实际系数(-506443.7530623999) },
      5: { 技能伤害系数: 获取破招实际系数(-438677.2221951999) },
    },
  },
  {
    技能ID: '38889',
    技能名称: '破·绝刀',
    统计名称: '破',
    是否为破招伤害: true,
    技能伤害系数: 获取破招实际系数(-766215.45472),
    技能等级数据: {
      1: { 技能伤害系数: 获取破招实际系数(-766215.45472) },
      2: { 技能伤害系数: 获取破招实际系数(-709743.345664) },
      3: { 技能伤害系数: 获取破招实际系数(-653271.236608) },
      4: { 技能伤害系数: 获取破招实际系数(-596799.1275519999) },
      5: { 技能伤害系数: 获取破招实际系数(-540327.018496) },
    },
    技能增益列表: [
      ...通用增益,
      {
        // 9889
        增益名称: '刀煞',
        增益所在位置: '奇穴',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
      },
    ],
  },
  {
    技能ID: '38971',
    技能名称: '破·盾舞',
    统计名称: '破',
    是否为破招伤害: true,
    技能伤害系数: 获取破招实际系数(-914882.56),
    技能等级数据: {
      1: { 技能伤害系数: 获取破招实际系数(-914882.56) },
      2: { 技能伤害系数: 获取破招实际系数(-888143.872) },
    },
    技能增益列表: 通用增益,
  },
  {
    技能ID: '36065',
    技能名称: '击破·援戈',
    是否为破招伤害: true,
    技能伤害系数: 获取破招实际系数(-862207.34464),
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 获取破招实际系数(-862207.34464) },
      2: { 技能伤害系数: 获取破招实际系数(-901235.1336448) },
      3: { 技能伤害系数: 获取破招实际系数(-901235.1336448) },
      4: { 技能伤害系数: 获取破招实际系数(-925791.944704) },
      5: { 技能伤害系数: 获取破招实际系数(-925791.944704) },
    },
  },
  {
    技能ID: '13039',
    技能名称: '卷雪刀',
    技能伤害系数: 24,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  // 盾击一段、二段、三段系数相同，仅有基础伤害不同，该现象为过去北漠奇穴盾击连续释放增伤的残留
  // 盾击三段
  {
    技能ID: '13161',
    技能名称: '盾击·二',
    统计名称: '盾击',
    技能伤害系数: 307.0,
    基础伤害_基础值: 312,
    基础伤害_浮动值: 31,
    武器伤害系数: 1,
    技能增益列表: 盾击增益,
  },
  // 盾击一段
  {
    技能ID: '13106',
    技能名称: '盾击·正常',
    统计名称: '盾击',
    技能伤害系数: 307.0,
    基础伤害_基础值: 104,
    基础伤害_浮动值: 10,
    武器伤害系数: 1,
    技能增益列表: 盾击增益,
  },
  // 盾击二段
  {
    技能ID: '13160',
    技能名称: '盾击·正常换动作',
    统计名称: '盾击',
    技能伤害系数: 307.0,
    基础伤害_基础值: 208,
    基础伤害_浮动值: 20,
    武器伤害系数: 1,
    技能增益列表: 盾击增益,
  },
  {
    技能ID: '13099',
    技能名称: '盾猛',
    技能伤害系数: 1003.08,
    基础伤害_基础值: 130,
    基础伤害_浮动值: 12,
    武器伤害系数: 1,
    技能增益列表: [
      ...通用增益,
      {
        // 9889
        增益名称: '赴敌',
        增益所在位置: '奇穴',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
      },
    ],
  },
  {
    技能ID: '19409',
    技能名称: '盾压',
    技能伤害系数: 575.9,
    基础伤害_基础值: 202,
    基础伤害_浮动值: 18,
    武器伤害系数: 1,
    技能增益列表: 盾压增益,
  },
  {
    技能ID: '13044',
    技能名称: '盾刀·一',
    秘籍依赖技能: '盾刀',
    基础伤害_基础值: 130,
    基础伤害_浮动值: 15,
    技能伤害系数: 225,
    武器伤害系数: 1,
    技能增益列表: 盾刀增益,
  },
  {
    技能ID: '13244',
    技能名称: '盾刀·二',
    秘籍依赖技能: '盾刀',
    基础伤害_基础值: 130,
    基础伤害_浮动值: 15,
    技能伤害系数: 158 * 1.05 * 1.05 * 1.85,
    武器伤害系数: 1,
    技能增益列表: 盾刀增益,
  },
  {
    技能ID: '13060',
    技能名称: '盾刀·三',
    秘籍依赖技能: '盾刀',
    基础伤害_基础值: 130,
    基础伤害_浮动值: 15,
    技能伤害系数: 120 * 1.05 * 1.05 * 1.1 * 1.85,
    武器伤害系数: 1,
    技能增益列表: 盾刀增益,
  },
  {
    技能ID: '13075',
    技能名称: '绝刀',
    统计名称: '绝刀',
    秘籍依赖技能: '绝刀',
    技能伤害系数: 668.0021400000002,
    基础伤害_基础值: 180,
    基础伤害_浮动值: 12,
    武器伤害系数: 1,
    技能增益列表: 绝刀增益,
  },
  {
    技能ID: '13092',
    技能名称: '斩刀',
    统计名称: '斩刀',
    秘籍依赖技能: '斩刀',
    技能伤害系数: 1197.3536640000002,
    基础伤害_基础值: 228,
    基础伤害_浮动值: 10,
    武器伤害系数: 1,
    技能增益列表: 斩刀增益,
  },
  {
    技能ID: '28479',
    技能名称: '劫刀',
    统计名称: '劫刀',
    秘籍依赖技能: '劫刀',
    技能伤害系数: 317 * 1.09 * 1.3 * 1.6 * 1.08,
    基础伤害_基础值: 110,
    基础伤害_浮动值: 29,
    武器伤害系数: 1,
    技能增益列表: 劫刀增益,
  },
  {
    技能ID: '13453',
    技能名称: '闪刀',
    统计名称: '闪刀',
    秘籍依赖技能: '闪刀',
    技能伤害系数: 160 * 0.9 * 1.05 * 1.05 * 1.06 * 1.77 * 1.3 * 2 * 1.08,
    基础伤害_基础值: 150,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '38973',
    技能名称: '盾舞',
    技能伤害系数: 156,
    基础伤害_基础值: 325,
    基础伤害_浮动值: 30,
    武器伤害系数: 1,
    技能增益列表: 盾舞增益,
  },

  {
    技能ID: '13463',
    技能名称: '盾飞',
    技能伤害系数: 27 * 1 * 1.2 * 2,
    基础伤害_基础值: 24,
    基础伤害_浮动值: 2,
    武器伤害系数: 1,
    技能增益列表: 盾飞增益,
  },
  {
    技能ID: '29188', // 8249_29188
    技能名称: '流血(DOT)',
    统计名称: '流血(DOT)',
    技能伤害系数: 70 * 1.5 * 2 * 1.05 * 1.1 * 1.2 * 0.7 * 0.6,
    DOT生效间隔: 32,
    DOT跳数: 13,
    基础伤害_基础值: 47,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '29187', // 8249_29187
    技能名称: '流血(DOT)·登锋',
    统计名称: '流血(DOT)',
    技能伤害系数: 70 * 1.5 * 2 * 1.05 * 1.1 * 1.2 * 0.7 * 0.6,
    DOT生效间隔: 16,
    DOT跳数: 26,
    基础伤害_基础值: 47,
    技能增益列表: [
      ...通用增益,
      {
        增益名称: '登锋',
        依赖奇穴: '登锋',
        增益所在位置: '奇穴',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.系数增伤, 值: 1.8 }],
      },
    ],
  },
  {
    技能ID: '25780',
    技能名称: '盾击·神兵',
    技能伤害系数: 50,
    基础伤害_浮动值: 2,
    技能增益列表: 通用增益,
  },

  {
    技能ID: '30925',
    技能名称: '阵云结晦',
    统计名称: '阵云结晦',
    技能伤害系数: 588.6,
    基础伤害_基础值: 72,
    基础伤害_浮动值: 2,
    武器伤害系数: 1,
    技能增益列表: [
      ...通用增益,
      {
        增益名称: '技能无视',
        增益启用: true,
        增益所在位置: '技能',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
      },
      {
        增益名称: '技能非侠',
        增益启用: true,
        增益所在位置: '技能',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.非侠增伤, 值: 2048 / 1024 }],
      },
    ],
  },
  {
    技能ID: '30926',
    技能名称: '月照连营',
    统计名称: '阵云结晦',
    技能伤害系数: 735.75,
    基础伤害_基础值: 96,
    基础伤害_浮动值: 3,
    武器伤害系数: 1,
    技能增益列表: [
      ...通用增益,
      {
        增益名称: '技能无视',
        增益启用: true,
        增益所在位置: '技能',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
      },
      {
        增益名称: '技能非侠',
        增益启用: true,
        增益所在位置: '技能',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.非侠增伤, 值: 2048 / 1024 }],
      },
    ],
  },
  {
    技能ID: '30857',
    技能名称: '雁门迢递',
    统计名称: '阵云结晦',
    技能伤害系数: 882.9000000000001,
    基础伤害_基础值: 120,
    基础伤害_浮动值: 9,
    武器伤害系数: 1,
    技能增益列表: [
      ...通用增益,
      {
        增益名称: '技能无视',
        增益启用: true,
        增益所在位置: '技能',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -1024 }],
      },
      {
        增益名称: '技能非侠',
        增益启用: true,
        增益所在位置: '技能',
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.非侠增伤, 值: 2048 / 1024 }],
      },
    ],
  },
  {
    技能ID: '34673',
    技能名称: '业火焚城',
    武器伤害系数: 1,
    技能增益列表: 通用增益,
    技能等级数据: {
      1: { 技能伤害系数: 2800 }, // 铁骨业火焚城
      2: { 技能伤害系数: 3976 }, // 分山业火焚城
    },
  },
  {
    技能ID: '34674',
    技能名称: '麟光甲寒',
    技能伤害系数: 588.9312000000001,
    基础伤害_基础值: 80,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '36482',
    技能名称: '援戈·血影',
    技能伤害系数: 1159.7175,
    基础伤害_基础值: 80,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '36482',
    技能名称: '援戈',
    技能伤害系数: 773.145,
    基础伤害_基础值: 80,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '37253',
    技能名称: '麾远',
    技能伤害系数: 475.99999999999994,
    基础伤害_基础值: 80,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: [
      ...通用增益,
      {
        // 9889
        增益名称: '技能无视',
        增益所在位置: '技能',
        增益启用: true,
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.郭氏外功基础防御, 值: -307 }],
      },
    ],
  },
  {
    技能ID: '38651',
    技能名称: '过涯',
    技能伤害系数: 132,
    基础伤害_基础值: 54,
    基础伤害_浮动值: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '13040',
    技能名称: '血怒',
    技能伤害系数: 0,
    技能增益列表: 血怒增益,
  },
  {
    技能ID: '33097',
    技能名称: '血誓',
    秘籍依赖技能: '绝刀',
    技能伤害系数: 162,
    基础伤害_基础值: 80,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 绝刀增益,
  },
  {
    技能ID: '33097', //等级1
    技能名称: '血壑',
    技能伤害系数: 162 * 1.5,
    基础伤害_基础值: 80,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '33097', //等级4
    技能名称: '惊涌',
    技能伤害系数: 1263.6000000000001,
    基础伤害_基础值: 80,
    基础伤害_浮动值: 15,
    武器伤害系数: 1,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '25215',
    技能名称: '断马摧城',
    技能伤害系数: 2685.8660400000003,
    基础伤害_基础值: 120,
    基础伤害_浮动值: 6,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '13206',
    技能名称: '撼地',
    技能伤害系数: 100,
    基础伤害_基础值: 100,
    基础伤害_浮动值: 10,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '41835',
    技能名称: '陷阵',
    技能伤害系数: 774,
    技能增益列表: 通用增益,
  },
  {
    技能ID: '41902',
    技能名称: '地坼',
    技能伤害系数: 774,
    基础伤害_基础值: 5750,
    基础伤害_浮动值: 229,
    技能增益列表: 盾击增益,
  },
  {
    技能ID: '41739',
    技能名称: '崩血',
    技能伤害系数: 297.5,
    技能增益列表: 通用增益,
  },
  // ===============
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
}

export { 技能增益 }
