import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import 获取快照增益 from '@/心法模块/统一数据/快照增益'

const 通用增益: 技能增益列表类型[] = [
  ...获取快照增益(),
  {
    BuffId: 32664,
    增益名称: '离火真煌',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [
      { 属性: 属性类型.全会心等级, 值: 1634 },
      { 属性: 属性类型.全会心效果等级, 值: 602 },
    ],
  },
  {
    // 10615
    增益名称: '非侠',
    增益所在位置: '职业',
    增益启用: true,
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.非侠增伤, 值: 154 / 1024 }],
  },
  // 曾经你也是大家的小宝贝祝祷兄
  // {
  //   BuffId: 18176,
  //   增益名称: '祝祷',
  //   增益所在位置: '奇穴',
  //   增益类型: '部分启用',
  //   增益集合: [{ 属性: 属性类型.通用增伤, 值: 102 / 1024 }],
  // },
  {
    BuffId: 18021,
    增益名称: '荧入白',
    增益所在位置: '奇穴',
    增益类型: '部分启用',
    增益集合: [
      { 属性: 属性类型.郭氏全无视防御, 值: 512 },
      { 属性: 属性类型.郭氏无双, 值: 205 },
    ],
  },
  {
    BuffId: 18021_1,
    增益名称: '荧入白_快照',
    依赖奇穴: '荧入白',
    增益所在位置: '奇穴',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏无双, 值: 205 }],
  },
  {
    BuffId: 18021_2,
    增益名称: '荧入白_常驻',
    依赖奇穴: '荧入白',
    增益所在位置: '奇穴',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏全无视防御, 值: 512 }],
  },
  // 鬼遁兄，我会记住你为衍天做出的贡献的
  // {
  //   BuffId: 18174,
  //   增益名称: '鬼遁',
  //   增益所在位置: '奇穴',
  //   增益类型: '部分启用',
  //   增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 308 }],
  // },
  {
    // BuffId: 31907,
    增益名称: '镇星',
    增益所在位置: '奇穴',
    依赖奇穴: '镇星入舆',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 184 }],
  },
  // BuffId: 28878,
  {
    增益名称: '镇星环',
    增益所在位置: '奇穴',
    依赖奇穴: '镇星入舆',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.技能独立增伤, 值: 512 / 1024 }],
  },
  // 亲爱的双会已经离我们远去
  // {
  //   BuffId: 31805,
  //   增益名称: '明灯',
  //   增益所在位置: '奇穴',
  //   依赖奇穴: '列宿游',
  //   增益类型: '部分启用',
  //   增益集合: [{ 属性: 属性类型.郭氏全会心效果等级, 值: 205 }],
  // },
  {
    // 山卦增伤：御前星专用
    增益名称: '山卦增伤',
    增益所在位置: '奇穴',
    依赖奇穴: '御前星',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.技能独立增伤, 值: 154 / 1024 }],
  },
  // 要是苍生铸世还有你该多好啊神元
  // {
  //   增益名称: '神元',
  //   增益所在位置: '奇穴',
  //   是否常驻面板: true,
  //   增益类型: '全局启用',
  //   增益集合: [{ 属性: 属性类型.郭氏元气, 值: 102 }],
  // },
  // 再也不能猴你了龙马出河
  // {
  //   BuffId: 18039,
  //   增益名称: '龙马出河',
  //   增益所在位置: '奇穴',
  //   依赖奇穴: '龙马出河',
  //   增益类型: '部分启用',
  //   增益集合: [{ 属性: 属性类型.通用增伤, 值: 102 / 1024 }],
  // },
]

export default 通用增益
