import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 沾衣未妨悟 extends 有CD技能通用类 {
  // 持续4s，每秒1跳，共4跳
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '沾衣未妨·悟')
  static 作用次数 = 4
  static 作用间隔 = 16
  static 首次间隔 = 0

  constructor(模拟循环) {
    super(模拟循环)
    this.初始化技能运行数据()
    沾衣未妨悟.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '沾衣未妨·悟')
  }

  命中() {
    this.对阵招式橙武减少绝技技能CD()
    this.减少苍棘缚地CD(32)
    this.保存释放记录('沾衣未妨·悟')
    this.沾衣未妨持续伤害()
  }

  沾衣未妨持续伤害() {
    const 待生效事件队列: 待生效事件[] = []
    const 作用次数 = 沾衣未妨悟.作用次数
    for (let i = 0; i < 作用次数; i++) {
      待生效事件队列.push({
        事件名称: '沾衣未妨',
        事件时间: this.模拟循环.当前时间 + 沾衣未妨悟.首次间隔 + 沾衣未妨悟.作用间隔 * (i + 1),
        事件备注: {
          技能名称: '沾衣未妨·悟',
        },
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  沾衣未妨结算() {
    this.改变温寒(-1, '沾衣未妨·悟')
    this.触发伤害行为('沾衣未妨·悟')
    // 联动苍棘缚地：沾衣每跳触发苍棘缚地额外攻击（最多2次）
    this.模拟循环.技能类实例集合?.['苍棘缚地·悟']?.沾衣触发额外攻击?.()
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表([]),
    }
  }
}

export default 沾衣未妨悟

export const 沾衣未妨悟类型 = typeof 沾衣未妨悟
