import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import 通用增益 from './通用增益/通用增益'

const 突增益: 技能增益列表类型[] = [
  ...通用增益,
  {
    增益名称: '4%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 41 / 1024 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
  {
    增益名称: '突通用',
    增益所在位置: '技能',
    增益类型: '全局启用',
    增益启用: true,
    增益集合: [{ 属性: 属性类型.郭氏外功基础攻击, 值: -1024 }],
  },
]

export default 突增益
