import { 获取倒读条实际帧数分布 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'
import { 待生效事件 } from '../../type'
import { ERROR_ACTION } from '../../utils'
import { 数组求和 } from '@/工具函数/help'

class 御前星 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '御前星')
  static 作用总间隔 = 0
  static 实际作用总间隔 = 80
  static 作用间隔帧 = 4
  static 作用次数 = 24
  static 实际作用次数 = 24
  static 释放重置 = false
  static 人为断读条损耗 = 0

  constructor(模拟循环) {
    super(模拟循环)
    御前星.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '御前星')
    this.初始化技能运行数据()
  }

  释放() {
    const 当前层数 = this.模拟循环.当前自身buff列表?.['星芒']?.当前层数 || 0
    if (!当前层数 || 当前层数 < 御前星.作用次数) {
      return {
        可以释放: false,
        异常信息: ERROR_ACTION.BUFF错误,
      }
    }

    return { 可以释放: true }
  }

  释放前初始化(额外信息) {
    const 当前层数 = this.模拟循环.当前自身buff列表?.['星芒']?.当前层数 || 0
    const 实际作用次数 = 额外信息?.作用次数 || 当前层数 || 0
    御前星.作用次数 = 当前层数 || 0
    御前星.实际作用次数 = 实际作用次数
    御前星.作用总间隔 = 4 * 当前层数
    御前星.实际作用总间隔 = 4 * 实际作用次数
  }

  获取读条时间() {
    // 根据加速修改实际读条帧
    let 读条持续时间 = this.模拟循环.获取衍天实际帧数(御前星.作用总间隔)

    御前星.人为断读条损耗 = 0
    if (御前星.实际作用次数 < 御前星.作用次数) {
      御前星.人为断读条损耗 = this.模拟循环.断御前星延迟
      const 实际作用分布 = this.获取御前星作用分布() // 实际持续读条时间应用总读条时间计算加速后截断
      读条持续时间 = 数组求和(实际作用分布)
    }
    return 读条持续时间 + 御前星.人为断读条损耗
  }

  读条(读条开始时间) {
    // 开始读条
    this.读条御前星(读条开始时间)
    this.保存释放记录('御前星')
  }

  获取御前星作用分布() {
    const 循环加速值 = this.模拟循环.获取实际加速值() || 0
    const 截断作用次数 = 御前星.实际作用次数
    const 作用分布 = 获取倒读条实际帧数分布(
      御前星.作用总间隔,
      御前星.作用间隔帧,
      循环加速值,
    )?.filter((_, index) => index < 截断作用次数)
    return 作用分布
  }

  读条御前星(读条开始时间) {
    const 待生效事件队列: 待生效事件[] = []
    const 作用分布 = this.获取御前星作用分布()
    let 已读条时间 = 0
    for (let i = 0; i < 作用分布.length; i++) {
      待生效事件队列.push({
        事件名称: '技能读条',
        事件时间: 读条开始时间 + 已读条时间 + 作用分布[i],
        事件备注: {
          技能名称: '御前星',
          是否为最后一跳: 作用分布.length - 1 === i,
        },
      })
      已读条时间 = 已读条时间 + 作用分布[i]
    }
    if (御前星.人为断读条损耗) {
      待生效事件队列.push({
        事件名称: '御前星人为损耗',
        事件时间: 读条开始时间 + 已读条时间 + 御前星.人为断读条损耗,
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件队列)
  }

  // 顺序不可随意更改
  读条命中() {
    this.触发伤害行为('御前星')
  }

  释放后() {
    this.模拟循环.卸除buff({ 名称: '星芒', 对象: '自身', 卸除层数: 御前星.实际作用次数 })
  }

  保存释放记录(名称) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['荧入白', '祝祷', '鬼遁', '镇星', '明灯']),
      特殊标记: 御前星.实际作用次数,
    }
  }
}

export default 御前星

export const 御前星类型 = typeof 御前星
