import { 属性类型 } from '@/@types/属性'

export default {
  装备列表: [
    {
      id: 111717,
      装备部位: '帽子',
      装备部位索引: '_1',
      当前精炼等级: 6,
      镶嵌孔数组: [
        { 镶嵌类型: 属性类型.内功破防等级, 镶嵌宝石等级: 8 },
        { 镶嵌类型: 属性类型.无双等级, 镶嵌宝石等级: 8 },
      ],
    },
    {
      id: 111723,
      装备部位: '衣服',
      装备部位索引: '_2',
      当前精炼等级: 6,
      镶嵌孔数组: [
        { 镶嵌类型: 属性类型.元气, 镶嵌宝石等级: 8 },
        { 镶嵌类型: 属性类型.全会心等级, 镶嵌宝石等级: 8 },
      ],
    },
    {
      id: 111699,
      装备部位: '腰带',
      装备部位索引: '_3',
      当前精炼等级: 6,
      镶嵌孔数组: [
        { 镶嵌类型: 属性类型.全会心等级, 镶嵌宝石等级: 8 },
        { 镶嵌类型: 属性类型.内功基础攻击, 镶嵌宝石等级: 8 },
      ],
    },
    {
      id: 111729,
      装备部位: '护腕',
      装备部位索引: '_4',
      当前精炼等级: 6,
      镶嵌孔数组: [
        { 镶嵌类型: 属性类型.无双等级, 镶嵌宝石等级: 8 },
        { 镶嵌类型: 属性类型.元气, 镶嵌宝石等级: 8 },
      ],
    },
    {
      id: 111711,
      装备部位: '下装',
      装备部位索引: '_5',
      当前精炼等级: 6,
      镶嵌孔数组: [
        { 镶嵌类型: 属性类型.内功基础攻击, 镶嵌宝石等级: 8 },
        { 镶嵌类型: 属性类型.全会心等级, 镶嵌宝石等级: 8 },
      ],
    },
    {
      id: 111777,
      装备部位: '鞋子',
      装备部位索引: '_6',
      当前精炼等级: 6,
      镶嵌孔数组: [
        { 镶嵌类型: 属性类型.内功基础攻击, 镶嵌宝石等级: 8 },
        { 镶嵌类型: 属性类型.内功破防等级, 镶嵌宝石等级: 8 },
      ],
    },
    {
      id: 49731,
      装备部位: '项链',
      装备部位索引: '_7',
      当前精炼等级: 6,
      镶嵌孔数组: [{ 镶嵌类型: 属性类型.无双等级, 镶嵌宝石等级: 8 }],
    },
    {
      id: 49737,
      装备部位: '腰坠',
      装备部位索引: '_8',
      当前精炼等级: 6,
      镶嵌孔数组: [{ 镶嵌类型: 属性类型.无双等级, 镶嵌宝石等级: 8 }],
    },
    {
      id: 49725,
      装备部位: '戒指',
      装备部位索引: '_9',
      当前精炼等级: 6,
      附魔: 16625,
      镶嵌孔数组: [],
    },
    {
      id: 49761,
      装备部位: '戒指',
      装备部位索引: '_10',
      当前精炼等级: 6,
      附魔: 16625,
      镶嵌孔数组: [],
    },
    {
      id: 46246,
      装备部位: '暗器',
      装备部位索引: '_11',
      当前精炼等级: 6,
      镶嵌孔数组: [{ 镶嵌类型: 属性类型.全会心等级, 镶嵌宝石等级: 8 }],
    },
    {
      id: 46268,
      装备部位: '武器',
      装备部位索引: '_12',
      当前精炼等级: 6,
      镶嵌孔数组: [
        { 镶嵌类型: 属性类型.内功基础攻击, 镶嵌宝石等级: 8 },
        { 镶嵌类型: 属性类型.元气, 镶嵌宝石等级: 8 },
        { 镶嵌类型: 属性类型.内功破防等级, 镶嵌宝石等级: 8 },
      ],
    },
  ],
  五彩石: '彩·急速·无双·激流(陆)',
  装备增益: {
    大附魔_伤帽: 0,
    大附魔_伤衣: 0,
    大附魔_伤腰: 0,
    大附魔_伤腕: 0,
    大附魔_伤鞋: 0,
  },
}
