export default {
  "装备基础属性": {
    "基础攻击": 54080,
    "破防等级": 72179,
    "无双等级": 77307,
    "会心等级": 64605,
    "会心效果等级": 17140,
    "全能等级": 0,
    "武器伤害_最小值": 3942,
    "武器伤害_最大值": 6570,
    "破招值": 960,
    "力道": 44,
    "元气": 9256,
    "身法": 44,
    "根骨": 44,
    "体质": 154324,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 10781,
    "装分": 576305
  },
  "装备镶嵌附魔属性": {
    "基础攻击": 12404,
    "破防等级": 4800,
    "无双等级": 8156,
    "会心等级": 2880,
    "会心效果等级": 960,
    "全能等级": 0,
    "武器伤害_最小值": 0,
    "武器伤害_最大值": 0,
    "破招值": 960,
    "力道": 44,
    "元气": 596,
    "身法": 44,
    "根骨": 44,
    "体质": 45,
    "基础气血上限": 160878,
    "额外气血上限": 0,
    "加速等级": 0
  },
  "装备列表": [
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSpunkBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104760,
      "装备部位": "帽子",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicCriticalDamagePowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104791,
      "装备部位": "衣服",
      "附魔": "无双+717"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicCriticalStrike",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104698,
      "装备部位": "腰带",
      "附魔": "无双+717"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104921,
      "装备部位": "护腕",
      "附魔": "无双+2401"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atSurplusValueBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104950,
      "装备部位": "下装",
      "附魔": "无双+2401"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 104729,
      "装备部位": "鞋子",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atStrainBase",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 42976,
      "装备部位": "项链"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 42988,
      "装备部位": "腰坠"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 43002,
      "装备部位": "戒指",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [],
      "当前精炼等级": 6,
      "id": 43002,
      "装备部位": "戒指",
      "附魔": "攻击+728"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atAllTypeCriticalStrike",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 6,
      "id": 41218,
      "装备部位": "暗器",
      "附魔": "元气+308"
    },
    {
      "镶嵌孔数组": [
        {
          "镶嵌类型": "atMagicAttackPowerBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atSpunkBase",
          "镶嵌宝石等级": 8
        },
        {
          "镶嵌类型": "atMagicOvercome",
          "镶嵌宝石等级": 8
        }
      ],
      "当前精炼等级": 8,
      "id": 40211,
      "装备部位": "武器",
      "附魔": "攻击+728"
    }
  ],
  "五彩石": "彩·无双·激流·月华(陆)",
  "装备增益": {
    "大附魔_伤帽": 2,
    "大附魔_伤衣": 2,
    "大附魔_伤腰": 2,
    "大附魔_伤腕": 2,
    "大附魔_伤鞋": 2,
    "常驻套装会心会效": 1,
    "套装技能": 1,
    "特效_2869": 1,
    "特效_2872": 1,
    "风特效腰坠": 2,
    "特效_2875": 2,
    "大橙武特效": 2
  }
}