import { 技能增益列表类型 } from '@/@types/技能'
import { 属性类型 } from '@/@types/属性'

export const 光明相会心增益: 技能增益列表类型 = {
  BuffId: 4423,
  Buff等级: 1,
  增益名称: '光明相',
  增益所在位置: '技能',
  增益类型: '部分启用',
  增益集合: [{ 属性: 属性类型.内功会心百分比, 值: 1 }],
}

const 光明相增益: 技能增益列表类型[] = [
  {
    增益名称: '减CD_10_1',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [],
  },
  {
    增益名称: '减CD_10_2',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [],
  },
  {
    增益名称: '减CD_10_3',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [],
  },
]

export default 光明相增益
