import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import { 通用日增益, 通用月增益 } from './通用增益/通用增益'
import { 明光日增益, 明光月增益 } from './通用增益/明光'
import { 光明相会心增益 } from './光明相'

export const 生死劫秘籍增益: 技能增益列表类型[] = [
  {
    增益名称: '5%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 51 / 1024 }],
  },
  {
    增益名称: '4%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 41 / 1024 }],
  },
  {
    增益名称: '3%伤害',
    增益所在位置: '秘籍',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 31 / 1024 }],
  },
]

export const 生死劫日增益: 技能增益列表类型[] = [
  ...通用日增益,
  明光日增益,
  ...生死劫秘籍增益,
  光明相会心增益,
]
export const 生死劫月增益: 技能增益列表类型[] = [
  ...通用月增益,
  明光月增益,
  ...生死劫秘籍增益,
  光明相会心增益,
]
