import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import { 通用日增益, 通用月增益 } from './通用增益/通用增益'

const 未衰减伤害因子: 技能增益列表类型 = {
  增益名称: '技能伤害因子',
  增益所在位置: '技能',
  增益类型: '全局启用',
  增益启用: true,
  增益集合: [{ 属性: 属性类型.全局伤害因子, 值: 0 }],
}

const 衰减伤害因子: 技能增益列表类型 = {
  ...未衰减伤害因子,
  增益集合: [{ 属性: 属性类型.全局伤害因子, 值: -961383 / 1048576 }],
}

export const 诛邪镇魔日增益: 技能增益列表类型[] = [...通用日增益, 未衰减伤害因子]

export const 诛邪镇魔日衰减增益: 技能增益列表类型[] = [...通用日增益, 衰减伤害因子]

export const 诛邪镇魔月增益: 技能增益列表类型[] = [...通用月增益, 未衰减伤害因子]

export const 诛邪镇魔月衰减增益: 技能增益列表类型[] = [...通用月增益, 衰减伤害因子]
