import { 属性类型 } from '@/@types/属性'
import { 技能增益列表类型 } from '@/@types/技能'
import 净世破魔击增益 from './净世破魔击'

const 诛邪镇魔增益: 技能增益列表类型[] = [
  ...净世破魔击增益,
  {
    // 25759
    BuffId: 25759,
    增益名称: '明光·日',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 184 }],
  },
  {
    // 25758
    BuffId: 25758,
    增益名称: '明光·月',
    增益所在位置: '技能',
    增益类型: '部分启用',
    增益集合: [{ 属性: 属性类型.郭氏内功基础攻击, 值: 184 }],
  },
  {
    增益名称: '技能伤害提高',
    增益启用: true,
    增益所在位置: '技能',
    增益类型: '全局启用',
    增益集合: [{ 属性: 属性类型.通用增伤, 值: 512 / 1024 }],
  },
]

export default 诛邪镇魔增益
