import 判断团队增益快照Buff from '@/数据/团队增益/tools'
import { 获取实际技能数据 } from '../../../通用/通用函数'
import 循环主类类型 from '../main'
import { 循环基础技能数据类型, 技能释放记录结果 } from '../type'

class 技能统一类 {
  模拟循环: 循环主类类型 = {} as any
  本次释放记录: 技能释放记录结果 = {}
  本次释放延迟: number | 'GCD' = 0

  constructor(模拟循环) {
    this.模拟循环 = 模拟循环
    return
  }

  检查GCD(索引, 当前技能?: 循环基础技能数据类型) {
    const 后一个技能 = this.模拟循环?.测试循环?.[索引 + 1]
    const GCD组 = 当前技能?.技能GCD组 === '自身' ? 当前技能?.技能名称 : 当前技能?.技能GCD组 || ''
    let GCD = this.模拟循环?.GCD组?.[GCD组] || 0
    let 等待GCD = 0
    if (this.本次释放延迟) {
      if (GCD组 === '公共') {
        GCD = GCD + this.本次释放延迟
      }
      // 如果存在后面的技能，判断后面的技能当前的GCD为多少，推进到后一个技能。这样可以让灭卡在后面的技能释放前释放
      else if (this.本次释放延迟 === 'GCD' && 后一个技能) {
        const 实际技能名称 = 获取实际技能数据(后一个技能)?.实际技能名称 || 后一个技能
        const 当前技能 = this?.模拟循环?.技能基础数据?.find(
          (item) => item?.技能名称 === 实际技能名称,
        )
        if (当前技能 && 当前技能?.技能GCD组) {
          const 技能实例 = this?.模拟循环?.技能类实例集合?.[当前技能?.技能名称]
          const 后一个技能GCD = this.模拟循环?.检查GCD?.(当前技能, 技能实例, 索引 + 1) || 0
          等待GCD = 后一个技能GCD
        }
      } else {
        等待GCD = Number(this.本次释放延迟)
      }
      if (等待GCD) {
        GCD = Math.max(等待GCD, GCD)
      }
    }
    this.本次释放延迟 = 0
    return GCD
  }

  统一初始化(额外信息) {
    if (额外信息?.延迟) {
      this.本次释放延迟 = 额外信息?.延迟
    }
    // 重置释放记录
    this.本次释放记录 = {}
  }

  触发伤害行为(
    伤害名称,
    伤害次数 = 1,
    额外增益列表: string[] = [],
    触发伤害时间: number | undefined = undefined,
    技能等级 = 1,
    快照buff列表: string[] = [],
  ) {
    // 判断玉枕
    const 增益列表 = [...额外增益列表]
    const 快照检测Buff列表 = [...快照buff列表]

    if (
      快照检测Buff列表?.includes('号令三军_快照_一鼓') &&
      !快照检测Buff列表?.includes('号令三军_快照_二鼓')
    ) {
      快照检测Buff列表.push('号令三军_快照_二鼓')
    }

    this.模拟循环.技能造成伤害?.(
      伤害名称,
      伤害次数,
      增益列表,
      触发伤害时间,
      false,
      技能等级,
      快照检测Buff列表,
    )
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
    }
  }

  获取当前重要buff列表(技能依赖自身buff列表: string[] = [], 技能依赖目标buff列表: string[] = []) {
    const 重要buff列表: string[] = []
    技能依赖自身buff列表.forEach((buff) => {
      if (this.模拟循环.当前自身buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    技能依赖目标buff列表.forEach((buff) => {
      if (this.模拟循环.当前目标buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    return 重要buff列表 || []
  }

  获取施加重要buff信息(buff名称) {
    const 当前时间 = this.模拟循环.当前时间 || 0
    const buff对象 = this.模拟循环.Buff和Dot数据?.[buff名称]

    return buff对象
      ? {
          buff名称: buff名称,
          buff开始时间: 当前时间,
          buff结束时间: 当前时间 + (buff对象?.最大持续时间 || 0),
        }
      : null
  }

  根据卦象触发伤害(伤害名称, ...rest) {
    const 当前卦象 = this.判断当前卦象()
    let 实际名称 = 伤害名称
    if (当前卦象) {
      实际名称 = `${实际名称}·${当前卦象}`
    }
    this.触发伤害行为(实际名称, ...rest)
  }

  获取卦象映射(枚举) {
    const 映射 = { 水: '卦象_水坎', 山: '卦象_山艮', 火: '卦象_火离' }
    return 映射[枚举]
  }

  判断当前卦象() {
    let 当前卦象 = ''
    if (this.模拟循环.当前自身buff列表?.['卦象_水坎']?.当前层数) {
      当前卦象 = '水'
    } else if (this.模拟循环.当前自身buff列表?.['卦象_山艮']?.当前层数) {
      当前卦象 = '山'
    } else if (this.模拟循环.当前自身buff列表?.['卦象_火离']?.当前层数) {
      当前卦象 = '火'
    }
    return 当前卦象
  }

  获得星运(星运值, 来源) {
    this.模拟循环.角色状态信息.星运 = Math.min(100, this.模拟循环.角色状态信息.星运 + 星运值)

    this.模拟循环.添加战斗日志?.({
      日志: `${来源} 触发获得星运值 ${星运值} 点`,
      日志类型: '技能释放结果',
    })
  }

  消耗星运(星运值, 来源) {
    this.模拟循环.角色状态信息.星运 = Math.max(0, this.模拟循环.角色状态信息.星运 - 星运值)

    this.模拟循环.添加战斗日志?.({
      日志: `${来源} 触发消耗星运值 ${星运值} 点`,
      日志类型: '技能释放结果',
    })
  }

  卦象清除() {
    this.模拟循环.卸除buff({ 名称: `卦象_水坎`, 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: `卦象_山艮`, 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: `卦象_火离`, 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: `祝由释放允许`, 对象: '自身' })
    this.模拟循环.卸除buff({ 名称: `荧入白`, 对象: '自身' })
  }

  连局判定() {
    return (
      this.模拟循环.当前目标buff列表['灯魂_0']?.当前层数 &&
      this.模拟循环.当前目标buff列表['灯魂_1']?.当前层数 &&
      this.模拟循环.当前目标buff列表['灯魂_2']?.当前层数
    )
  }

  灵器伤害() {
    if (this.模拟循环.校验奇穴是否存在('灵器') && this.连局判定()) {
      this.触发伤害行为('灵器')
    }
  }

  橙武伤害(伤害名称) {
    if (this.模拟循环.当前自身buff列表['橙武']?.当前层数) {
      this.触发伤害行为(伤害名称)
    }
  }

  水卦加速判断() {
    if (this.模拟循环.当前自身buff列表['卦象_水坎']?.当前层数) {
      this.模拟循环.添加buff({ 名称: '水卦加速', 对象: '自身' })
    }
  }

  刷新鬼遁(不判定连局 = false) {
    if (this.模拟循环.校验奇穴是否存在('鬼遁')) {
      if (不判定连局 || this.连局判定()) {
        this.模拟循环.添加buff({ 名称: '鬼遁', 对象: '自身' })
      }
    }
  }

  获取星芒() {
    if (this.模拟循环.校验奇穴是否存在('御前星')) {
      this.模拟循环.添加buff({ 名称: '星芒', 对象: '自身' })
    }
  }

  应卦震符触发判定() {
    if (!!this.模拟循环.当前自身buff列表?.['应卦震符']?.当前层数) {
      this.模拟循环.技能类实例集合?.['应卦震符']?.触发伤害()
    }
  }

  化卦坠符触发判定() {
    if (!!this.模拟循环.当前自身buff列表?.['化卦坠符']?.当前层数) {
      this.模拟循环.技能类实例集合?.['化卦坠符']?.触发伤害()
    }
  }

  获取当前快照buff() {
    const buff列表: string[] = []
    if (this?.模拟循环?.当前自身buff列表?.['荧入白']?.当前层数) {
      buff列表.push('荧入白_快照')
    }
    if (this?.模拟循环?.当前自身buff列表?.['祝祷']?.当前层数) {
      buff列表.push('祝祷')
    }
    if (this?.模拟循环?.当前自身buff列表?.['鬼遁']?.当前层数) {
      buff列表.push('鬼遁')
    }
    if (this?.模拟循环?.当前自身buff列表?.['镇星']?.当前层数) {
      buff列表.push('镇星')
    }
    if (this?.模拟循环?.当前自身buff列表?.['明灯']?.当前层数) {
      buff列表.push('明灯')
    }
    if (this?.模拟循环?.当前自身buff列表?.['龙马出河']?.当前层数) {
      buff列表.push('龙马出河')
    }

    // 团队增益快照
    if (this?.模拟循环?.启用团队增益快照) {
      const 团队增益buff列表 = 判断团队增益快照Buff({
        团队增益轴: this.模拟循环.团队增益轴,
        判定帧: this.模拟循环.当前时间 || 0,
      })

      if (团队增益buff列表?.length) {
        buff列表.push(...团队增益buff列表)
      }
    }

    return [...buff列表]
  }
}

export default 技能统一类
