export default [
  {
    version: '[暗影千机] 2.5.8',
    date: '2026-06-18 22:00:00',
    content: [
      '综合',
      <div>
        <p>- 更新粽子数值</p>
      </div>,
      '无方',
      <div>
        <p>- 优化模拟器回蓝逻辑</p>
      </div>,
      '凌海诀',
      <div>
        <p>- 新增紫武驾鸾循环</p>
      </div>,
      '太玄经',
      <div>
        <p>- 修复模拟器计算兵伤害作用间隔时没有计算水卦加速的BUG</p>
      </div>,
    ],
  },
  {
    version: '[暗影千机] 2.5.7',
    date: '2026-05-28 22:00:00',
    content: [
      '综合',
      <div>
        <p>- 更新云片糕、梅花糕、芝麻杆数值</p>
        <p>- 修复部分试炼无修项链的数值错误</p>
      </div>,
      '笑尘诀',
      <div>
        <p>- 更新雨龙贞固循环</p>
      </div>,
      '孤锋诀',
      <div>
        <p>- 新增橙武长短轴循环</p>
      </div>,
      '移动端_无方',
      <div>
        <p>- 移动端_无方模拟器</p>
      </div>,
    ],
  },
  {
    version: '[暗影千机] 2.5.6',
    date: '2026-05-22 00:00:00',
    content: [
      '综合',
      <div>
        <p>- 更新5月21日技改系数/非侠</p>
      </div>,
      '笑尘诀',
      <div>
        <p>- 更新贞固循环</p>
      </div>,
      '孤锋诀',
      <div>
        <p>- 新增紫武轮椅循环和进阶循环</p>
      </div>,
      '分山劲',
      <div>
        <p>- 优化了模拟器的交互体验</p>
      </div>,
      '凌海诀',
      <div>
        <p>- 更新了橙武循环</p>
      </div>,
      '太玄经',
      <div>
        <p>- 更新了新的橙武循环</p>
        <p>- 修改了模拟器的部分问题</p>
      </div>,
      '焚影圣诀',
      <div>
        <p>- 更新了新的紫武和橙武二段加速循环</p>
      </div>,
      '山海心诀',
      <div>
        <p>- 更新了模拟器连珠和领胡的Buff持续时间</p>
      </div>,
    ],
  },
  {
    version: '[暗影千机] 2.5.5',
    date: '2026-05-10 22:00:00',
    content: [
      '易筋经',
      <div>
        <p>- 修复部分模拟器异常</p>
        <p>- 生成了紫武、橙武、斩杀循环</p>
      </div>,
      '北傲诀',
      <div>
        <p>- 生成了紫武、橙武循环</p>
      </div>,
      '笑尘诀',
      <div>
        <p>- 新增两个一段加速贞固橙武循环</p>
      </div>,
      '无方',
      <div>
        <p>- 部分循环更新</p>
      </div>,
      '幽罗引',
      <div>
        <p>- 部分循环更新</p>
      </div>,
      '太玄经',
      <div>
        <p>- 新增特效武器循环和模拟器</p>
        <p>- 修复模拟器快照逻辑，重新生成各计算循环</p>
      </div>,
      '孤锋诀',
      <div>
        <p>- 新增橙武太奶循环</p>
      </div>,
    ],
  },
  {
    version: '[暗影千机] 2.5.4',
    date: '2026-05-07 06:15:00',
    content: [
      '综合',
      <div>
        <p>- 循环不满足加速/延迟无法计算时，增加了更明显的提示</p>
        <p>- 未启用增益计算时，增加了更明显的提示</p>
      </div>,
      '凌海诀',
      <div>
        <p>- 修复模拟器天行Buff持续时间的Bug</p>
        <p>- 重新生成了紫武、橙武循环</p>
      </div>,
      '周天功',
      <div>
        <p>- 重新生成了橙武循环</p>
      </div>,
      '易筋经',
      <div>
        <p>- 修复部分模拟器异常</p>
      </div>,
      '笑尘诀',
      <div>
        <p>- 计算循环新增了强制加速要求</p>
      </div>,
    ],
  },
  {
    version: '[暗影千机] 2.5.3',
    date: '2026-04-30 23:45:00',
    content: [
      '花间游',
      <div>
        <p>- 内置模拟器循环，内置计算循环</p>
      </div>,
      '凌海诀',
      <div>
        <p>- 修改天行系数</p>
      </div>,
      '周天功',
      <div>
        <p>- 同步非侠系数</p>
      </div>,
      '易筋经',
      <div>
        <p>- 修复部分模拟器异常</p>
      </div>,
      '天罗诡道',
      <div>
        <p>- 内置紫武计算循环</p>
      </div>,
      '无方',
      <div>
        <p>- 更新疾根橙武循环</p>
      </div>,
      '幽罗引',
      <div>
        <p>- 移除拘意伤害</p>
      </div>,
    ],
  },
  {
    version: '[暗影千机] 2.5.2',
    date: '2026-04-27 21:15:00',
    content: [
      '综合',
      <div>
        <p>- 部分模拟器内部逻辑优化</p>
      </div>,
      '易筋经',
      <div>
        <p>- 完成模拟器开发，暂无内置循环</p>
      </div>,
      '天罗诡道',
      <div>
        <p>- 内置临时计算循环</p>
      </div>,
      '山海心诀',
      <div>
        <p>- 更新2段加速0延迟循环</p>
      </div>,
      '毒经',
      <div>
        <p>- 修复部分循环</p>
      </div>,
    ],
  },
  {
    version: '[暗影千机] 2.5.1',
    date: '2026-04-25 21:15:00',
    content: [
      '综合',
      <div>
        <p>- 更新 昆吾·弦刃·英雄/刃凌·英雄/无修·天/巽/速·震 的伤害系数</p>
        <p>- 凌海诀 / 紫霞功 / 周天功 / 山海心诀 / 笑尘诀 / 毒经模块开放计算</p>
        <p>- 修复计算增益时计算了阆风仙玉附魔的Bug</p>
        <p>- 部分门派已初步可用</p>
        <p>- 其余门派还没完全开发完成，请耐心等待</p>
      </div>,
      '山海心诀',
      <div>
        <p>- 完成计算循环、模拟器开发</p>
      </div>,
      '周天功',
      <div>
        <p>- 完成计算循环、模拟器开发</p>
      </div>,
      '凌海诀',
      <div>
        <p>- 完成计算循环、模拟器开发</p>
      </div>,
      '毒经',
      <div>
        <p>- 完成计算循环、模拟器开发</p>
      </div>,
      '笑尘诀',
      <div>
        <p>- 完成计算循环</p>
      </div>,
      '紫霞功',
      <div>
        <p>- 完成计算循环</p>
      </div>,
      '孤锋诀',
      <div>
        <p>- 应循环作者要求更新橙武循环名字</p>
        <p>- 修复模拟器弱点刷新机制，使其更贴近游戏的实际情况</p>
      </div>,
    ],
  },
  {
    version: '[暗影千机] 2.5.0',
    date: '2026-04-24 00:00:00',
    content: [
      '综合',
      <div>
        <p>- 暗影千机版本更新，使用前建议先清除缓存</p>
        <p>- 部分门派已初步可用</p>
        <p>- 其余门派还没完全开发完成，请耐心等待</p>
      </div>,
      '孤锋诀',
      <div>
        <p>- 完成计算循环、模拟器开发</p>
      </div>,
      '太玄经',
      <div>
        <p>- 完成计算循环、模拟器开发</p>
      </div>,
      '分山劲',
      <div>
        <p>- 完成计算循环、模拟器开发</p>
      </div>,
      '无方',
      <div>
        <p>- 完成计算循环、模拟器开发</p>
      </div>,
      '移动端_无方',
      <div>
        <p>- 完成计算循环</p>
      </div>,
      '幽罗引',
      <div>
        <p>- 完成计算循环</p>
      </div>,
      '周天功',
      <div>
        <p>- 完成模拟器开发，暂无内置循环</p>
      </div>,
      '山海心诀',
      <div>
        <p>- 完成模拟器开发，暂无内置循环</p>
      </div>,
      '凌海诀',
      <div>
        <p>- 完成模拟器开发，暂无内置循环</p>
      </div>,
      '花间游',
      <div>
        <p>- 完成模拟器开发，暂无内置循环</p>
      </div>,
    ],
  },
  {
    version: '[山海源流] 2.4.13',
    date: '2026-02-08 22:00:00',
    content: [
      '综合',
      <div>
        <p>- 更新春节大阵，升景、封门数值</p>
      </div>,
      '天罗诡道',
      <div>
        <p>- 修改大橙武伤害系数411{` => `}337</p>
      </div>,
      '周天功',
      <div>
        <p>- 修改模拟器：引窍、破穴触发的绝脉可以受到玉枕额外无视防御加成</p>
      </div>,
    ],
  },
  {
    version: '[山海源流] 2.4.12',
    date: '2026-01-26 23:00:00',
    content: [
      '综合',
      <div>
        <p>- 删除部分非主流创意料理</p>
      </div>,
      '太玄经',
      <div>
        <p>- 修复模拟器橙武期间天斗旋会消耗知微的Bug</p>
        <p>- 基于修复的模拟器重新生成橙武撞灯循环</p>
        <p>- 修改踏斗增益30434：15{` => `}7.5</p>
      </div>,
      '山海心诀',
      <div>
        <p>- 重新生成了橙武循环</p>
      </div>,
      '周天功',
      <div>
        <p>- 修改模拟器抟风令2秒{` => `}1.5秒</p>
      </div>,
      '孤锋诀_悟',
      <div>
        <p>- 修改非侠系数860{` => `}932</p>
      </div>,
    ],
  },
  {
    version: '[山海源流] 2.4.11',
    date: '2026-01-19 23:00:00',
    content: [
      '综合',
      <div>
        <p>- 更新各门派奇穴</p>
        <p>- 更新1.19号各职业技改（部分职业循环待更新）</p>
      </div>,
      '北傲诀',
      <div>
        <p>- 非侠系数修改：215{` => `}226</p>
        <p>- 新增橙武冷疏/烽砺短循环{'(短轴循环，勿与冷砺直接对比)'}</p>
      </div>,
      '笑尘诀',
      <div>
        <p>- 越渊非侠系数修改：123{` => `}164</p>
      </div>,
      '毒经',
      <div>
        <p>- 非侠系数修改：205{` => `}215</p>
      </div>,
      '紫霞功',
      <div>
        <p>- 非侠系数修改：553{` => `}573</p>
      </div>,
      '焚影圣诀',
      <div>
        <p>- 非侠系数修改：123{` => `}143</p>
      </div>,
      '天罗诡道',
      <div>
        <p>- 天罗阵眼新增非常驻增益：2%无双</p>
        <p>- 天罗诡道心法选择天罗阵眼计算时，不会再计算特殊的循环了</p>
      </div>,
      '太玄经',
      <div>
        <p>- 模拟器修改：【知微】天斗旋引爆1跳{` => `}2跳</p>
        <p>- 知微(DOT)系数修改：1265{` => `}1400</p>
        <p>- 修复了知微(DOT)未正确受到荧入白无视防御加成的问题</p>
        <p>- 基于模拟器重新生成的撞灯循环</p>
      </div>,
      '山海心诀',
      <div>
        <p>- 非侠系数修改：225{` => `}164</p>
        <p>- 聚势摧霆系数修改：265{` => `}291</p>
        <p>
          - 模拟器修改：【聚势摧霆】蓄力时间修改，总消耗时间3{` => `}
          2.5
        </p>
        <p>- 模拟器修改：【连珠】释放聚势摧霆降低“金乌见坠”2秒调息时间</p>{' '}
        <p>- 基于模拟器重新生成的紫武和橙武循环</p>
      </div>,
      '周天功',
      <div>
        <p>- 非侠系数修改：584{` => `}604</p>
      </div>,
      '周天功_悟',
      <div>
        <p>- 截阳无双系数修改：103{` => `}205</p>
      </div>,
      '幽罗引',
      <div>
        <p>- 非侠系数修改：348{` => `}317</p>
      </div>,
      '太玄经_悟',
      <div>
        <p>- 新增模块（测试中）by 月影无痕</p>
      </div>,
    ],
  },
  {
    version: '[山海源流] 2.4.10',
    date: '2026-01-01 19:00:00',
    content: [
      '综合',
      <div>
        <p>- 更新龙门飞剑武器</p>
        <p>- 修复部分情况模拟器增益启用无效的Bug</p>
      </div>,
      '周天功',
      <div>
        <p>- 修复段氏破招不吃无视防御奇穴的bug并更新循环</p>
      </div>,
    ],
  },
  {
    version: '[山海源流] 2.4.9',
    date: '2025-12-22 16:30:00',
    content: [
      '综合',
      <div>
        <p>- 修复了部分属性7级镶嵌孔的数据异常的Bug</p>
        <p>- 修复了修改过的装备红框一直存在的Bug</p>
        <p>- 修复装备导入无法正确识别心法的Bug</p>
        <p>- 循环模拟新增内置增益开关</p>
        <p>- 加速规划新增装备类型过滤</p>
        <p>- 智能对比新增加速选项过滤</p>
        <p>- 更新冬至装备</p>
        <p>- 更新12.22技改技能系数</p>
      </div>,
      '焚影圣诀',
      <div>
        <p>- 修正紫武一段加速崇光/圣焰令循环的时间</p>
      </div>,
      '无方',
      <div>
        <p>
          -
          更新无方紫武武学助手及手动循环，CW手动上限循环，支持2-5段加速多延迟计算，请根据个人延迟选择加速档位。
        </p>
        <p>- 相关循环攻略已更新至《无方指引》，详情请见门派群公告。</p>
        <p>
          -
          手动循环均为该延迟/加速下最优解，可能并无循环可照抄，默认手动玩家已熟读并理解六微详解并能够进行个人循环构建。
        </p>
      </div>,
      '毒经',
      <div>
        <p>- 修复了模拟器DOT未正常按快照逻辑执行的问题</p>
        <p>- 修复了橙武悸心循环二段加速下起手BUFF缺失的问题</p>
        <p>- 新增循环「武学助手」</p>
      </div>,
      '花间游',
      <div>- 修复模拟器计算玉石CD只在点出丹鼎情况下受加速影响的Bug</div>,
      '太玄经',
      <div>- 修复模拟器提前打断御前星时，加速计算异常的Bug</div>,
    ],
  },
  {
    version: '[山海源流] 2.4.8',
    date: '2025-12-07 19:00:00',
    content: [
      '综合',
      <div>
        <p>- 支持角色导入{`(Beta)`}</p>
        <p>- 修复了部分模拟器技能释放后减少GCD的异常</p>
        <p>- 配装器会显示你修改过的装备了</p>
      </div>,
      '焚影圣诀',
      <div>
        <p>- 新增一段加速紫武圣焰令循环适配</p>
        <p>- 修复了焚影阵(阵眼)覆盖率计算异常的问题</p>
      </div>,
    ],
  },
  {
    version: '[山海源流] 2.4.7',
    date: '2025-11-30 14:00:00',
    content: [
      '综合',
      <div>
        <p>- 新增部分情况下收益图标为负数的情况说明</p>
        <p>- 修复了部分模拟器技能释放后减少GCD的加速计算异常</p>{' '}
        <p style={{ marginLeft: 12 }}>- 万灵寒更晓箭、劲风簇、花间生风等</p>
        <p>- 修复大附魔手鞋伤害数值</p>
        <p>- 修复配装器装备详情镶嵌孔展示错误（仅UI错误，数值无异常）</p>
      </div>,
      '花间游',
      <div>
        <p>- 模拟器新增奇穴支持：故幽、风裳</p>
        <p>- 模拟器修复断快雪加速异常，支持断快雪人为延迟设置</p>
        <p>- 更新花间循环和内置循环</p>
      </div>,
      '毒经',
      <div>
        <p>- 模拟器更新「忽略延迟」功能</p>
        <p>- 新增紫武「悸心」循环</p>
        <p>- 所有循环：</p>
        <p style={{ marginLeft: 12 }}>
          - 通过 忽略延迟 功能重做了循环，使其更符合对应档位的实际表现
        </p>
        <p style={{ marginLeft: 12 }}>- 精细化制作了每个加速及延迟下的循环</p>
        <p style={{ marginLeft: 12 }}>- 完善了循环描述</p>
      </div>,
      '焚影圣诀',
      <div>
        <p>- 新增二段加速下紫武/橙武圣焰令循环</p>
        <p>- 修复了特效腰坠未正确计入爆发快照的问题</p>
        <p>- 修复了循环中降灵尊、悬像破魔和武伤的伤害偏低的问题</p>
        <p>- 修复了二段加速阈值不准确的问题</p>
        <p>- 优化了循环选择界面的文字提示表述</p>
      </div>,
      '幽罗引',
      <div>
        <p>- 修复紫武遍历寻优会计算橙武的问题</p>
        <p>- 更新紫武和橙武循环</p>
      </div>,
      '笑尘诀',
      <div>
        <p>- 修复技改后灼烧系数未更新的异常</p>
      </div>,
    ],
  },
  {
    version: '[山海源流] 2.4.6',
    date: '2025-11-24 14:00:00',
    content: [
      '综合',
      <p key='2.4.6.1'>
        <p>- 修复部分情况下统计伤害导致的页面崩溃问题</p>
        <p>- 优化模拟器技能增益buff显示</p>
      </p>,
      '花间游',
      <p key='2.4.6.2'>
        <p>- 修复模拟器快雪破招触发方式</p>
      </p>,
      '易筋经',
      <p key='2.4.6.3'>
        <p>- 修复模拟器贪破逻辑</p>
      </p>,
      '焚影圣诀',
      <p key='2.4.6.4'>
        <p>- 新增焚影计算器，支持一段紫武与二段橙武循环计算</p>
      </p>,
      '幽罗引',
      <p key='2.4.6.5'>
        <p>- 修复模拟器勾线时长问题</p>
      </p>,
      '笑尘诀',
      <p key='2.4.6.6'>
        <p>- 新增笑尘诀贞固CW循环</p>
      </p>,
      '天罗诡道',
      <p key='2.4.6.7'>
        <p>- 修复化血系数</p>
      </p>,
    ],
  },
  {
    version: '[山海源流] 2.4.5',
    date: '2025-11-22 21:00:00',
    content: [
      '综合',
      <p key='2.4.5.1'>
        <p>- 修改附魔，只保留本赛季和上赛季附魔</p>
        <p>- 易筋经阵眼覆盖率统一改为97</p>
        <p>- 修复多个模拟器加速计算GCD问题</p>
        <p>- 其余已知Bug修复</p>
      </p>,
      '无方',
      <p key='2.4.5.2'>
        <p>- 修复六微系数错误</p>
      </p>,
      '太玄经',
      <p key='2.4.5.3'>
        <p>- 新增撞灯循环，新增撞灯模拟器</p>
        <p>- 修复御前星星芒消耗异常问题</p>
        <p>- 计算器新增撞灯循环，请仔细查看！！！仔细查看！！！仔细查看！！！循环内的说明</p>
      </p>,
      '毒经',
      <p key='2.4.5.4'>
        <p>- 模拟器新增对奇穴「悸心」、「蛊虫狂暴」的支持</p>
        <p>- 内置循环新增「悸心(橙武)」，移除了「降厄简易(橙武)」，并修正了部分此前循环</p>
        <p>- 修复了模拟器此前刷新DOT的异常表现</p>
        <p>- 修复了「降厄」系数错误</p>
      </p>,
      '山海心诀',
      <p key='2.4.5.5'>
        <p>- 修改CW循环</p>
      </p>,
      '花间游',
      <p key='2.4.5.6'>
        <p>- 模拟器支持春寒</p>
      </p>,
      '周天功',
      <p key='2.4.5.7'>
        <p>- 修复橙武加成系数409.6 {'=>'} 410</p>
      </p>,
      '天罗诡道',
      <p key='2.4.5.8'>
        <p>- 新增天罗诡道模拟器，仅支持星离1/2/4段加速循环循环</p>
      </p>,
      '分山劲',
      <p key='2.4.5.9'>
        <p>- 更新橙武多延迟循环</p>
      </p>,
      '移动端_孤锋诀',
      <p key='2.4.5.10'>
        <p>- 更新系数</p>
      </p>,
    ],
  },
  {
    version: '[山海源流] 2.4.4',
    date: '2025-11-17 15:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.4.4.1'>
        <p>11.17技改更新各心法非侠</p>
        <p>技能统计弹窗详情功能</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.4.4.2'>
        <p>修复紫武四段循环 新增吞兰钟循环</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.4.4.3'>
        <p>修复蓬莱系数问题 游仙作用时机</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.4.4.4'>
        <p>新增分山劲模拟器和内置循环</p>
      </p>,
    ],
  },
  {
    version: '[山海源流] 2.4.3',
    date: '2025-11-12 15:30:00',
    content: [
      '笑尘诀',
      <p style={{ paddingLeft: 12 }} key='2.4.3.1'>
        <p>更新丐帮追龙紫武、橙武循环</p>
        <p>计算器完成</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.4.3.2'>
        <p>修复清歌奇穴不生效的问题</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.4.3.3'>
        <p>更新无方循环支持多加速、多延迟调整</p>
      </p>,
    ],
  },
  {
    version: '[山海源流] 2.4.2',
    date: '2025-11-01 10:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.4.2.1'>
        <p>修复部分情况下团队增益快照数值错误</p>
        <p>修复部分情况下特效腰坠快照数值错误</p>
        <p>修复部分情况下交替切换秘籍导致的伤害错误</p>
        <p>更新28000品无修装备</p>
        <p>新增阵眼万灵阵连珠，覆盖率99</p>
      </p>,
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='2.4.2.2'>
        <p>计算器完成</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.4.2.3'>
        <p>修复模拟器流血持续时间错误</p>
      </p>,
    ],
  },
  {
    version: '[山海源流] 2.4.1',
    date: '2025-10-31 00:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.4.1.1'>
        <p>同步山海源流新赛季技改</p>
        <p>部分心法未开发完成</p>
        <p>因奇穴结构/循环变动，需重新切换循环以保证使用</p>
        <p>建议在做好备份的情况下，先使用右下角清空缓存后再使用</p>
        <p>角色导入因推栏不支持无法使用，可尝试使用茗伊插件导入</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.15',
    date: '2025-07-21 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.15.1'>
        <p>更新飘黄计算公式</p>
      </p>,
      '天罗诡道',
      <p style={{ paddingLeft: 12 }} key='2.3.15.2'>
        <p>千秋万劫系数修改 988.5549960000003 {`=>`} 1136.8382454000002</p>
        <p>千秋万劫非侠修改 2048 {`=>`} 1638</p>
      </p>,
      '移动端_孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.3.15.3'>
        <p>行云势受加速增益，重新生成循环，最高支持30158加速</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.14',
    date: '2025-07-01 18:00:00',
    content: [
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.3.14.1'>
        <p>支持花间游模拟器</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.3.14.2'>
        <p>支持特效武器金刚JCL解析</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.13',
    date: '2025-06-16 16:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.13.0'>
        <p>同步各职业6月16日技改</p>
        <p>装备库新增30700特效武器（目前无内置特效循环）</p>
        <p>更新配装器内循环切换能力和部分循环切换提示</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.3.13.1'>
        <p>支持梅洒血雨JCL解析</p>
        <p>新增雪海循环</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.3.13.2'>
        <p>新增三段橙武神阳循环</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.12',
    date: '2025-06-02 16:00:00',
    content: [
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.3.12.1'>
        <p>只保留4段紫武橙武胧雾各一个循环，其余内置循环删除。</p>
        <p>有需求自己JCL录入或者模拟器录入。</p>
      </p>,
      '丐帮',
      <p style={{ paddingLeft: 12 }} key='2.3.12.2'>
        <p>紫武更新1、2段循环，橙武更新雨龙循环</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.11',
    date: '2025-05-29 16:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.11.1'>
        <p>更新六一、端午节日增益数值</p>
        <p>装备过滤新增过滤特效</p>
        <p>新增快速设置团队增益，性能受限仅支持部分部位</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.10',
    date: '2025-05-15 11:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.10.1'>
        <p>更新部分职业快捷团队增益设置</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.3.10.2'>
        <p>模拟器新增倾波技能</p>
      </p>,
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='2.3.10.3'>
        <p>模拟器新增聚势的标鹄特殊机制，根据机制重新生成循环</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.3.10.4'>
        <p>模拟器去除倒读条延迟，新增商的凌然天风顺发秘籍</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.9',
    date: '2025-05-15 11:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.9.1'>
        <p>更新奇穴弹窗说明，部分循环使用时请勿切换循环核心奇穴</p>
        <p>
          此更新针对部分不了解职业的人选择了以某奇穴构建的核心循环后，又将核心奇穴切换为全局奇穴奇穴带节奏的情况。
        </p>
        <p>切记，计算器是用来辅助配装的不是用来带的，如果忘了可以再阅读一遍使用须知。</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.3.9.2'>
        <p>更新非侠调整 338 {'=>'} 236</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.3.9.3'>
        <p>模拟器新增倾波</p>
      </p>,
      '天罗诡道',
      <p style={{ paddingLeft: 12 }} key='2.3.8.4'>
        <p>新增第13奇穴，用于切换是否启用机关的会心加成</p>
        <p>现有循环需要切换一次循环后才可正确使用此奇穴</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.8',
    date: '2025-05-14 16:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.8.1'>
        <p>更新各职业技改</p>
        <p>更新毒经、凌海诀、天罗诡道更新非侠</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.3.8.2'>
        <p>更新倾波猴王循环</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.3.8.66'>
        <p>更新盾压、盾猛系数</p>
      </p>,
      '天罗诡道',
      <p style={{ paddingLeft: 12 }} key='2.3.8.3'>
        <p>更新千秋万劫、化血、蚀肌弹系数</p>
        <p>更新多个循环</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.3.8.4'>
        <p>更新龙回首为独立技能，更新系数</p>
        <p>更新神火循环</p>
        <p>修复枭神全程覆盖的Bug</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.3.8.5'>
        <p>更新多个循环，新增全3沧孤循环</p>
      </p>,
      '孤锋诀·悟',
      <p style={{ paddingLeft: 12 }} key='2.3.8.6'>
        <p>更新流血系数</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.3.8.7'>
        <p>更新CW特效系数</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.3.8.8'>
        <p>更新CW特效系数、更新不鸣系数</p>
        <p>更新多个循环</p>
      </p>,
      '紫霞功',
      <p style={{ paddingLeft: 12 }} key='2.3.8.9'>
        <p>更新CW特效系数</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.7',
    date: '2025-05-08 11:25:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.7.1'>
        <p>更新了部分情况下加速装备更换后无匹配循环的提示文字</p>
        <p>更新了自定义循环的引导</p>
        <p>修复JCL导入、角色导入大附魔异常，修复魔盒导入部分内功镶嵌异常</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.3.7.2'>
        <p>模拟器支持遥思</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.3.7.3'>
        <p>新增一阳3分钟循环</p>
      </p>,
      '周天功·悟',
      <p style={{ paddingLeft: 12 }} key='2.3.7.4'>
        <p>修复界段锁神第一跳吃了两次一阳指增伤的bug</p>
      </p>,
      '无方·悟',
      <p style={{ paddingLeft: 12 }} key='2.3.7.5'>
        <p>由感动中国长倦手动txt订正错位JCL修复后，重新发布</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.6',
    date: '2025-05-05 12:45:00',
    content: [
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.3.6.1'>
        <p>模拟器新增飞鸿破野</p>
      </p>,
      '花间诀',
      <p style={{ paddingLeft: 12 }} key='2.3.6.2'>
        <p>更新3、4、5段橙武循环</p>
        <p>更新3段紫武循环</p>
        <p>修复JCL部分DOT解析报错</p>
      </p>,
      '天罗诡道',
      <p style={{ paddingLeft: 12 }} key='2.3.6.3'>
        <p>新增千秋化血橙武循环</p>
        <p>修复段氏阵会心加成错误计算</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.3.6.4'>
        <p>修复JCL部分DOT解析报错</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.5',
    date: '2025-04-29 16:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.5.0'>
        <p>修改易筋阵的覆盖率</p>
        <p>修改部分30200散件属性</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.3.5.1'>
        <p>更新循环标题</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.3.5.2'>
        <p>更新橙武循环</p>
      </p>,
      '紫霞功',
      <p style={{ paddingLeft: 12 }} key='2.3.5.3'>
        <p>更新紫武循环</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.3.5.4'>
        <p>更新紫武带斩杀计算的均摊循环，按3/7计算</p>
      </p>,
      '北傲诀',
      <p style={{ paddingLeft: 12 }} key='2.3.5.5'>
        <p>更新橙武循环截断时间</p>
        <p>部分橙武循环截断时间待调整</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.3.5.6'>
        <p>更新橙武循环</p>
      </p>,
      '天罗诡道',
      <p style={{ paddingLeft: 12 }} key='2.3.5.7'>
        <p>新增天罗诡道心法模块</p>
        <p style={{ color: 'red' }}>注意：天罗阵眼回神机的功能暂时未做</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.4',
    date: '2025-04-28 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.4.1'>
        <p>更新4月28日技改数据</p>
        <p>配装器新增遍历寻优功能</p>
        <p>打包产物分包</p>
        <p>新增装备速查功能</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.3.4.2'>
        <p>使用模拟器生成了新的循环</p>
      </p>,
      '北傲诀',
      <p style={{ paddingLeft: 12 }} key='2.3.4.3'>
        <p>整合更新了紫、橙武循环</p>
        <p>部分橙武循环截断时间待调整</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.3.4.4'>
        <p>未更新CW循环</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.3.4.5'>
        <p>未更新步临循环</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.3',
    date: '2025-04-21 14:45:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.3.1'>
        <p>更新大附魔选择方式</p>
        <p>新增段氏阵（一阳）覆盖率99</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.3.3.2'>
        <p>模拟器新增内置循环，来自魔盒流萤</p>
      </p>,
      '花间',
      <p style={{ paddingLeft: 12 }} key='2.3.3.3'>
        <p>修复JCL解析倚天错位的Bug</p>
      </p>,
      '分山',
      <p style={{ paddingLeft: 12 }} key='2.3.3.4'>
        <p>新增橙武循环，仅支持二段加速计算</p>
      </p>,
      '笑尘诀',
      <p style={{ paddingLeft: 12 }} key='2.3.3.5'>
        <p>添加笑尘诀模块，由君山PVE教育局power</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.3.3.5'>
        <p>新增海碧橙武循环</p>
      </p>,
      '孤锋诀·悟',
      <p style={{ paddingLeft: 12 }} key='2.3.3.4'>
        <p>更新循环%</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.2',
    date: '2025-04-21 14:45:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.2.1'>
        <p>修复部分创意料理数据</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.3.2.2'>
        <p>神兵·循环天转伤害削弱15%</p>
      </p>,
      '北傲诀',
      <p style={{ paddingLeft: 12 }} key='2.3.2.3'>
        <p>更新三段加速CW循环</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.3.2.3'>
        <p>更新CW循环截断时间</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.1',
    date: '2025-04-17 11:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.1'>
        <p>太极秘录正式服技改</p>
        <p>计算器更新大量功能</p>
        <p style={{ color: 'red' }}>
          由于无界JCL解析困难，暂时决定隐藏无模拟器的各无界心法模块，存留无界模块系数也暂未更新
        </p>
        <p>使用前建议清空缓存在使用，避免造成不必要的bug</p>
        <p>注意，当前部分数据并非最终版本，今日会多次更新更新数据</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.0.6',
    date: '2025-04-07 17:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.0.6.0'>
        <p>更新三改各职业系数</p>
        <p>重做装备特效模块，增加副本新特效计算和特效显示</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.0.5',
    date: '2025-04-02 10:40:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.0.5.0'>
        <p>更新各职业系数，更新少林、毒经、无方、气纯橙武循环</p>
        <p>由于无界JCL解析困难，暂时决定隐藏无模拟器的各无界心法模块</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.0.4',
    date: '2025-03-29 13:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.0.4.0'>
        <p>更新各职业系数</p>
        <p>更新万灵、刀宗、段氏、蓬莱模拟器</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.0.3',
    date: '2025-03-22 11:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.0.3.0'>
        <p>更新毒经、气纯二段加速循环</p>
        <p>修改附魔收益的计算方式为郭氏计算</p>
        <p>修改装备镶嵌分数计算系数</p>
        <p>修复配装器配装导出功能错误显示大附魔的Bug</p>
        <p>团队增益支持快速设置坦克、奶妈增益层数</p>
        <p>放开保存方案数量限制为15个</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.0.2',
    date: '2025-03-18 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.0.2.0'>
        <p>修改全局镶嵌孔系数</p>
        <p>更新全局奇穴</p>
        <p>添加花间游、紫霞功、无方、毒经的解析</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.0.1',
    date: '2025-03-14 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.0.1.0'>
        <p>修改全局镶嵌孔系数</p>
        <p>更新全局奇穴</p>
        <p>添加花间游、紫霞功、无方的解析</p>
      </p>,
    ],
  },
  {
    version: '[太极秘录] 2.3.0.0',
    date: '2025-03-14 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.3.0.0.0'>
        <p>修改装备，修改部分系数</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.17',
    date: '2025-03-18 11:40:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.15.0'>
        <p>更新分山盾猛、过涯系数</p>
        <p>更新界无方中和、中毒系数</p>
        <p>更新界刀宗截辕系数</p>
        <p>更新段氏劈风令、劈风令·骤系数</p>
        <p>更新万灵、段氏、界段非侠</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.16',
    date: '2025-03-03 09:00:00',
    content: [
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.2.15.0'>
        <p>更新衍天宗炸灯循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.15',
    date: '2025-02-28 12:30:00',
    content: [
      '紫霞功',
      <p style={{ paddingLeft: 12 }} key='2.2.14.0'>
        <p>紫霞功模块，模块负责人月慕青尘</p>
        <p>内置紫武器一段加速循环和橙武二段加速循环</p>
        <p style={{ color: 'red' }}>使用前请鼠标移至选择循环部位，仔细阅读循环说明</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.14',
    date: '2025-02-25 15:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.14.0'>
        <p>修改快照计算逻辑，删除原循环内快照计算标记。动态判断。</p>
        <p>修改模拟器统一组件，各心法模拟器起手buff添加方式修改</p>
      </p>,
      '综合-BUG',
      <p style={{ paddingLeft: 12 }} key='2.2.14.1'>
        <p>修复部分内功伍级五彩石名称错误导致六级五彩石属性异常问题</p>
        <p>再次修复无封项链特效层数计算超过10层的bug（为计算器分支管理导致的旧代码丢失导致）</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.2.14.2'>
        <p>修正兵主逆基础伤害系数{`（官方已修复188为390）`}</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.13',
    date: '2025-02-18 11:00:00',
    content: [
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.2.13.1'>
        <p>更新紫武计算循环，区分为30延迟和60延迟。固定按一段加速计算</p>
        <p>更新五段加速橙武循环</p>
        <p>修复吞海相关系数的解析和系数</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.2.13.2'>
        <p>更新紫武和橙武循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.12',
    date: '2025-02-17 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.12.0'>
        <p>同步各门派17日技改</p>
        <p>部分心法模拟器模块优化，组件抽离</p>
        <p>新增公式字段 atUnlimitCriticalDamagePowerKiloNumRate</p>
      </p>,
      '技改变动',
      <p style={{ paddingLeft: 12 }} key='2.2.12.1'>
        <p>技改前后变动，所有变动均暂不考虑循环变化。数值均为约等于，根据配装上下浮动</p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>花间游：</span>
          +4%（未计算流离bug影响）
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>山海心诀：</span>
          +2.7%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>太玄经：</span>
          +2.5%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>毒经：</span>
          +2.3%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>孤锋诀：</span>
          +2.2%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>分山劲：</span>
          +2.1%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>周天功：</span>
          +2%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>北傲诀：</span>
          +1.4%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>凌海诀：</span>
          +1%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>无方：</span>+1%
        </p>
        <p>
          <span style={{ width: 70, display: 'inline-block' }}>易筋经：</span>
          -3.65%
        </p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.2.12.2'>
        <p>击懈：“留客雨”命中非侠士目标降低“决云势”11秒调息时间</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.11',
    date: '2025-02-13 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.11.0'>
        <p>部分门派系数ID补全</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.2.11.1'>
        <p>更新触发率分析工具，对天网特殊处理</p>
        <p>修正兵主逆基础伤害系数{`（描述390实际188）`}</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.2.11.2'>
        <p>新增魔盒两位大佬的165孤循环，内置至模拟器</p>
        <p>外部新增165孤循环，4段理论延迟及5段根据雷港咩吖循环生成，其余根据亦归循环生成</p>
        <p>考虑实战灵活性，将原威声{`(分开吃影子)`}循环的默认奇穴由雨积改为溃延</p>
        <p>关于165循环选择哪个的建议：根据自身情况测试哪个舒服打哪个</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.10',
    date: '2025-02-10 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.10.0'>
        <p>更新风舞者增益</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.9',
    date: '2025-01-23 18:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.9.0'>
        <p>重新放开橙武触发率分析功能</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.8',
    date: '2025-01-22 10:00:00',
    content: [
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.2.8.0'>
        <p>更新一段加速循环</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.2.8.1'>
        <p>更新橙武循环，删除极限处理</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.7',
    date: '2025-01-20 10:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.7.0'>
        <p>阻止了部分页面元素被浏览器翻译的功能，避免翻译引起的页面报错</p>
        <p>新增了页面报错后的错误提示页面</p>
        <p style={{ color: 'red' }}>如果您启用了“翻译”功能，请关闭后再使用</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.2.7.1'>
        <p>更新紫武二段加速循环，和一段加速合并为同一个循环，根据加速等级自动适配。</p>
        <p>一段加速替换为不卡横扫循环</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.2.7.1'>
        <p>新增橙武新循环</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.2.7.2'>
        <p>更新紫武周流循环，来自刀可特</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.6',
    date: '2025-01-16 10:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.6.0'>
        <p>配装器的装备增加了图标</p>
        <p>新增了配装导出功能，支持复制、下载。暂不支持直接生成魔盒配装</p>
        <p>修正中和·悟数值</p>
        <p>修改无封项链特效层数，限制最大为10层</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.5',
    date: '2025-01-14 10:10:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.5.0'>
        <p>因技术原因，暂时隐藏橙武触发率分析功能</p>
      </p>,
      '北傲诀',
      <p style={{ paddingLeft: 12 }} key='2.2.5.1'>
        <p>修复橙武循环未正确计算快照增益的bug</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.2.5.2'>
        <p>
          新增新橙武循环定式黑白。由 解牛 提供。
          <span style={{ color: 'red' }}>只支持五段加速计算</span>
        </p>
        <p>修复 {`兰摧玉折(DOT)·吞海`} 系数异常bug</p>
        <p>青冠的攻击、无双加成现在会显示在面板上</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.2.5.3'>
        <p>更新紫武打法新循环</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.2.5.4'>
        <p>
          橙武特效伤害由「鹿王本生」变成为「烬灭」
          <span style={{ color: 'red' }}>仅名称变化</span>
        </p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.4',
    date: '2025-01-13 11:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.4.0'>
        <p>增加22200暗器</p>
        <p>启用团队增益轴的团队增益会有更明显的提示</p>
        <p>优化了部分解析循环的逻辑</p>
        <p>增加春节大阵开阵效果：升景、封门</p>
      </p>,
      '北傲诀',
      <p style={{ paddingLeft: 12 }} key='2.2.4.1'>
        <p>
          更新橙武循环，区分为归酣、碎影。
          <span style={{ color: 'red' }}>只支持一段加速计算</span>
        </p>
        <p>修复大橙武错误的将醉斩白蛇加成计算到刀啸风吟的错误</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.2.4.2'>
        <p>模拟器“换行”逻辑改为，当存在“换行”技能时，只使用该技能做UI换行展示</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.3',
    date: '2025-01-06 11:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.3.0'>
        <p>更新龙门飞剑武器无双数值</p>
        <p>更新部分职业非侠，系数调整</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.2.0.0'>
        <p>重新生成了两个橙武循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.2',
    date: '2025-01-03 10:50:00',
    content: [
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.2.2.0'>
        <p>更新紫武一段加速循环</p>
        <p>更新橙武二段加速循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.1',
    date: '2025-01-01 12:00:00',
    content: [
      '周天功·悟',
      <p style={{ paddingLeft: 12 }} key='2.2.1.0'>
        <p>新增周天功·悟心法及模拟器</p>
        <p>该模块由 蓝团 开发和调试完成</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.2.2.1'>
        <p>更新紫武循环</p>
        <p>更新橙武循环</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.2.2.2'>
        <p>更新紫武循环（暂时只支持二段加速）</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.2.0',
    date: '2024-12-30 14:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.2.0.0'>
        <p>更新12月30日各门派技改</p>
        <p>更新龙门飞剑武器特效数值</p>
        <p>更新立地系数和层数</p>
        <p style={{ color: 'red' }}>注意：内功心法需要手动设置一次快捷增益以清空立地的增益层数</p>
        <p>以下职业已更新循环：孤锋诀、分山劲</p>
        <p>以下职业待更新循环：北傲诀CW、太玄经、毒经、无方、周天功、山海心诀·悟、凌海诀·悟</p>
        <p>其余职业循环暂无变动，或随后续更新更新</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.18',
    date: '2024-12-25 10:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.18.0'>
        <p>修复7级镶嵌孔数据异常Bug</p>
        <p>更新龙门飞剑武器</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.17',
    date: '2024-12-18 15:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.17.0'>
        <p>更新冬至buff数值</p>
        <p>部分模拟器添加战斗曲线功能</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.1.17.1'>
        <p>更新紫武优解手打循环877区间数据</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.1.17.2'>
        <p>新增了胧雾观花循环</p>
        <p>优化了模拟器劈风令的处理，删除了额外劈风技能</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.16',
    date: '2024-12-12 11:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.16.0'>
        <p>同步12月12日更新</p>
        <p>修复大附魔手鞋伤害数值</p>
        <p>修复部分情况下大附魔装备分数计算异常的问题，当前大附魔固定按所在部位装备品级计算</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.1.16.1'>
        <p>修改降魔系数</p>
        <p>韦陀降魔 87.81045569999999 {'=>'} 111.56318396685</p>
        <p>拿云降魔 100.91250000000001 {'=>'} 132.69665784375002</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.15',
    date: '2024-12-05 11:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.15.0'>
        <p>更新冬至装备</p>
      </p>,
      '太玄经·悟',
      <p style={{ paddingLeft: 12 }} key='2.1.15.1'>
        <p>更新循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.14',
    date: '2024-12-02 10:30:00',
    content: [
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.1.14.0'>
        <p>偷偷搞了一个模拟器，还在测试中</p>
      </p>,
      '太玄经·悟',
      <p style={{ paddingLeft: 12 }} key='2.1.14.1'>
        <p>更新斗循环，新循环还在调试中</p>
      </p>,
      '无方·悟',
      <p style={{ paddingLeft: 12 }} key='2.1.14.2'>
        <p>更新循环，新循环不计算鬼门</p>
      </p>,
      '花间游·悟',
      <p style={{ paddingLeft: 12 }} key='2.1.14.3'>
        <p>新增花间游·悟</p>
        <p>循环默认未计算渡泉·悟斩杀，手动选择渡泉后按50%均摊计算</p>
      </p>,
      '凌海诀·悟',
      <p style={{ paddingLeft: 12 }} key='2.1.14.4'>
        <p>加了一个内置的三段加速循环，但是不确定是否有buff异常叠加导致偏高的情况</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.13',
    date: '2024-12-02 10:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.13.1'>
        <p>更新各门派无界技改</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.12',
    date: '2024-11-30 22:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.12.1'>
        <p>优化装备助手·无修助手</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.1.12.2'>
        <p>更换CW循环</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.1.11.2'>
        <p>新增橙武二段加速循环</p>
        <p>更新部分奇穴支持，配合Formulator导入使用</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.1.12.3'>
        <p>合并紫武206、3488档位循环，自动根据加速切换</p>
        <p>新增橙武循环，模拟5分钟触发7次，节点平均为理想节点和较差节点</p>
        <p>具体循环见模拟器</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.11',
    date: '2024-11-26 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.11.1'>
        <p>部分代码优化，优化加速规划算法</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.1.11.2'>
        <p>修复虚弱增益覆盖</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.1.11.3'>
        <p>新增威声4段加速超低延迟新循环</p>
      </p>,
      '凌海诀·悟',
      <p style={{ paddingLeft: 12 }} key='2.1.11.4'>
        <p>修改紫武循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.10',
    date: '2024-11-22 11:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.10.1'>
        <p>新增加速规划功能</p>
        <p>增加了气血附魔</p>
        <p>修复部分情况下循环加速识别异常的问题</p>
        <p>修改快捷设置和默认T奶团队增益层数 100 {`=>`} 90</p>
        <p>修改部分模拟器网络延迟和无GCD技能的作用关系</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.1.10.2'>
        <p>更新橙武循环</p>
      </p>,
      '山海心诀·悟',
      <p style={{ paddingLeft: 12 }} key='2.1.10.3'>
        <p>更新紫武循环</p>
        <p style={{ color: 'red' }}>
          因JCL读取增加伤害Buff消失逻辑异常可能导致伤害偏高，但是不影响计算相对配装
        </p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.9',
    date: '2024-11-21 11:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.9.1'>
        <p>更新各职业技改</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.1.8.2'>
        <p>修改宠物非侠</p>
        <p>循环暂未更新</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.1.8.3'>
        <p>新增了假设的紫武度冥循环，套装覆盖率均摊比天网低10%</p>
      </p>,
      '北傲诀',
      <p style={{ paddingLeft: 12 }} key='2.1.8.4'>
        <p>修改紫武循环团队增益计算方式，支持快照计算</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.1.8.5'>
        <p>修改模拟器破穴CD</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.8',
    date: '2024-11-19 18:20:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.8.1'>
        <p>更新各职业技改</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.1.8.2'>
        <p>策划忘了改宠物非侠，还是72/1024</p>
        <p>更新循环</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.1.8.3'>
        <p>更新循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.7',
    date: '2024-11-14 11:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.7.1'>
        <p>更新各职业技改</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.1.7.2'>
        <p>更新模拟器</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.6',
    date: '2024-11-12 14:00:00',
    content: [
      '太玄经悟、凌海诀悟',
      <p style={{ paddingLeft: 12 }} key='2.1.6.1'>
        <p>新增心法</p>
      </p>,
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='2.1.6.2'>
        <p>根据朝仪加速阈值，细化了各循环的加速档位</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.1.6.3'>
        <p>
          辛苦秃不得打了一个20分钟的CW循环。20分钟为了减少特效的波动影响，20分钟较5分钟dps会偏低
        </p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.5',
    date: '2024-11-07 15:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.5.1'>
        <p>新增团队增益轴设置功能，可以控制部分团队增益的计算方式“快照”｜“均摊”</p>
        <p>理论上快照计算对团队增益的计算更加精确，但是有更高的计算性能要求，计算耗时更长</p>
        <p>目前需重新录入循环才能支持快照计算，当前已支持部分。其他循环待逐步更新</p>
        <p>上述循环若更新后出现明显卡顿，请联系我重置循环</p>
        <p>自带模拟器心法 孤锋诀、山海心诀、周天功后续开发该功能</p>
        <p>其余增益轴说明见弹窗内</p>
      </p>,
      '北傲诀、凌海诀、分山劲',
      <p style={{ paddingLeft: 12 }} key='2.1.5.2'>
        <p>新增橙武循环</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.1.5.3'>
        <p>新CW循环，重新设定了无方紫武、橙武循环。由长倦提供</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.4',
    date: '2024-11-06 17:00:00',
    content: [
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.1.4.1'>
        <p>
          循环变更名称 六破 {`=>`} 电逝 无影刀 {`=>`} 击懈
        </p>
        <p>新增威声循环，和电逝各有优劣，具体选择建议及宏见魔盒帖子说明</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.3',
    date: '2024-11-05 16:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.3.0'>
        <p>修改缓存读取方式，避免错误的计算未携带增益</p>
        <p>配装器新增「过滤无修」功能</p>
        <p>配装器新增加速不足提示文案</p>
        <p>目标新增试炼之地雷神和133级boss选择</p>
        <p>装备库更新</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.1.3.1'>
        <p>新增橙武JCL辅助配装，并非最优打法</p>
        <p>非侠系数 52 {`=>`} 72</p>
        <p>引窍涌泉 0.05 {`=>`} 0.04</p>
        <p>引窍涌泉新增非侠，系数 175</p>
        <p>横驱风靡系数 524.4 {`=>`} 445.73999999999995</p>
        <p>封府增强越0.47%，清激增强约0.36%。依然清激略高。</p>
        <p>
          考虑配装问题，本次系数调整最终结果
          <span style={{ color: 'red' }}>增强约0.3% ～ 0.5%</span>
        </p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.1.3.2'>
        <p>更新橙武循环</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.1.3.2'>
        <p>更新橙武循环</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.1.3.3'>
        <p>更新紫武循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.2',
    date: '2024-11-03 16:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.2.0'>
        <p>修复内功加速五彩石遗漏的问题</p>
        <p>修复全能加成的破招和无双展示在面板上</p>
        <p>修复大附魔装备分数问题</p>
        <p>新增五彩石</p>
        <p style={{ color: 'red' }}>
          注意：内功五彩石名称为虚拟，请按属性搜索具体对因伤害类型的五彩石
        </p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.1.2.1'>
        <p>修复15000品小CW属性异常问题</p>
        <p>新增清激1.1循环(206档位)，2.0循环(劈风令3488加速档位)</p>
        <p>周天功心法的段氏阵法6%增伤改为快照计算，方便模拟器哪模拟阵眼4重的影响</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.1.2.2'>
        <p>新增橙武循环</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.1.2.3'>
        <p>新增CW循环</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.1.2.4'>
        <p>新增T队开阵选项，按80%覆盖率计算</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.1',
    date: '2024-11-01 10:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.1.0'>
        <p>修复内功加速五彩石遗漏的问题</p>
        <p style={{ color: 'red' }}>
          注意：内功五彩石名称为虚拟，请按属性搜索具体对因伤害类型的五彩石
        </p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.1.1.1'>
        <p>新增相息一键宏循环，用于配装参考</p>
        <p>模拟器加速从加速档位修改为加速等级</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.1.1.2'>
        <p>
          新增橙武循环，强制要求加速等级
          <span style={{ color: 'red' }}>9848</span>
        </p>
      </p>,
    ],
  },
  {
    version: '[丝路风语] 2.1.0',
    date: '2024-10-31 16:30:00',
    content: [
      <p key='2.1.0.0'>
        <a
          href='https://jx3.xoyo.com/index/#/article-details?kid=1334144'
          target='_blank'
          rel='noreferrer'
        >
          技改链接
        </a>
      </p>,
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.1.0.1'>
        <p>130级数值、装备库、增益等技改。各心法技改</p>
      </p>,
      <p style={{ paddingLeft: 12 }} key='2.1.0.2'>
        <p>新增周天功、毒经、易筋经、北傲诀、分山劲心法</p>
        <p>新增周天功模拟器</p>
      </p>,
      <p style={{ paddingLeft: 12 }} key='2.1.0.4'>
        「无方·悟」「山海心诀·悟」计算循环暂未更新
      </p>,
      <p style={{ paddingLeft: 12, color: 'red' }} key='2.1.0.3'>
        在正式开始使用前，请在页面右下角点击“清除缓存”后再进行使用。
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.14',
    date: '2024-10-24 16:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.14.1'>
        <p>更新CW、15500橙戒装备模型</p>
        <p>更新刀宗、万灵CW模拟器</p>
        <p>修改蓬莱阵眼覆盖率</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.13',
    date: '2024-10-24 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.13.1'>
        <p>修改各职业非侠，修改部分职业循环</p>
      </p>,
      '北傲诀',
      <p style={{ paddingLeft: 12 }} key='2.0.13.1'>
        <p>新增北傲诀心法</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.12',
    date: '2024-10-22 10:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.12.1'>
        <p>修改各职业非侠，修改部分职业循环</p>
      </p>,
      '孤锋诀·悟',
      <p style={{ paddingLeft: 12 }} key='2.0.12.2'>
        <p>更新模拟器</p>
        <p>修复留减少绝技技能CDbug</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.0.12.3'>
        <p>根据快照更新循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.11',
    date: '2024-10-18 11:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.11.x'>
        <p>部分职业增益数值修改</p>
        <p>装备库更新</p>
        <p>五彩石更新</p>
        <p>逐云寒蕊具体伤害修改</p>
        <p>新增部分无封装备算法</p>
      </p>,
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='2.0.11.1'>
        <p>11层桑柘奇穴</p>
        <p>猜测朝能吃第一层劲风奇穴加成</p>
        <p>具体表现待实测后决定</p>
      </p>,
      '孤锋诀·悟',
      <p style={{ paddingLeft: 12 }} key='2.0.11.2'>
        <p>脑策了行云二、三段不吃GCD逻辑后重写模拟器</p>
        <p>具体表现待实测后决定</p>
      </p>,
      '已更新循环门派',
      <p style={{ paddingLeft: 12 }} key='2.0.11.3'>
        <p>无方、易筋经、花间游已更新循环</p>
      </p>,
      '待定未更新事项',
      <p style={{ paddingLeft: 12 }} key='2.0.10.4'>
        <p>太玄经、分山劲、山海心诀·悟。具体循环待新JCL后更新</p>
        <p>大附魔</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.10',
    date: '2024-10-15 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.10.x'>
        <p>修改各内功远程职业循环，删除普通攻击</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.0.10.1'>
        <p>更新带套装循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.10',
    date: '2024-10-15 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.10.x'>
        <p>修改各内功远程职业循环，删除普通攻击</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.0.10.1'>
        <p>更新带套装循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.9',
    date: '2024-10-12 11:45:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.9.x'>
        <p>修改飘黄数据</p>
        <p>修改优化算法的计算方式，剔除附魔和镶嵌的容量后计算，使用前需要重新进入配装器保存一次</p>
        <p>优化算法仅代表趋势，且收益接近时存在上下浮动，具体说明详见功能Tip</p>
      </p>,
      '花间',
      <p style={{ paddingLeft: 12 }} key='2.0.9.1'>
        <p>新增无脑芙蓉循环</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.0.9.2'>
        <p>模拟器逻辑修改</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.8',
    date: '2024-10-11 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.8.x'>
        <p>修改附魔分数</p>
      </p>,
      '分山劲',
      <p style={{ paddingLeft: 12 }} key='2.0.8.1'>
        <p>新增分山劲心法</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.0.8.2'>
        <p>且待时休·苍棘缚地+58.7%</p>
        <p>银光照雪·结草+10%</p>
        <p>疑似为之前公告的改动未实装，非额外加强</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.7',
    date: '2024-10-10 17:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.7.x'>
        <p>更新装备库</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.0.7.1'>
        <p>修改青冠加成为无视50%防御</p>
        <p>快雪+20%</p>
        <p>折花+15%</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.0.7.2'>
        <p>守缺+10%</p>
        <p>横扫+10%</p>
        <p>疑似为之前公告的改动未实装，非额外加强</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.6',
    date: '2024-10-08 10:00:00',
    content: [
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.0.6.1'>
        <p>修正JCL涓流偏差导致的循环错位</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.0.6.2'>
        <p>新增小飞棍循环</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.0.6.3'>
        <p>更新循环，修复跃潮无破招bug</p>
      </p>,
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='2.0.6.4'>
        <p>删除紫箭循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.5',
    date: '2024-10-01 23:30:00',
    content: [
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.0.5.1'>
        <p>更新循环</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.0.5.2'>
        <p>更新循环（修复三生覆盖率不准确bug）</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='2.0.5.3'>
        <p>新增循环</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.4',
    date: '2024-09-29 18:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.4.1'>
        <p>9月29日技改</p>
        <p>更新各门派系数</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='2.0.4.2'>
        <p>更新模拟器，更新循环</p>
      </p>,
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='2.0.4.3'>
        <p>更新模拟器，更新循环</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='2.0.4.4'>
        <p>更新循环</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='2.0.4.5'>
        <p>更新重山系数，更新循环</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.0.4.6'>
        <p>更新循环</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='2.0.4.7'>
        <p>更新循环（猴王）</p>
      </p>,
      '易筋经',
      <p style={{ paddingLeft: 12 }} key='2.0.4.8'>
        <p>应「秃不得」大佬的支持，新增易筋经心法</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.3',
    date: '2024-09-27 11:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.3.1'>
        <p>增加循环设置秘籍功能</p>
        <p>增加循环导入导出功能</p>
      </p>,
      '毒经',
      <p style={{ paddingLeft: 12 }} key='2.0.3.2'>
        <p>新增毒经心法</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.2',
    date: '2024-09-25 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.2.1'>
        <p>更新9月20日技改</p>
        <p>更新无界增益</p>
        <p>更新涌泉系数</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.1',
    date: '2024-09-23 11:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.1.1'>
        <p>更新9月19日技改</p>
        <p>更新套装激活逻辑</p>
        <p>更新新飘黄伤害计算</p>
        <p>修改优化算饭逻辑，剔除无双计算</p>
      </p>,
    ],
  },
  {
    version: '[丝路风语-体服] 2.0.0',
    date: '2024-08-27 10:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='2.0.0.1'>
        <p>
          各心法等级「13」 {`=>`} 「14」气血加成「235」 {`=>`} 「245」
        </p>
        <p>属性基础系数修改</p>
        <p>装备库、同泽宴更新</p>
        <p>开放开发者选项，可自行导入JCL解析循环用作计算</p>
      </p>,
      '周天功',
      <p style={{ paddingLeft: 12 }} key='2.0.0_ztg'>
        <p>新增周天功心法，附带模拟器</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.27',
    date: '2024-09-12 14:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.27.1'>
        <p>中秋节暗器更新</p>
        <p style={{ color: 'red' }}>
          由于某不要脸机器人作者的恶意使用，角色名称查询功能下架。只支持使用UID查询
        </p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.26',
    date: '2024-08-27 10:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.26.1'>
        <p>代码优化，性能优化，部分组件懒加载</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.25',
    date: '2024-08-19 10:00:00',
    content: [
      '山海心诀·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.25.1'>
        <p>更新计算循环-助手循环，助手来自魔盒「渊凡」，JCL来自「十九停」</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.24',
    date: '2024-08-16 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.24.1'>
        <p>新增15000破无项链</p>
      </p>,
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='1.1.24.2'>
        <p>修正山海心诀各技能2%伤害秘籍的系数「21」{`=>`}「20」</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='1.1.24.3'>
        <p>修正无方各技能2%伤害秘籍的系数「21」{`=>`}「20」</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.23',
    date: '2024-08-14 14:00:00',
    content: [
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.1.23.1'>
        <p>添加橙武「鬼枭」循环，循环由某不愿意透漏名字的昆吾衍天提供</p>
        <p style={{ color: 'red' }}>
          「鬼枭」循环默认按「枭神」40%覆盖计算，如不计算枭神可手动修改奇穴
        </p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.22',
    date: '2024-08-13 14:00:00',
    content: [
      '综合-Bug',
      <p style={{ paddingLeft: 12 }} key='1.1.22.1'>
        <p>修复无封对比中对比组合计算的Bug</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='1.1.22.1'>
        <p>将原「避奚养荣橙武循环」改名为“声控”，增加一份常规数据，由鹿行川提供</p>
        <p>增加循环是为了回应某些使用者对所谓刷特效所以才不要破招的反馈</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.21',
    date: '2024-08-09 17:30:00',
    content: [
      '综合-Bug',
      <p style={{ paddingLeft: 12 }} key='1.1.21.1'>
        <p>修复无封对比中对比时未计算附魔的Bug</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.20',
    date: '2024-08-06 17:30:00',
    content: [
      '综合-功能',
      <p style={{ paddingLeft: 12 }} key='1.1.20.1'>
        <p>优化配装器最佳附魔计算的显示，显示多个五彩石，方便对比</p>
        <p>新增百分比主属性五彩石（实际收益很低）</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.19',
    date: '2024-08-05 17:00:00',
    content: [
      '综合-功能',
      <p style={{ paddingLeft: 12 }} key='1.1.19.1'>
        <p>新增循环的数据提供者的备注，展示提供用于计算JCL文件的玩家</p>
        <p>删除无界统一背景图</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.1.19.2'>
        <p>应评论需求，重新添加「鬼追」循环</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.18',
    date: '2024-08-01 20:00:00',
    content: [
      '综合-功能',
      <p style={{ paddingLeft: 12 }} key='1.1.18.1'>
        <p>新增功能「收益图表-属性置换」，详情请鼠标移至属性置换查看</p>
        <p>新增功能「装备助手-无封助手」，用于快速跨部位实现「智能对比」。使用前请阅读须知。</p>
      </p>,
      '综合-Bug',
      <p style={{ paddingLeft: 12 }} key='1.1.18.1'>
        <p>修复雷计算时错误计算了对内功攻击力加成的Bug</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.17',
    date: '2024-07-26 10:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.17.1'>
        <p>修复清心的文本描述错误</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.1.17.1'>
        <p>删除「鬼追」循环</p>
        <p>新增两个「鬼枭」循环，一个为欧皇版</p>
        <p style={{ color: 'red' }}>
          「鬼枭」循环默认按「枭神」40%覆盖计算，如不计算枭神可手动修改奇穴
        </p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.16',
    date: '2024-07-26 10:30:00',
    content: [
      '无方',
      <p style={{ paddingLeft: 12 }} key='1.1.16.1'>
        <p>新增紫武养荣武学助手流派</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.15',
    date: '2024-07-25 14:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.15.1'>
        <p>新增「装分」「气血」属性显示</p>
        <p>新增「气血」相关增益，新增「共战」增益</p>
        <p>优化配装器UI布局</p>
        <p>配装器智能对比功能现在可以对比附魔了</p>
        <p style={{ color: 'red' }}>存量数据的装分和气血需要重新进入配装器操作一下才会更新。</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='1.1.15.2'>
        <p>删除了循环计算时对加速的强制校验</p>
        <p>现在配装加速不符合依然会按照1段加速计算，不会返回0了</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='1.1.15.3'>
        <p>删除了「怅归」循环计算时对加速的强制校验，</p>
        <p>现在配装加速不符合依然会按照1段加速计算，不会返回0了</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.14',
    date: '2024-07-22 09:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.14.1'>
        <p>根据长倦提供的循环更新了避奚养荣的橙武循环</p>
        <p>如出现样式问题导致计算器无法使用，请尝试强制刷新页面清除缓存。</p>
        <p>建议使用Chrome浏览器</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.13',
    date: '2024-07-19 15:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.13.1'>
        <p>升级了系统的基础UI组件，如出现样式问题请反馈。</p>
        <p>由于组件库升级，不支持IE浏览器</p>
        <p>新增了面向新使用者的漫游式引导，如您已经熟练使用，可以跳过引导</p>
        <p>重新增加蓝色家园酒品</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.12',
    date: '2024-07-18 12:00:00',
    content: [
      '综合-功能',
      <p style={{ paddingLeft: 12 }} key='1.1.12.1'>
        <p>团队增益新增「弄梅」稀缺增益 - 相知风雷特效</p>
        <p>团队增益新增「中和·悟」增益 - 灵素·悟</p>
        <p>小药小吃新增八段锦相关小吃，数值为秘境内数值</p>
        <p>小药小吃新增了增益的具体数值显示</p>
        <p>团队增益新增一键展开/收起功能</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.11',
    date: '2024-07-17 16:30:00',
    content: [
      '综合-功能',
      <p style={{ paddingLeft: 12 }} key='1.1.11.1'>
        <p>页面右下角新增「数据迁移」功能，方便在不同网址、客户端中同步数据</p>
        <p>新增连接内携带服务和名称自动打开导入弹窗功能，例：</p>
        <p>
          <a
            href='https://jx3.btcsg.top/?xf=lhj&server=梦江南&name=剑网三'
            target='_blank'
            rel='noreferrer'
          >
            jx3.btcsg.top/?xf=lhj&server=梦江南&name=剑网三
          </a>
        </p>
      </p>,
      '综合-重构',
      <p style={{ paddingLeft: 12 }} key='1.1.11.2'>
        <p>重构计算函数对技能增益的计算函数</p>
        <p>
          大幅提升计算效率，在花间、蓬莱等循环较为复杂的情况下以及勾选团队增益情况下性能提升明显，约有50%提升。
        </p>
        <p>放开花间游、凌海诀的优化算法功能。若后续发现依然卡死再关闭</p>
      </p>,
      '综合-Bug',
      <p style={{ paddingLeft: 12 }} key='1.1.11.3'>
        <p>修复了「归去来棍·悟」的数值错误</p>
      </p>,
      <p style={{ color: 'red' }} key='1.1.11.3'>
        本次重构代码较为底层，若有问题请及时反馈
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.10',
    date: '2024-07-13 20:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.10.1'>
        <p>角色配装导入额外支持按角色id查询</p>
        <p>仙王蛊鼎增伤修订为「15%」</p>
      </p>,
      '山海心诀·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.10.2'>
        <p>更新了十九停「珠海哥」打的JCL生成的循环</p>
        <p>目前看大部分情况下2动物比3动物更高</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.9',
    date: '2024-07-12 15:30:00',
    content: [
      '无方·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.9.2'>
        <p>新增无方·悟心法</p>
        <p>内置四个循环为「长倦」打的手动循环。为1段加速计算</p>
        <p style={{ color: 'red' }}>默认按「鬼门·悟」50%覆盖计算，如不计算鬼门可手动修改奇穴</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.8',
    date: '2024-07-10 12:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.8.1'>
        <p>新增无界团队增益</p>
      </p>,
      '山海心诀·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.8.2'>
        <p>增加二动物循环，目前由于JCL解析无界丟buff原因。可能存在波动</p>
        <p>二动物三动物打法对延迟要求不同，实际自己试试哪个高打哪个</p>
        <p>吐槽一下界万灵手动也太吃延迟了</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.7',
    date: '2024-07-09 10:30:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.7.2'>
        <p>新增了内功加速五彩石</p>
        <p>配装器内当装备精炼等级未满时，会有更清晰的提示</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='1.1.7.1'>
        <p>新增了避奚养荣循环</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.6',
    date: '2024-07-08 09:30:00',
    content: [
      '7月8日技改',
      <p style={{ paddingLeft: 12 }} key='1.1.0.2'>
        <a
          href='https://jx3.xoyo.com/index/#/article-details?kid=1333878'
          target='_blank'
          rel='noreferrer'
        >
          技改链接
        </a>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.1.5.1'>
        <p>非侠修改为「14%」（数值144）</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='1.1.5.1'>
        <p>非侠修改为「10%」（数值102）</p>
        <p>修改了各循环名称，删除了应理的「终极」「初级」循环，删除武学助手循环</p>
        <p>更新了养荣循环，现在为5分钟循环</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='1.1.5.1'>
        <p>修复模拟器点出奇穴「周流」时识破诀锐意增加数值不正确的问题</p>
      </p>,
      '山海心诀·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.5.1'>
        <p>循环变动，手动循环暂时只支持一段加速计算。近期可能会随时调整更新</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.5',
    date: '2024-07-07 00:30:00',
    content: [
      '山海心诀·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.5.1'>
        <p>- 新增了山海心诀·悟无界心法的计算器。</p>
        <p>- 内置三个循环：【紫武_助手】【紫武_手动】【橙武_手动】</p>
        <p style={{ color: 'red' }}>
          -
          特别说明！！目前有反馈高破招号在副本内dps异常。目前原因未知，经测试无增益情况下无异常。暂不确定是哪个增益导致异常。
          <p>目前请勿根据本计算器拍高破招装备。旗舰账号暂时不建议针对无界进行配装修改。</p>
        </p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.4',
    date: '2024-07-03 19:50:00',
    content: [
      '7月3日技改',
      <p style={{ paddingLeft: 12 }} key='1.1.0.2'>
        <a href='https://jx3.xoyo.com/announce/gg.html?id=1333872' target='_blank' rel='noreferrer'>
          技改链接
        </a>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='1.1.1.3'>
        <p>- 非侠调整为11%（系数为113）</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='1.1.1.3'>
        <p>- 养荣额外伤害提高90%</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='1.1.1.3'>
        <p>- 非侠调整为18%（系数为184）</p>
        <p>- 「戗风」被动8%，吃影子额外8%（系数82）</p>
        <p>- 「击懈」诀云势增加100%非侠（系数1024）</p>
        <p>- 模拟器同步更新威声、涣衍、流岚等逻辑</p>
        <p>- 根据模拟器生成了新的六破、无影刀、橙武循环</p>
      </p>,
      '孤锋诀·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.1.3'>
        <p>- 非侠调整为45%（系数为461）</p>
        <p>- 「留客雨·悟」命中存在流血buff的目标时刷新目标流血</p>
        <p>- 根据模拟器生成了新的手动、助手、橙武循环</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.3',
    date: '2024-07-03 16:50:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.3.1'>
        <p>- 服务器资源更换，感谢「冰糖雪梨橙」的大力支持</p>
        <p>- 新增角色导入功能，可以直接导入游戏内角色配装。请在配装器内查看</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.2',
    date: '2024-07-01 17:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.2.1'>
        <p>- 页面新增了「识别装备对比」工具功能。使用前请阅读使用说明</p>
        <p>- 花里胡哨的功能又增加了</p>
        <p>
          (
          原计划用OCR做图片识别的，后来发现免费的识别精度很低，又发现插件有文字复制功能，就改为使用文字解析
          )
        </p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.1',
    date: '2024-06-28 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.1.1'>
        <p>- 修正了由于引入孤锋诀悟心法导致的其他心法加速阈值计算错误的问题</p>
        <p>- 优化了无界破招伤害的取整函数，和攻击力计算分开走取整链然后合并计算</p>
      </p>,
      '孤锋诀·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.1.3'>
        <p>- 根据风雪的JCL导入了助手循环</p>
        <p>- 修正了流血buff计算未计算加速导致横云势和留客雨伤害异常的问题</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.1.0',
    date: '2024-06-27 09:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.0.1'>
        <p>- 面板属性增加伤帽的破防属性显示（之前没显示是为了对齐之前的魔盒）</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='1.1.0.2'>
        <p>- 修复了刀宗非侠按通用增伤计算的bug</p>
      </p>,
      '孤锋诀·悟',
      <p style={{ paddingLeft: 12 }} key='1.1.0.3'>
        <p>- 新增了孤锋诀·悟无界心法的计算器。包含模拟器同步更新</p>
        <p>- 内置三个循环：【紫武_助手】【紫武_手动】【橙武_手动】</p>
        <p style={{ color: 'red' }}>
          - 特别说明，由于目前无界武学助机制尚未研究明白。经过多次测试完全找不到规律。
        </p>
        <p style={{ color: 'red' }}>
          - 当前的紫武助手循环为哪个亮了点哪个，且模拟助手释放留客雨时的卡顿效果生成的循环
        </p>
        <p>- 武学助手机制尚未测试完成，暂不开放模拟器内的武学助手功能。</p>
        <p>
          <a href='https://www.jx3box.com/bps/82408' target='_blank' rel='noreferrer'>
            - 点击查看无界刀宗不完全攻略指南
          </a>
        </p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.14',
    date: '2024-06-23 14:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.14.1'>
        <p>- 删除装备库数据中未支持心法的装备。以压缩代码体积</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.0.14.2'>
        <p>- 新增「鬼追」一键宏新手流派。</p>
        <p>- 该流派JCL来源于「奶茶」在成都打死粉茶茶的完整战斗数据，数据已计算枭神斩杀效果</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.13',
    date: '2024-06-18 09:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.13.1'>
        <p>- 新增全局伤害因子独立乘区，应用场景例【青冠】【正律】</p>
        <p>- 配装器装备选择区间下降至12100品</p>
        <p>- 配装器装备新增10100赠送橙武</p>
        <p>- 在外部显示了技能数量统计。考虑布局原因。在打开增益面板时会隐藏技能统计</p>
        <p>- 优化了查看模拟战斗技能详情的按钮样式，使其更容易被认为是可以点击按钮</p>
      </p>,
      '花间游',
      <p style={{ paddingLeft: 12 }} key='1.0.13.2'>
        <p>{`- 应「蔓海赋尘」大佬支持。新增花间游心法`}</p>
        <p>{`- 支持循环：`}</p>
        <p>{`- 紫武：1、2段加速「焚玉」；1、2段加速「故幽」`}</p>
        <p>{`- 橙武：2段加速「焚玉」；2段加速「故幽」`}</p>
        <p style={{ color: 'red' }}>注意</p>
        <p>- 橙武循环无视配装加速情况，固定按2段加速计算</p>
        <p>- 紫武循环只计算1、2段加速配装，0段加速面板计算结果直接返回0</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.12',
    date: '2024-06-12 18:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.12.1'>
        <p>- 新增会破比、招无比两个收益图表（花里胡哨的功能又增加了）</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.0.12.2'>
        <p>{`- 压缩了背景图片的尺寸`}</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.11',
    date: '2024-06-11 10:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.11.1'>
        <p>- 新增三个试炼之地目标，方便计算。数据来源魔盒</p>
        <p>- 冷龙峰副本Boss防御数据与124级木桩相同，不额外添加</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.0.5.2'>
        <p>{`- 配装器武器选择增加5600品归一`}</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.10',
    date: '2024-06-07 18:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.10.1'>
        <p>- 订正负数破招系数的计算函数</p>
        <p>- 优化了计算程序函数，理论计算效率提升一倍</p>
        <p>- 优化了在开启智能对比后，无论是否展开阵眼弹窗都会重复多次计算导致性能损耗的BUG</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.9',
    date: '2024-05-30 18:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.9.1'>
        <p>- 增加了端午节日增益粽子和小吃，在团队增益弹窗中可选</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='1.0.9.2'>
        <p>
          - 新增了凌海诀「怅归」循环，
          <span style={{ color: 'red' }}>默认按一段加速计算。非一段加速配装会返回0</span>
        </p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.8',
    date: '2024-05-29 11:15:00',
    content: [
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='1.0.8.2'>
        <p>{`- 生成了新的丛云朝仪循环，时间为第五轮大招打完`}</p>
        <p>{`- 对循环进行重新订正`}</p>
        <p>{`- 模拟器增加了对倒读条技能的延迟补偿逻辑`}</p>
        <p>{`- 订正了模拟器对于同时间Dot伤害和叠加Dot行为先后顺序逻辑`}</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.7',
    date: '2024-05-28 12:40:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.7.1'>
        <p>{`- 修改了全局的DOT系数计算公式，使其更加合理易懂`}</p>
        <p>{`- 新增了新的增益类型，无双百分比。对面板无双乘法计算，例：养荣`}</p>
      </p>,
      '无方',
      <p style={{ paddingLeft: 12 }} key='1.0.7.2'>
        <p>{`- 新增无方心法`}</p>
        <p>{`- 无方循环数据均由长倦大佬提供`}</p>
        <p>养荣循环经长倦确认定为按千枝全程覆盖计算</p>
        <p style={{ color: 'red' }}>注意，无方循环目前均为一段加速固定计算。</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='1.0.7.2'>
        <p>{`- 生成了新的二段加速橙武循环`}</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.0.5.2'>
        <p>{`- 修复了天斗旋一个伤害秘籍的文案错误`}</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.6',
    date: '2024-05-27 09:30:00',
    content: [
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='1.0.6.2'>
        <p>{`- 非侠系数修改「6」=> 「13」`}</p>
        <p>{`- 流岚无视防御「40%」=>「25%」`}</p>
        <p>{`- 以上两条数值待更新后测试，133和256`}</p>
        <p>{`- 模拟器溃延减少诀云CD「10」=>「11」`}</p>
        <p>{`- 外部计算循环暂未通过模拟器重新生成，理论上溃延对结果影响较小。`}</p>
        <p style={{ color: 'red' }}>{`- 最终伤害正负1%上下浮动，约等于没变`}</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='1.0.6.2'>
        <p>{`- 移除非侠3%加成`}</p>
        <p style={{ color: 'red' }}>{`- 最终伤害削弱2%-3%`}</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.0.6.2'>
        <p>{`- 由于JCL解析鬼遁丢失问题，暂时将鬼遁视作全局覆盖计算`}</p>
        <p>{`- 更新了新的橙武循环`}</p>
        <p>{`- 修复了紫武鬼列循环鬼遁覆盖计算有问题的BUG`}</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.5',
    date: '2024-05-24 12:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.5.1'>
        <p>{`- 修正了全局对于技能系数增伤的计算取整位置，例：涤瑕、素矰等`}</p>
        <p>{`- 新增了技能系数对技能等级的取值逻辑`}</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='1.0.5.2'>
        <p>{`- 修正「停云势」和「断云势」的武器伤害系数「2.5」=> 「2」`}</p>
        <p>{`- 精细破招系数的算法`}</p>
        <p>{`- 修复门派套装双会buff的覆盖率时间`}</p>
      </p>,
      '山海心诀',
      <p style={{ paddingLeft: 12 }} key='1.0.5.2'>
        <p>{`- 精细破招系数的算法`}</p>
      </p>,
      '太玄经',
      <p style={{ paddingLeft: 12 }} key='1.0.5.2'>
        <p>{`- 新增太玄经心法`}</p>
        <p>{`- 支持循环「鬼列」「堪炸」「橙武」`}</p>
        <p style={{ color: 'red' }}>注意，太玄经循环目前均为一段加速固定计算。</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.4',
    date: '2024-05-21 10:45:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.4.1'>
        <p>{`- 修复「关闭背景」功能重新进入页面没有读取缓存的问题`}</p>
        <p>{`- 修复系统中部分错别字 「决」 => 「诀」`}</p>
        <p>{`- 增加「万灵阵(从朱)」选项，覆盖率100%`}</p>
      </p>,
      '孤锋诀',
      <p style={{ paddingLeft: 12 }} key='1.0.4.2'>
        <p>- 修复孤锋诀无法选择力道五彩石的BUG</p>
        <p>
          -
          更新了孤锋诀模拟器内DOT伤害的快照拆分，（后续保存的循环会生效，外面循环目前没改。理论差距不大）
        </p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.3',
    date: '2024-05-17 10:40:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.3.1'>
        <p>- 配装器快速一键附魔功能增加选择计算部位功能，大大提高计算效率</p>
        <p>- 修复切换循环没有自动切换至对应循环奇穴的BUG</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='1.0.3.2'>
        <p>- 凌海诀计算卡顿的原因为循环细化的较为详细，计算过程更为复杂</p>
        <p>- 暂时去除了凌海诀的「优化算法」功能</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.2',
    date: '2024-05-16 09:40:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.0.2.1'>
        <p>- 主JS拆包，优化了首次加载的速度</p>
      </p>,
      '凌海诀',
      <p style={{ paddingLeft: 12 }} key='1.0.2.2'>
        <p>- 根据方小皮提供的橙武JCL生成了新的橙武循环</p>
        <p>- 修复了普通水特效和风特效没有生效的BUG</p>
        <p>- 增加了团队增益快捷设置</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.1',
    date: '2024-05-11 16:10:00',
    content: ['支持凌海诀模块，数据提供：考拉。测试：方小皮（还在调试中）'],
  },
  {
    version: '[雾海寻龙] 1.0.0',
    date: '2024-05-11 16:10:00',
    content: [
      '合并万灵/刀宗计算器',
      '项目代码重构',
      '系统右上角可以切换心法',
      '新心法可以通过录入心法模块实现，提高了接入效率',
      '理论计算效率提升50%，1164次附魔计算本地耗时【500ms】 => 【240ms】',
      '后续提供接入文档',
    ],
  },
]
