import { 属性系数, 等级常数, 等级系数 } from '@/数据/常量'
import { 目标属性类型 } from '@/@types/常量'

export const 目标集合: 目标属性类型[] = [
  {
    名称: '54级木桩',
    等级: 54,
    防御系数: 属性系数.防御 * (等级系数 * 54 - 等级常数),
    防御点数: 6592,
    目标类型: '木桩',
  },
  {
    名称: '53级木桩',
    等级: 53,
    防御系数: 属性系数.防御 * (等级系数 * 53 - 等级常数),
    防御点数: 6399,
    目标类型: '木桩',
  },
  {
    名称: '52级木桩',
    等级: 52,
    防御系数: 属性系数.防御 * (等级系数 * 52 - 等级常数),
    防御点数: 3841,
    目标类型: '木桩',
  },
  {
    名称: '51级木桩',
    等级: 51,
    防御系数: 属性系数.防御 * (等级系数 * 51 - 等级常数),
    防御点数: 2791,
    目标类型: '木桩',
  },
  {
    名称: '53级Boss',
    等级: 53,
    防御点数: 6399,
    防御系数: 属性系数.防御 * (等级系数 * 53 - 等级常数),
    目标类型: '试炼',
  },
]

export default 目标集合
