import { Buff枚举, 循环基础技能数据类型, 日志类型 } from '../simulator/type'
import { 基础GCD帧 } from '.'
import { 每秒郭氏帧 } from '@/数据/常量'
import { 通用Buff数据, 通用循环模拟技能基础数据 } from '../../通用/通用技能/通用技能定义'

const 循环模拟技能基础数据: 循环基础技能数据类型[] = [
  ...(通用循环模拟技能基础数据 as any),
  {
    // 并蒂夺株·悟 - 持续4s，每秒1跳伤害，每跳获得1点温性
    技能名称: '并蒂夺株·悟',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 18,
    技能GCD组: '公共',
    技能类型: '对阵招式',
    图标: 'https://icon.jx3box.com/icon/101368.png',
  },
  {
    // 青圃着尘·悟 - 倒读条3.06s，6跳伤害，每跳获得1点寒性
    技能名称: '青圃着尘·悟',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 25,
    是否为倒读条技能: true,
    技能GCD组: '公共',
    技能类型: '对阵招式',
    图标: 'https://icon.jx3box.com/icon/101367.png',
  },
  {
    // 苍棘缚地·悟 - 持续9s，每秒1跳，沾衣触发额外攻击最多+2跳
    技能名称: '苍棘缚地·悟',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 60,
    技能GCD组: '公共',
    技能类型: '绝技技能',
    图标: 'https://icon.jx3box.com/icon/101370.png',
  },
  {
    // 沾衣未妨·悟 - 持续4s，每秒1跳伤害，每跳获得1点寒性
    技能名称: '沾衣未妨·悟',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 15,
    技能GCD组: '公共',
    技能类型: '对阵招式',
    图标: 'https://icon.jx3box.com/icon/15408.png',
  },
  {
    // 川乌射罔·悟 - 倒读条2.56s，4跳伤害，每跳获得1点温性
    技能名称: '川乌射罔·悟',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 12,
    是否为倒读条技能: true,
    技能GCD组: '公共',
    技能类型: '对阵招式',
    图标: 'https://icon.jx3box.com/icon/15407.png',
  },
  {
    // 钩吻断肠·悟·普通 - 基础技能，造成伤害获得1点温性，触发追加
    技能名称: '钩吻断肠·悟·普通',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 0,
    技能GCD组: '公共',
    技能类型: '傍身招式',
    图标: 'https://icon.jx3box.com/icon/15406.png',
  },
  {
    // 钩吻断肠·悟·追加 - 由普通触发，造成伤害获得1点寒性
    技能名称: '钩吻断肠·悟·追加',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 0,
    技能GCD组: '公共',
    技能类型: '傍身招式',
    图标: 'https://icon.jx3box.com/icon/101358.png',
  },
  {
    技能名称: '凌然天风·悟',
    技能释放后添加GCD: 0,
    技能CD: 每秒郭氏帧 * 30,
    技能GCD组: '自身',
    技能类型: '其他',
    图标: 'https://icon.jx3box.com/icon/101369.png',
  },
  // {
  //   技能名称: '唤醒',
  //   技能释放后添加GCD: 0,
  //   技能GCD组: '自身',
  //   技能类型: '其他',
  //   图标: 'https://icon.jx3box.com/icon/18440.png',
  // },
  // {
  //   技能名称: '易命',
  //   技能释放后添加GCD: 0,
  //   技能GCD组: '自身',
  //   技能类型: '其他',
  //   图标: 'https://icon.jx3box.com/icon/337.png',
  // },
  // {
  //   技能名称: '损毁',
  //   技能释放后添加GCD: 0,
  //   技能GCD组: '自身',
  //   技能类型: '其他',
  //   图标: 'https://icon.jx3box.com/icon/3452.png',
  // },
  {
    技能名称: '换行',
    技能释放后添加GCD: 0,
    技能CD: 0,
    技能GCD组: '自身',
    技能类型: '绝技技能',
    图标: 'https://icon.jx3box.com/icon/24490.png',
    说明: '插入换行将只以"换行"作为展示换行。',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
  '循环异常',
]

export enum 技能GCD组 {
  公共,
  自身,
  换箭,
}

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  // Buff
  钩吻断肠绝章: {
    类型: '自身',
    名称: '钩吻断肠绝章',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 10,
    图标: 'https://icon.jx3box.com/icon/15406.png',
    备注: '内功基础攻击+15%',
  },
  烬灭: {
    类型: '自身',
    名称: '烬灭',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 30,
    图标: 'https://icon.jx3box.com/icon/23414.png',
    备注: '橙武特效，伤害提高15%',
  },
  并蒂增伤: {
    类型: '自身',
    名称: '并蒂增伤',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 2,
    图标: 'https://icon.jx3box.com/icon/101368.png',
    备注: '释放并蒂夺株后获得，持续5s，苍棘缚地伤害提高10%',
  },
  钩吻追加: {
    类型: '自身',
    名称: '钩吻追加',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 3,
    图标: 'https://icon.jx3box.com/icon/101358.png',
    备注: '可以施展钩吻断肠·追加',
  },
  唤醒10: {
    类型: '自身',
    名称: '唤醒10',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/18440.png',
    备注: '唤醒每层增伤2%，10层',
  },
  唤醒20: {
    类型: '自身',
    名称: '唤醒20',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/18440.png',
    备注: '唤醒每层增伤2%，20层',
  },
  唤醒30: {
    类型: '自身',
    名称: '唤醒30',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/18440.png',
    备注: '唤醒每层增伤2%，30层',
  },
  易命: {
    类型: '自身',
    名称: '易命',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/337.png',
    备注: '承此余力，死战不息。自身最大气血、伤害与治疗效能显著提升',
  },
  损毁5: {
    类型: '自身',
    名称: '损毁5',
    最大层数: 5,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/3452.png',
    备注: '损毁严重，每层使受到的伤害提高10%，5层',
  },
  损毁20: {
    类型: '自身',
    名称: '损毁20',
    最大层数: 20,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/3452.png',
    备注: '损毁严重，每层使受到的伤害提高10%，20层',
  },
  损毁50: {
    类型: '自身',
    名称: '损毁50',
    最大层数: 50,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/3452.png',
    备注: '损毁严重，每层使受到的伤害提高10%，50层',
  },
  凌然天风: {
    类型: '自身',
    名称: '凌然天风',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 5,
    图标: 'https://icon.jx3box.com/icon/101369.png',
    备注: '腾跃而起，仰止苍穹。',
  },
  中和增伤: {
    类型: '自身',
    名称: '中和增伤',
    最大层数: 1,
    最大持续时间: 每秒郭氏帧 * 6,
    图标: 'https://icon.jx3box.com/icon/16029.png',
    备注: '中和增伤+5%',
  },
  鬼门增伤: {
    类型: '自身',
    名称: '鬼门增伤',
    最大层数: 1,
    最大持续时间: 99999,
    图标: 'https://icon.jx3box.com/icon/101419.png',
    备注: '目标气血低于50%且带有中毒时，自身伤害提高30%',
  },
  // DOT
  中毒: {
    类型: '目标',
    名称: '中毒',
    最大层数: 1,
    最大作用次数: 6,
    最大持续时间: 每秒郭氏帧 * 6,
    伤害频率: 16,
    图标: 'https://icon.jx3box.com/icon/70618.png',
    备注: '中毒DOT，由中和触发，每1秒造成毒性内功伤害，共6跳',
  },
  ...(通用Buff数据 as any),
}
