import { 获取实际帧数 } from '@/工具函数/data'
import { 待生效事件 } from '../../type'
import 技能统一类 from '../../通用类/技能统一类'

class 大漠刀法 extends 技能统一类 {
  static 原始间隔 = 16
  static 最大事件次数 = 500

  constructor(模拟循环) {
    super(模拟循环)
  }

  初始化普攻轴() {
    this.触发伤害行为('大漠刀法')
    this.刷新普攻序列()
  }

  刷新普攻序列(初始时间 = this.模拟循环.当前时间) {
    const 待生效事件: 待生效事件[] = []
    const 当前间隔 = 获取实际帧数(大漠刀法.原始间隔, this.模拟循环.加速值) + 1
    for (let i = 1; i <= 大漠刀法.最大事件次数; i++) {
      待生效事件.push({ 事件名称: '大漠刀法检查', 事件时间: 初始时间 + 当前间隔 * i })
    }
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  大漠刀法检查() {
    this.触发伤害行为('大漠刀法')
    if (
      this.模拟循环.待生效事件队列.filter((事件) => 事件.事件名称 === '大漠刀法检查').length === 1
    ) {
      this.刷新普攻序列()
    }
  }
}
export default 大漠刀法
