import { 获取实际技能数据 } from '../../../通用/通用函数'
import 循环主类类型 from '../main'
import { 循环基础技能数据类型, 技能释放记录结果 } from '../type'

class 技能统一类 {
  模拟循环: Partial<循环主类类型> = {}
  本次释放记录: 技能释放记录结果 = {}
  本次释放延迟: number | 'GCD' = 0
  本次释放是否击破: boolean = false
  本次是否在倾怒内: boolean = false
  技能释放前锐意: number = 0
  constructor(模拟循环) {
    this.模拟循环 = 模拟循环
    return
  }

  检查GCD(索引, 当前技能?: 循环基础技能数据类型) {
    const 后一个技能 = this.模拟循环?.测试循环?.[索引 + 1]
    const GCD组 = 当前技能?.技能GCD组 === '自身' ? 当前技能?.技能名称 : 当前技能?.技能GCD组 || ''
    let GCD = this.模拟循环?.GCD组?.[GCD组] || 0
    let 等待GCD = 0

    if (this.本次释放延迟) {
      if (GCD组 === '公共') {
        GCD = GCD + this.本次释放延迟
      }
      // 如果存在后面的技能，判断后面的技能当前的GCD为多少，推进到后一个技能。这样可以让灭卡在后面的技能释放前释放
      else if (this.本次释放延迟 === 'GCD' && 后一个技能) {
        const 后一个技能实际名称 = 获取实际技能数据(后一个技能)?.实际技能名称
        const 下一个技能 = this?.模拟循环?.技能基础数据?.find(
          (item) => item?.技能名称 === 后一个技能实际名称,
        )
        if (下一个技能 && 下一个技能?.技能GCD组) {
          if (下一个技能?.技能GCD组 !== ('自身' as any)) {
            const 技能实例 = this?.模拟循环?.技能类实例集合?.[下一个技能?.技能名称]
            const 后一个技能GCD = this.模拟循环?.检查GCD?.(下一个技能, 技能实例, 索引 + 1) || 0
            等待GCD = 后一个技能GCD
          } else {
            const 再下一个技能实际名称 = 获取实际技能数据(
              this.模拟循环?.测试循环?.[索引 + 2],
            )?.实际技能名称
            const 再下一个技能 = this?.模拟循环?.技能基础数据?.find(
              (item) => item?.技能名称 === 再下一个技能实际名称,
            )
            if (再下一个技能 && 再下一个技能?.技能GCD组 !== ('自身' as any)) {
              const 技能实例 = this?.模拟循环?.技能类实例集合?.[再下一个技能?.技能名称]
              const 后一个技能GCD = this.模拟循环?.检查GCD?.(再下一个技能, 技能实例, 索引 + 2) || 0
              等待GCD = 后一个技能GCD
            }
          }
        }
      } else {
        等待GCD = Number(this.本次释放延迟)
      }
      if (等待GCD) {
        GCD = Math.max(等待GCD, GCD)
      }
    }

    this.本次释放延迟 = 0
    return GCD
  }

  释放前初始化(额外信息) {
    if (额外信息?.延迟) {
      this.本次释放延迟 = 额外信息?.延迟
    }
    // 重置释放记录
    this.本次释放记录 = {}
    this.本次释放是否击破 = false
    this.本次是否在倾怒内 = !!this.模拟循环.当前自身buff列表?.['倾怒']?.当前层数
    this.技能释放前锐意 = this.模拟循环?.角色状态信息?.锐意 || 0
  }
  触发回复锐意(锐意值, 来源) {
    this.模拟循环.增加锐意?.(锐意值, 来源)
  }

  触发消耗锐意(锐意值, 来源) {
    // const 当前锐意 = this.模拟循环.角色状态信息?.锐意 || 0
    this.模拟循环.减少锐意?.(锐意值, 来源)
  }

  触发伤害行为(
    伤害名称,
    伤害次数 = 1,
    额外增益列表: string[] = [],
    触发伤害时间: number | undefined = undefined,
    DOT伤害 = false,
    技能等级 = 1,
  ) {
    this.模拟循环.技能造成伤害?.(伤害名称, 伤害次数, 额外增益列表, 触发伤害时间, DOT伤害, 技能等级)

    this.模拟循环.卸除buff?.({ 名称: '弱点内置CD', 对象: '目标' })
  }

  当前破绽层数() {
    return this.模拟循环.当前目标buff列表?.['破绽']?.当前层数 || 0
  }

  当前洄涛层数() {
    return this.模拟循环.当前自身buff列表?.['洄涛']?.当前层数 || 0
  }

  获得破绽(来源) {
    const 当前沧逸层数 = this.模拟循环.当前自身buff列表?.['沧逸']?.当前层数 || 0
    if (当前沧逸层数) {
      this.获得洄涛(`${来源}-沧逸`)
    } else {
      this.实际获得破绽()
    }
  }

  实际获得破绽() {
    if (this.模拟循环.校验奇穴是否存在?.('洄涛') && this.当前破绽层数() >= 4) {
      this.获得洄涛('洄涛-破绽满层')
    } else {
      this.模拟循环.添加buff?.({ 名称: '破绽', 对象: '目标' })
    }
  }

  获得洄涛(来源) {
    if (this.模拟循环.校验奇穴是否存在?.('洄涛')) {
      this.模拟循环.添加buff?.({ 名称: '洄涛', 对象: '自身', 来源 })
    }
  }

  判定破浪三式洄涛() {
    if (this.当前洄涛层数()) {
      this.消耗洄涛('破浪三式-转化洄涛')
      this.获得破绽('破浪三式-转化洄涛')
    }
  }

  消耗洄涛(来源) {
    if (this.当前洄涛层数()) {
      const 原刷新时间 = this.模拟循环.当前自身buff列表?.['洄涛']?.刷新时间 || 0
      this.模拟循环.卸除buff?.({
        名称: '洄涛',
        对象: '自身',
        buff刷新时间: 原刷新时间,
        卸除层数: 1,
        来源,
      })
    }
  }

  测试不会影响洄涛的击破(来源?) {
    // 沧1在洄滔>=8时可以击破
    if (
      // this.模拟循环.当前自身buff列表?.['倾怒']?.当前层数 &&
      // !this.模拟循环.当前自身buff列表?.['沧链'] &&
      // this.模拟循环.当前自身buff列表?.['洄涛']?.当前层数 &&
      // this.模拟循环.当前自身buff列表?.['洄涛']?.当前层数 >= 8
      // 改为怒内也挤迫,只看涣衍
      !this.模拟循环.当前目标buff列表?.['破绽']?.当前层数 ||
      this.模拟循环.当前目标buff列表?.['破绽']?.当前层数 < 3
    ) {
      return true
    } else {
      return false
    }
  }

  弱点击破判定(来源?) {
    if (this.模拟循环.自动击破) {
      if (this.弱点存在判定() && this.测试不会影响洄涛的击破(来源)) {
        this.模拟循环?.技能类实例集合?.['弱点击破']?.弱点击破命中?.()
        this.本次释放是否击破 = true
      }
    } else {
      if (this.模拟循环.当前自身buff列表?.['下一个技能会触发击破']?.当前层数 || 0) {
        this.模拟循环?.技能类实例集合?.['弱点击破']?.弱点击破命中?.()
        this.模拟循环.卸除buff?.({ 名称: '下一个技能会触发击破', 对象: '自身' })
      }
    }
  }

  弱点存在判定() {
    return (
      !!this.模拟循环.当前目标buff列表?.['弱点_左']?.当前层数 ||
      !!this.模拟循环.当前目标buff列表?.['弱点_右']?.当前层数
    )
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
      本次是否击破: !!this.本次释放是否击破,
      // 这里可以写数字，true,false等。然后搜索 const 底部标识函数 看那里怎么写的
      // 底部标识: !!this.本次是否在倾怒内, // Boolena
      底部标识: this.技能释放前锐意, // Text
      背景容器: !!this.本次是否在倾怒内, // background
    }
  }

  获取当前重要buff列表(技能依赖自身buff列表: string[] = [], 技能依赖目标buff列表: string[] = []) {
    const 重要buff列表: string[] = []
    技能依赖自身buff列表.forEach((buff) => {
      if (this.模拟循环.当前自身buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    技能依赖目标buff列表.forEach((buff) => {
      if (this.模拟循环.当前目标buff列表?.[buff]?.当前层数) {
        重要buff列表.push(buff)
      }
    })
    return 重要buff列表 || []
  }

  获取施加重要buff信息(buff名称) {
    const 当前时间 = this.模拟循环.当前时间 || 0
    const buff对象 = this.模拟循环.Buff和Dot数据?.[buff名称]

    return buff对象
      ? {
          buff名称: buff名称,
          buff开始时间: 当前时间,
          buff结束时间: 当前时间 + (buff对象?.最大持续时间 || 0),
        }
      : null
  }
}

export default 技能统一类
