import type { 循环数据 } from '@/@types/循环'

/**
 * @name 用于计算的循环数据
 * 该数据可以通过JCL分析器进行获取，也可以自己根据实际情况编写
 */

// 循环
import 橙武_亘天_暗影千机 from './橙武_亘天_暗影千机.json'
import 紫武_亘天_暗影千机 from './紫武_亘天_暗影千机.json'
import 橙武_极_亘天_暗影千机 from './橙武_极_亘天_暗影千机.json'
import 橙武_撞灯_暗影千机 from './橙武_撞灯_暗影千机.json'
import 紫武_撞灯_暗影千机 from './紫武_撞灯_暗影千机.json'
import 特效_麒麟3_暗影千机 from './特效_麒麟3_暗影千机.json'
import 特效_麒麟2_暗影千机 from './特效_麒麟2_暗影千机.json'

const 计算循环: 循环数据[] = [
  紫武_亘天_暗影千机,
  橙武_亘天_暗影千机,
  橙武_极_亘天_暗影千机,
  紫武_撞灯_暗影千机,
  橙武_撞灯_暗影千机,
  特效_麒麟3_暗影千机,
  特效_麒麟2_暗影千机,
] as 循环数据[]

export default 计算循环
