import 循环模拟技能基础数据 from '../../../constant/skill'
import { 待生效事件 } from '../../type'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 弛律召野 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '弛律召野')

  constructor(模拟循环) {
    super(模拟循环)

    // 因为横断技能充能信息受奇穴影响，这里做覆盖
    弛律召野.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '弛律召野')

    this.初始化技能运行数据()
  }

  释放() {
    const 朱厌 = this.模拟循环.校验奇穴是否存在('朱厌')
    if (朱厌) {
      this.模拟循环.召唤宠物('弛律召野', ['朱厌'])
      this.模拟循环.召唤宠物('弛律召野', ['朱厌'])
      this.模拟循环.召唤宠物('弛律召野', ['朱厌'])
    } else {
      this.模拟循环.召唤宠物('弛律召野')
    }

    if (this.模拟循环?.校验奇穴是否存在('命俦')) {
      this.触发命俦召唤额外虎()
    }
  }

  触发命俦召唤额外虎() {
    const 待生效事件: 待生效事件[] = []
    for (let i = 0; i < 5; i++) {
      待生效事件.push({
        事件名称: `命铸-宠物攻击`,
        事件时间: this.模拟循环.当前时间 + 3 * 16 * (i + 1),
        事件备注: {
          宠物名称: '命铸',
        },
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件)
  }
}

export default 弛律召野

export const 弛律召野类型 = typeof 弛律召野
