import { Space } from 'antd'
import { 配装, 图片 } from '../../../components'
import 十人基础 from './配装数据/10人基础.json'
import 普通配装 from './配装数据/普通配装.json'
import 英雄平民 from './配装数据/英雄平民.json'
import 普通烛微 from './配装数据/普通烛微.json'
import 橙武配装 from '@/心法模块/心法/孤锋诀/推荐配装/橙武.json'
import 紫武配装 from '@/心法模块/心法/孤锋诀/推荐配装/紫武.json'

export default function 推荐配装() {
  return (
    <>
      <h3>加速</h3>
      <p>
        低延迟玩家（稳定 45 以下）：三段加速 <strong>928</strong>
      </p>
      <p>
        中延迟玩家（稳定 70 以下）：四段加速 <strong>1452</strong>
      </p>
      <p>
        高延迟玩家（稳定 90 以下）：五段加速 <strong>2024</strong>
      </p>
      <i>
        延迟高低只能给个参考数值，实际上受物理距离、加速器、按键速度、是否解帧、网线质量等影响，具体哪个最适合需要自行测试，最基本要求是保证灭影覆盖完第二组三沧孤。
      </i>

      <h3>附魔</h3>
      <p>优先配好加速：攻击 ≈ 力道 {'>'} 其他。</p>

      <h3>五彩石</h3>
      <p>请注意，五彩石差距甚微，具体会随着配装变化而不同，但差距波动较小，建议买便宜的</p>
      <p>
        赛季前中期：<strong>加速·无双·外攻</strong> | <strong>x·破防·外攻</strong> |{' '}
        <strong>x·外攻·破防</strong> ———— 打开交易行搜
        <strong>·斩铁·锐刃</strong> 或 <strong>·锐刃·斩铁</strong> 买最便宜的
      </p>
      <p>
        赛季中后期：<strong>x·外攻·会效</strong> | <strong>x·破防·会效</strong> |{' '}
        <strong>x·会效·外攻</strong>
      </p>

      <h3>四件套</h3>
      <p>四件套性价比极高，但拉满不如 2 件套 + 全黄字。</p>

      <h3>配装思路</h3>
      <p>
        配装不是死的，认死一个配装图可能一赛季都无法毕业；根据自身延迟、预算与掉落、常用阵眼等调整才最好。
      </p>
      <p>
        普通玩家优先保证<strong>四件套</strong>
        和加速达标，剩余部位会心破防都差不多。预算充足的玩家后期可考虑2件套+黄字的组合。其中套装衣服（加速）必备
      </p>
      <h4>紫武</h4>
      <Space wrap>
        <配装 名称='10人副本速成' 视图='配装页面' 缩放={0.45} 配装数据={十人基础} />
        <配装 名称='25人普通速成' 视图='配装页面' 缩放={0.45} 配装数据={普通配装} />
        <配装 名称='25人英雄平民' 视图='配装页面' 缩放={0.45} 配装数据={英雄平民} />
        <配装 名称='紫武终局参考' 视图='配装页面' 缩放={0.45} 配装数据={紫武配装} />
      </Space>
      <h4>橙武</h4>
      <Space wrap>
        <配装 名称='25人普通烛微' 视图='配装页面' 缩放={0.45} 配装数据={普通烛微} />
        <配装 名称='橙武终局参考' 视图='配装页面' 缩放={0.45} 配装数据={橙武配装} />
      </Space>
      <h4>719品烛微刀说明</h4>
      {/* <p>
        英雄水特效 {'>'} 英雄紫武 ≈ 719品烛微刀 {'>'} 普通紫武
      </p> */}
      <p>有719品烛微刀不用换吃鸡武器</p>
    </>
  )
}
