import { 每秒郭氏帧 } from '@/数据/常量'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 暗藏杀机 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '暗藏杀机')

  constructor(模拟循环: any) {
    super(模拟循环)
  }

  释放() {

  }

  命中() {
    this.模拟循环.添加待生效事件队列([{
      事件名称: '暗藏延迟触发',
      事件时间: this.模拟循环.当前时间 + 每秒郭氏帧 * 1.5,
    }])
    this.保存释放记录('暗藏杀机')
  }

  触发伤害(){
    this.触发伤害行为('暗藏杀机', 1)
    if (this.模拟循环.校验奇穴是否存在('波诡云谲')) {
      const 鬼斧备弹数量 = this.模拟循环.当前自身buff列表?.['鬼斧备弹']?.当前层数
      if (鬼斧备弹数量! >= 3) {
        this.模拟循环.添加buff({
          名称: '扬威',
          对象: '自身',
          延长buff时间: 每秒郭氏帧 * 5
        })
        this.模拟循环.添加buff?.({ 名称: "鬼斧弹药", 对象: '自身',新增层数:3 })
        this.模拟循环.卸除buff?.({ 名称: "鬼斧备弹", 对象: '自身',卸除层数:3 })
      }
    }
  }

  保存释放记录(名称: string) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      重要buff列表: this.获取当前重要buff列表(['心无旁骛', '扬威', '神机好穷内攻增伤','神机好穷陷阱增伤', '秋风散影','催寒','气魄','弩心','天风汲雨']),
    }
  }
}

export default 暗藏杀机

export const 暗藏杀机类型 = typeof 暗藏杀机
