import { 技能基础数据模型 } from '@/@types/技能'

export const 天罗阵眼动态函数 = (技能数据映射: Map<string, 技能基础数据模型>) => {
  // 天罗自己拿阵眼时，擘两分星内功增伤的覆盖率调整
  let 擘两分星内功增伤_已调整 = false
  技能数据映射.forEach((单个技能数据映射) => {
    if (!擘两分星内功增伤_已调整) {
      单个技能数据映射.技能增益列表?.find((技能增益) => {
        if (技能增益.增益名称 === '擘两分星·内功' && 技能增益.增益类型 === '全局启用') {
          let 擘两分星内功增益 = 技能增益.增益集合?.at(0)
          if (擘两分星内功增益) {
            // 预估实战分星覆盖率为木桩分星覆盖率的76%
            擘两分星内功增益.值 *= 0.76
            擘两分星内功增伤_已调整 = true // 只调整一次
          }
          return true
        }
        return false
      })
    }
  })
}
