import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '静霂',
        奇穴图片: 'https://icon.jx3box.com/icon/22986.png',
        id: '38479',
        奇穴描述:
          '属于自身的<NounID 77>效果持续时间提高2秒，“招式施展距离降低”强度降低至三成，满层后无法再刷新持续时长，叠加至满层后使目标沉默5秒。',
      },
      {
        奇穴名称: '玉枕',
        奇穴图片: 'https://icon.jx3box.com/icon/22955.png',
        id: '38500',
        奇穴描述:
          '“经脉循行”期间招式无视目标40%防御等级，且若为消耗能量招式则每消耗1点能量额外无视目标0.5%防御等级。',
      },
      {
        奇穴名称: '百会',
        奇穴图片: 'https://icon.jx3box.com/icon/22969.png',
        id: '38503',
        奇穴描述: '引爆“绝脉”时，每引爆一层“绝脉”使目标获得5%减疗效果，持续12秒。',
      },
      {
        奇穴名称: '徙溟',
        奇穴图片: 'https://icon.jx3box.com/icon/22975.png',
        id: '38513',
        奇穴描述:
          '“抟风令”会吸收范围内的“雾海”，若成功吸收则不再吹飞目标，而是使生成的“横驱风靡”持续附带“迷云”，该效果会根据所吸收雾海的剩余时长作用一定次数后消失。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '疏雪',
        奇穴图片: 'https://icon.jx3box.com/icon/24962.png',
        id: '38466',
        奇穴描述:
          '“雪满”转化为<NounID 59>时会标记控制来源6秒，期间对其他目标施展“破穴”时会额外对标记的目标生效一次。',
      },
      {
        奇穴名称: '神封',
        奇穴图片: 'https://icon.jx3box.com/icon/22974.png',
        id: '38481',
        奇穴描述: '消耗任脉和督脉能量之和不低于30点时，回复6点任脉，6点督脉。',
      },
      {
        奇穴名称: '流梨',
        奇穴图片: 'https://icon.jx3box.com/icon/24961.png',
        id: '38497',
        奇穴描述:
          '“雪满”期间可施展二段招式，使自身6秒内免疫封内、缴械和重创，期间<NounID 59>额外免疫击退、被拉。“雪满”效果结束前未施展则自动尝试施展。',
      },
      {
        奇穴名称: '郁潆',
        奇穴图片: 'https://icon.jx3box.com/icon/22956.png',
        id: '38499',
        奇穴描述:
          '自身“雾海萦空”范围内的敌对玩家目标每秒获得3秒“郁潆”效果：基础攻击力和治疗量降低10%，至多5层。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '雪霁风吟',
        奇穴图片: 'https://icon.jx3box.com/icon/24960.png',
        id: '38465',
        奇穴描述: '解除自身控制，并使自身获得6秒<NounID 59>。',
      },
      {
        奇穴名称: '纷飙',
        奇穴图片: 'https://icon.jx3box.com/icon/22983.png',
        id: '38475',
        奇穴描述:
          '“劈风令”引发的骤风共振伤害提高20%，对非侠士目标造成一次<SUB 39340 0>额外伤害，每次施展时返还5%“抟风令”剩余调息时间。',
      },
      {
        奇穴名称: '零露',
        奇穴图片: 'https://icon.jx3box.com/icon/22947.png',
        id: '38493',
        奇穴描述: '“雪满”转化<NounID 59>的比例提升至1:1。',
      },
      {
        奇穴名称: '朔风扬尘',
        奇穴图片: 'https://icon.jx3box.com/icon/22874.png',
        id: '38549',
        奇穴描述:
          '跃起并获得7层“朔风扬尘”效果，技能替换为二段招式扬尘，扬尘公共调息时间0.6秒，“朔风扬尘”持续时间内可以连续施展，延迟0.5秒后向目标位置造成<SUB 38554 0>矩形范围伤害，并回复5点任脉5点督脉能量，被扬尘重复命中则受到的伤害将逐步递增。每次释放还会获得可叠加层数的“扬尘”效果：“经脉循行”期间任脉和督脉能量回复增加1点，每次施展“一阳指”套路招式时消耗1层。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '封枢',
        奇穴图片: 'https://icon.jx3box.com/icon/24963.png',
        id: '38467',
        奇穴描述:
          '“破穴”每消耗10点能量引爆目标1层“绝脉”，每引爆1层返还消耗的10%能量，并使目标受控期间受到自身下一次“引窍”伤害提高3%。\\n成功引爆“绝脉”的“破穴”若成功击退目标，则其触发的“云散”闪现会优先选择距目标更近的位置。',
      },
      {
        奇穴名称: '神门',
        奇穴图片: 'https://icon.jx3box.com/icon/22961.png',
        id: '38490',
        奇穴描述:
          '“破穴”额外附带一次破招伤害，以此方式触发破招使自身内功基础攻击提高20%，无双等级提高15%，持续23秒。',
      },
      {
        奇穴名称: '出岫',
        奇穴图片: 'https://icon.jx3box.com/icon/22976.png',
        id: '38495',
        奇穴描述: '“风流云散”调息时间降低10秒，变为2层充能招式，施展后只能获得1层“云散”。',
      },
      {
        奇穴名称: '风萦',
        奇穴图片: 'https://icon.jx3box.com/icon/24402.png',
        id: '40242',
        奇穴描述: '“劈风令”弹道速度降低50%，伤害降低30%，会在目标周围8尺内的目标之间弹射至多3次。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '骤涌',
        奇穴图片: 'https://icon.jx3box.com/icon/24959.png',
        id: '38472',
        奇穴描述:
          '自身“横驱风靡”内目标数未达上限时，敌方目标进入或离开区域会受到一次<SUB 38548 1>混元内功伤害。',
      },
      {
        奇穴名称: '停岚',
        奇穴图片: 'https://icon.jx3box.com/icon/24958.png',
        id: '38473',
        奇穴描述:
          '自身“雾海”存在期间可施展二段招式：将雾向对侧吹散，使雾海方向区域内至多10名敌方侠士根据雾海的剩余时长获得3-5层“雾渺”。',
      },
      {
        奇穴名称: '茫缈',
        奇穴图片: 'https://icon.jx3box.com/icon/22971.png',
        id: '38501',
        奇穴描述:
          '“骤风”对静止目标伤害增加35%，施展“骤风令”后2秒内可额外施展一次不占基础调息的“劈风令”。',
      },
      {
        奇穴名称: '敕空',
        奇穴图片: 'https://icon.jx3box.com/icon/24401.png',
        id: '40244',
        奇穴描述:
          '“劈风令”命中后标记目标8秒。“抟风令”拉扯被标记的目标会扯出一道风刃，短暂延迟后劈向目标，造成<SUB 40340 1>混元内功伤害，该伤害视作“劈风令”。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '遏尘',
        奇穴图片: 'https://icon.jx3box.com/icon/22963.png',
        id: '38091',
        奇穴描述:
          '“风流云散”冲刺结束后对前方6尺进行一次斩击，对至多6个目标造成<SUB 38538 1>混元内功伤害并使其定身2秒。',
      },
      {
        奇穴名称: '既晓',
        奇穴图片: 'https://icon.jx3box.com/icon/22970.png',
        id: '38504',
        奇穴描述:
          '施展“风流云散”卸除自身除阳性不利效果、阴性不利效果、混元不利效果、毒性不利效果一次，回复2%最大气血值，非战斗状态下施展调息时间降低10秒。',
      },
      {
        奇穴名称: '摧烟',
        奇穴图片: 'https://icon.jx3box.com/icon/22977.png',
        id: '38507',
        奇穴描述: '“劈风令”对目标范围造成一次<SUB 38557 0>额外伤害，且可以被“抟风令”重置调息。',
      },
      {
        奇穴名称: '灵台',
        奇穴图片: 'https://icon.jx3box.com/icon/22978.png',
        id: '38509',
        奇穴描述: '“绝脉”可叠加的层数增加5层，引爆10层及以上时造成一次<SUB 38888 0>额外伤害。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '风徊絮转',
        奇穴图片: 'https://icon.jx3box.com/icon/22957.png',
        id: '38477',
        奇穴描述:
          '立即对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元内功伤害并使其获得6秒“风徊絮转”。“风徊絮转”会在其受到自身击退或拉扯时消耗并附带额外效果：击退后使其3秒内无法施展轻功且自身下一次“引窍”无需消耗能量直接造成最大效果，拉扯后对其6尺内至多6个目标造成<SUB 38886 1>混元内功伤害并返还自身20%“抟风令”剩余调息时间。',
      },
      {
        奇穴名称: '一阳来复',
        奇穴图片: 'https://icon.jx3box.com/icon/22876.png',
        id: '38511',
        奇穴描述:
          '获得50点任脉能量和50点督脉能量，重置“引窍”调息时间。施展“破穴”或“引窍”时返还本招式5秒调息时间。',
      },
      {
        奇穴名称: '胧雾观花',
        奇穴图片: 'https://icon.jx3box.com/icon/22875.png',
        id: '38515',
        奇穴描述:
          '进行一次闪现并在原地留下一个雾气分身，短暂延迟后对目标造成<SUB 38590 1>混元内功伤害并为其添加1层“雾渺”。',
      },
      {
        奇穴名称: '飞鸿破野',
        奇穴图片: 'https://icon.jx3box.com/icon/22991.png',
        id: '38981',
        奇穴描述:
          '获得一层“云散”效果，闪现至目标位置并在短暂延迟后造成4段4尺范围<SUB 38982 1>“飞鸿”伤害，之后对6尺至多6个目标造成<SUB 38983 1>“破野”伤害。“飞鸿”、“破野”附带僵直效果，每段招式命中侠士目标后使自身获得10点任督二脉能量。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '浥尘',
        奇穴图片: 'https://icon.jx3box.com/icon/22950.png',
        id: '38469',
        奇穴描述: '“骤风”扩散“雾渺”效果的速度翻倍。',
      },
      {
        奇穴名称: '启霁',
        奇穴图片: 'https://icon.jx3box.com/icon/22949.png',
        id: '38470',
        奇穴描述: '每次施展“雾刃飞光”时，返还1秒“骤风令”调息时间。',
      },
      {
        奇穴名称: '疾掠',
        奇穴图片: 'https://icon.jx3box.com/icon/22966.png',
        id: '38471',
        奇穴描述: '“骤风”范围提升至8尺，目标数提升至10个。',
      },
      {
        奇穴名称: '清激',
        奇穴图片: 'https://icon.jx3box.com/icon/22967.png',
        id: '38474',
        奇穴描述: '“抟风令”调息时间降低10秒，伤害提高100%。',
      },
      {
        奇穴名称: '山雨重楼',
        奇穴图片: 'https://icon.jx3box.com/icon/22878.png',
        id: '38476',
        奇穴描述: '命中运功目标则打断其运功，并使目标进入4秒“迷云”状态。',
      },
      {
        奇穴名称: '轻岚',
        奇穴图片: 'https://icon.jx3box.com/icon/22877.png',
        id: '38478',
        奇穴描述:
          '“雾刃飞光”额外对前方6尺内120度扇形区域内至多5个目标造成<SUB 38531 1>混元内功伤害并使其获得1层“雾渺”，施展期间“云散”闪现会优先选择距目标更近的位置。',
      },
      {
        奇穴名称: '见飓',
        奇穴图片: 'https://icon.jx3box.com/icon/22984.png',
        id: '38480',
        奇穴描述: '“劈风令”变为3层充能招式。',
      },
      {
        奇穴名称: '玄气',
        奇穴图片: 'https://icon.jx3box.com/icon/22989.png',
        id: '38482',
        奇穴描述: '引爆“绝脉”标记时可额外引爆至多3层。',
      },
      {
        奇穴名称: '悬枢',
        奇穴图片: 'https://icon.jx3box.com/icon/22960.png',
        id: '38484',
        奇穴描述: '“引窍”变为2层充能招式，造成伤害前额外附带2层“绝脉”。',
      },
      {
        奇穴名称: '止蔌',
        奇穴图片: 'https://icon.jx3box.com/icon/22964.png',
        id: '38488',
        奇穴描述: '“劈风令”引发的骤风共振命中目标后使其3秒内无法施展轻功招式。',
      },
      {
        奇穴名称: '滃从',
        奇穴图片: 'https://icon.jx3box.com/icon/22973.png',
        id: '38505',
        奇穴描述:
          '“雾刃飞光”每段伤害递增提高至40%，完整施展后使自身<BUFF 30667 1 desc>，持续<BUFF 30667 1 time>。',
      },
      {
        奇穴名称: '定元',
        奇穴图片: 'https://icon.jx3box.com/icon/22959.png',
        id: '40241',
        奇穴描述: '对定身、击倒、被拉状态的目标造成伤害提高7%。',
      },
    ],
  },
]

export default 奇穴数据
