import type { 奇穴列表数据类型 } from '@/@types/奇穴'

const 奇穴数据: 奇穴列表数据类型[] = [
  {
    奇穴列表: [
      {
        奇穴名称: '静霂',
        奇穴图片: 'https://icon.jx3box.com/icon/22986.png',
        id: '38479',
        奇穴描述:
          '属于自身的<NounID 77>效果持续时间提高2秒，“招式施展距离降低”强度降低至三成，满层后无法再刷新持续时长，叠加至满层后使目标沉默5秒。',
      },
      {
        奇穴名称: '风萦',
        奇穴图片: 'https://icon.jx3box.com/icon/24402.png',
        id: '40242',
        奇穴描述:
          '“劈风令”命中目标后会分裂并弹射向其12尺内至多3个未被“风萦”弹射锁定的目标，随后弹射回主目标。每次弹射后伤害减半。',
      },
      {
        奇穴名称: '百会',
        奇穴图片: 'https://icon.jx3box.com/icon/22969.png',
        id: '38503',
        奇穴描述: '引爆“绝脉”时，每引爆一层“绝脉”使目标获得5%减疗效果，持续12秒。',
      },
      {
        奇穴名称: '蛰微',
        奇穴图片: 'https://icon.jx3box.com/icon/27100.png',
        id: '38490',
        奇穴描述:
          '“破穴”变为2层充能招式，不再击退和定身目标，而是使其每2秒受到一次混元内功伤害，持续<BUFF 33156 1 time>。“引窍”命中有该效果的非侠士目标会将其引爆，使剩余伤害立即生效，该引爆伤害受督脉能量加成。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '流梨',
        奇穴图片: 'https://icon.jx3box.com/icon/24961.png',
        id: '38497',
        奇穴描述: '“雪满”期间可施展二段招式，<SUB 38547 1>“雪满”效果结束前未施展则自动尝试施展。',
      },
      {
        奇穴名称: '疏雪',
        奇穴图片: 'https://icon.jx3box.com/icon/24962.png',
        id: '38466',
        奇穴描述:
          '“月落参横”期间“雪满”消耗降低85%，首次损失15%气血值时若处于“雪满”下还将获得1层“落雪”。',
      },
      {
        奇穴名称: '零露',
        奇穴图片: 'https://icon.jx3box.com/icon/22947.png',
        id: '38493',
        奇穴描述: '“雪重花满”不再充能，调息时间及获得的“雪满”时长减少6秒，“雪满”消耗降低50%。',
      },
      {
        奇穴名称: '神封',
        奇穴图片: 'https://icon.jx3box.com/icon/22974.png',
        id: '38481',
        奇穴描述:
          '消耗任督二脉能量时至多消耗40点，任一脉能量达到最大消耗时回复10点任督二脉能量，并使自身<BUFF 29254 1 time>内<BUFF 29254 1 desc>。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '出岫',
        奇穴图片: 'https://icon.jx3box.com/icon/22976.png',
        id: '38495',
        奇穴描述: '“风流云散”调息时间降低10秒，变为2层充能招式，施展后只能获得1层“云散”。',
      },
      {
        奇穴名称: '封枢',
        奇穴图片: 'https://icon.jx3box.com/icon/24963.png',
        id: '38467',
        奇穴描述:
          '“破穴”可以引爆目标“绝脉”，每引爆1层返还消耗的10%能量，并使目标受控期间受到自身下一次“引窍”伤害提高3%。\\n成功引爆“绝脉”的“破穴”若成功击退目标，则其触发的“云散”闪现会优先选择距目标更近的位置。',
      },
      {
        奇穴名称: '徙溟',
        奇穴图片: 'https://icon.jx3box.com/icon/22975.png',
        id: '38513',
        奇穴描述:
          '“抟风令”会吸收范围内的“雾海”，若成功吸收则不再吹飞目标，而是使生成的“横驱风靡”持续附带“迷云”，该效果会根据所吸收雾海的剩余时长作用一定次数后消失。',
      },
      {
        奇穴名称: '玉枕',
        奇穴图片: 'https://icon.jx3box.com/icon/22955.png',
        id: '38500',
        奇穴描述: '“经脉循行”期间不再自然回复任督二脉能量，招式无视目标50%防御等级。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '停岚',
        奇穴图片: 'https://icon.jx3box.com/icon/24958.png',
        id: '38473',
        奇穴描述:
          '自身“雾海”存在期间可施展二段招式：将雾向对侧吹散，使雾海方向区域内至多10名敌方侠士根据雾海的剩余时长获得3-5层“雾渺”。',
      },
      {
        奇穴名称: '骤涌',
        奇穴图片: 'https://icon.jx3box.com/icon/24959.png',
        id: '38472',
        奇穴描述:
          '自身“横驱风靡”内目标数未达上限时，敌方目标进入或离开区域会受到一次<SUB 38548 1>混元内功伤害。',
      },
      {
        奇穴名称: '敕空',
        奇穴图片: 'https://icon.jx3box.com/icon/24401.png',
        id: '40244',
        奇穴描述:
          '“劈风令”命中后标记目标8秒。“抟风令”拉扯被标记的目标会扯出一道风刃，短暂延迟后劈向目标，造成<SUB 40340 1>混元内功伤害并尝试触发一次骤风共振。',
      },
      {
        奇穴名称: '涣风',
        奇穴图片: 'https://icon.jx3box.com/icon/27101.png',
        id: '44516',
        奇穴描述:
          '“劈风令”引发的骤风共振命中目标后标记其<BUFF 33157 1 time>，至多叠加3层。“破穴”、“引窍”命中标记的目标时会将其消耗，每层消耗使本次招式及其附带效果伤害提高15%。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '灵台',
        奇穴图片: 'https://icon.jx3box.com/icon/22978.png',
        id: '38509',
        奇穴描述: '“绝脉”可叠加的层数增加5层，引爆10层及以上时造成一次<SUB 38888 0>额外伤害。',
      },
      {
        奇穴名称: '既晓',
        奇穴图片: 'https://icon.jx3box.com/icon/22970.png',
        id: '38504',
        奇穴描述:
          '施展“风流云散”卸除自身阳性不利效果、阴性不利效果、混元不利效果、毒性不利效果各一个，并回复2%最大气血值；若在非战斗状态下施展则返还6秒调息时间。',
      },
      {
        奇穴名称: '遏尘',
        奇穴图片: 'https://icon.jx3box.com/icon/22963.png',
        id: '38091',
        奇穴描述:
          '“风流云散”冲刺结束后对周围6尺进行一次斩击，对至多6个目标造成<SUB 38538 1>混元内功伤害并使其定身2秒，若命中目标则返还“风流云散”6秒调息时间。',
      },
      {
        奇穴名称: '摧烟',
        奇穴图片: 'https://icon.jx3box.com/icon/22977.png',
        id: '38507',
        奇穴描述: '“劈风令”变为3层充能招式，且可以被“抟风令”重置调息时间。',
      },
    ],
  },
  {
    奇穴列表: [
      {
        奇穴名称: '胧雾观花',
        奇穴图片: 'https://icon.jx3box.com/icon/22875.png',
        id: '38515',
        奇穴描述:
          '进行一次闪现并在原地留下一个雾气分身，短暂延迟后对目标造成<SUB 38590 1>混元内功伤害并为其添加1层“雾渺”。',
      },
      {
        奇穴名称: '风徊絮转',
        奇穴图片: 'https://icon.jx3box.com/icon/22957.png',
        id: '38477',
        奇穴描述:
          '立即对目标造成<SKILL NeutralDamage>点(+<SKILLEx {D0} {SkillNeutralAP}>)混元内功伤害并使其获得6秒“风徊絮转”。“风徊絮转”会在其受到自身击退或拉扯时消耗并附带额外效果：击退后使其3秒内无法施展轻功且自身下一次“引窍”无需消耗能量直接造成最大效果，拉扯后对其6尺内至多6个目标造成<SUB 38886 1>混元内功伤害并返还自身20%“抟风令”剩余调息时间。',
      },
      {
        奇穴名称: '飞鸿破野',
        奇穴图片: 'https://icon.jx3box.com/icon/22991.png',
        id: '38981',
        奇穴描述:
          '获得一层“云散”效果，闪现至目标位置并在短暂延迟后造成4段4尺范围<SUB 38982 1>“飞鸿”伤害，之后对6尺至多6个目标造成<SUB 38983 1>“破野”伤害。“飞鸿”、“破野”附带僵直效果，每段招式命中侠士目标后使自身获得10点任督二脉能量。',
      },
      {
        奇穴名称: '一阳来复',
        奇穴图片: 'https://icon.jx3box.com/icon/22876.png',
        id: '38511',
        奇穴描述:
          '<TALENT_CORE 38490 1>战斗中每施展1次“破穴”可施展1次本招式。创建一个雾气分身对当前目标模仿施展一次“破穴”，并使自身6秒内下一个“引窍”施展后额外返还15点任督二脉能量。该“破穴”视为自身施展，但不触发调息时间，不获得或消耗能量。',
      },
    ],
  },
  {
    是否为混池: true,
    奇穴列表: [
      {
        奇穴名称: '止蔌',
        奇穴图片: 'https://icon.jx3box.com/icon/22964.png',
        id: '38488',
        奇穴描述: '“劈风令”引发的骤风共振命中目标后使其3秒内无法施展轻功招式。',
      },
      {
        奇穴名称: '茫缈',
        奇穴图片: 'https://icon.jx3box.com/icon/22971.png',
        id: '38501',
        奇穴描述:
          '“骤风”对静止目标伤害增加35%，施展“骤风令”后2秒内可额外施展一次不占基础调息的“劈风令”。',
      },
      {
        奇穴名称: '定元',
        奇穴图片: 'https://icon.jx3box.com/icon/22959.png',
        id: '40241',
        奇穴描述: '对定身、击倒、被拉状态的目标造成伤害提高7%。',
      },
      {
        奇穴名称: '山雨重楼',
        奇穴图片: 'https://icon.jx3box.com/icon/22878.png',
        id: '38476',
        奇穴描述: '命中运功目标则打断其运功，并使目标进入4秒“迷云”状态。',
      },
      {
        奇穴名称: '轻岚',
        奇穴图片: 'https://icon.jx3box.com/icon/22877.png',
        id: '38478',
        奇穴描述:
          '“雾刃飞光”额外对前方6尺内120度扇形区域内至多5个目标造成<SUB 38531 1>混元内功伤害并使其获得1层“雾渺”，施展期间“云散”闪现会优先选择距目标更近的位置。',
      },
      {
        奇穴名称: '疾掠',
        奇穴图片: 'https://icon.jx3box.com/icon/22966.png',
        id: '38471',
        奇穴描述: '“骤风”范围提升至8尺，目标数提升至10个。',
      },
      {
        奇穴名称: '清激',
        奇穴图片: 'https://icon.jx3box.com/icon/22967.png',
        id: '38474',
        奇穴描述: '“抟风令”调息时间降低10秒，伤害提高100%。',
      },
      {
        奇穴名称: '纷飙',
        奇穴图片: 'https://icon.jx3box.com/icon/22983.png',
        id: '38475',
        奇穴描述:
          '“劈风令”施展时返还5%“抟风令”剩余调息时间，命中“骤风”“横驱风靡”内的非侠士目标额外造成一次<SUB 39340 0>伤害，并使本次骤风共振的范围扩大至整个“骤风”“横驱风靡”。',
      },
      {
        奇穴名称: '启霁',
        奇穴图片: 'https://icon.jx3box.com/icon/22949.png',
        id: '38470',
        奇穴描述: '每次施展“雾刃飞光”时，返还1秒“骤风令”调息时间。',
      },
      {
        奇穴名称: '清然',
        奇穴图片: 'https://icon.jx3box.com/icon/22972.png',
        id: '44514',
        奇穴描述: '督脉能量高于任脉能量且差值不低于20点时施展“引窍”，使督脉能量加成效果提高100%。',
      },
      {
        奇穴名称: '滃从',
        奇穴图片: 'https://icon.jx3box.com/icon/22973.png',
        id: '38505',
        奇穴描述:
          '“雾刃飞光”每段伤害递增提高至40%，完整施展后使自身<BUFF 30667 1 desc>，持续<BUFF 30667 1 time>。',
      },
      {
        奇穴名称: '归霭',
        奇穴图片: 'https://icon.jx3box.com/icon/27103.png',
        id: '44515',
        奇穴描述: '消耗“雪满”时返还1.5秒“雾海萦空”调息时间。',
      },
    ],
  },
]

export default 奇穴数据
