// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 血怒 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '血怒')
  static 回复怒气 = 0

  constructor(模拟循环) {
    super(模拟循环)
    血怒.回复怒气 = 10
    let 秘籍回怒 = 0
    const 血怒秘籍 = this.模拟循环.秘籍?.['血怒'] || []
    for (let i = 0; i < 血怒秘籍?.length; i++) {
      if (血怒秘籍[i]?.includes('回怒')) {
        秘籍回怒 += 5
      }
    }
    血怒.回复怒气 = 10 + 秘籍回怒
  }
  释放() {
    // 偃守孤旌切换至擎刀时无法使用非苍雪刀技能（可使用撼地）
    const 偃守孤旌禁用非苍雪刀技能 = this.模拟循环.当前自身buff列表?.['战绝']?.当前层数
    if (偃守孤旌禁用非苍雪刀技能) {
      return { 可以释放: false }
    }

    // 连续释放血怒时才可叠加，因此没有血怒，或有血怒连按标记时，才会获得血怒连按标记
    if (
      !this.模拟循环.当前自身buff列表?.['血怒']?.当前层数 ||
      this.模拟循环.当前自身buff列表?.['血怒连按标记']?.当前层数
    ) {
      this.模拟循环.添加buff?.({ 名称: '血怒连按标记', 对象: '自身', 新增层数: 1 })
    }
    // 惊涌血怒不可叠加
    if (this.模拟循环.校验奇穴是否存在?.('惊涌')) {
      this.模拟循环.添加buff?.({ 名称: '血怒_惊涌', 对象: '自身', 新增层数: 1 })
    } else {
      // 未点出惊涌，连续释放血怒时血怒可叠加
      if (
        this.模拟循环.当前自身buff列表?.['血怒连按标记']?.当前层数 &&
        this.模拟循环.当前自身buff列表?.['血怒']?.当前层数
      ) {
        this.模拟循环.添加buff?.({ 名称: '血怒', 对象: '自身', 新增层数: 1 })
      } else {
        // 没有血怒连按标记时，再释放血怒会被覆盖
        this.模拟循环.卸除buff?.({ 名称: '血怒', 对象: '自身' })
        this.模拟循环.添加buff?.({ 名称: '血怒', 对象: '自身', 新增层数: 1 })
      }
    }

    // 血魄血怒重置斩刀调息时间
    if (this.模拟循环.校验奇穴是否存在?.('血魄')) {
      this.重置斩刀调息时间()
    }
  }

  释放后() {
    // 血魄血怒额外回复25点怒气
    if (this.模拟循环.校验奇穴是否存在?.('血魄')) {
      this.触发回复怒气(血怒.回复怒气 + 25, '血魄' + 血怒.技能数据?.技能名称)
    } else {
      this.触发回复怒气(血怒.回复怒气, 血怒.技能数据?.技能名称)
    }
    this.保存释放记录()
  }

  保存释放记录() {
    const 造成buff数据 = this.获取施加重要buff信息('血怒_惊涌')
    this.本次释放记录 = 造成buff数据 ? { 造成buff数据 } : {}
    this.本次释放记录 = {
      ...this.本次释放记录,
      重要buff列表: this.获取当前重要buff列表([
        '血怒',
        '血怒_惊涌',
        '嗜血',
        '麟光玄甲',
        '援戈',
        '橙武',
      ]),
    }
  }

  获取技能释放记录结果() {
    return {
      ...this.本次释放记录,
      底部标识: this.技能释放时怒气 || 0,
    }
  }
}

export default 血怒
export const 血怒类型 = typeof 血怒
