import { 获取实际帧数 } from '@/工具函数/data'
import { 待生效事件 } from '../../type'
import 技能统一类 from '../../通用类/技能统一类'

class 梅花枪法 extends 技能统一类 {
  static 原始间隔 = 27
  static 最大事件次数 = 500
  static 普攻记时点 = 0

  constructor(模拟循环) {
    梅花枪法.普攻记时点 = 0
    super(模拟循环)
  }

  获得当前普攻间隔() {
    const 普攻实际间隔 = 获取实际帧数(梅花枪法.原始间隔, this.模拟循环?.加速值) + 1
    return 普攻实际间隔
  }

  初始化普攻轴() {
    // 立即造成第一次普攻伤害，然后添加序列
    this.梅花枪法造成伤害()
    梅花枪法.普攻记时点 = 0
    this.刷新普攻序列()
  }

  刷新普攻序列(初始时间 = 梅花枪法.普攻记时点, 生成次数 = 梅花枪法.最大事件次数) {
    this.模拟循环.删除待生效事件队列('梅花枪法检查')
    const 待生效事件: 待生效事件[] = []
    const 当前普攻间隔 = this.获得当前普攻间隔()
    for (let i = 1; i <= 生成次数; i++) {
      const 事件时间 = 初始时间 + 当前普攻间隔 * i
      待生效事件.push({
        事件名称: `梅花枪法检查`,
        事件时间: 事件时间,
        事件备注: {},
      })
    }
    this.模拟循环.添加待生效事件队列(待生效事件)
  }

  梅花枪法检查() {
    梅花枪法.普攻记时点 = this.模拟循环.当前时间
    this.梅花枪法造成伤害()
  }

  延后读条期间普攻(读条结束时间: number) {
    const 普攻事件 = this.模拟循环.待生效事件队列.filter((事件) => 事件.事件名称 === '梅花枪法检查')
    const 下次普攻 = 普攻事件[0]
    if (下次普攻 && 下次普攻.事件时间 < 读条结束时间) {
      const 延后帧数 = 读条结束时间 - 下次普攻.事件时间
      this.模拟循环.删除待生效事件队列('梅花枪法检查')
      this.模拟循环.添加待生效事件队列(
        普攻事件.map((事件) => ({ ...事件, 事件时间: 事件.事件时间 + 延后帧数 })),
      )
    }
  }

  梅花枪法造成伤害() {
    this.触发伤害行为('梅花枪法')
  }
}

export default 梅花枪法

export const 梅花枪法类型 = typeof 梅花枪法
