import { 获取实际帧数 } from '@/工具函数/data'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 穿云 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '穿云')

  constructor(模拟循环) {
    super(模拟循环)
    穿云.技能数据 = 模拟循环?.技能基础数据?.find((item) => item.技能名称 === '穿云')
    const 循环加速值 = this.模拟循环.加速值
    if (穿云?.技能数据?.技能CD) {
      const 加速后帧数 = 获取实际帧数(穿云?.技能数据?.技能CD, 循环加速值)
      穿云.技能数据.技能CD = 加速后帧数
    }
    this.初始化技能运行数据()
  }

  命中() {
    this.判断穿云链触发伤害()
    this.回复战意('穿云', 1)
  }

  穿云造成伤害(名称, 段数) {
    this.触发伤害行为(名称, 1)
    this.保存释放记录(名称, 段数)
  }

  判断穿云链触发伤害() {
    const 穿云链层数 = this.模拟循环.当前自身buff列表?.['穿云链']?.当前层数
    if (!穿云链层数) {
      this.穿云造成伤害?.('穿云·一', 1)
      this.模拟循环.添加buff?.({ 名称: '穿云链', 对象: '自身', 新增层数: 1 })
    } else if (穿云链层数) {
      this.穿云造成伤害?.('穿云·二', 2)
      this.模拟循环.卸除buff?.({ 名称: '穿云链', 对象: '自身', 卸除层数: 1 })
    }
  }

  保存释放记录(名称, 段数) {
    this.本次释放记录 = {
      实际伤害技能: 名称,
      // 伤害段数: 段数,
      重要buff列表: this.获取当前重要buff列表(['牧云', '驰骋·1', '驰骋·2', '激雷', '夜征', '渊']),
    }
  }
}

export default 穿云

export const 穿云类型 = typeof 穿云
