/**
 * 常量文件
 */

import type { 延迟数据类型 } from '@/@types/常量'

export const DEFAULT_PROJECT_NAME = '默认方案'

// 50级自身属性系数
// https://www.jx3box.com/bps/109685

export const 自身等级 = 50 // 当前角色等级
export const 每等级减伤 = 0.05

export const 等级系数 = 33
export const 等级常数 = 660

// export const 外功常数 = 8992.534 / 100
// export const 内功常数 = 9704.743 / 100
// 经 青墨白宣实测 常数在计算的时会舍去小数点
export const 外功常数 = 8992 / 100
export const 内功常数 = 9704 / 100
export const DOT常数 = 12
// export const 气血压缩系数 = 0.01
export const 全能转无双 = 1220

export const 属性系数 = {
  会心: 9.609,
  会效: 3.54,
  御劲: 19.218,
  化劲: 5.2,
  命中: 9.195,
  闪避: 13.491,
  招架: 15.833,
  无双: 7.117,
  防御: 10.912,
  破防: 10.483,
  急速: 10.21,
  御劲减会伤: 9.518,
  // 破招: 24.558,
}

// 注意这玩意是小数算的，不是1024
export const 基础系数 = {
  // 身法转会心: 250 / 1024,
  // 力道转攻击: 195 / 1024,
  // 力道转破防: 61 / 1024,
  // 根骨转会心: 250 / 1024,
  // 元气转攻击: 195 / 1024,
  // 元气转破防: 61 / 1024,
  // 体质转气血: 10000 / 1024,

  身法转会心: 0.25,
  力道转攻击: 0.19,
  力道转破防: 0.06,
  根骨转会心: 0.25,
  元气转攻击: 0.19,
  元气转破防: 0.06,
  体质转气血: 10,
}

type 属性系数类型 = typeof 属性系数

export const 自身属性系数: 属性系数类型 = {} as any

for (const 属性 in 属性系数) {
  自身属性系数[属性] = 属性系数[属性] * (等级系数 * 自身等级 - 等级常数)
}

// console.log('自身属性系数', 自身属性系数, 等级系数, 自身等级, 等级常数)

// y=x(0.7+0.3x)/2
export const 精炼加成系数 = {
  0: 0,
  1: 0.005,
  2: 0.013,
  3: 0.024,
  4: 0.038,
  5: 0.055,
  6: 0.075,
  7: 0.098,
  8: 0.124,
  9: 0.153,
  10: 0.185,
}

export const 延迟设定: 延迟数据类型[] = [
  {
    label: '理论0延迟',
    value: 0,
  },
  {
    label: '低延迟(1-45)',
    value: 1,
  },
  {
    label: '中延迟(45-75)',
    value: 2,
  },
  {
    label: '高延迟(75-105)',
    value: 3,
  },
  {
    label: '超高延迟(>105)',
    value: 4,
  },
]

export const 每秒郭氏帧 = 16
