/**
 * 常量文件
 */

import type { 延迟数据类型 } from '@/@types/常量'

export const DEFAULT_PROJECT_NAME = '默认方案'

// 130级自身属性系数
// https://www.jx3box.com/bps/85798

export const 自身等级 = 130 // 当前角色等级
export const 每等级减伤 = 0.05

export const 等级系数 = 1155
export const 等级常数 = 130350

export const 属性系数 = {
  会心: 9.985,
  会效: 3.679,
  御劲: 9.985,
  化劲: 1.669, // *
  命中: 7.644,
  闪避: 4.628, // *
  招架: 5.432, // *
  无双: 6.734,
  防御: 6.364, // *
  破防: 11.412,
  急速: 10.61, // 210078 10.61 * (130 * 1155 - 130350)
  破招: 8.534, // 7.421
  御劲减会伤: 2.557,
}

// 注意这玩意是小数算的，不是1024
export const 基础系数 = {
  身法转会心: 0.9,
  力道转攻击: 0.163,
  力道转破防: 0.3,
  根骨转会心: 0.9,
  元气转攻击: 0.181,
  元气转破防: 0.3,
  体质转气血: 10,
}

type 属性系数类型 = typeof 属性系数

export const 自身属性系数: 属性系数类型 = {} as any

for (const 属性 in 属性系数) {
  自身属性系数[属性] = 属性系数[属性] * (等级系数 * 自身等级 - 等级常数)
}

// y=x(0.7+0.3x)/2
export const 精炼加成系数 = {
  0: 0,
  1: 0.005,
  2: 0.013,
  3: 0.024,
  4: 0.038,
  5: 0.055,
  6: 0.075,
  7: 0.098,
  8: 0.124,
  9: 0.153,
  10: 0.185,
}

export const 延迟设定: 延迟数据类型[] = [
  {
    label: '理论0延迟',
    value: 0,
  },
  {
    label: '低延迟(1-45)',
    value: 1,
  },
  {
    label: '中延迟(45-75)',
    value: 2,
  },
  {
    label: '高延迟(75-105)',
    value: 3,
  },
  {
    label: '超高延迟(>105)',
    value: 4,
  },
]

export const 每秒郭氏帧 = 16
