import type { 技能基础数据模型 } from '@/@types/技能'

import 通用增益, { 通用日增益, 通用月增益 } from './技能增益/通用增益/通用增益'
import 大漠刀法增益 from './技能增益/大漠刀法'
import 通用武伤增益 from './技能增益/通用增益/通用武伤'
import 烈日斩增益 from './技能增益/烈日斩'
import { 生死劫日增益, 生死劫月增益 } from './技能增益/生死劫'
import { 靡业报劫日增益, 靡业报劫月增益 } from './技能增益/靡业报劫'
import 驱夜断愁增益 from './技能增益/驱夜断愁'
import 银月斩增益 from './技能增益/银月斩'
import 净世破魔击月增益 from './技能增益/净世破魔击月'
import 净世破魔击日增益 from './技能增益/净世破魔击日'
import 银月斩DOT增益 from './技能增益/银月斩DOT'
import 赤日轮增益 from './技能增益/赤日轮'
import 幽月轮增益 from './技能增益/幽月轮'
import 光明相增益 from './技能增益/光明相'
import {
  诛邪镇魔日增益,
  诛邪镇魔月增益,
  诛邪镇魔日衰减增益,
  诛邪镇魔月衰减增益,
} from './技能增益/诛邪镇魔'
import 真实伤害系数 from '../../统一数据/真实伤害系数'
import 心法通用系数 from '../../统一数据/心法通用系数'
import { 属性类型 } from '@/@types/属性'

const 崇光斩恶等级数据 = {
  1: { 技能伤害系数: 900 },
  2: { 技能伤害系数: 3285 },
}

const 技能基础数据: 技能基础数据模型[] = [
  {
    技能ID: '3969',
    技能名称: '光明相',
    技能伤害系数: 0,
    技能增益列表: 光明相增益,
  },
  {
    技能ID: '19055',
    技能名称: '通用武伤',
    统计名称: '武伤',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 通用武伤增益,
    技能等级数据: {
      // '武伤·赤日轮'
      1: { 统计名称: '武伤', 武器伤害系数: 1 },
      // '武伤·烈日斩'
      2: { 统计名称: '武伤', 武器伤害系数: 1 },
      // '武伤·生死劫·日'
      3: { 统计名称: '武伤', 武器伤害系数: 1 },
      // '武伤·生死劫·月'
      4: { 统计名称: '武伤', 武器伤害系数: 1 },
      // '武伤·净世破魔击·日'
      5: { 统计名称: '武伤', 武器伤害系数: 2 },
      // '武伤·净世破魔击·月'
      6: { 统计名称: '武伤', 武器伤害系数: 1 },
      // '武伤·幽月轮'
      7: { 统计名称: '武伤', 武器伤害系数: 1 },
      // '武伤·银月斩'
      8: { 统计名称: '武伤', 武器伤害系数: 1 },
      // '武伤·驱夜断愁'
      9: { 统计名称: '武伤', 武器伤害系数: 2 },
    },
  },
  {
    技能ID: '40088',
    技能名称: '烈日斩',
    统计名称: '烈日斩',
    技能伤害系数: 572,
    基础伤害_基础值: 15,
    基础伤害_浮动值: 1,
    技能增益列表: 烈日斩增益,
  },
  {
    技能ID: '40089',
    技能名称: '银月斩',
    统计名称: '银月斩',
    技能伤害系数: 287,
    基础伤害_基础值: 9,
    基础伤害_浮动值: 1,
    技能增益列表: 银月斩增益,
  },
  {
    技能ID: '6257',
    技能名称: '生死劫·日',
    技能伤害系数: 67,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 1,
    秘籍依赖技能: '生死劫',
    技能增益列表: 生死劫日增益,
  },
  {
    技能ID: '6258',
    技能名称: '生死劫·月',
    秘籍依赖技能: '生死劫',
    技能伤害系数: 67,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 1,
    技能增益列表: 生死劫月增益,
  },
  {
    技能ID: '4326',
    技能名称: '大漠刀法',
    伤害类型: '外功',
    技能伤害系数: 16,
    武器伤害系数: 1,
    技能增益列表: 大漠刀法增益,
  },
  {
    技能ID: '4476',
    技能名称: '净世破魔击·月',
    统计名称: '净世破魔击·月',
    秘籍依赖技能: '净世破魔击',
    技能伤害系数: 269,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 2,
    技能增益列表: 净世破魔击月增益,
  },
  {
    技能ID: '14701',
    技能名称: '净世破魔击·日',
    统计名称: '净世破魔击·日',
    秘籍依赖技能: '净世破魔击',
    技能伤害系数: 808,
    基础伤害_基础值: 9,
    基础伤害_浮动值: 1,
    技能增益列表: 净世破魔击日增益,
  },
  {
    技能ID: '4480',
    技能名称: '驱夜断愁',
    统计名称: '驱夜断愁',
    秘籍依赖技能: '驱夜断愁',
    技能伤害系数: 814,
    基础伤害_基础值: 95,
    基础伤害_浮动值: 9,
    技能增益列表: 驱夜断愁增益,
    技能等级数据: {
      58: {
        技能伤害系数: 1059,
        基础伤害_基础值: 12,
        基础伤害_浮动值: 1,
      },
    },
  },
  {
    技能ID: '25777',
    技能名称: '驱夜断愁·神兵',
    技能伤害系数: 50,
    基础伤害_浮动值: 2,
    技能增益列表: 通用月增益,
  },
  {
    技能ID: '4024',
    技能名称: '幽月轮',
    统计名称: '幽月轮',
    技能伤害系数: 392,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 7,
    技能增益列表: 幽月轮增益,
  },
  {
    技能ID: '4025',
    技能名称: '幽月轮二段',
    统计名称: '幽月轮',
    秘籍依赖技能: '幽月轮',
    技能伤害系数: 392,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 7,
    技能增益列表: [
      ...幽月轮增益,
      {
        增益名称: '自带5%会心',
        增益所在位置: '技能',
        增益启用: true,
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.内功会心百分比, 值: 0.05 }],
      },
    ],
  },
  {
    技能ID: '4026',
    技能名称: '幽月轮三段',
    统计名称: '幽月轮',
    秘籍依赖技能: '幽月轮',
    技能伤害系数: 448,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 7,
    技能增益列表: [
      ...幽月轮增益,
      {
        增益名称: '自带10%会心',
        增益所在位置: '技能',
        增益启用: true,
        增益类型: '全局启用',
        增益集合: [{ 属性: 属性类型.内功会心百分比, 值: 0.1 }],
      },
    ],
  },
  {
    技能ID: '4028',
    技能名称: '赤日轮',
    统计名称: '赤日轮',
    技能伤害系数: 510,
    基础伤害_基础值: 13,
    基础伤害_浮动值: 2,
    技能增益列表: 赤日轮增益,
  },
  {
    技能ID: '4029',
    技能名称: '赤日轮二段',
    统计名称: '赤日轮',
    秘籍依赖技能: '赤日轮',
    技能伤害系数: 510,
    基础伤害_基础值: 14,
    基础伤害_浮动值: 2,
    技能增益列表: 赤日轮增益,
  },
  {
    技能ID: '4030',
    技能名称: '赤日轮三段',
    统计名称: '赤日轮',
    秘籍依赖技能: '赤日轮',
    技能伤害系数: 636,
    基础伤害_基础值: 15,
    基础伤害_浮动值: 2,
    技能增益列表: 赤日轮增益,
  },
  {
    技能ID: '35056',
    技能名称: '明赦尊谕·日',
    技能伤害系数: 67,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 1,
    技能增益列表: 通用日增益,
  },
  {
    技能ID: '35057',
    技能名称: '明赦尊谕·月',
    技能伤害系数: 67,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 1,
    技能增益列表: 通用月增益,
  },
  {
    技能ID: '35065',
    技能名称: '愿火长燃',
    技能伤害系数: 640,
    基础伤害_基础值: 7,
    基础伤害_浮动值: 1,
    技能增益列表: 通用日增益,
  },
  {
    技能ID: '37336',
    技能名称: '崇光斩恶',
    统计名称: '崇光斩恶',
    技能伤害系数: 900,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 24,
    技能增益列表: 通用日增益,
    技能等级数据: 崇光斩恶等级数据,
  },
  {
    技能名称: '崇光斩恶·月破魔',
    统计名称: '崇光斩恶',
    秘籍依赖技能: '净世破魔击',
    技能伤害系数: 900,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 24,
    技能增益列表: [
      ...通用日增益,
      ...净世破魔击月增益.filter(
        (增益) => 增益.增益所在位置 === '秘籍' && 增益.增益名称.endsWith('会心'),
      ),
    ],
    技能等级数据: 崇光斩恶等级数据,
  },
  {
    技能ID: '41765',
    技能名称: '涤罪',
    技能伤害系数: 4752,
    基础伤害_基础值: 10,
    基础伤害_浮动值: 10,
    技能增益列表: 通用日增益,
  },
  {
    技能ID: '43410',
    技能名称: '圣焰',
    技能伤害系数: 1076,
    基础伤害_基础值: 10,
    基础伤害_浮动值: 10,
    技能增益列表: 通用日增益,
  },
  {
    技能名称: '诛邪镇魔·日',
    统计名称: '诛邪镇魔',
    技能伤害系数: 648,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 24,
    技能增益列表: 诛邪镇魔日增益,
    技能等级数据: {
      1: { 技能增益列表: 诛邪镇魔日增益 },
      2: { 技能增益列表: 诛邪镇魔日增益 },
      3: { 技能增益列表: 诛邪镇魔日衰减增益 },
      4: { 技能增益列表: 诛邪镇魔日衰减增益 },
    },
  },
  {
    技能名称: '诛邪镇魔·月',
    统计名称: '诛邪镇魔',
    技能伤害系数: 648,
    基础伤害_基础值: 20,
    基础伤害_浮动值: 24,
    技能增益列表: 诛邪镇魔月增益,
    技能等级数据: {
      1: { 技能增益列表: 诛邪镇魔月增益 },
      2: { 技能增益列表: 诛邪镇魔月衰减增益 },
      3: { 技能增益列表: 诛邪镇魔月增益 },
      4: { 技能增益列表: 诛邪镇魔月衰减增益 },
    },
  },
  {
    技能ID: '4202_13359', // 4202_13359
    技能名称: '银月斩(DOT)',
    秘籍依赖技能: '银月斩',
    统计名称: '银月斩(DOT)',
    技能伤害系数: 344,
    DOT生效间隔: 32,
    DOT跳数: 9,
    基础伤害_基础值: 1,
    技能增益列表: 银月斩DOT增益,
  },
  {
    技能ID: '25725_34373', // 25725_34373
    技能名称: '靡业报劫·日(DOT)',
    统计名称: '靡业报劫·日(DOT)',
    秘籍依赖技能: '生死劫',
    技能伤害系数: 3317,
    DOT生效间隔: 32,
    DOT跳数: 10,
    基础伤害_基础值: 1,
    技能增益列表: 靡业报劫日增益,
  },
  {
    技能ID: '25726_34374', // 25726_34374
    技能名称: '靡业报劫·月(DOT)',
    统计名称: '靡业报劫·月(DOT)',
    秘籍依赖技能: '生死劫',
    技能伤害系数: 3317,
    DOT生效间隔: 32,
    DOT跳数: 10,
    基础伤害_基础值: 1,
    技能增益列表: 靡业报劫月增益,
  },
  // --------------
  ...真实伤害系数,
  ...心法通用系数(通用增益),
]

export default 技能基础数据

const 技能增益 = {
  通用增益,
}

export { 技能增益 }
